{"song_id":17409,"song_name":"Turtle Power","artist_id":326152,"display_artist":"Partners In Kryme","spotify_id":"3dFAXD9FtN2gmoZToyoJl2","lyrics":"T-U-R-T-L-E Power\nT-U-R-T-L-E Power\nT-U-R-T-L-E Power\nTeenage Mutant Ninja Turtles\n\nOn the half shell, they're the heroes four\nIn this day and age, who could ask for more?\nThe crime wave is high with muggings mysterious\nAll police and detectives are furious\n'Cause they can't find the source\nOf this lethally evil force\nThis is serious, so give me a quarter\nI was a witness, get me a reporter\nCall April O'Neil in on this case, and\nYou'd better hurry up, there's no time to waste\nWe need help, like quick, on the double\nHave pity on the city; man, it's in trouble\nWe need heroes like the Lone Ranger\nWhen Tonto came pronto, when there was danger\nThey didn't say we'd be there in half an hour\n'Cause they displayed... Turtle Power\n\nT-U-R-T-L-E Power\nT-U-R-T-L-E Power\nT-U-R-T-L-E Power\nTeenage Mutant Ninja Turtles\n\nT-U-R-T-L-E Power\nT-U-R-T-L-E Power\nT-U-R-T-L-E Power\nTeenage Mutant Ninja Turtles\n\nNow our ace reporter was hot on the trail\nDetermined to put these crooks in jail\nShe spied the bad guys and saw what happened\nBut before she knew it, she fell in a trap and got caught\nYeah, she was all alone\nWith no friends, and no phone\nNow this was beyond her worst dreams\n'Cause she was cornered by some wayward teens\nHeaded by Shredder they were anything but good\nMisguided, unloved, they called them The Foot\nThey could terrorize and be angry youths, and\nThey mugged the people; who needed proof?\nThen from out of the dark came an awesome sound\nShouted \"Cowabunga!\" as they hit the ground\nFrom the field of weeds the heroes rescued the flower\n'Cause they possessed... Turtle Power\n\nT-U-R-T-L-E Power\nT-U-R-T-L-E Power\nT-U-R-T-L-E Power\nTeenage Mutant Ninja Turtles\n\nT-U-R-T-L-E Power\nT-U-R-T-L-E Power\nT-U-R-T-L-E Power\nTeenage Mutant Ninja Turtles POWER\n\nWhen you stand for what you believe in\nAnd find the strength to do what's right?\nThat's TURTLE POWER\n\nHeroes on the half shell, they're on a mission\nWhen there's a battle got the enemy wishin'\nThat they stayed at home, instead of fightin'\nThese ninja masters with moves like lightnin'\nThey were once normal, but now they're mutants\nSplinter's the teacher so they are the students\nLeonardo, Michelangelo, and Donatello\nMake up the team and one other fellow\nRaphael. He's the leader of the group\nTransformed from the norm by the nuclear goop\nPizza's the food that's sure to please\nThese ninjas are into pepperoni and cheese\nBack to the story, it's not hard to find\nNinja's not just of the body but of the mind\nThose were the words that their master instructed\nBut a letter from Shredder has Splinter abducted\nThat was the last straw: spring into action\nStep on The Foot, now they're gonna lose traction\nNow this is for real, so you fight for justice\nYour shell is hard so you shout, \"They can't dust us off\nLike some old coffee table\"\nSince you been born you've been willing and able\nTo defeat the sneak, protect the weak\nFight for rights and your freedom to speak\nNow the villain is chillin' so you make a stand\nBack to the wall, put your sword in your hand\nRemember the words of your teacher, your master:\n\"Evil moves fast, but good moves faster\"\nThan light, shining for your illumination:\nGood versus Evil equals confrontation\nSo when you're in trouble don't give in and go sour\nTry to rely on YOUR... Turtle Power\n\nT-U-R-T-L-E Power\nT-U-R-T-L-E Power\nT-U-R-T-L-E Power\nTeenage Mutant Ninja Turtles\n\nT-U-R-T-L-E Power\nT-U-R-T-L-E Power\nT-U-R-T-L-E Power\nTeenage Mutant Ninja Turtle Power\n\nT-U-R-T-L-E Power\nT-U-R-T-L-E Power\nT-U-R-T-L-E Power\nTeenage Mutant Ninja Turtles\n\nT-U-R-T-L-E Power\nT-U-R-T-L-E Power\nT-U-R-T-L-E Power\nTeenage Mutant Ninja Turtles Power"}