{"song_id":17487,"song_name":"Tic-Tac-Toe","artist_id":306244,"display_artist":"Kyper","spotify_id":"null","lyrics":"Tic Tac Toe is a game I used to play\nWhen I was little I used to say\nI got the X and I got the O\nIt don't matter 'cause it's Tic Tac Toe\n\nNow I'm a little bit older\nI like to play just a little bit bolder\nI like gettin' girls and givin' 'em pearls\nAnd their legs across my shoulders\n\nI love to go to the disco\nSee a fly girl and say hello\nThey just look me in the eye and pass right by\nWith that booty shakin' like Jello\n\nI like to speak 'cause that's bein' nice\nIt makes me mad when I have to speak twice\nBut that's the game that girls like to play\nIt's just Tic Tac Toe and roll the other way\n\nX and O, as in yes and no\nX and O, as in sex, maybe so\nX is for yes and O is for no\nX is for sex or maybe so\n\nYou might get some if you play this game\nAll girls love it but smooth is their game\n\nThat's why they just walk right by\nLaughin', gigglin', shakin' that pie\nGirls are what you what when you come up to them\nSo don't play dumb and try to school 'em\n\nThat's when you got to be real cool\nJump in the biz and act a fool\nPull out the portable car phone\nNext thing you know you'll be drivin' 'em home\n\nOn the way there you're thinkin' 'bout one thing\nGirls ain't dumb they know you want the wild thing\nYou through the X and go for the kiss\nThey throw the O and go for the dis\n\nX and O, as in yes and no\nX and O, as in sex, maybe so\nX is for yes and O is for no\nX is for sex or maybe so\n\nYou might get some if you play this game\nAll girls love it but smooth is their game\n\nDo you wanna play Tic Tac Toe?\nDo you wanna play Tic Tac Toe?\nDo you wanna play Tic Tac Toe?\nDo you wanna play Tic Tac Toe?\n\nX and O, as in yes and no\nX and O, as in sex, maybe so\nX is for yes and O is for no\nX is for sex or maybe so\n\nYou might get some if you play this game\nAll girls love it but smooth is their game\n\nI met this girl by the name of Judy\nKind of cute with a real nice booty\nHard to get and likes to play tough\n'Cause she knows I want the funky stuff\n\nWhen I spoke, she wouldn't even speak\nTill she saw me in the biz that week\nTook her to the movies and bought her a treat\nWent to my house and made the bed squeak\n\nYeah, that Judy puts up a fight\nBut I won with the X 'cause I rolled that night\nJust when things started to feel good\nWe rolled a little fast and we broke the wood\n\nMy dad got up 'cause he heard some knockin'\nThought it was a crook me and Judy was rockin'\nCame to my room opened up the door\nSon whatcha doin'? Playin' Tic Tac Toe\n\nX and O, as in yes and no\nX and O, as in sex, maybe so\nX is for yes and O is for no\nX is for sex or maybe so\n\nYou might get some if you play this game\nAll girls love it but smooth is their game"}