{"song_id":17610,"song_name":"New Power Generation","artist_id":351039,"display_artist":"Prince","spotify_id":"231Ymyur5JtUCbzDgDJwcX","lyrics":"Lay down your funky weapon.\nYeah y'all, here we go\nPumpin' the big noise in the 90's.\n\nPardon me for living, but this is my world too\nI can't help that what's cool to us might be strange to you\nPardon me for breathing, can we borrow some of your air?\nThe problem with you and your kind is that you don't know love is there\n\nLay down your funky weapon, come join us on the floor\nMaking love and music's the only things worth fighting for\nWe are the new power generation, we want to change the world.\nThe only thing that's in our way is you.\nYour old fashioned music, your old ideas,\nWe're sick and tired of you telling us what to do.\n\nPardon me for thinking, but there's something under my hair\nI bet you thought the lights were on but no one's living there\nYou think that if you tell enough lies they will see the truth?\nI hope they bury your old ideas the same time they bury you\n\nLay down your funky weapon, come join us on the floor\nMaking love and music's the only things worth fighting for\nWe are the new power generation, we want to change the world.\nThe only thing that's in our way is you.\nYour old fashioned music, your old ideas,\nWe're sick and tired of you telling us what to do.\n\nWe are the new, we are the new, we are the new,\nMaking love and music\nNew power, we stand\n\nPardon us for caring, we didn't know it was against the rules (shout it out)\nIf we only want to love one another\nThen tell me now who's the fool (tell me, tell me)\nNo father, no mother, no sister, no brother, nobody can make me stop\nSaid if you didn't come to party child, I think you better get up off of my block.\n\nLay down your funky weapon, come join us on the floor\nMaking love and music's the only things worth fighting for\nWe are the new power generation, we want to change the world.\nThe only thing that's in our way is you.\nYour old fashioned music, your old ideas,\nWe're sick and tired of you telling us what to do.\n\nWhy don't you just be happy, baby.\n\nLay down your funky weapon, come join us on the floor\nMaking love and music's the only things worth fighting for\nWe are the new power generation, we want to change the world.\nThe only thing that's in our way is you.\nYour old fashioned music, your old ideas,\nWe're sick and tired of you telling us what to do.\n\nGo on and get up off of my block\nGet up off of my block, because\nLove is there if you'd just open up to it.\nIf you'd just believe your whole world would change\n\nNew power generation, you've got to rearrange, we've got\nWe are the new power generation, you've gotta give up all the fight\nWe gotta try to love one another, baby. we are the new power generation\nWe are the new power generation.\nWe are the new power generation."}