{"song_id":17744,"song_name":"Deep, Deep Trouble","artist_id":419120,"display_artist":"The Simpsons Featuring Bart","spotify_id":"null","lyrics":"Bart:\nLet me start at the start, then take it away\nMy name is Simpson, Bartholomew J.\nThat's Bart with an \"art\" and a capital \"B\"\nThen \"simp\" plus \"s-o-n\" that's me\nIntroductions aside, let's move right along\nYou can all sing along at the sound of the gong\nOnce upon a time, about a week ago\nAll of the sudden, trouble started to grow\nAlarm was buzzin', I was snoozin'\nSupposed to get up now, but I was refusing\nTo let reality become an intrusion\n'Cause in dreamy-dreamland I was cruisin'\nBut the buzz kept buzzin', my head kept fuzzin'\nGave the radio a throw and heard an explosion\nI opened up my eyes to my surprise\nThere stood Homer and his temperature rised\nI will chillin', he was yellin'\nFace all distored, 'cause he was propellin'\nIt wasn't what he said, but more of his tone\nThe usual jibe, put your nose to the grind-stone\nI said I'm real sorry, but that didn't cut it.\nI started to protest, but Dad said\n\nHomer:\nShut it! Get up, mow the lawn! Move it on the double!\n'Cause if you don't, you're in deep, deep, trouble!\n\nBack-up Singers:\nTrouble! Deep, deep trouble!\nWanted to snuggle! Deep, deep trouble!\n\nBart:\nSo I'm in the front yard mowing like crazy\nSweating like a pig and the sun is blazy\nHomer's in the driveway, gettin' in the car\nWith Mom and Lis, I hope they're going real far\nThen Dad yells ---\n\nHomer: Bart!\nBart: And I go, \"Yo!\" He goes ---\nHomer: You done yet?\nBart: And I go, \"No.\" So he goes ---\nHomer: Oh, you're too slow!\n\nBart:\nSo I step on the gas, speed up the mow\nDidn't see that sprinkler underneath that tree\nWham! Keee! Pisssssh!\nRainin' on me! I go, \"Whoa!\" Homer goes ---\n\nHomer:\nD'oh! Now you can't go, to the boat show!\n\nBart:\nThis is my thanks for working my butt off\nHomer starts the car and they all start to 'putt off\nSoaked to the bone, standin' in a puddle...\nNo one needs to tell me I'm in deep, deep trouble...\n\nBack-up Singers:\nTrouble! Deep, deep trouble!\nThe one who gets double! Deep, deep trouble!\n\nBart:\nAs soon as they're gone, I'm stretched on a lawn\nLooking at the sky with my sunshades on\nNow I never ever claimed that I was a smarty\nBut inspiration hits me: \"Let's have a party!\"\nI called up my posse. They were here in a flash\nThey brought all their pals, we started to thrash!\nThere was rompin', and stompin', an occasional crash\nA fist fight or two, and Nintendo for cash\nWe raided the fridge, dogs raided the trash\nI got a little worried when the windows got smashed\nThe next thing you know Mom and Dad are home\nThe kids disappear, and I'm all alone\nEverything is silent except for my moan\nAnd the low bluesy tone of a saxophone\nThey look at me, then they go into a huddle\nGet the sinking sensation I'm in deep, deep trouble\n\nBack-up Singers:\nTrouble! Deep, deep Trouble!\nYou're in trouble! Deep, deep trouble!\n\nBart:\nThere's a little epilogue to my tale of sadness\nI was dragged down the street by His Royal Dadness\nWe rounded the corner and came to a stop\nThrew me inside Jake's barber shop\nI said, \"Please sir, just a little off the top...\"\nDude shaved me bare, gave me a lollipop\nSo on my head there's nothing but stubble\nMan, I hate bein' in deep, deep trouble!\n\nBack-up Singers: Trouble! Deep, deep trouble! Nothing but stubble!\nDeep deep trouble!(repeated)\nBart: Oh, come on man."}