{"song_id":18259,"song_name":"Tequila","artist_id":275276,"display_artist":"A.L.T. And The Lost Civilization","spotify_id":"50jzaB4NVS3mO6rRIE7mmm","lyrics":"I was at the bar with my drinking team\nAnd it was me, Jack Daniels and my homie Jim Beam\nWe were kinda blizzed and we were tryin' to behave, yo\nWhen in walked a soldier, he was from the Fuzzy Navel\nWe were fallin', stumblin, crawlin\nIn came the police, Captain Tom Collins\nAnd the vato said, \"Freeze!\" (Freeze!)\nHe said, \"Hands in the air and hand over your keys\"\nNow we did, and that was kinda simple\nNow here came Margarita and her friend Shirley Temple\nI asked my friend 'bout Margarita\nHe said that Shirley was a virgin and I wouldn't wanna meet her\nSo I talked to Margarita, cause, yo, she was flyer\nI took her to the couch, 'cause I wanted to srew-drive her\nNow I'm not one for a speech\nBut there was plenty of Tequila and Sex on the Beach\nY'all\nTequila\n\nHorn section plays the 'Tequila' theme\n\nT-T-T-Tequila\n\nYeah\n\nAll right\n\nCome on\n\nCrowd\nTequila!\n\nHere we go again and I'm not fussin\nSee, I'm a French Mexican but I kick it with White Russians\nAt the bar with the drink in my hand\nIn walked Jos&#xE9; Cuevo, it was Margarita's man\nI talked to the Wise Man, cause yo, he's distinguished\nHis name is St. Ides and he spoke in Olde English\nHe said, \"You better think fast\nCause Jos&#xE9; is kinda crazy and I heard he shot blast\"\nHe gave me some advice and it went like this, yo\n\"Catch the Nighttrain and head up to 'Cisco\"\nI didn't wanna stick around\nI caught the 1 (:) 51 to New York, the Greyhound\nNow I'm at the Red Zone, everybody stylin\nShowbiz was sippin Ice Teas on Long Island\nI blacked out, the party came to a halt\n'Cause I was drinkin' the Tequila with the lemon and salt\nY'all\nTequila\n\nHorn section plays the 'Tequila' theme\n\nT-T-T-Tequila\n\nYeah\n\nAll right\n\nCrowd\nTequila!\n\nI woke up in the morning and felt like a zombie\nThe Tequila Gold Label had bombed me\nYou see, I woke up late, I wasn't feelin' so great\nAnd Mike said, \"There's a Bacardi party startin at 8\"\nYo, we walked in the party and started playin' our games\nWe played tops, ??? and quarters with Bartles and Jaymes\nHere came Shirley Temple and they told me to chill\nBecause the Mickey Brothers took her up to Strawberry Hill\nThey took her $1000 mink and she could barely think\nCause the Tequila that she drank had her tickled pink\nNow the music came on and I rocked the instrumental\nThere's a groupie named Mai Tai, a fly oriental\nA groupie is a girl that jocks\nShe wore a def Black Velvet and drank Scotch on the rocks\nWe had a Fake Marriage, now here's the Honeymoon\nYo, it's on, Vagabond at the Blue Lagoon\nNow everybody take a couple of words from the wise\nA girlie and a bottle - Tequila Sunrise\nTequila\n\nHorn section plays the 'Tequila' theme\n\nYeah\n\nAll right\n\nCome on\n\nCrowd\nTequila!"}