{"song_id":18485,"song_name":"Born 2 B.R.E.E.D.","artist_id":311761,"display_artist":"Monie Love","spotify_id":"63jtO84uEIVb6a0KZQeSKM","lyrics":"I'm a mother that gave birth young, so what about it\nDoes it mean right away that I'm wrong\nAll in due time, well my time is right now\nSo don't ask me who, where, what when or how\nI know I got me and a good partner beside me\nOne that will never try to desert of defy me\nSo who are you to tell me how to run my family\nI can plan it by myself, I need nobody planning me\n'Cause yeah I might be young, but my stability's correct\nEverything about my little one I must protect\nWhat she sees, what she hears, and everything surrounding\nA decent state of mind is what my daughter will be found in\n\nBorn 2 B.R.E.E.D.\nYoung mother be thankful, be strong\nThe fact that you're young, it ain't wrong\nA mother I will try to be\nTha fact is, I was born 2 B.R.E.E.D.\n\nSo tell me what do the kids learn at school\nHow to pack a pistol, how to play a class fool\nThen they blame the parents when the kid plays hooky\nSubject to getting shot is something that I wouldn't wanna be\nMaybe it is safer to stay within your home\nProtecting yourself from getting a bullet within your dome\nIt's something to think about, the word safe\nI often wonder if there exists such a place\nWhether on a bus, a train, or plain walkin'\nYou're subject to the devious ones that might be hawkin'\nI'll teach my child to respect every day as a blessing\nAnd follow the path of her future lesson by lesson\n\nBorn 2 B.R.E.E.D.\nYoung mother be thankful, be strong\nThe fact that you're young, it ain't wrong\nA mother I will try to be\nTha fact is, I was born 2 B.R.E.E.D.\n\nSo ask me again if I need ghetto assistance\nThere's food on my table and my baby's not wearing piss pants\nI could teach my child more at home that you could ever\nCorrupt the youthful mind I produce, that will be never\nThis one will learn from me, the other babies too\n'Cause what you teach is censorship, I wanna teach what's true\nSo bother me not with our by the book method\nIf I was already deaf I would be getting deafer\nI know exactly what I'm doing, in it I believe\nMy life is in my offspring 'Cause I was born 2 B.R.E.E.D.\n\nBorn 2 B.R.E.E.D.\nYoung mother be thankful, be strong\nThe fact that you're young, it ain't wrong\nA mother I will try to be\nTha fact is, I was born 2 B.R.E.E.D."}