{"song_id":18673,"song_name":"Indo Smoke (From \"Poetic Justice\")","artist_id":311514,"display_artist":"Mista Grimm","spotify_id":"63KcYWznO0w3J5wymiT9QK","lyrics":"(Feat. Warren G, G-Child, Nate Dogg)\n\n(G-Child)\nHey, this is the G-Child, spaceketeers\nAre ya in the house baby, are ya in the house\nYou know what I'm sayin', 'cause it's that time\nFor you to kicks the funk online as we rewind, then it will combine\n\n(Mista Grimm)\nSmokin' on the bud, feelin' kinda high\nSippin on the gin, feelin' kinda fly\nA Warren G production sits in the tape deck\nAs Mista Grimm raps over laps, don't say shit\nJust, listen and recline for a spell\nPass the fat spliff back and forth (oh yeah)\nStuck, unable to breathe through the Chronic\nCloud that somehow prevents me from installin fresh air\n\n(Warren G)\nAh, Indosmoke\nPass me the joint so I can take a toke\n1 puff, 2 puff, 3 puff, 4 puff, 5 I'm feelin' real high\nLeaning to the side in my muthafuckin ride\nWith the OG gangsta glide\nWoo!, hey now ya know\nInhale, exhale with my flow\nBreakaway, come again like this\nThe LB to the C two times to miss\n'Cause if you do, you break you get broke\nMe and Mista G and the indosmoke \n\n(Chorus x2: Nate Dogg)\n(\"Are you high yet?\" (repeated in background))\nWhatever you do muthafucka you betta not choke\nThis ain't no stress, it's the muthafuckin indo smoke\n\n(Mista Grimm)\nFee, fi, foe, really doe\nI'm still smokin' and sippin, talkin' like a pimp\nFreakin, seekin' new lands without transport\n'Cause indo smoke is a man's sport\nI never feel stressed and that's the realist\nJust a proper herb for my chronic illness\nPlease, let me go on with my day\nRelax with phat tracks and a real fat J\nOoh, I think I'm in love\nAstounded from what it did sended me far above\nOn a fly cloke I can brag for days\nYou can't swim with Grimm\nBecause my tidal wave's - high\nAnd that's no joke\nBecause Mista Grimm takes flight from the indo smoke \n\n(Mista Grimm)\nIgnition to remission blast off through the 'cause\nMost of the voyage I enjoy is just a cause\nI sonic boom when I return back to earth\nBirth of a new rhyme will take no time\nI'm prepared, papers and a lighter to provoke\nA comical scene to watch Mista Grimm choke\nThen gain composure, compose a symphony\nFrom C-H-R-O-N-I-C and Mista G mixed together nicely\nCombining lick the linings vaula\nA fat Chronic sack you can put in your jaw\nH and R puff the stuff in ya lungs\nSmokin' on the Chronic, gettin' straight sprung\nStretched, taken to the extreme feelin'\nDancin on the ceilin like Lionel\nIf ya hear me on some vinyl\nI break 'em till they can't be broke\nAs I soak, in da indo smoke \n\n(Nate Dogg)\n(\"Are you high yet?\" repeated in background)\nTake a trip with Nate Dogg to the Eastside\nWe will show you wether our gangstas love to get high\nWe get high on every street in Long Beach\nSo don't come to my hood thinkin' that you can save me\n\nNiggas from (?) foreign (?) land (?) wanna come to the East and reveal (?)\nI gotta viscious left hook and you're damn right I will steal\nShots go out to my nigga Mista Grimm and you know Warren G\nI gotta nigga named Gangsta Rod, you know B-Tip you know me\nMy name is Nate D-O double G and I'm comin' straight from the East\nDon't think you don't know where I'm from, I'm from 213\n\n(Outro: G-Child)\nYeah, you know what I'm sayin'\n19 ninety muthafuckin 3 (hey)\nI got my muthafuckin niggaz in the house\nI got my nigga Mista Grimm in the house (uh, ah)\nI got my nigga B-Tip in the house (uh, ah)\nI got my nigga Nate Dogg in the house (uh, ah)\nI got my nigga Ricky Rod in the house (uh, ah)\nI got the nigga Butch in the house (uh, ah)\nI got my nigga Greg in the house (uh, ah)\nHe's engineering this, check it out\nYou know what I'm sayin'\nLong Beach in the house\nWe hooked up with some people from West Covina\nMy nigga Mista Grimm, but you know\nAin't nothing but a G Thang, uh\nG Thang, but you don't hear me though, yeah\nAre you high yet?  \n\nAre ya high big baby?\nAre ya high?  \n\nNigga I asked you is you high (I'm fucked up)\nI ain't be gotten no women, nigga is you high, shit (I'm fucked up)\n\nOh we can do this then,\nHey, let's go\nIt's over big baby, hey"}