{"song_id":18709,"song_name":"We Getz Busy","artist_id":276515,"display_artist":"Illegal","spotify_id":"null","lyrics":"(Malik)\nYo, check it out\nComing right back at you\nWith another slamming hit\nIllegal in the motherfuckin house\nWith Erick Sermon, takin' over in the 90's, youknowhatI'msayin?\nE-Double on the solo tip\nAnd this how we gonna do it\nWe gettin' buzy on this track\nAiyyo, check it\nDo ya like this\n\nMalik'll play the lawnmover, and Kris'll play the grass\nI just ate MC's, cause why? ABC whipped!\nIllegal cuts that ass, the way that I will punch you\nWouldn't think I was a kid G, that's why I took the time out\nTo say that I gets buzy, like Dizzy, Gillespie\nSo suckers stretch your eyes, but you still couldn't see me\nNow, skippidy-doo-dah, di-di-di da-di-day\nI don't need no permission, I still come out and play\nTo Uncle Sam I say, \"Scram!\" Say my numbers aren't enough\nBut to get wreck with the army, all I have to be is rough\nAnd tough, and no need to lie about my age\nJust get fly with my tongue, and go on a rampage\nI'm going off, because it's Little Malik\nAnd no sucker, it's not all about maturity\nNow if you want beef, fuck it, cause a fuss\nAnd no, little kids, this ain't nothin' for Da Youngsta's\nYa can't even see me\nIt's no relation, so we can't run in the family\nYeah, and I'm still the boss\n'Cause I'm a straight up nigga, ain't nothin' 'bout me Kris Kross...\n... You little rejects\nI have the intellect to get respect, I'm gettin' wreck\nDon't even try to scam, because you're no threat to me\nCan't rate ya, who rhymes, sellin Jermaine's life stories\n\n \"For all of y'all, keepin' y'all in health\"\n\nI getz buzy\nI getz buzy on this track, 'cause I getz buzy\nMalik getz buzy on this track, 'cause I getz buzy\nMalik getz buzy on this track, 'cause I getz buzy\nMalik getz buzy on this track\n\n(Jamal)\nI getz buzy with my shit, you shouldn't shoulda fucked with me\nI'm not a ordinary kid it's the Illegal shit G\n\nAnd with Malik, my shit'll be pumpin, you're punkin\nYou step out ?like the fuck in it? just like a pumpkin\nSwingin' bolos, and buckin buckshots\nSo when you look in the mirror, it be Illegal on your knots\nSo my advice to you is fade, stay out my way\n'Cause I'm a young bull on a rampage, I don't play\nJam that was a dopefiend, my rhymes and crews are fat\nCheck out my ryhmes, and now check my gat\nBecause I'm always strapped pack with a loaded rhyme\nAnd steppin niggaz get knocked off, from here to Zimbabwe, out\n'Cause I ain't havin' that shit, in ninety-three\n'Cause if you fuck with this shit, you gotta fuck with Malik, uh-huh\nYou call me pussy, come and play you get fucked\nBut if your bitches is burned, I call her shit out of luck\n\n \"For all of y'all, keepin' y'all in health\"\n\nI getz buzy y'all\nJamal getz buzy on this track, I getz buzy\nI getz buzy on this track, Jamal getz buzy\nI getz buzy on this track, I getz buzy\nJamal getz buzy on this track\n\n(Erick Sermon)\nAh, make me wanna holla (\"RRAAAAAOOWWW!\") scream like Busta\nAnd get down, get down, from 'You a Customer'\nCocaine hit, E-Double the shit, yo\nI'm swifter than Flash when I'll be cracking that black ass\nLike this, my style's mackadocious\nAnd rumpshaking, like the bumba claat Jamaican\nWho can see me? My rap format is cock diezel\nWhen I be rockin' with Illegal\nIt Smells Like Teen Spirit, but not Nirvana's\nIt's real hip-hop music, like Afrika Bambaata's\nSo step off, heey, hey\nYo it's the E-R-I-C-K yo...\n\n \"For all of y'all, keepin' y'all in health\"\n\nI'm gettin' buzy y'all\nI'm gettin' buzy on this track, I getz buzy\nErick getz buzy on this track, I getz buzy\nErick getz buzy on this track, I getz buzy\nErick getz buzy on this track"}