{"song_id":18700,"song_name":"Written On Ya Kitten","artist_id":312066,"display_artist":"Naughty By Nature","spotify_id":"0ey2gaUqOYXGdxuShDcFHP","lyrics":"Oh where's my kitty cat?\nOh where's my kitty cat?\nOh where's my kitty cat?\nOh where's my kitty cat?\n\nTreach\nOh lord have mercy come again, come again\nI'm making other people's pussycats max if your nookie\nThat's, good for your voice, plump, trump and moist\nRub me where you love me face the waist some takes his choice\nPlenty many ladies try to pay me the lady\nI got motts but worse that cost a lot baby, baby (baby, baby)\nKitty Kat hittin kid from the corner, wanna quest the rest of your nest\nStraight from my shower to your sauna, yup\nNext crew, this ain't no Pep&#xE9; Le Pew, this is what we do, M&#xE9;nage &#xE0; trois we do\nToo mean, too mad, too much to handle\nName is written like a Martin lit that kitten with a candle\nAnd if ya go court on that have a rate court stuff, come take a short cut to Fort Nuts\nMany praise the way we play (Well you know)\nWhat can I say?\nHit 'em low\n\nOh where's my kitty kat, where's my kitty kat at stroking me? (Hoping she's open G)\nOh where's my kitty kat, where's my kitty kat at stroking me?\nOh where's my kitty kat, where's my kitty kat at stroking me? (Hoping she's open G)\nOh where's my kitty kat, where's my kitty kat at stroking me?\n\nTreach\nOn and on, I coulda sworn I saw puddy cat, city titty cat, witty pretty cat\nOh where the hell is my kitty kat!\nPretty patter craps, then I lick her paw, looks like a thicker broad, thick as a brick, time to pick the draws\nNow every time my waterfall blows, I'm at the tip her toes going yo, GERONIMO!\nGot my name written in missiles, capitals, lower-case, show your face, cursive and big initials\nI mow the lawn every season, call me Mr. Green Thumb, 'cause I'm pushing pushers giving me ones\nCook up the stew and keep steppin', I started another life with your wife after we met at y'all reception\nI saw your think down in the kitchen, now she does kev does head the dirty laundry plus does dishes\nBefore the hittin though on your mitten, and don't stop stickin'\nUntil it's written on her kitten\n\nOh where's my kitty kat, where's my kitty kat at stroking me? (Hoping she's open G)\nOh where's my kitty kat, where's my kitty kat at stroking me?\nOh where's my kitty kat, where's my kitty kat at stroking me? (Hoping she's open G)\nOh where's my kitty kat, where's my kitty kat at stroking me?\n\nTreach\nHalleujah! Hip Hop Hooray!\nI'm up six hours early, it's a kitten hittin day\nThe dog catcher doesn't speak, his moves switches cause, I catch the pussycat and he catches all the bitches\nI go for cats plus ball hard, but you can never get the purr or the fur from a bulldog\nSo I'm back for the cat, give up the nappy stat\nSo I can take a cat nap\nOh yeah I like my pussycat deep, so if she's tired of sleep, I have some place to soak my feet\nI see some looking for a bigger knot, what a nigga got, just make sure there's satin sheets in your litter box\nThat's when they hit us a problem\nMake sure the room is hot and locked with Gangsta Bitch in the Boombox (in the Boombox)\nI oughta chill and leave happily\nAnd if somebody knocks it after me there be a Catastrophe\nYou don't ever let me get a little bit, for the kibbles 'n' bits, I hit for nibble the tits (nibble the tits)\nAlways due to hittin with a lubricated mitten, some do lickin' stickin' just to get it written on their kitten\n\nOh where's my kitty kat, where's my kitty kat at stroking me? (Hoping she's open G)\nOh where's my kitty kat, where's my kitty kat at stroking me?\n\nOh where's my kitty kat, where's my kitty kat at stroking me? (Hoping she's open G)\nOh where's my kitty kat, where's my kitty kat at stroking me?\n\nOh where's my kitty kat, where's my kitty kat at stroking me? (Hoping she's open G)\nOh where's my kitty kat, where's my kitty kat at stroking me?\n\nOh where's my kitty kat, where's my kitty kat at stroking me? (Hoping she's open G)\nOh where's my kitty kat, where's my kitty kat at stroking me?"}