{"song_id":18723,"song_name":"Looking For Mr. Do Right","artist_id":1518199,"display_artist":"Jade","spotify_id":"6yosQszs2pOEkmGKOqagmN","lyrics":"It's rainin' again, what time is it?\nMan, I can't believe he done stood me up again\nI don't deserve this, what kind of fool does he think I am?\nTime after time and today, but what for?\nHuh, you know what? I think it's time I've looked for Mr. Do Right\n\nWorked all day long, I need a man whose back is real strong\nSomeone to fulfill my intellect and sexual desires\nNow, please don't get me wrong, I don't even come on strong\nIt's been awhile since I've been satisfied\nAnd these feelings I can no longer hide\n\nI used to be in love, but it was oh, so long ago\nMy mind and body's craving, for a real man to give me some love\nBut now that you're here with me, there's a smile upon my face\n'Cause loving you is so damn easy, and you sure 'nuff driving me crazy\n\nCan't someone stop this rain from falling on my face?\nI'm looking for Mr., Mr. Do Right someone who can do it all night\nWhen will you learn playing with fire really burns\nI'm searching for Mr., Mr. Do Right\nSomeone who can please me through the night\n\nI sit here waiting, you just won't call, no\nMy mind is so confused but you don't seem to care at all\nNow Lord knows I've tried to keep our love alive\nSo I sing this song for you 'cause it seems like the right thing to do\n\nI used to be in love but it was oh, so long ago\nMy mind and body's craving, for a real man to give me some love\nBut now that you're here with me, there's a smile upon my face\n'Cause loving you is so damn easy and you sure 'nuff driving me crazy\n\nCan't someone stop this rain from falling on my face?\nI'm looking for Mr., Mr. Do Right someone who can do it all night\nWhen will you learn that playing with fire really burns\nI'm lookin' for Mr., Mr. Do Right\nSomeone who can please me through the night\n\nYou used to love me\n(I need a real man)\nI need a strong man, I need a Mr. Do Right\nYou don't hold me like you used to\nMy mind and body's craving, oh yeah for Mr. Do Right\nLord knows I've tried, Mr. Do Right\n\nDon't keep me waiting, anticipating, oh\nI worked all week long, I need a Mr.\nI need a man who's back is real strong\nFulfill me, take care of my sexual desires, baby"}