{"song_id":18757,"song_name":"What's My Name?","artist_id":279664,"display_artist":"Snoop Dogg","spotify_id":"5XhkV07Vou38wnrzwURUOC","lyrics":"Eeyiyiyiyiya, the Dogg Pound's in the house (the bomb)\nEeyiyiyiyi yeah, the Dogg Pound's in the house\nSnoop Doggy Dogg (the bomb)\nSnoop Doggy Dogg (Dogg)\n\nFrom the depths of the sea back to the block\nSnoop Doggy Dogg, funky as the, the, The D.O.C\nWent solo on that ass, but it's still the same\nLong Beach is the spot where I serve my 'caine\nFollow me, follow me, follow me, follow me, but don't lose your grip\nNine-trizzay's the yizzear for me to fuck up, shit\nSo I ain't holdin' nuttin' back\nAnd motherfucker, I got five on that twenty sack\nIt's like that and as a matter of fact (rat-tat-tat-tat)\n'Cause I never hesitate to put a nigga on his back\nYeah, so peep out the manuscript\nYou see that it's a must we drop gangsta shit\nWhat's my motherfuckin' name?\n\nSnoop Doggy Dogg (yeah, yeah, yeah)\nSnoop Doggy Dogg (the bomb)\nDah dah dah dah, doo doo doo doo doo doo doo, dah dah (Dogg)\n\nIt's the bow to the wow, creepin' and crawlin'\nYiggy yes y'allin', Snoop Doggy Dogg in\nThe motherfuckin' house like everyday\nDroppin' shit with my nigga Mr Dr. Dre\nLike I said, niggas can't fuck with this\nAnd niggas can't fuck with that\nShit that I drop cause ya know it don't stop\nMr. One Eight Seven on a motherfuckin' cop\nTic toc never the Glock, just some nuts and a cock\nRobbin' motherfuckers, then I kill dem bloodclots\nThen I step through the fog and I creep through the smog\n'Cause I'm Snoop Doggy (who?) Doggy (what?) Doggy (Dogg)\n\nSnoop Doggy Dogg\nSnoop Doggy Dogg (the bomb)\nBow-wow-wow, yippy-yo-yippy-yay, bow-wow-wow, yippy-yo (the bomb)\nBow-wow-wow, yippy-yo-yippy-yay, bow-wow-wow, yippy-yo\n\nNow just throw your hands in the motherfuckin' air\nAnd wave the motherfuckers like ya just don't care\nYeah, roll up the dank, and pour the drank\nAnd watch your step (why?) cause Doggy's on the gank\nMy bank roll's on swoll\nMy shit's on hit, legit, now I'm on parole, stroll\nWith the Dogg Pound right behind me\nAnd up in yo bitch is where ya might find me\nLayin' that, playin' that G Thang\nShe want the nigga with the biggest nuts, and guess what (what?)\nHe is I, and I am him, slim with the tilted brim\nWhat's my motherfuckin' name\n\nSnoop Doggy Dogg (the bomb)\nSnoop Doggy Dogg\nSnoop Doggy Dogg (the bomb)\nSnoop Doggy Dogg (Dogg)\nDah dah dah dah, doo doo doo doo doo doo doo, dah dah (the bomb)\nDah dah dah dah, doo doo doo doo doo doo doo, dah dah (Dogg, the bomb)\n\nDoggy Dogg, Doggy Dogg, Doggy Dogg (the bomb)\nWord is he's lying, Snoop Dogg\nAnd the Dogg Pound, a playa, Snoop Dogg\nSnoopy Dogg, Snoopy Dogg (the bomb)\nPlaya yeah, I know you're dirty\nC'mon Snoopy, c'mon Snoopy (the bomb)\nAnd the Dogg Pound, Snoopy Dogg (the bomb)\nSnoopy Dogg, Snoopy Dogg (Dogg)\n\nNasty dog, doggy dog\nThank God it's Friday"}