{"song_id":18836,"song_name":"Money In The Ghetto","artist_id":430262,"display_artist":"Too Short","spotify_id":"null","lyrics":"In The Ghetto\nYou think life is hard\nFood stamps and to' up cars\nWall to wall dirty on carpet\nSittin' in a bucket hopin' you can start it\nAnd ride around to the liquor store\nCan't get a job get drunk some more\nYou better stop trippin' on them stereotypes\n'Cause In The Ghetto there's a good life\nWe ain't starvin' like marvin' won't see no roach\nWhen you chill wit the rich folks in the hood\nYou sittin' on leather watchin' big screens\nBought by the dope fiends\nSmokin' and what about the brother wit the good jobs\nSave money and workin' hard\nBought a house for his wife and kids\nYou only got 1 life to live\nAnother brother got some cocaine\nYou know his face but don't know his name\nYou know he got the sack man\nAnd he's sittin' on a phat bank\nSellin' cars at his house in the driveway\nBein' so clean don't roll it just fly away\n'Cause folks got Money In The Ghetto\nYeah you know.\n\nHey hey hey.\nWhatcha got to say?\nIt's Money In The Ghetto\nHollywood\n\"Havin' Money In The Ghetto.\"\n\nMoney In The Ghetto ain't nothin' new\nIt's been like that way before you\nWas even born get up for the down stroke\nChocolate city for the black folks\nSay it loud in your hot pants\nMan child in the promise land\nI take you back to iceberg's land\nAnd all the players that came before him.\nIf you a everyday hustler, get'cha money\n'Cause what they do to black man ain't funny\nAll the time tryin' to put us the pen\nYou get parole and then they send you again\nAll the homies in the hood gettin' paid\nYou might have left but the Money stayed\nIn The Ghetto it ain't all about drugs\nGettin' paid doin' all kind of stuff\nOnly rule on the street is don't get caught\nUnless you hustle ain't breakin' the law\nAnd even though rich folks got it good\nWe're sittin' on it phat in the hood\nI'm ridin' on some gold ones\nSmokin' dank and it's potent\nAsk them fools 'cause they know\nIt's Money In The Ghetto.\n\nHey hey hey.\nWhatcha got to say?\nIt's Money In The Ghetto\nHollywood\n\"Havin' Money In The Ghetto.\"\n\nI got money baby just tell me the price\nCause $hort dawg ain't nuttin' nice\nI always hit the town wit my boy Ben Franklin\nSpend fo' get an ounce a dank then\nRich nigga get high relaxin'\nAnd if I bust a Ben Frank get some Andrew Jackson's\n5 20's for a hundred dollar bill\nYou know the math let's make a deal\nOn a $1 bill if you look on the front\nYou find the face of George Washington\nMake money baby that's all I do\nThat's how I know Thomas Jefferson is on the 2\nAbraham Lincoln got shot and died\nFreed the slaves so they put him on the 5\nAnd how much in my old time friend\nThey put his face on the front of the 10\nThey are the dead presidents\nFrom the hood and they represent\nThe American dream for the average monority\nMakin' money get some weed & a 40\nI'm on the east side livin' like a king\nKick back watch a 50 inch screens\nBounce to the west side and hit studio\nAnd spend my Money In The Ghetto.\n\nHey hey hey.\nWhatcha got to say?\nIt's Money In The Ghetto\nHollywood\n\"Havin' Money In The Ghetto.\"\n\nNowadays if you can't say a rap, or play sports\nYou might just come up short\nAnd they always say the same things\nDon't be a gangsta or a dope fiend\nGet your High School diploma, go to college\nGet a degree and start makin' dollars\nOnly 1 thing wrong and it's a trip\nInner city schools don't teach us shit\nGot us stuck on stupid, straight S.O.S.\nCan't get nothin' but they payin' the rest of them fools\nAll around the world in the other countries\nThey should be spendin' that money right here\nIn the state of California\nYou graduate and can't spell diploma\nDip to the hood and get rich\nSlangin' rocks to a smoked out bitch\nNo school'll come close to that\nA few transaction make my pockets fat\nI make alot of money and it ain't no lie\nI'll probably ball till the day I die\nAnd if I didn't. So What?\nI bet you I'd still come up\nCause there's a whole lot of Money In The Ghetto... yeah you know.\n\nHey hey hey.\nWhatcha got to say?\nThey got Money In The Ghetto\nHollywood\n\"Havin' Money In The Ghetto.\""}