{"song_id":18872,"song_name":"How Do You Like It?","artist_id":305658,"display_artist":"Keith Sweat","spotify_id":"2K5tllslbKc50g1RqtiPuZ","lyrics":"Keith:\nHow do you like it when I do it just like this\nHow do you like it when I do it just like that\nHow do you like it when I do it just like this\nHow do you like it when I do it just like that\n\n - And all the gangsta's say\n\n(Repeat 1 (3x))\n\nKeith (Left Eye):\nI don't want to do you wrong baby (do you wrong)\nI just want to treat you right (treat you right) baby\nCome and lay with me my girl (lay with me)\nI just want to serve you right\n\nHow do you like it baby (nice and slow boy)\nTell me how you want it baby (here we go my baby)\nTell me girl what makes you feel good my baby\n(Nice and slow boy)\nTell me girl how do you like it baby (here we go my baby)\nI want my promises back\nHow do you like it when I do it just like this\nCome on come on come on\nHow do you like it when I do it just like that\nDo you like it when I do it just like this to you baby\nHow do you like it when I do it just like this\nTell me how do you like it girl\nHow do you like it when I do it just like that\n\n(Repeat 1 (4x))\n\nKeith (Left Eye):\nCome on girl and taste this lovin' (this lovin')\nThat you know I got for you (got for you baby)\nI just want to lay you down (down with me)\nThat is what I want to do\n\nHow do you like it baby (nice and slow boy)\nTell me how you want it baby (here we go my baby)\n\n\nTell me how you like it sugar (nice and slow boy)\nI wanna know how do you want it baby (here we go my baby)\n\nKeith:\nGirl I got to know\nHow do you like it when I do it just like this\n(Ain't nothin' but a jam)\nHow do you like it when I do it just like that\n(Ain't nothin' but a Keith Sweat jam)\nHow do you like it when I do it just like this\n(Ain't nothin' but a jam)\nHow do you like it when I do it just like that\n(Ain't nothin' but a Keith Sweat jam)\n\nLeft-Eye:\nYo here we go-Left Eye flow\nWhat's up! Baby you can skinny dip in my left lip sip a little cat\nNip eat my punanna, monanna and the little banana split get a little top notch\nPlay somebody's hopscotch watch as I land in my man's crotch\nNow there's a crew in perusin' what I'm doin' I wouldn't want to ruin\nYou and who you knew but as I'm rollin'\nThrough your exes with my triple O\nI'm yellin' tic tac toe from the waist below Yo!\nYou say tomatoes I say tomatoes so pick up on my lead and lick on those toes\nMe and my kitty cat is wearin' a hat to the throne so baby take us to the endzone\nI'm catching 80 in my shady to the top nickel I'm the lady goin' crazy on your popsicle\nAnd as we come a little closer to the end of the game\nYou know I'm taking all the sweat out your name\n\nKeith:\nJam, how do you like it baby, jam\nCome on don't you want to jam\nI want to know baby jam\nCome on jam I want to know baby\nJam, jam baby ain't nothin' but my jam\nHow do you like it\nDon't you want to jam\nHow do you like it?"}