{"song_id":18929,"song_name":"Crooklyn (From \"Crooklyn\")","artist_id":397268,"display_artist":"The Crooklyn Dodgers","spotify_id":"null","lyrics":"\"Here comes the pitch ... and it comes in wide\nAnd the count now is one and one to Jackie Robinson\nBilly Martin... \"\n\n(Buckshot) \"Straight from Crooklyn, better known as Brooklyn\"\n(Guru) \"Never takin' shorts, cause Brooklyn's the borough\"\n\n(Special Ed)\nPanic, as another manic depressive\nAdolescent, stares at death, now what's left\nWhen there ain't no God, and a whole lot of pride\nIt might be a homicide; so let the drama, slide\nWe don't want no problems B\nGet your name in the obituary column sheet\nCause life is too short, and it just gets shorter\nI wish I had a quarter for all my people they slaughtered\nLast year alone, in the Dead Zone\nWalk straight, but don't walk late\n'Cause I'm comin' with a hate only made, from what it made me\nCause nobody ever played me\nNow it's, only gettin' worse, Buckshot and Ase\nIn the land of the waste, kickin you in your face\n\n(Masta Ase)\nWe be doin' it up Crooklyn STYYYYYYLE\nWhat does it take to get you WILLLLLLD\nMy mentality is gettin' iller, killer\nInstinct that's tryin' to infiltrate, but wait\nI know you wanna enter but I can't let you in\nMy mindstate's the maddest, I'm Gone With the Wind\nBecause it is, survival of the fittest\nWhen the shit hits the fan I got my shank in my hand\nBlack man with the permanent tan\nI come from the 'Ville and never ran, damn\n\n(Buckshot)\nI'm feelin' another part of reality\nHit me when I represent the F.A.P\nStraight from the 'Ville, Tilden played the building\nI mean literally when I say I make a killing\nFor my cypher, see I'm feenin to bust a piper\nOriginal Headz represent the Brooklyn all nighter\nDo or die, I'm sayin' it's you and I\nBring your click, so we can get Stone like Family Sly\nPeace to C.I. and the Bush\nMight even see Ruck and the Rock givin' the push\n\n(Buckshot) \"Straight from Crooklyn, better known as Brooklyn\"\n(Guru) \"Never takin' shorts, cause Brooklyn's the borough\"\n(Buckshot) \"Straight from Crooklyn, better known as Brooklyn\"\n(Guru) \"Never takin' shorts, cause Brooklyn's the borough\"\n\n(Masta Ase)\nWe did it like that, and now we do it like this\nWe did it like that, and now we do it like this\nGo inside your mind and find a time that you miss\nAnd just, think about the steel in your fist\nIt's just an extension of your arm, it's that ghetto type of charm\nThat makes all the homeboys swarm\nCan I drop the bomb? Oh yes I can\nMove with the groove, smooth like Geechie Dan\nWho is the man? That kid there\nWho is the chick with the pick in her hair?\nAngela, uh Davis, and we roll like Avis\nRent-a-Car kid, there you are\n\n(Special Ed)\nYou know where to find me, whenever you need me\nIf you know the Ave., follow the path\nTo the land of the aftermath\nBut don't frolic in the midst, crazy ass Crooklyn kids\n'Cause they always throwin' a body on my lawn\nI'm gettin' a Rott-weiler, without a collar\nGet off my block boy and give me a dollar\nFor the trouble, or get blown up, like a bubble\n\n(Buckshot)\nLet's take a sec to think back, the year of the seven-oh\nWhen Brooklyn was the place to go\nFlow, on a journey up to Crown Heights\nEbbets Field, feel the reel to reel on your life\nTrife, individuals live in the PJ's\nDee Evil, check my DJ\nHey, play what I wanna play in the day\nBut in the night, I feel the right took a left\nBucktown, Brooklyn break it down\nHeads from state to state, travel as I unravel the rate\nHow it, tapped Scott and Sutter\nI remember way back in the days playin' hot peas and butter\nBrother, if you want another lesson, Crooklyn, session\nTake it back, Black Smif-N-Wessun\n\n(Special Ed)\nPress your luck, you get stuck by Buck\nFor your bucks, Masta Ase, has the taste\nFor ducks, and duck sauce, so tell Lord Digga\nDig a grave for the bones, sticks and stones\nWhile I kick some ancient poems, through your domes\n'Act went back, to attack your homes\nSo Tip, can I flip? (Yes you can)\nI'm in the World War, with Muhammad my man\n\n(Masta Ase)\nFeels so good to be a Crooklyn Dodger\nUh-huh, what's happenin', to ReRun and Roger?\nI think I seen 'em wearin Timberlands and runnin' down the block\nFrom D'Wayne and D'Wayne had a glock\n'Cause he be sellin rock for the Partridge Family\nAnd Ruben Kincaid drives a 300-E\nAnd he be pimpin' Chrissy from Three's Company\nPlus he stuck Mr. T for all his jewelry\nThis is a 70's thing from the days\nWhen kids didn't act so crazed, in Crooklyn\n\n(Buckshot) \"Straight from Crooklyn, better known as Brooklyn\"\n(Guru) \"Never takin' shorts, cause Brooklyn's the borough\"\n(Buckshot) \"Straight from Crooklyn, better known as Brooklyn\"\n(Guru) \"Never takin' shorts, cause Brooklyn's the borough\"\n(Repeats as sports dialogue fades in)\n\n\"Robinson waits, here comes the pitch\nAnd there goes a line drive to left field\nWaters? after it, he leaps and it's over his head\nAgainst the wall... and ? scores\nBrooklyn wins! Brooklyn wins! Brooklyn wins!\""}