{"song_id":18960,"song_name":"Funky Y-2-C","artist_id":418898,"display_artist":"The Puppies","spotify_id":"null","lyrics":"Oh you so funky and hot!\n\nHey little mama, why you dance so funky?\nHey little mama, why you dance so funky?\nYah, it's that funky dance, that funky Y2C!\nYah, it's that funky dance, that funky Y2C!\n\nHey little mama, why you dance so funky?\nHey little mama, why you dance so funky?\nYah, it's that funky dance, that funky Y2C!\nYah, it's that funky dance, that funky Y2C!\n\nHey little mama, why you dance so funky?\nGet on the floor and shake it like a donkey\nShake it's little ass, shake to the right, do the funky dance, shake it all night\nShake that thing you know you got it on, now look at me and shake your big butt\nJust do it baby jump up and down, now break it down, to the ground\nShake it, Shake it, Shake it, Shake it, get real funky and don't you break it\nYah, that's right you doing it baby look so funky you drive me crazy\nYah, it's the big boy once again\nLet that butt go out and in\nNow to the funky dance in place\nYou look so funky I wanna say\n\nHey little mama, why you dance so funky?\nHey little mama, why you dance so funky?\nYah, it's that funky dance, that funky Y2C!\nYah, it's that funky dance, that funky Y2C!\n\nFunky, Funky, yah that's me\nI'm dancing funky to the beat\nI really want the crowd to say...\n(Hey little mama)\nShaking it, Shaking it, that's what I'm doing\nGot all the boys up in here just ow-en\nJust because I'm young not old, I know you think that I am bold\nBold euogh to show this butt\nBut you know, you got me messed up\nI am young, but I have drinks\nI can do the funk that's all night\nSweat me Sweat suck, don't you know they call me Tamrya?\nFeast your eyes on this funky butt\nWhile all them folks out there say what?..\n\nHey little mama, why you dance so funky?\nHey little mama, why you dance so funky?\nYah, it's that funky dance, that funky Y2C!\nYah, it's that funky dance, that funky Y2C!\n\nOh you so hot!\n(Hey little mama)\nGirl you need to stop!\n(Hey little mama)\n\nHey ladies come, on do it now! FUNKY...\n(Funky Y2C)\nFellas come on, get it now! FUNKY...\n(Funky Y2C)\nI wanna learn that dance...\nMe too!\nSo, watch how I do it then...\n(Go, go, go, go)\n(Hey little mama)\nMy mama taught my how to do this...\n(Hey little mama)\nOh, she do it good\nYah it's that funky dance that funky y2c!\n(Go, go, go, go, funky Y2C!)\n\nHey little mama do you like that sound?\nDon't you know how to pup with the pup down?\nUP, pop pup is shaking it again... come on do that funky dance\nGet funky, funky, funky, baby, go to the ground, get crazy\nYah, that's right, Hey Tamyra, I'm telling you to shake that...\nWHAT!..\n\nHey little mama!..\nYah, I'm dancing funky\nFunky, funky, as you can see\nThrow my butt to the funky beat\nThrowing it 'cause you gave me a chance\nSo now watch me do that funky dance\nMake all the fellas dance right up\nWhile I go down to the ground... SAY WHAT?\n\nHey little mama, why you dance so funky?\nHey little mama, why you dance so funky?\nYah, it's that funky dance, that funky Y2C!\nYah, it's that funky dance, that funky Y2C!\n\nNow that's the way you do it dogg!.."}