{"song_id":19118,"song_name":"Pimp Of The Year","artist_id":301336,"display_artist":"Dru Down","spotify_id":"5EG736eh6LGV2Y99WbTJwD","lyrics":"Mack playas, ballas, grindas.\nYeah I'm the real true pimp of the year.\nWill ya feel me.\nHa ha, pimp of the mutha' fuckin' year.\n\nGive it up give it up a give it to me.\nA big mack capalized double D. see.\nAnd it's on, so I'm a get sick wit it,\nA give me drank da bomb and let me get wit it.\nYeeyah, 'cause I'm gonna be the biggest pimp of the year\nGoin' around doin' shit like this here.\nCause a nigga is strong,\nAnd way to long when it comes to my ding dong.\nBut, bet, I get a check when I sign on the dotted line,\nSo now I know I gotta get mine.\nIt's really no thang to me, see, to be a real true P.I.M.P.\n'Cause I had me a hoe or two or mo'\nWay back in eighty fuckin' fo'.\nThat's when I was a teen.\nBut my dick was still big to make a bitch bleed, see.\nAnd of coarse I'm slappin' hoes,\nSmackin' hoes, up and down tha fuckin' avenues.\nAnd ever I do that,\nI dig a deep in the pocket for tha fat gat.\nFeel me. I'm so god damn bad,\nThat I had to kick off in a hoe's ass,\nCause the girl tried to do me,\nRide of with her man in the mustang pony.\nAnd I know it'd catch up with her\nNext day in the paper, yeah the nigga raped her.\nBut I'm not trippin'.\nBitches like you want to keep on slippin'.\nSo I had to move on, to the next young bitch that had it goin' on\nUgh, and I'm not here to pump no fear,\nI'm just the mack playa' pimp of the year, bitch.\n\nPimp, pimp on... You got all the ladies.\nPimp, pimp on... You got all the ladies.\n\nFirst thang first on the second verse.\nI learned a hell of a lot,\nA get from the get down start.\nSo I had my hoes hoin'.\nHad every tramp thinkin' I was the orthidano goin'.\nCause all the game I spit is good shit,\nAnd the shit that I spit made me rich.\n'Cause I was all about money.\nIf the girl says she down, well bees come and get the honey.\n'Cause I'm givin' it up quick.\nTake a hit, take a lick at them pink lips.\nUh, and a bet is better than grey,\nNot knowin' that I bought this broad out of state\nAnd I met her in Mentley.\nLookin' just like the actress singer Whitney.\nBut I knew she was a fake one,\nBut to me young bra' it didn't really make me none.\nI just walked up to her.\nI said my name's Dru Down and I'll Slick Rick the ruler.\nAnd from the get go,\nI'm just a pimp, hoe, ya comin' with me, a to the east side O\nAnd then she said okay,\nI'm on my way, let me pack my bags before today.\nYeeyah, then I said get with it and don't be a bitch and try to split\nUh, She was right up under my wing,\nAt the airport at five fifteen.\nShe said \"Who are you and why are ya here?\",\nI said I'm Dru Down and pimp of the year.\n\nPimp, pimp on... You got all the ladies.\nPimp, pimp on... You got all the ladies.\n\nI've got a thang for makin' hoes.\nEvery woman that I touch bitch turns into gold.\nAnd I don't go for talk back,\nHave respect when ya speakin' to a pimp fuck that.\nDeduct from tha pay check,\nMatta fact get yo ass in the back of the Cadillac,\nSo I can ride and check mate.\nLike rule number eight I keep a bitch in a plate.\nAnd no I don't play around, fuck around,\nA when it comes to my money nigga.\nAnd when it comes to gettin' a bitch sprung,\nI give her Henesee, a with tha one on one.\nSo she can get so high, real high,\nAnd that she that knows I'm that type a guy.\n'Cause I'm a kick somethin' just for the hoes,\nAnd for myself I keep indo.\nAnd when a hoe finds out I'm real, yes I am\nMack playa pimp of tha year.\n\nPimp, pimp on... You got all the ladies.\nPimp, pimp on... You got all the ladies.\nPimp, pimp on... You got all the ladies.\nPimp, pimp on... You got all the ladies."}