{"song_id":19183,"song_name":"Foe Tha Love Of $","artist_id":296202,"display_artist":"Bone Thugs-N-Harmony Featuring Eazy-E","spotify_id":"null","lyrics":"(Feat. Eazy E)\n\nFoe tha' love of money\nGotta make that money man\nIt's still the same now\n\nGotta get on the grind\nPop in the clip of my nine\nAnd bitch if you slip\nYou hit the chalk and fall in the night time\nGotta get mine\nAin't takin' no shorts or no losses\nHop on the phone\nCallin' my nigga sin at home\nPolishin' that MAC-10 crome\nGotta a lick so bring yo shit\nCause once again it's on\nTo the dome with a fifth of burb\nWe wig to the curb so we swerve\nAnd rolled out to pick up the triple six thug\nAnd follow the murder for robbin the dooehouse\nSmoke jump outta me bong\nSo high, now comin' to slay with four grenades and a gauge\nI'm a play, watch all 'em fall in the grave and lay\nPullin' in the driveway, Wish spotted the place and quickly rolled up\nBulldozed through the living room\nHopped out of the car and started to blow up\nBuck, Buck, and a kaboom\nMe blew all them bodies all over the room\nThem doomed\nAnd gotta move fast, why?\nThe po-po's comin'\nSnatch up me yummy\nSo nigga don't think it's funny\nI'm comin' up quick in the niine-quat\nCause Flesh be lovin' this money\n\nI'm given uo love to the hustlas\nAll them St.Clair thugstas makin' that money stayin' on your feet\nAnd you better believe gotta have that cheese\nFor the green leaves, never catch me sleep\nStay on the grind, get mine\nStayin' down for mine crime, and I hit up the nine-nine\nGivin' up that llelo, makin' me sale, twenties nickles and dimes\nBeat up and stick up a lick up, that two-eleven\nGotta get what's mine, then bailin'\nMe kickin' up dust, I'm trailin\nFeelin' one-eight-seven\nThat's how it is, and I gotsta have it in the nine-quat\nMission to check a mill and still be real\nThuggin' on the glock-glock, creepin' on a come up\nWon't sleep till I'm done up\nGotta blaze me blunt up, hunt up another plot and scheme\nGotta make some green, cause soldiers nut up, What up?\nGotta get that business on, even though the buddah run me, stun me\nFeelin' lovely, but I'm just in it for he love of the money\n\nStandin' on the corner straight slangin' rocks\nAw ahit! Here comes the muthafuckin' cops!\nSo I dash, I ducks, and I hides behind a tree\nMakin' sure the muthafuckas don't see me\nNow my fat sack of rocks hell yeah I stuffed 'em\nPolice on my draws, I had to pause\nAnd yeah, it's still muthafuck 'em\nNow my game is tight, tight as fuck is my game\nEasy muthafuckin E or Eric Wright it's all the same\nNow niggas might trip on how I stash my grip\nI gotta have it bitch\nFor the love of this shit\nMuthafucka!\n\nWhen dough got me thugsta, thuggish ways, down for my crime every time\nFollow me down the nine-nine, and you will find all of me kind\nCheck out the ripsta, now, drop down\nRun 'em up outta me hood\nRip's straight when makin' me grip with me click\nRollin' with Ruthless, the thug I be\nMe put 'em in mud, buck 'em, and pump blood\nGot nothing to lose, bitch\nYa beter respect Rip, or ya best check this slug\nIt's goin' down steady pump and peel rounds, gunnin' with a me gang\nBang, gotta make that money man\nIt's still the same\nSteady runnin' thang wild, and follow me now\nWhile I take you up into a barrel of a gun, see\nFor the dub you're done\nFor the bud, I run, for the love of my money\n\nNigga down for my thug off in this game\nSo peep as me creep and me crawlin' off on the mission to back in the\nDays\nWhen niggas was bailin' with sawed-offs and wanted to get paid\nRunnin' to my side, lil' nigga, Ripsta, both on the mission for money\nYou give you the cash, oh, that was your ass\nCause me and me nigga was hungary\nAnd bitch, if you're stallin' you might just catch one to the temple\nAnd um, Bone raw doggin', so nigga just make tha shit simple and run\nTo catch one nigga me fill 'em with bullets and dump 'em in rivers\nRemember, me killa now\nFor money, me dig ya six feet in a ditch and get richer\nCause bitch you were slippin'\nI'll cut ya, then rip ya, then buck ya down\nSteayd rodin' and stealin' makin' a killin'\nNigga drugdealin', needin a million\nHustlin' drugs when the thugs be chillin'\nFor the money, these niggas be sellin' off in the cut\nWhere you find a nigga thuggin' off in braids and skullies\nAnd when I stick ya and lick ya, remember\nI get 'em up for the love of the money\nFor the love of money\n\nYeah, Bone in the muthafuckin' house for the nine-quats nigga\nYeah, rollin' with Ruthless records in this bitch\nMy niggas, Layzie Bone, Bizzy Bine, Wish Bone, And Flesh-n-Bone\nAnd I'm that nigga, Krayzie Bone, in the muthafuckin' house"}