{"song_id":19190,"song_name":"Can't Wait","artist_id":364794,"display_artist":"Redman","spotify_id":"0gr7MtWpDjyWK3E0xCbJCX","lyrics":"(Verse One)\nI'm like RRRAHHH RRRAHHHH, like I had cerebral palsy\nMy flows be's wet like all you girls drawers be\nCrack the Phils, spread the buddha then the hidash\nRoll it up and then ask, who chipped in for the ten bag?\nEt cetera, I roll my blunts with two textures\nPick up fifty bags and then I smoke all the extras\nIt's the truth, like vod-ka one-eighty proof\nDon't drop your drawers, I'll fuck through your daisy dukes (true!)\nPut your fingers up in the air if you're high (hiiigh)\nI walk by (by) so eff a drive (dry)\nI swing up in it bout an average as half as\nGood as Reggie Jackson's that's why you talk backwards\nEnough; chumps be on some Bogart shit like Humphrey\nYou couldn't beat me if you ran with 21 Jump Streets\nOr 90210, fuck it yo\nIn the movies I'm the nigga puffin buddha in the back row\n\n(Chorus: Repeat 8X)\nI can't wait to get it on\n\n(Verse Two)\nI'm just a smokey boy, I'm from the Land of the Lost\nYou can't see me, like Charlie Angels' boss; I'm often\nCoolin 'round the blid-docks, I rock round the clid-dock\nMy glid-dock cocked, from here to 16th and Len-nox\nAsk Roger Thomas if I'm gettin' scopic\nI was milk like two tits, now I'm butter like Blue Bonnet\nNow who got the funk? (We got the funk!)\nAy ay aiyyo well I got the weed! (We got the blunts!)\nI never sniffed; I used to puff woolies in a jam\nBack in eighty-eight, when it was twenties to the gram\nBizzail, you couldn't feel me in braille, hell\nI write my names on walls in smoke spots when I'm buyin L\nThe fly guy with the Force like Luke Sky'\nDown for a funk see twa bitch if you're fly\nThe Funkadelic, been rockin' mics since the fourth grade\nI Terminate like X and I Terminate like Schwarzeneg\nDum-de-dum, rock like Buju Banton\nSoup like won ton, funk by the tons, to rumps\nPLEASE! My whole crew is makin' cheese\nTonight's the night baby, so suck up on these - and it's on\n\n(Verse Three)\nI said I, catch the A-train, to the left\nSmoke the choc', I set shit off like Boba Fett\nBig up to all my niggaz in the housin projects\nI'm runnin' up in ya continue to split your guts\nGRAB THE RAIL, if you get scared of my lines when I rock well\nGot Whit's like Pernell, shit's the bomb like Ak'nel\nRickety rocket, mind deep as the Loch Ness\nWaste niggaz like toxic, wet like galoshes\nCan I handle my biz? (Yes you can!)\nI cause Chaos, and bring a lot of Def-to-Jams\nYes I can; now act stupid I'll pop the trunk\nKa-KLUNK, now give me a ba-bump, BA-BUMP\nOoh cool, smooth like two blue suede shoes\nY'all faggots slept on my Hoffman and Kools\nWord to Dan, Tan, Pillow and Cool B\nSwitchin speeds like Bruce Lee ridin' up Fuji in a movie\nI drop it on the one, fuck the two-three\nFunky like a box of coochies on loose leaf\n\nYo yo, I said...\nSwitchin up speeds, like Bruce Lee, ridin' up Fuji, in a movie\nHeh, I be sayin' some shit!\nNow... if you didn't get it...\nLaugh now... and then figure the shit out when you get home!"}