{"song_id":19415,"song_name":"Liquid Swords","artist_id":302695,"display_artist":"Genius/GZA","spotify_id":"2qmxggATKFIeg68guRSG3r","lyrics":"Intro one: (not included on 7)\n\nWhen I was little... my father was famous.\nHe was the greatest sam-urai in the empire;\nAnd he was the shogun's decapitator.\nHe cut off the heads of a hundred and thirty-one lords.\nIt was a bad time for the empire.\nThe shogun just stayed inside his castle -- and he never came out.\nPeople said his brain was infected by devils.\nMy father would come home -- he would forget about the killings.\nHe wasn't scared of the shogun, but the shogun was scared of him.\nMaybe that was the problem.\nThen, one night... the shogun sent his ninja spies to our house.\nThey were supposed to kill my father... but they didn't.\n*Woman screams*\nThat was the night everything changed *voice fades*\n\nIntro two: rza\n\nSee, sometimes...\nYou gotta flash 'em back\nSee niggaz don't know where this shit started\nY'all know where it came from\nI'm sayin' we gonna take y'all back to the source\nWe bounce, yo\n\nChorus: rza, gza\n\nWhen the MC's came, to live our their name\nAnd to perform (forrrrm)\nSome had, to snort cocaine (caiiinnne) to act insane (sannne)\nWith before pete rock-ed it on, now gone\nThat the mental plane (plaaanne) to spark the brain (brainnn)\nWith the building to be born\nYo rza flip the track with the what to gut\nCheck 'em check chicka icka etta uh\n\nVerse one:\n\nFake niggaz get flipped\nIn mic fights I swing swords and cut clown\nShit is too swift to bite you record and write it down\nI flow like the blood on a murder scene, like a syringe\nOn some wild out shit, to insert a fiend\nBut it was yo out the shop stolen art\nCatch a swollen heart from not rollin' smart\nI put mad pressure, on phony wack rhymes that get hurt\nShit's played, like zodiac signs on sweatshirt\nThat's minimum, and feminine like sandals\nMy minimum table stacks a verse on a gamble\nEnergy is felt once the cards are dealt\nWith the impact of roundhouse kicks from black belts\nThat attack, the mic-fones like cyclones or typhoon\nI represent from midnight to high noon\nI don't waste ink, nigga I think\nI drop megaton bombs more faster than you blink\nCause rhyme thoughts travel at a tremendous speed\nClouds of smoke, of natural blends of weed\nOnly under one circumstance is if I'm blunted\nTurn that shit up, my clan in da front want it\n\nVerse two:\n\nI'm on a mission, that niggaz say is impossible\nBut when I swing my swords they all choppable\nI be the body dropper, the heartbeat stopper\nChild educator, plus head amputator\nCause niggaz styles are old like mark 5 sneakers\nLyrics are weak, like clock radio speakers\nDon't even stop in my station and attack\nWhile your plan failed, hit the rail, like amtrak\nWhat the fuck for? down by low, I make law\nI be justice, I sentence that ass two to four\nRound the clock, that state pen time check it\nWith the pens I be stickin but you can't stick to crime\nCame through with the wu, slid off on the dl\nI'm low-key like seashells, I rock these bells\n(When the MC's..) now come aboard, it's medina bound\nEnter the chamber, and it's a whole different sound\nIt's a wide entrance, small exit like a funnel\nSo deep it's picked up on radios in tunnels\nNiggaz are fascinated how the shit begin\nGet vaccinated, my logo is branded in your skin"}