{"song_id":19477,"song_name":"Let's Play House","artist_id":377303,"display_artist":"Tha Dogg Pound Featuring Michel'le","spotify_id":"72dGR173qzIBT1qOUQn52F","lyrics":"Intro: Dr. Dre\n\nThat's right\nSome of that shit you just can't fuck wit\nTha Dogg Pound flava, for the nine-fever\nKnowhatI'msayin? Michel'le in the house\nThat's right, set it off\n\nVerse One: Dat Nigga Daz, Michel'le\n\nYoung Daz struck a match and the match went out\nBut it wasn't no more lights in the house, check it out\nSpeakin' of house let's play a game of it\nAre ya wit it? Hide and go get it, I betcha love it baby\nI'll play the daddy and you can play the momma\nSo we can get down upon the living room floor\nAre ya wit it? I promise I won't kill it\nPuddy-cat on a leash what should I do, should I kill it?\nYesss\n\nSee back in the day when we used to play\nYou wanted to be with me (that's right)\nNow that is so right and natural\nNo other man that I can see\nI'm singin' in my background\nDiggin up a hole for you to make your move\nBut no longer will I be told regroup\nLet's play house\n\nChorus: Daz, Michel'le, Nate Dogg\n\nEngine engine number nine let's play house\nRollin' down the DP line\n(Repeat 2X)\n(Michel'le) Let's play house...\n(Michel'le) Is that what you want me to do with you?\nYou play tha momma baby let's play house\nI'll play the daddy\nYou can play the momma\nAnd I'll play the daddy\n(Michel'le) Let's play house\nYou can play tha momma let's play house\nAnd I'll be the daddy\nAnd I'll be the daddy\nThat runs the house, straight up\n\nVerse Two: Dat Nigga Daz, Kurrupt\n\nI'm in the shack bout to blaze up a sack\nYeah we grown all alone posted up the back\nThere's no mistakin, I can have the whole house shakin\nYoung Daz in that ass baby doll no fakin\nDon't get me wrong, tell me what's the flavor of the song\nYou know it's Daz in your drawers when ya momma ain't home\nRing the alarm, I got ya buzz, lovin' me\nPhsyically and mentally I knew that it was never meant to be\n\nI know you know this girl by tha name of Danielle\nBody of a Goddess face from hell\nBut oh shhh, this wasn't the average trick\n(She got the bomb) and she like gobblin and swallowin\nA whole nine and a half on dat black ass\nGroupie now all the hoocies wanna do me from the past\nTo the present (say what?) let me rep and present\n(Who dat?) The biggest nigga hittin all the hoes in your click\nFast as lightning runnin' through like the breeze\nIn the summertime out on the corners making G's\nIt's the thirst, but I can show somethin' much worse\nThan the thirst, if worse came to worse, but first things first\nBrenda, I can remember\nHow hot y'all be gettin', eighty-seven, eighty-six, and, yeah\nThe year a young man grows\nSome women become ladies, some turn into hoes\nYoung hoes grown, find a way to stay wit me\nIn the cut wit Kurupt, come and play with me, yeah\n\nOutro: Michel'le, Nate Dogg\n\n(Part A)\nIf ya wanna be wit me, stay wit me, play wit me\nCome Kurupt, bring your stuff to me\nMy, sweet, baby\n\n(Part B)\nLet's play house, let's play house, let's play houuuusseeee\nLet's play housssse, let's play houssse\n\nPart A, part B sung as part A repeats\n\nPart B sung over part A with Nate Dogg singing \"let's play house\" 2X\n(Repeat this part 3X to fade)"}