{"song_id":19498,"song_name":"Get Money","artist_id":1496937,"display_artist":"Junior M.A.F.I.A. Featuring The Notorious B.I.G.","spotify_id":"1uUnAtPzMEHpkeodSVMcmL","lyrics":"Fuck bitches, get money... fuck niggaz, get money \n\n Hehehe\n WHAT? Uh, sex 'em up\n The fuck? That shit ain't even ?? big boy\n Oh aight, you don't, you don't get none of that shit\nUh, check it out\n Bout to \"get money\"\n\n(Notorious B.I.G.)\nYou wanna sip Mo' on my living room flo'\nPlay Nintendo with Cease-a-Leo\nPick up my phone say, \"Poppa not home\"\nSex all night, mad head in the morn'\nSpin my V, smoke all my weed\nTattoo on tit-tie sayin' B-I-G, now check it\nYou wanna be my main squeeze baby\nDon'tcha, you wanna gimme what I need baby\nWon'tcha, picture life as my wife just think\nFull length mink, fat X and O links\nBracelets to match, conversation was all that\nShowed you the safe combinations and all that\nGuess you could say youse the one I trusted\nWho would ever think that you would spread like mustard?\nShit got hot, you sent Feds to my spot\nTook me to court, tried to take all I got\n'Nother intricate plot, the bitch said I raped her\n\"Damn, why she wanna stick me for my paper?\"\nMy Mo-sci-no hoe, my Ver-sa-ce hottie\nCome to find out, you was fuckin' everybody\nYou knew about me, the fake ID\nCases in Virginia, body in D.C.\nWoe, oh is me, that's what I get for trickin\nPay my own bail, commence to ass kickin\nLick in the door, wavin the four-four\nAll you heard was, \"Poppa don't hit me no more\"\nDisrespect my click, my shit's imperial\nFuck around and made her milkbox material\nYou feel me? Suckin dick, runnin' your lips\n'Cause of you, I'm on some real fuck a bitch shit, uh...\n\nFuck bitches, get money... fuck niggaz, get money \n\n WHAT? I see mad girls like you\n You seen mad girls just ACTIN' hot\n I'm tellin' you though\n There AIN'T nobody like me\n You just frontin, there's people out like that\n ??\n\n(Lil' Kim)\nUh, whoo! Get at me\nWhoo, I told you niggaz\nNiggaz... betta grab a seat\nGrab on your dick as this bitch gets deep\nDeeper than the pussy of a bitch six feet\nStiff dicks feel sweet in this little petite\nYoung bitch from the street, guaranteed to stay down\nUsed to bring work outta town on Greyhound\nNow I'm Billboard now, niggaz press to hit it\nPlay me like a chicken, thinkin' I'm pressed to get it\nRather do the killin' than the stick up jooks\nRather count a million while you eat my pussy\nPush me to the limit get my feelings in it\nGet me open while I'm cummin down your throat\nThen, you wanna be my main squeeze nigga\nDon'tcha, you wanna lick between my knees nigga\nDon'tcha wanna see me whippin your 3 down the Ave.\nBlow up spots on bitches because I'm mad\nBreak up affairs lick shots in the air\nYou get vexed, and start swingin' everywhere\nMe shifty? Now you wanna pistol whip me\nPull out your nine, while I cock on mine\nYeah what nigga? I ain't got time for this\nSo what nigga? I'm not tryin' to hear that shit\nNow you wanna buy me diamonds and Armani suits\nAdrienne Vitadini and Chanel 9 boots\nThings that make up, for all the games and the lies\nHallmark cards, sayin', \"I apologize\"\nIs you wit me? How could you ever deceive me\nBut payback's a bitch motherfucker, believe me\nNaw I ain't gay this ain't no lesbo flow\nJust a lil somethin', to let you motherfuckers know\n\nFuck bitches, get money... fuck niggaz, get money \n\n Wait a minute, wait a minute\nBack up, just give me that shit, this shit is mine\n Oh you want my numbers and shit\n ??\n Look, now you wanna ??\n I'm all that bitch, don't ask\nYou're fuckin' with a bitch named Aphrodite\n Y'all believe that shit?\n Just playin' with you, worrd\n?? Daddy is all that, oh word\n?? I'm talkin' bout some presidents\nTalkin' bout this motherfuckin cash\n Whatever you don't think about this\nMy nickname was Jesus in high school\n You don't even believe that shit!\nGod don't believe that shit!\n I'm the supreme being baby"}