{"song_id":19520,"song_name":"Doin It","artist_id":276751,"display_artist":"LL Cool J","spotify_id":"1mU0es3QUBRAxKkYvTANpG","lyrics":"Mmmm yeah (mmmmm) check it out baby\nMake it hot... then we drop it\n(Ooh!) Uh, yeah\n(Ooh!) Uptown, you know how we do it\nYeah you know\nMake it hot\n\nLL Cool J: It's our first time together and I'm feeling kinda horny.\nConventional methods of making love kinda bore me.\nI wanna knock your block off, get my rocks off,\nBlow your socks off make sure your G spots soft.\n\nLeShaun: I'm gonna call you big daddy and scream your name.\nMatter fact I can't wait for your candy rain.\n\nJ: So watcha sayin', I get my swerve on, bring it live,\nMake it last forever, damn the kitty cat's tight.\n\nL: Mmm... Daddy slow down your flow.\nPut it on me like a G baby nice and slow.\nI need a rough neck nigga mandingo in a sec,\nWho ain't afraid to pull my hair and spank me from the back.\n\nJ: No doubt, I'm the player that you're talkin' about.\n\nL: Mmm... But do you really think that you can work it out?\n\nJ: I guarantee you shorty it's real, baby stick it out,\nHere comes the man of steel.\n\nL: Doin' it and doin' it and doin' it well,\nDoin' it and doin' it and doin' it well,\nDoin' it and doin' it and doin' it well,\nJ: I represent Queens, she was raised out in Brooklyn.\n\nI'm in the mix now, searching for the right spot,\nTo hit now, get down,\n\nL: Damn my lover dig down\nYou use a rubber?\n\nJ: Damn right.\n\nL: You are my lover?\n\nJ: All night.\n\nL: The putty good to you? Word to motha?\n\nJ: Man tight.\nThe only thing left to do is climax,\nLet's make it last,\n\nL: Word we ain't goin' out like that.\nAll this time you've been telling me that you was a Don.\n\nJ: I tried to warn you girl you wouldn't listen,\nNow let's get it on.\n\nL: Mmm make me wild... don't do that.\nChill wait a minute baby let me please you back.\n\nJ: You talk good one shorty love you're makin' me sweat,\nHow a live nigga like it girl?\n\nL: Nice and wet.\nWe get it on to the break of dawn, damn your large,\nHow a big girl like it daddy?\n\nJ: Nice and hard.\nSafe sexin' it, flexin' it, gettin' mad affectionate,\nChewin' it, doin' it, all while we're doin' it.\n\nJ: Baby, I wanna hit it in the worst way.\n\nL: Make it hot.\n\nJ: Scheming on the ass since the first day.\n\nL: Don't stop.\nDamn I love it when you talk like that.\nMake it bounce sugar,\n\nJ: Long as you can bounce me back.\nMore flesh than the greek fest,\n\nL: Roll up the sess.\n\nJ: Pass the Hennessee,\n\nL: Put my body to the test.\nWay way back many niggas ago,\nI was a young girl listening to how you flow.\nNow's my chance to hit you off daddy I'm grown.\nFrom the back, from the side,\n\nJ: Right, I'm in the zone.\nOne of a kind when it's time to do mine.\nCamcorder and the whole shit,\n\nL: Press rewind.\nLet it flow on the screen while we puffs the L.\nLayin' back in the cut while we're under the spell.\n\nJ: Word life, I like the way the ep went down.\nGo to sleep, tomorrow I'll take you back downtown.\nWe'll be,"}