{"song_id":19543,"song_name":"Funkorama","artist_id":364794,"display_artist":"Redman","spotify_id":"3H3dlRPB8IIVpt3zjLUb03","lyrics":"We, hah!\nThis is Funk Doctor Spock!\nAs we look, at our clocks\nWe gonna take you, on a ship to another journey\nTo the Darkside\nHah, we've conquered, new evidence, that there is life\n\nMy funk prognosis make my brains come comatose\nOne hundred percent funk runs blood straight through your nose\nI don't have to be Madonna, to make your eyes freeze\nVisine's for eyes when you smoke the thai weed\nFor this, you need a journalist scientist\nKeep your eye in this, funk cosmical, far from logical\nI blow the spot up in any hood or boondox\nMake the bully of the block move and get new locks\nNow who kicks that phenomical astronomical? Uh\nThat's my nine in you, feelin' nauseous that's my rhyme in you\nI swing funk like numchuks my game's death\nThat's cool when I blind fools like Kareem Abdul\nHot like lava's fire, sometimes I get more higher than Cheech\nMy funk speech make words wear sun visors\nI'm gettin' down with the funk in your trunk\nDef Squad's in the house, with the ... for all you punks\n\n\"Coming down the block man loud as fuck\nYou would swear Redman was inside the trunk\" - A Tribe Called Quest \"Midnight\"\n(Repeat 4X)\n\nAh, I'm just as high as three peeled up motherfuckers\nDef Squad's in the house, with the ... for you suckers\nPunks, y'all chumps, I blew the frame once twice\nI'm dumb nice, I bring my worst lyrics to a gunfight\nThe top notch, nah fuck that, that notch's topped\nI'm off the meter, I make computer's catch amenesia\nI'm swifter than roller blades on Icecapades\nI'm Fearless like Four plus I'm +Kool+ like +Aid+\nMy grammar, slam from here to York, Alabama\nI never pull my pants up, I'm nutty like Planters\nMy style gets Death like Row or Def like Jeff\nDef like Jam or Squad, or death like Meth\nOne two! Big up to my niggaz on one deuce\nThat cocks snaps and busts back at the boys in...\nRrrrrah! With weed for you!\nWho says I can't burn shit up just like Lisa Lopez?\nI'm cause the ruckus, my area is fucked up\nYou better off calling them Power Ranger motherfuckers\nCause Redman will bomb just like Sadaam\nWhen I'm loose I'm worldwide like triple fat goose\nHeavily armed\n\n\"Coming down the block man, loud as fuck\nYou would swear Redman was inside the trunk\" -- Q-Tip\n(Repeat 4X)"}