{"song_id":19687,"song_name":"Can You Feel Me","artist_id":301336,"display_artist":"Dru Down","spotify_id":"4DhYwWjQulbUNmeGTFngso","lyrics":"Yeah, it's Dru Down baby\nComin' straight from that izno a.k. no play\nMatter of fact listen to my baby.\n\nCan you feel me?\nI said I'm doin' what I gotta do stayin' true to tha crew\nCheck it\nCan you feel me?\nI said I'm deep down and dirty I grew up hella early\nCan you feel me?\nI said I fantasize about the dreams havin' big fancy things\nCan you feel me?\nI can still remember when I stole my first diamond ring\n\nOK, I'm deep down and dirty, you heard me before\nBut I'ma kick this shit like I be kickin' in some front doors\nNow popo or five O straight on that real, always been real, fifteen blocks down the\nstreet from that feel. But still see niggas have got it wrong, that\nPopo is five O. and that is my hoe. Come and see me some time, bust a\n(rim?) and bust a rhyme, after that I fucked that (rimmy?), bust a\nRhyme and get a dime. And lets smoke, choke, until the break of dusk\nFuck that bitch dawn, and put that penny in my palm. Understand this\nI roles deep in tha five, I've been down with tha five, I gets dirty\nin tha five. And do a hoo ride. Why? That is tha question, devils be\nguessin', don't question, stressin'. Livin' in tha ghetto, hello, you\nBetta hear me, and if ya don't you betta really try to feel me\n\nCan you feel me?\nI said I'm doin' what I gotta do, stayin' true to tha crew, so true\nCan you feel me?\nI said I'm deep down and dirty, I grew up hella early\nCan you feel me?\nI said I fantasize about tha dreams, havin' big fancy things\nCan you feel me?\nI can still remember when I stole my first diamond ring\n\nMama always told me it'd be days like this. So I took myself to\nTraders and bought myself up a pimp and and some clips\nShit was gettin' hectic, check this niggas try to wrecka, bets and etc\nAnd I bet ya ya life has never been a taken like, I'm deep down and\ndirty early. But see pearly, at the age of three, took my ass in\nCause my momma was deceased. I still ended up a with tha gangsta\nComin' from tha street, having mentality, causin' casualties, don't\nBe mad at me. I'm D.D., pimp playa O.G., born up in tha city of the\nO.A.K.L.A.N.D., ghetto brown hustla, no sucka, serious about my\nBussiness. What is this? Now dig this, I overnight became rich. I'm\nMe, not tha ordinary nigga from tha street, grew up, threw up, to what\nI wanted to be, and what I sing\n\nCan you feel me?\nI said I'm doin' what I gotta do, stayin' true to tha crew\nCan you feel me?\nI said I'm deep down and dirty, I grew up hella early\nCan you feel me?\nI said I fantasize about tha dreams havin' big fancy things\nCan you feel me?\nI can still remember when I stole my first diamond ring\n\nIt didn't matter my money was gettin' low, I'm on tha struggle\nWhatever a nigga go for he gots be on tha double. But solo, cause\nNiggas be bitches and snitches at tha same time, but I'm a go and get\nMy nine. And find these niggas who be talkin' a hell of a lot a to\nThese bitches, these bitches who be talkin' a hell of a lot a to these\nNiggas who be riggers, but I'm a go and hit and do a dig em smack, a to\nYour ass back to the future. Smoke super, I'm rollin' in tha six eight\nCougar, while Reugers I masta mind like Lex Luger. It ain't no thing\nLike a chicken wing, with the (mob/wild?) of a master\nOur mission is never impossible. Not for me, see, so fuck that O. series, you stuck\nOn that screen I laugh, I'm over mescaline\nI see you dream as a triple beam, with hella dope from a muthafucka\nWith no cut bro\n\nCan you feel me?\nI said I'm doin' what I gotta do, stayin' true to tha crew\nCan you feel me?\nI said I'm deep down and dirty, I grew up hella early\nCan you feel me?\nI said I fantasize about tha dreams, havin' big fancy things\nCan you feel me?\nI can still remember when I stole my first diamond ring\n\nYeah, can you feel me?\nD.d, grew up, threw up, to what I wanted to be and what I sing.\nCan you feel me?\nCan ya, can ya\nThat's what I want for you to feel me"}