{"song_id":19801,"song_name":"Get Up","artist_id":418543,"display_artist":"Lost Boyz","spotify_id":"3cVdgpyCPWOmJOFc3Zsp6b","lyrics":"(Mr. Cheeks)\nI see a whole team of chicks tryin' to sit wit us\nDrinkin' Dom, smokin' charm, wanna get wit us\nGot my, V.I.P. section game locked down\nGoin' bad for J-Bad he just came in town\nWe lovin' Tai on the floor, smokin' lai wit tips\nLadies in the amazin, 'cause we in the mix\nAll the peeps from my hood,\nWearin timbs and jeans\nLost Boyz represent from South Jamaica Queens\nI'm wit my mens spendin ends\nOrderin liquors and beers\nAin't nuttin new to this\nWe've been doin' this for years\nI got my drink on kid, and my cash is right\nShorty aight think I'm not gettin' ass tonight?\nAnd wit Malik and Melquan, my man Hassan\nYo shorty what you wearin is turnin' me on\nTakin' me, makin' me wanna bounce wit you\nIt's all right, we got all night to smoke an ounce or two\n\nGet Up and clap yo hands\nCome on and clap yo hands\n\n(Mr. Cheeks)\nA few hours in the jam and a fighter\nJeans saggin, timberland tied up\nSee my old crew from the mystery\nBig Phil from Queensville still gettin' cheese\nAll my peeps from the van gettin' nice my man\nL.B. style run the while represent my fam\nMakin' moves makin' ho's puffin buddha sacks\nReresentin Lost Boyz stayibn true to dat\nI must bring it to the funk\n'Cause the funk is it\nSeein shortie on the floor\nTryin' to show the skirt\nI wanna, run up on her and...\nPush up on her and...\nKick some Willie Bobo and let her know that I want her and\nHit the door, let the Ac hit the streets (streets)\nGet our beats (beats), gets in between the sheets\nHit the door, for the fam\nBack in my Ac, I'm outta town\n\nIts mad cars up in front the piece\nShorties bouncin' (bounce bounce)\nNiggas on the corner, 40 ouncin\nPuffin lai, kickin it to shorties passin by\nSee some be actin' ill\nAnd some be actin' fly\nBut inside it's the L.B. slide\nMusic pumpin smokin' skunk\nGettin' funkdafied\nWhile Ro, Pretty Lou, J-Bowl 'n' Bo\nWe just a fiend in effect\nNigga pop the Mo\nBacked up by Jeff Star\nLadies takin' flicks\nSpigg Nice got the flyin wit Jamaican chicks\nIt ain't no real ill shit, when L.B.'s in town\n(Get up, Get Up, Get Up)\nYou know how we get down"}