{"song_id":19891,"song_name":"Ghetto Love","artist_id":300055,"display_artist":"Da Brat Featuring T-Boz","spotify_id":"5iJkSPVhITJvlYW3U3BxtS","lyrics":"I had some problems\nAnd no one could seem to solve them\nBut you had the answer\nYou told me to take a chance\nAnd learn the ways of love, my baby\nAnd all that it has to offer...\nYou told me your secret love won't let you down\nOh allll my love baby...\n\nDa Brat:\n\nHey nigga ain't shit gonna ever change\nBetween you and your boo.\nPut a hold on me ever since I held you\nWhat compelled you to be my nigga\nBesides passion and lust\nYou ran up on a real bitch with understanding and trust\nFuck the others, none of them compare to us\nAnd under covers you my muthafucka nigga,\nWhen you stickin my stuff\nYou laid pipe unlike any other plumber\nTook me shoppin' all day and at night, you kept me cummin.\nMade dinner, collard greens, candied yams and steak.\nTaught me how to measure grams, cook rocks, and chop weight\nCaught a case, 'cause you're boy ran his mouth too much.\nAnd it's a disgrace how the pain felt to miss your touch\nBut as the days keep passin, keep it laughin' with stacks of letters\nHit you so you don't forget us\nWhen you'd rather not be livin' in the cella\nHella muthafuckas want your occupation\nBut they can keep pacin', 'cause I'm gonna be waitin on my Baby...\n\nT-Boz:\nAnd all this love, is waiting for you\nMy baby... Sweet Darling...\nAnd all this love is waiting for you\n\nDa Brat:\nDon't worry 'bout a thing, nigga stay down\nAs long as you can hang, I'm-a be around\n\nDa Brat:\nRan into your boy, had heard he'd spread the word\nThat you was soft, braggin he collecting your cheese,\nAnd pissing me the fuck off.\nThe first thought of committing a felony never left\nI missed the big breaths you took when we waz puffin an L,\nJust the little things you do with the bigger ones I\nSaw better SL 500s colorful Gucci sweaters and leathers\nDiamond letters girl you broke, I saved the sugar for you\nKeep the business runnin', droppin' off keys in Cancun\nCash rules, and you remain to be the King of my throne\nPosition taken, flippin calendar pages till you get home\nWanna blast your boy for snatchin up my happiness\nBut I regret what'll happen to this dollar foundation\nIf I'm incarcerated\nToo you can make it through, we bail on the Jealous\nWho tell us the opposite of that,\nForever you and Brat\nI tried to take the blame, but you preferred to handle my fame\nSo I'm waitin with open arms to rekindle the flame..."}