{"song_id":19902,"song_name":"Sho Nuff","artist_id":373301,"display_artist":"Tela Featuring Eightball & MJG","spotify_id":"7JY6NI9AKY0D1Xp5FoRRb8","lyrics":"(Tela)\nIt was this bitch that I knew back from '86\nGraduated and made it from the college of dicks\nNow who the fuck you be, bitch you know me\nTryin' to act solo, down low, hush-hush, and lo-key\nNah hoe I ain't po', where did my motherfuckas go\nI remember this hoe, she used to do nails for Rochelle's, well\nHow the hell you been since I had no job\nHum, why don't you give me some\nCause you know I flow and run for Suave\nNah, all of that was on the couch\nNo doubt y'all records spin, y'all shippin in gold\nIt's cold On The Outside Lookin' In (Brrrr)\nYou'd besta make yourself worthy\n'Cause I got a click of niggaz ready to get their johnson very dirty\nYou heard me push these thirty dicks, inside your pearly clit\nAin't this a bitch\nI remember when you would not give me shit\nNow you down for them habits\nPut your numbers on them naturals\nMake it snappy 'cause I got to go to the bathroom\n\nHoes with no clothes sho nuff\nShakin that ass in the club nigga what?\nHoes with no clothes sho nuff\nShakin that ass in the club nigga what?\nHoes with no clothe sho nuff\nShakin that ass in the club nigga what?\nHoes with no clothes sho nuff\nShakin that ass in the club nigga what?, Suave love\n\n(Eightball)\nNo different from the rest\nShe's just an ordinary hoe\nHair extensions, long nails, ass thicker than gumbo\nMake it fast, takin' cash, shakin ass in the mix\nTens turn to twenties and twenties come from plenty tricks\nNiggaz in love\nCan't stay out the club\nAll in the hoe's face\nBut at the end of the paper chase, whatever you had will be erased\nI see him in the back\nCountin' up that chedder\nTalkin' loud, smokin' hay, makin' clouds, gettin' ready for the crowd\nI think I know one\nI remember you, oh yes I do\nTryin' to hide side from me and my crew, but ain't no love lost boo\nWhat time the club close, at 3\nWhat's up, you comin' with me\nWe can smoke up mad trees after you get up off your knees\nYou want some cheese\nHoes don't stay at the suave house\nHoes around my nuts like knats\nReal dogs don't pay for cats, dats\nFor real baby\nRecognize and sho me love, dig that shit, sho nuff\n\nHoes with no clothes sho nuff\nShakin that ass in the club nigga what?\nHoes with no clothes sho nuff\nShakin that ass in the club nigga what?\nHoes with no clothe sho nuff\nShakin that ass in the club nigga what?\nHoes with no clothes sho nuff\nShakin that ass in the club nigga what?, Suave love\n\n(MJG)\nWell I be God damned, this shy ass hoe\nWants to get close to me\nA few years back in the past, you wouldn't of even noticed me\nQuoting the, lyrics of the songs that you know I flow\nLookin' for, confidants, and tickets to my next show\nCheck yo' bitch\nIn these short ass pants and blow up dresses\nI can tell they freaky without three guesses\nOh yes it's very true\nYour bitches be needin me, leavin' you\nHell, now what the fuck is a nigga like me supposed to do\nLet her loose or let her remain\nCause all she be lookin' for is some fame\nA bigger name\nLook, this thang with bigger game\nAnd she claim she ain't heard my music\nTryin' to trick me\nSo I told that hoe my name Bill Bigsley\nShe still hit me\nNow she, killin' my dick softly with her mouth and I\nReally just don't plan on takin' it out 'cause I\nMJ fuckin' G you needs to knows 'bout these hoes shakin\nThey ass with no clothes like some pros, sho nuff\n\nHoes with no clothes sho nuff\nShakin that ass in the club nigga what?\nHoes with no clothes sho nuff\nShakin that ass in the club nigga what?\nHoes with no clothe sho nuff\nShakin that ass in the club nigga what?\nHoes with no clothes sho nuff\nShakin that ass in the club nigga what?, Suave love"}