{"song_id":19952,"song_name":"Who You Wit (From \"Sprung\")","artist_id":304305,"display_artist":"Jay-Z","spotify_id":"3DG2hUPMLKcFptV1Gv32oI","lyrics":"Uh-huh, yeah hah\nNever sprung huh?\nJigga, Roc-a-Fella y'all\nNever sprung huh?\nYeah, peep the repertoire\nPeoples, feel me on this one\nPeoples, feel this\nNever sprung huh? Know my style\n\nI love bitches, thug bitches, shy bitches\nRough bitches, don't matter you my bitches\nGold diggers witcha eyes on my riches\nCan't Knock your Hustle for real, exotic bitches\nI'm game tight, see it all through the platinum French\nBraids with the French name in the same night\nPull you and your tight friend\nLift your little dress like light wind, hah, then I slide right in\nYou know the whole repertoire, U.S. to the U-S-S-R\nSexier than a Lexus car\nMatch wits with the best of y'all the rest of y'all\nIs like veg-etables in my presence, check it\nReminescin to nuttin you ever heard, Iceberg\nSlim baby ride rims through the suburbs\nFunds come in lump sums never ends deferred\nGet money like I'm down South Wednesday the 3rd, it's on\n\nDough to get, more shows to rip\nI suggest you all roll with the click, who you wit\nFrozen wrists and it's flows that's sick\nMore O's than you know exist, bitch who you wit\n\nCan't scheme on em, Roc-a-Fella got a team on em\nChicks dream on him trick cream on him\nLose it when dudes think it's just music\nLean on 'em flash green on 'em and diamond rings on em\nSex around the way girls down to meet eyes\nI'm somethin' every girl gotta have like Levi's\nYa quita, me got more, see I ball\nYou can love me or hate me, either or\nI'ma stay widdit, rock the custom drop Bentleys\nNever eat at Denny's and party like Lil Penny\nCan he live? Trick or main chick but if she leave\nJust as quick, Indian give, ha-hah\nNow what I look like? Givin' a chick half my trap\nLike she wrote half my raps, yeah, I'm havin' that\nYou be the same chick when you leave me\nThe bankbook and the credit cards and take everything you came wit\n\nDough to get, more shows to rip\nI suggest you all roll with the click, who you wit\nFrozen wrists and it's flows that's sick\nMore O's than you know exist, bitch who you wit\n\nYou know the move's major, never minor\n'Cause when you a true player, they never find ya\nWe takin' trips abroad with chicks from afar\nDown in the grill in the Villa gettin' hilla\nNever know 'em at the resort, readin to ride with us all\nCheckin' out this new wine, inhalin the cork\nMillion miles from the puddles the rainy days the tussles\nReign in ways to hustle, so we won't get caught\nHad beef of all sort but I turned it around\nChose my steps more wisely, I'm learnin the ground\nI was so gung-ho when I earned my first pound\nNow it's million dollar deals, straight turnin' 'em down\nRoc-a-Fella make or break me, till death do us\nWon't be in your right mind, you ever step to us\nBeen there, when I was in my tenth year, went there\nThen I realized that it didn't make sense there\nBacktrack, show me where the cash at, and plus\nFrivilous beef, please, we lookin' past that\nY'all can gossip while we learnin the world\nDrop the hot shit never returnin your girl, it's on\n\nDough to get, more shows to rip\nI suggest you all roll with the click, who you wit\nFrozen wrists and it's flows that's sick\nMore O's than you know exist, bitch who you wit\n\nDough to get, more shows to rip\nI suggest you all roll with the click, who you wit\nFrozen wrists and it's flows that's sick\nMore O's than you know exist, bitch who you wit\n\nDough to get, more shows to rip\nI suggest you all roll with the click, who you wit\nFrozen wrists and it's flows that's sick\nMore O's than you know exist, bitch who you wit\n\nDough to get, more shows to rip\nI suggest you all roll with the click, who you wit\nFrozen wrists and it's flows that's sick\nMore O's than you know exist, bitch who you wit\n\nBeyatch!\nJigga, nine-seven shit, next millennia\nRecognize, realize, it's on\nRoc the block, ah\nLaughin', it's on"}