{"song_id":19964,"song_name":"Smile","artist_id":278349,"display_artist":"Scarface Featuring 2Pac & Johnny P","spotify_id":"2wxO3ZydJTZRi4Bbc02q7i","lyrics":"2Pac (Spoken):\nThere's gon' be some stuff you gon' see, that's gon' make it hard to smile in the future.\nBut through whatever you see, through all the rain and the pain, you gotta keep your sense of humor.\nYou gotta be able to smile through all this bullshit.\nRemember that.\nMmm, yeah.\nSo keep ya head up.\nYeah.\n\n\n\nOur lifestyles be closed-captioned\nAddicted to fatal attractions\nPictures of actions be played back\nIn the midst of mashin'\n\nNo fairy tales, for this young black male\nSome see me stranded in this land of hell, jail and crack sales\nHustlin' and heart be a nigga culture\nOr the repercussions while bustin' on backstabbin' vultures\n\nSellin' my soul for material wishes, fast cars and bitches\nWishin' I live my life a legend, immortalized in pictures\nWhy shed tears, save your sympathy\nMy childhood years were spent buryin' my peers in the cemetery\n\nHere's a message to the newborns, waitin' to breathe\nIf you believe then you can achieve, just look at me\nAgainst all odds, though life is hard we carry on\nLivin' in the projects, broke with no lights on\n\nTo all the seeds that follow me\nProtect your essence\nBorn with less, but you still precious\nJust smile for me now\n\nJohnny P & 2Pac :\nSmile for me, won't you smile (Smile for me now)\nJust smile (Smile), smile for me (What ya lookin' all sad for? Nigga you black, smile for me now)\nSmile for me (Nigga you ain't got nothin' to be worried about)\nWon't you smile (No doubt, smile for me now) just smile for me (And the next generation)\n\nScarface:\nNow as I open up my story, with the blaze o' your blunts\nAnd you can picture thoughts slowly, upon phrases I wrote\nAnd I can walk you through the days that I done\nI often wish that I could save everyone, but I'm a dreamer\n\nHave you ever seen a nigga who was strong in the game\nOverlookin' his tomorrows and they finally came\nLook back on childhood memories and I'm still feelin' the pain\nTurnin' circles in my life came to dealin' cocaine\n\nTo many hassles in my local life, survivin' the strain\nAnd a man without a focus, life could drive him insane\nStuck inside a ghetto fantasy, hopin' it'd change\nBut when I focus on reality, we broke and in chains\n\nHad a dream of livin' wealthy and makin' it big\nOver foot broad chose to cook raw, wouldn't take but I did\nAnd after all my momma's thankin' God for blessin' the child\nAll my momma gots to do now, is collect it and smile\n\nSmile for me, won't you smile\nJust smile, smile for me\nSmile, for me\nWon't you smile, for me\n\n2Pac:\nFuck the world as we elope and witness furious speeds\nUnanswered questions keep us all stressin', curious G's\nBackstabbed and bleedin', crooked thoughts laced with weed\nLearnin', duckin' stray shots, bullets be hot, they burnin'\n\nInhalin' sherm smoke, visualized the flames\nWill I be smothered by my own pain\nStrange whispers, cowards conversate, so quick to diss us\nTakin' pictures for the feds in desperate hopes they'd get us\n\nHit us off, give us plenty centuries, forgive my sins\nSince I ain't in many penitenturies the best revenge\nIs fuck friends, we military minded soldiers\nBustin' shots blindly, tryin' to find Jehovah\n\nTo help me, somebody save me, lost and crazy\nScared to drop a seed hopin' I ain't cursed my babies\nMaybe now niggas feel me now, picture my pain\nEmbrace my words make the world change, and still I smile nigga\n\nScarface (Spoken):\nAnd now a moment of silence, let us pray.\nAnd as you journey into outer-space, may the angels help to lead the way.\nMay the prayers that the families made, shine up on your soul to keep you safe.\nAnd all the homies that done passed away, be there to greet you as you pass the gates.\nAnd as you headed to the tunnel's light, I hope it leads to eternal life.\nCan we say a prayer for our homie 'Pac?\n\nSmile\n\n(Smile for me)\n(All ya need to do is smile)\n(Woo smile for me)\n(Come on smile for me)"}