{"song_id":19981,"song_name":"Hip Hop Drunkies","artist_id":377255,"display_artist":"Tha Alkaholiks Featuring Ol  Dirty Bastard","spotify_id":"null","lyrics":"(Feat. Ol' Dirty Bastard)\n\n(Tash) What's yo' name?\nWhat's yo' naaaaaame?\n(ODB) *burp* My name is, Ol Dirty Bastard... and I'ma Alkaholik\n(Tash) Yeah me too nigga\n(ODB) *singin' some crazy shit*\n\n(Tash)\nYou're now rockin' with Tha Liks so start reachin' for the ozone\nI see some girls I know but y'all look different with your clothes on\nWhat's up though, Tash came to steal it like the Grinch\nWhile I'm leavin' niggaz puzzled like I said my shit in French\nBut it's all Olde English that I'm bringin' from beneath\nTry to bite my style on wax and watch these lyrics crack your teeth\n'Cause I make words Connect like Westside when I test glide\nMy drunken lyrical hanglider, nobody's tighter\nThan a ruff rap provider, with ninety ways to peel ya\nSo I know the three words (Tash'll kill ya) sound familiar\nI filter out the weak every time I speak\nI drink to hit the peak to make my mind go (beep)\nI'm def-da-fyin, you rappin' like my client\nTryin' to scrape me for the style that slam harder than Kobe Bryant\nBE QUIET! This is Likwidation from the West\nMotherfuck ya boozy show, I got my own special guest\n\n(Ol Dirty Bastard)\nYo, yo, breaker breaker breaker one-nine\nI bust this bitch in the behind with the silver shine\n'Cause she thought she was fine\nShe winked at me, I thought it was fine\nThis nigga poutin, this hoe was mine\nI had the alcohol in me, took my time\nLet a nigga ro-tate turn on the table\nPut in the diamond needle, pull it to your ego\nWhat? You the king in the chair on my ground\nThe Tyson of sound, it's twenty seconds to a round\nScavenger nigga, youse a shrimp, a full line of shit\nMy ear can't digest it\nStop drinkin' all that motherfuckin water, let's take it to the land\nSo I can Godzilla up your sheeit, Mr. Tiny Tim man\nNiggaz be creepin' up my beanstalk\nWhen I start to come down on your fuckin' asses\nTry to chip shit on up, get these nuts\nMotherfucker WHAT!\n\n(J-Ro)\nThe Ro pimped the flow like a hoe, so I should rap on the mack-raphone\nMy rhymes hittin hard enough to crack a bone\nI divide square MC's like math\nBend you in half and drink a Genuine Draft\nI stop him, then I skied out with all wampum\nWhen he's layin on the ground, I let my Dog Scrilla chop him\n(Switch reels) I feels it's all about skills\nThe outcome's unbelievable like Tyson/Holyfield\nYour lyrics are loaners return 'em to they rightful owners\nMy style is wild, like G's or the pistolas\nNo need to ask, I put you on like a ski mask\nWe can Fight the Power like this was P.E. class\nI Bomb Squads like Hank Shock\nPeace to my nigga Scott puttin' stickers on the block\n*Burp* I drink more Brewsters than Punky\nIt's the further adventures of the hip-hop drunkies\n\nYou bithces are hoes\nPut it in ya like my motherfuckin hoe\nOr in your butthole/earhole\nWhever the fuck it goes\n(Repeat 2X)\n\n(Ol Dirty)\nYeah, yo, yo, yo\nNo disrespect to any architect\nWho tried to perfect, oh what the heck\nI'm a MC director, rhyme inspector\nRated top ten, Brooklyn borough sector\n\n(J-Ro)\nIt's the Packtown original b-boy I'm rappin'\nWhat's happenin', so dope got the pope clappin\nI'm smackin, on some chicken, what you kickin\nYou trickin, while I'm vickin hoes you stick your dick in\n\n(Tash)\nStep outta place, Tash'll smack your taste out your face\nCause there's nowhere to hide unless you move to outer space\n'Cause I waste motherfuckers like toxic fumes\nSo you betta (make room) when you hear the (boom boom)\n\n(Ol Dirty (rapping like RZA))\nHey sugar plum, how can you assume\nThat the pitch of the volume, doesn't have no tune\nI'm not your everyday, regular rap star peddler\nOne on one at your rap seminar\nBeware of the Hard Way, Three's the Hard Way\nAt you fuckers...\n\n(J-Ro)\nSo aiyyo, my name is J-Ro\nAnd my style is so dope they call it ya-yo\nI don't rap fast, I love green grass\nNuttin nice on the mic, call me a mean ass\n\n(Ol Dirty (still rapping like RZA))\nExtra da-llama, bring hahaha\nExtra extra bring the da-llama\nVerse a better one, then slice-a-versa\nGod acre, massacre murdered\nAlso known as a rap wrecka, not a rhyme rebel\nYou're just rhyme to survive streets\nTrue beaters, minerals and rhymes survive lyrics\nLike the acre without the attic, but not the only Asiatic\nTrue God but my dick is my lightning rob\nHoe don't kick that mumbo jumbo...\n\n(Tash)\nSee this the type of shit niggaz don't try at home\nI come funkin up the spot like Micheal Jordan's cologne\nWith the megadrunken, style to keep the crowd pumpin\nNiggaz lookin' at me like, 'Tash is up to somethin'\n(Get drunk and I stumbled) but I didn't come to trip\nI came to bring it to ya humb-le\nTumb-le all your plots and all your plans\nOl Dirty's in the house and that's my motherfuckin man!\n\nIt's the Likwid crew\nComin' through with Ol Dirty from the Wu\nPassin your party, jettin out with allt he brew\nSo what y'all new, niggaz think you wanna do?\n(Repeat 2X)"}