{"song_id":20037,"song_name":"Far From Yours","artist_id":277032,"display_artist":"O.C. Featuring Yvette Michele","spotify_id":"null","lyrics":"Uh, yeah, phenomenon, yeah\n(Yvette) Ooh, yeah, baby far from yours, oh yeah\nVerse One: O.C.\nYo, time is most limited I'm back on the scene\nO replenishes, potency like four or five Guinnesses\nHennessey's flourishing, O.C.is nourishing\nPerformin miracles, ill and mad lyrical\nWhat stands before your very eyes is a\nOne man stand-alone phenomenon\nMicrophone misery you sufferin, taste my repetoire\nIn your face like a buck fifty, done with the razor\nI'm felt by Aztecs, felt by Asians\nPortuguese Lebanese and even Caucasians\nEvery form of power, they respect my stats\nSlap me five, with former leader drink Cognac with diplomat\nRetard your whole brigade, cave in your brain waves\n(With subliminal messages) makin' party people slaves\nYa hit reverse to rewind, and defy my cause\n\"One thing I do is keep 'em different, and far from yours\"\nChorus One: Yvette Michelle\nHe's no average M.C., with a smile on his face\nThough they'll try to bite his style, no one can duplicate\nVerse Two: O.C.\nI be the chosen one, beyond the Moet and Cristal\nA son of King and a Queen, therefore ability\nFor song run in my genetics\nI gave ideas to L. Ron Hubbard to write books on Dianetics\nFedEx your info, if you wanna show the manager\nMr. Dave make sure give us a good payday too\nI was assigned to Earth, on a mission\nTo spread worldwide my glorious compositions\nNotes are like B sharps floatin\nOut of my mouth from start to finish till the song diminish\nMy lyrical energy bring out envy in most MC's\nWho listen to O, he didn't know me before\nThen you know who I are now, bitin my style\nThat's a crime to be dealth with but we take it to trial\nVerdict is in, the judge know my beef has cause\n\"One thing I do is keep 'em different, and far from yours\"\nChorus Two: Yvette Michelle\nHe's no average MC, with a smile on his face\nAnd though you try to bite his style, no one can duplicate\nHe can flow anywhere ya want, he can rhyme any time you say\nAnd he's never ever ever too far, from tomorrow, today\nVerse Three: O.C.\nYou may never find a MC well orchestrated like a symphony\nSome'll go down in history, some in infamy\nThe infamy will be somewhat a mystery\nAs long as my name O.C. live on through infinity\nMy identity, will ring bells in all facilities\nFrom fans to enemies I'm the antidote and remedy\nI'ma philosophize, analyze, no question\nIf I die I'ma return like Jesus' resurrection\nI'm a blessin to the rap game, my claim to fame is when\nI disappear reappear, I put rappers to shame\nPlain and simple, in common English, what I distinguish\nThe meanest lyric flamethrower your career's over\nFinesse a mic Casanova, Don Juan or MC\nThe people need a change, this rap shit is deranged\nYo Raider, flip the fader, let 'em know my cause\n\"One thing I do is keep 'em different, and far from yours\"\nChorus Two (Roc Raider cuts and scratches the \"one thing\" sample)\nChorus Two repeats\n(Yvette) Never too far, never..."}