{"song_id":20078,"song_name":"Avenues","artist_id":364810,"display_artist":"Refugee Camp All Stars Featuring Pras (With Ky-mani)","spotify_id":"null","lyrics":"(Ky-Mani)\nOh no! Oh no!\nSay, we gonna rock down through, Electric Avenue\nAnd then we'll take it higher\nSay, we gonna rock down through, the Brooklyn Avenues\nAnd then we'll take it higher!\nOh no! Oh no!\n\n(Prazwell)\nYo, yo\nSlick like Rick Rick James when I hit (hit)\nSuperfreak chicks, who I don't miss (yo I don't miss)\nFix for your nose, my flows make you sick (uh-huh)\nTwo chicks for me, none for you like Twix\nPlay with niggaz head like 'Clef guitar picks\nWent from, bottom pits to, making hits, and\nHollow-tips then, shooting lips (right)\nHandle our business make sure it sits\nRide through the tunnels (crusin by) fuck the guestlists\nLight up your block with roman candlesticks\nKnown to blow shows with pyrotechnics (right)\nRappin' bout your whips while you catchin transits\nBuyin shorty gifts, with checks from WIC\nYour record sound like a demo that was yet not mixed\n(Shit ain't mixed yet)\nYour whole style broke and it should be fixed (uh-huh)\nTime runnin' out as my Rolex ticks\nDon't get caught on the Ave, it's too Electric...\n\n(Ky-Mani)\nSay, we gonna rock down through, Electric Avenue\nAnd then we take it higher (c'mon c'mon c'mon c'mon)\nSay, we gonna rock down through, the Brooklyn Avenues (Flatbush too)\nAnd then we'll take it higher!\nOh no! Oh no!\n\n(Prazwell)\nI dedicate this to my peeps who're on the streets\nGod bless they soul, may they rest in peace\nThere's those who finance and those who choose to lease\nWhatever suits you weather on the turn of your leafs\nDifferent strokes for different folks God\nI refuse to going back and being broke Lord\nHe got struck with lightning, he got hit hard\nFace this twenty life to maximum, his whole life is scarred\nThe Preacher's Son and I came off the Santa Maria\nTen cases of Malta, caught the diarrhea\nLoad the ReFugees on the aircraft carrier\nSome say Dirty Cash (Dirty Cash) we never heard of ya\nYou don't know me? (Yeah yeah)\n\n(Ky-Mani)\nSay, we gonna rock down through Electric Avenue (c'mon)\nAnd then we'll take it higher (c'mon c'mon c'mon c'mon)\nSay, we gonna rock down through the Brooklyn Avenues (Flatbush too)\nAnd then we'll take it higher! (c'mon man)\nOh no! Oh no! (yeah, all right)\n\n(Prazwell)\nWatch your back watch your side, swimmin with shark\nString you like a harp while they playin' Mozart\nNo credential, get nowhere like Oslo\nStand back to Frisco, at the Rico Beagle\nSuave like Rico, on fire like pyro\nFrantic like a skitzo, rougher than Brillo\nHe caught the rap like Donnie Brascoe\n\n(Ky-Mani)\nOut in the street there is violence (yeah, uh)\nDown in Brooklyn there is violence (Flatbush too)\nDown dere in Queens there is violence (QBC)\nAnd there's a lot of work to be done, Lord\nDown in the ghetto there violence (out in the streets)\nOut in L.A. there is violence (Compton)\nIn Miami there is violence (Miami Vice, yeah)\nAnd there's a lot of work to be done, Lord (yo, c'mon, yo)\n\nWe gonna rock down through, ReFugee Avenue (rock to, uh-huh)\nAnd then we take it higher! (c'mon)\nSay, we gonna rock down through, Haiti Avenue (Port-Au-Prince)\nAnd then we take it higher!\n\n(Prazwell)\nHaha, yeah, yo, yo, c'mon\nReFugee All-Stars, yeah yeah"}