{"song_id":20142,"song_name":"No, No, No","artist_id":300824,"display_artist":"Destiny's Child","spotify_id":"5kHgrRO3hMDPehtH9VhYQc","lyrics":"You be sayin', \"No, no, no, no, no,\" when it's really, \"Yes, yes, yes, yes, yes...\"\nYou be sayin', \"No, no, no, no, no,\" when it's really, \"Yes, yes, yes, yes, yes...\"\nYou be sayin', \"No, no, no, no, no,\" when it's really, \"Yes, yes, yes, yes, yes...\"\nYou be sayin', \"No, no, no, no, no,\" when it's really, \"Yes, yes, yes, yes, yes...\"\n\nBoy, I know you want me, I can see it in your eyes,\nBut you keep on frontin' - Won't you say what's on your mind?\n'Cause each and every time you're near me, you give me signs,\nBut when I ask you what's the deal, you hold it all inside...\n\nIf you wanna be with me, you gotta keep it real;\nTell me what's goin' on, tell me how you feel...\n'Cause boy, I know you want me just as much as I want you,\nSo come and get my love - it's all here for you...\n\nYou be sayin', \"No, no, no, no, no,\" (No, no) when it's really, \"Yes, yes, yes, yes, yes...\" (Yes, yes...)\nYou be sayin', \"No, no, no, no, no,\" when it's really, \"Yes, yes, yes, yes, yes...\" (Tellin' me \"no\"!)\nYou be sayin', \"No, no, no, no, no,\" (No, no, no) when it's really, \"Yes, yes, yes, yes, yes...\" (Yes, yes, yes...)\nYou be sayin', \"No, no, no, no, no,\" (Oh, ooh yeah...) when it's really, \"Yes, yes, yes, yes, yes...\" (Ooh, yeah...)\n\nIf you keep actin' this way, you're gonna lose my love;\nI ain't got no time to play - you better hurry up...\n'Cause every time I come around and cruise around your way,\nI see you on the corner, but you don't know what to say...\n\nWhen I walk up to you, baby, you seem so shy;\nWhat's the problem, baby? Never had a girl like I?\nI can see right through you, and you know you wanna be mine,\nSo get your act together, 'cause you're running out of time!\n\nYou be sayin', \"No, no, no, no, no,\" (Oh!) when it's really, \"Yes, yes, yes, yes, yes...\" (Yeah-yeah, yeah-yeah)\nYou be sayin', \"No, no, no, no, no,\" (No...) when it's really, \"Yes, yes, yes, yes, yes...\" \nYou be sayin', \"No, no, no, no, no,\" (Don't you know, you tell me, \"No, baby, no, baby, no, baby...\")\nWhen it's really, \"Yes, yes, yes, yes, yes...\" (\"Yes, baby, yes, baby, yes, baby...\")\nYou be sayin', \"No, no, no, no, no,\" (\"No, baby, no, baby, no, baby!\")\nWhen it's really, \"Yes, yes, yes, yes, yes...\" (\"Yes, baby, yes, baby, yes, baby...\")\n\n(Just say yes...)\nYou won't regret - I must confess, I'm really feelin' you;\nAnything you've ever wanted before is right here for you, for you...\nDon't worry what they say - Just bring your love my way;\n'Cause your friends can't do what I can for you - I don't wanna hear you say...\n\n(No...) \nBaby, tell me... (Yes...)\nTell me yes, don't tell me no, no... (No...)\n(Yes...)\n\nYou be sayin', \"No...\", (Don't tell me \"no,\" no...)\nWhen it's really, \"Yes...\" (Tell me what I wanna hear, yeah, yeah...)\nYou be sayin', \"No...\" (Y-E-S, not N-O...)\nWhen it's really, \"Yes...\" (Oh, ooh, oh...)\n\nYou be sayin', \"No, no, no, no, no,\" when it's really, \"Yes, yes, yes, yes, yes...\"\n(You make me say \"No, baby, no, baby, no, baby...\")\nWhen it's really, \"Yes, yes, yes, yes, yes...\" (\"Yes, baby, yes, baby, yes, baby...\")\nYou be sayin', \"No, no, no, no, no,\" (\"No, baby, no, baby, no, baby!\")\nWhen it's really, \"Yes, yes, yes, yes, yes...\" (\"Yes, baby, yes, baby, yes, baby...\")"}