{"song_id":20180,"song_name":"Father","artist_id":276751,"display_artist":"LL Cool J","spotify_id":"7JXFCtDRnftvbZjukyIRRB","lyrics":"I swear to tell the truth and nothing but the truth,\nSo help me God\nI just felt like telling the story of my life\nFelt like, maybe somebody could be inspired, you know?\nWe all feel pain, we all go through things\nBut it's time to overcome all that\n\nIf your plane crashed in the water and everybody died\nWould you drown on purpose or try to survive?\nI was born handicapped my arm wouldn't move\nThey called me a cripple pops caught an attitude\nBeat my moms smoked lye drove trucks\nMy moms had a miscarriage, he didn't give a fuck\nHe sniffed some coke, come home\nBeat up on my moms 'cause she's talkin' on the phone\nCome on\n\nAll I ever wanted\n(All I ever needed)\nAll I ever needed\n(Was a father)\nWas a father\n(That's all)\nThat's all!\n(All I ever wanted)\nAll I ever wanted\n(All I ever needed)\nAll I ever needed, was a father\n(Was a father)\n\nMoms got tired of the beatings said, \"Yo, we got to go\"\nPacked up her bags we bounced out the do'\nShe said, \"I ain't taking these whippin's no mo'\nI want to live to see my little Todd grow\"\nI remember tear drops on my pops face\nLooking down at me standing on the staircase\nHandsome brother with a smooth goatee\nMakes me wonder why he act so ugly, you feeling me?\n(I'm feeling you)\n\nAll I ever wanted\n(All I ever needed)\nAll I ever needed\n(Was a father)\nWas a father\n(That's all)\nThat's all!\n(All I ever wanted)\nAll I ever wanted\n(All I ever needed)\nAll I ever needed, was a father\n(Was a father)\n\nMy pops got drunk when me and my moms bounced\nSwigged some Jack Dan', sniffed up a ounce\nGrabbed the shotty left Long Isle for Queens\nPossessed by a demon, a devil it seemed\nI was too young to understand the risk\nWhen your moms come home off the midnight shift\nShe turned around heard the shotgun click\nMy pops said, \"You think that you could leave me?\"\nHe blasted my moms in the back\nShe fell down screaming I can't forget that\nMy grandfather tried to close the do'\nHe got shot ten times in the stomach yo, for real\n\nAll I ever wanted\n(All I ever needed)\nAll I ever needed\n(Was a father)\nWas a father\n(That's all)\nThat's all!\n(All I ever wanted)\nAll I ever wanted\n(All I ever needed)\nAll I ever needed, was a father\n(Was a father)\n\nMy head was spinning, I had never seen blood\nFour years old, this don't feel like love\nAnyway, pops disappeared\nGrandpops and moms healed up over the years\nThis therapist got up in her head\nLed her to believe without him she'd be dead\nYou know, they fell in love with one another\nEverything seemed right that's word to mother\nUntil I started getting beatings everyday\nSometimes for going outside to play\nLate at night on my knees I'd pray\nA young child, wishing the pain would go away\nDad where was you when he made me strip\nBeat with belts like a slave with a whip\nKicked me down steps outside in the snow\nPunched me in the chest stomped me out on the flo'\nThat's just the tip of the iceberg look\nIt's too long for a song but perfect for a book\nWord is bond, that's real baby\n\nAll I ever wanted\n(All I ever needed)\nAll I ever needed\n(Was a father)\nWas a father\n(That's all)\nThat's all!\n(All I ever wanted)\nAll I ever wanted\n(All I ever needed)\nAll I ever needed, was a father\n(Was a father)"}