{"song_id":20188,"song_name":"Tha Hop","artist_id":305946,"display_artist":"Kinsu","spotify_id":"0hyJHL9VTqHn5VheJDFeRE","lyrics":"Let's go! Gonna do it like this, gonna' do it like this\nNow I don't know, but I've been told, that this party is gettin' cold, that's\nWhy I got a new dance just for you. It's called The Hop, so what you gonna\nDo? Just jump up and down till you hit the ceiling, do that dance, don't\nFight the feelin'. Lemme' form a line and let me get behind that big fat girl\nWith the big behind and hop like a bunny rabbit, lemme get it girl, 'cause I\nGots ta' have it. Party people come an' hop along, so go ahead girl, let's\nSing your song\n\nThat's the way we do that booty hop, now we got the party, hoppy won't you\nCome and hop along\nDo, Do, Do, Do, Do, Do. Do, Do, Do, Do, Do Do, Do Do. 4 times\nHop along like Cassidy, everybody always askin' me, \"What's with the Hop and\nHow you do it?\" All you gotta' do is get your hips into it. Jump around\nTill you get excited. That's the way, uh huh, I like it. Everybody come on\nAnd sing along, just go ahead girl let's sing that song!\n\nBreak it on down!\nEverybody do da' booty hop, jump up and down and don't stop, do that booty hop\nUntil you drop. Here we go...\nBreathe!\nHere we go wit a little sumpin' sumpin', that got he party people jumpin'\nJumpin'. It's not the Dip or the Macerena, it's called the Hop and it's just\nFor winners. So let's begin, just move your body, do dat' hop and let's start\nThe party. So everybody, once the game is on, go ahead girl, let's sing your\nSong\n\nEverybody do da' booty hop, jump up and down and don't stop, do that booty hop\nUntil you drop. Here we go...\nJust breathe! Bye, Bye choo-choo train, hey yo' girl what's up with that\nThang!\nThat's the way we do that booty hop! (Miami!)\nThat's the way we do that booty hop! (Atlanta!)\nThat's the way we do that booty hop! (California!)\nThat's the way we do that booty hop! (New York City!)\nThat's the way we do that booty hop! (South Carolina!)\nThat's the way we do that booty hop! (North Carolina!)\nThat's the way we do that booty hop! (Alabama!)\nThat's the way we do that booty hop! (All the black girls!)\nThat's the way we do that booty... (All the white girls!)\nThat's the way we do that booty... (Give la, la and women!)"}