{"song_id":20212,"song_name":"Nothin' Move But The Money","artist_id":310696,"display_artist":"Mic Geronimo Featuring DMX & Black Rob","spotify_id":"5Q6RB8C28hLmXMC9tJPoCs","lyrics":"(Feat. Puff Daddy)\n\n(Puffy)\nAha aha yeah yeah yeah yeah yeah yeah yeah yeah\nKeep it movin' come on and keep it movin' \n\n(Verse 1: Mic)\nTint that shine, full us to the teeth\nAsk yourself can you ball like me\nIt's nothin' that an amature can try to see\nEven hoes with the most step carefully around me\nI bribe by the rules you know\nDisturb my groove and you gots to lay low\nGeronimo have it in the cut hawked up\nFucked up steering the gas from both sides\nI stay high Puffy pie in the soar\nSpearing the dough, accordly we run it,\nHow it go? Can't nobody hold me down\nLike my nigga Puff say, cut so sharp, you\nThink we sensay (sh)?, Ima break it down audio display\nWith some help from the Bad Boys mic on the play\nFrontin' on my crew nigga crime don't pay\nWe're back in ya face kickin' dirt all day\nVirgin niggas can't rhyme, don't try\nIt's a fact, you've been hitted by the Master-I\n\nEmcees wanna gun me, take my life from me\nIt's funny but still ain't nothin' move but the money\nIt's on...\n\nIs time to hard? Time to rough? Feelin' like you had\nEnough, we can make it, gotta try\nMake a change, live your life\n\n(Verse 2: Mic)\nStruggle it is, I'm goin' to back fully on\nWith the tracks fully plats 88 zillion\nNiggas carry on while I'll place in funds\nAnd makin' some, the value it make 'em run\nGrands and tons of rhymes, if you cope 'em once\nThat you're man over me Shorty rock 'em on\nHere it is in the cut climb ??? at the ???\nThe bomb shit blowin' like a bag of ???\nMad She wrote a verse but it just don't fit\nRight in that shit with the niggas you running\nTo role with, I told y'all motha controle\nThe bowl with this microphone like a , it just\nDon't miss give somethin' to run with 'em on the\nBlock all the niggas we hold you see is ???, and still\n\nEmcees wanna gun me, take my life from me\nIt's funny but still ain't nothin' move but the money\nIt's on...\n\nIs time to hard? Time to rough? Feelin' like you had\nEnough, we can make it, gotta try\nMake a change, live your life\n\n(Verse 3: Mic)\nGeronimo got it locked up like ATM, blowin' the\nTwenty with shortie in the gray B.M\nGettin' dirty after dark like 4 AM and strokin'\nMy little mami till her body say when\nI'm more amazing then a Spielberg flick mix it with\nA little bit of the Tarantino shit, Y'all know to\nQuit while you're movin' your head, see we stoppin'\nOn the bank up in the game, enough said\nA team so strong what can stop me now\nY'all niggas better hopely taunt me now, and still\n\nEmcees wanna gun me, take my life from me\nIt's funny but still ain't nothin' move but the money\nIt's on...\n\nCan't you see that what I mean is the mon-ey\nCan't you see...\n\n(Puff)\nYeah yeah yeah yeah\nBlunt records, Bad Boy collabo\nYeah I see"}