{"song_id":20237,"song_name":"Just Be Straight With Me","artist_id":279318,"display_artist":"Silkk The Shocker Featuring Master P, Destiny's Child, O'Dell, Mo","spotify_id":"1mWtjJDzlNziPw3hzbXFD5","lyrics":"(Feat. Master P)\n\nPeople always talkin' 'bout\n(I'm what, say what? I'm what, say what?)\nYou're a hustler\n(I'm what, say what? I'm what, say what?)\nI don't care what the others think,\nJust be straight with me (I'm what say what?)\n\n(Verse 1: Silkk the Shocker)\nHuh? Huh? Huh?\nI know I take chances to make sure I'm sittin' tight\nDo I get how I live, sometimes I don't get it right\nMy gold and platinum plaques make you know what we did\nHave the whole world wonderin what Silkk The Shocker, Master P did\nSee it ain't no limit, it's only the beginnin\nWhy 'cause all y'all want us to fall, and hit the wall\nIt'll only take a minute, an see I gets the bomb tree\nBeats By the Pound shit, it sound sick, rolex, and baguettes all\nI take this out the ghetto an live up on top\nAkin flights, an shoppin' sprees, on 504 yachts\nSee money don't change me, make me live a lil bit good\nTook some of my, family members, an my homies out the hood\nSee we ghetto millionaires, far away when we meet\nI think they watched us P 'cause about when we speak\nSee I'm too deep to change, everybody know my name\nI guess I gotta charge it 2 da game\n\n(Verse 2: Master P)\nUGHHH! Green money, I like to count honey,\nMy only bad habit that I like to sell B's honey\nWe hot check the Billboard spot\n24 g's an P's to make a club rock\nNow they violent, gotta get it rowdy\nPeep game gotta Benz, Lex Luger in or out it\nDon't hate me, the money don't make me\nIt's gonna take 200 million just to break me\n'Cause I'm a soldier, I thought I told ya\nI like that doja, but hate the rollers\nCrystal, greed, an hinace, got cream\nMakes a brother in a Bentley, from the ghetto\nThere ain't no limit 'cause we livin' large\nBought a rolex, a yacht with a gold card\nYou done lately, your girl wanna date me, in my grill\nFor, UGHHH! an I'm straight g\n\n(Verse 3: Silkk)\nI guess they call me a hustler, 'cause of the fast livin'\nBut if I see somethin' I gotta get it, because I have vision\nAn if I like it, I gotta get, if I saw it\nWent from, over the shows, over the doors\nHouse full of floors that's marble, a brand new Ferrari\nParked it, when I bought it, see I'm a no limit soldier\nAn I came to get it started, what you, what you think,\nI'm all about my bank, tryin' to be a multi-millionaire\nBefore I'm old enough to drink, now we can ride bro, no lie bro\nSee nobody be here beside us, so go ahead an fire it up\nSome girls wanna perk it, my homies like to work it\nSoldiers from Texas, all the way to Jersey\nTick to the tock, all around the clock\nFrom the north, to the south,\nTo the east, to the west, it just don't stop\nSo to all my real g's, throw them up high\nTo all the ballers that have the corks of Crystal let it fly\nThat's how we live\n\n(Master P/Silkk)\nNo Limit say what? I'm what say what?\nNew Orleans say what? I'm what say what?\nSouth side say what? Ugh! I'm what say what?\nEast side say what? I'm what say what?\nWest coast say what? I'm what say what?\nNorth side say what? I'm what say what?\nSilkk The Shocker say what? I'm what say what?\nNo Limit say what? I'm what say what?\nHa ha, playas, congratulate,\nAin't no hatin' on this side, where the money at?\nThat's what hustlin is about, you heard me?\nMaster P, Silkk The Shocker, hustlin till the izend,\nMovin thangs how we get it, we gonna get it, how we livin'."}