{"song_id":20312,"song_name":"Out Of Sight (YO)","artist_id":369277,"display_artist":"Rufus Blaq","spotify_id":"null","lyrics":"Have you ever been ambushed?\n\nEvery time I write a rhyme\nYou know it's tight\nPeople say B-L-A-Q you out of sight\nYo chiki chiki high chiko\nComin' through 'bout to do the impossible\n(Repeat)\n\nNever test B-L-A-Q the six footer\nYou tried to call my bluff How could ya?\nFrontin' when you ain't got straps\nWhy would ya?\nCuttin' hard core and ya tank's full of sugar\nYou can never compare to rhymes I write\nMy style is ferocious & I'm gettin' ?? for tonight\nGroupies in my hotel lobby I'm hittin' on 'em\nNiggas try to take my reign I'm shittin' on 'em\nAs is I'm trippin' on 'em tracks I'm flippin' on 'em\nNiggas ain't satisfied till my weapon is spittin' on 'em\nEverytime I bust mine your soul burn\nYou niggas yearn to learn my flows spread the germs\nMakin' you squirm any MC can get his ass beat\nBlowin' up the spot in spite of the last beef\nChiki ko ya highest title ya numero uno\nMy wife is Puerto Rican so we speak in ??\nNationality no it don't matter where you rest\nYou can still catch verbal slugs to ya chest\nYou niggas tryin' to front like you hard as cold steel\n\"The Sweetest Thing,\" I've ever known is Bourbon Hills\n\nWho the most John Blaze?\nAnd who John Doe?\nI'm too hot chiki chiki ah chiki o\nUnfadeable (Yo) top dollar\nWhen I bark I bite rougher than Rottweiler\nPull around here I'm buckin' your Impala\nMy entourage is large like Kamala\nThe women holler I lay my game down sick\nHeey stick it up in yo' girl so I'm quick\nTickle it hee hee hee hee hee Who I be?\nA P to the I to the M to the P\nLyrically y'all haters should not test\nI'm too laced ice on my wrist to chest\nYou talkin' shit when you never progress\nI'm a excel until I have no goals left I'm gone\n\nB-L-A-Q's gonna make you dance\nAmbush gonna make you dance\nWhat what come on\nM-O double B's gonna make you dance\nDontell wanna make you dance\n\nEvery time I write a rhyme\nYou know it's tight\nPeople say B-L-A-Q you out of sight\nYo chiki chiki high chiko\nComin' through 'bout to do the impossible\n(Repeat)\n\nA to the M-B-U-S-H Ambush baby\nA to the M-B-U-S-H never forgets (that's us)\nA to the M-B-U-S-H uh that's us that's us\nHa ha uh uh uh A to the M-B-U-S-H"}