{"song_id":20387,"song_name":"Do You","artist_id":303378,"display_artist":"Heather B.","spotify_id":"04k3LZBJGf9VAVtyc2g1pJ","lyrics":"What, what?\nBitches backstab with no remorse, fuck bitches\nThey get blasted when I'm lickin' off, Heather B\nHard hitter, when I'm gettin' off, these bitches\nWith no father figures they be trickin off, feel me\nThey beez off the heez knees and naps to show\nIf they try to run between these I blow they doors\nPut the jinx on 'em all like they sophomores\nCause these bitches got the gall to holla hardcore\nI'm crackin' jaws, Heather B the southpaw, with no look\nGive a fuck about these bitches, uh, and that's the hook\nYou know how I'm gon' get it, split it, off the books\nAnd you ain't got to love me, trust me, simply hook\n\nWhen you countin' on your peoples and they don't pull through\nI'ma do me (you gots to do you)\nNiggaz game so weak I can see right through\nI'ma do me (you gots to do you)\nEverybody got a time and I know mine's due\nI'ma do me (you gots to do you)\nSee you out there gettin' yours, gots ta gets mine too\nI'ma do me (you gots to do you)\n\nHeather B, Grand like a Cherokee\nLoredo, I need my hands on some alfredo\nStreets condonin it, Back on the Block, Quincy Jonesin it\nPrada, get publishing, what? I'm owning it huh\nYou feel me now? You get the point?\nHeather B B B B drops oowops on your joints\nYou really, can't rate me or mistake me for another\nI Brings In Da Noize And Funk like Savion Glover\nWicked, like those sisters and that stepmother\nGot your clocks strikin twelve I'm bringin' hell to Cinderella\nFuck how much you sell cause, I read your album cover\nYou couldn't write a jam if your last name was Smucker\nGot all my motherfuckers yellin' Jersey up in here\nNo Limit like Master P I like how he Do Dat There\nListen here I'm livin' sort of dan-gerous-ly\nPlus I'm bulletproof no use in aimin at me\n\nI spits pure fire, I burn the finest of designs\nHeather B that MC that runs up on 'em from behind\nWho got your back now, where you ill crew at?\nThe sons you talked about with guns, the ones with gats and all that?\nI figured that some rap for plaques over, R&B tracks\nYou got to watch, what you say if you ain't really, livin' that\nAnother rapper lost, lookin' all stank up in The Source\nWhat's all that shit fo'? Did your momma, raise a hoe?\nFight it, and I win, I'm that rhyme, veteran\nWith that Nighttime Sniffly Sneezin Rest Your Head, Medicine\nSee me live rock on Keenan, and even, Letterman\nRock Chris Rock, blow his spot, like nitro-glycerin\nHold that like they don't know, but I'm like years ahead of them\nPlus I shed, more light right, than Thomas, Edison\nAnd I'll take it there end your career with one stroke of my pen\nAnd I got enough love, I don't need no mo' friends\n\nWhen they poppin' champagne and you only drinkin' brew\nI'ma do me (you gots to do you)\nWhen you know you broke as hell and your rent is due\nI'ma do me (you gots to do you)\nAnd you ain't got no love, you know you ain't true\nI'ma do me (you gots to do you)\nFrontin with them niggaz from that weak ass crew\nI'ma do me (you gots to do you)\nAnd I'm out"}