{"song_id":20409,"song_name":"Goodbye To My Homies","artist_id":309928,"display_artist":"Master P Featuring Silkk The Shocker, Sons Of Funk And Mo B. Dick","spotify_id":"6tvyV4j2sAoetLwByIWiK1","lyrics":"(Master P)\nR-I-P homie, R-I-P\n\n(Sons of Funk/Mo B. Dick)\nHow do I say goodbye to what we had\nThe good times that made us laugh outweighed the bad\nI thought we'd get to see forever\nBut forever's gone away\nIt's so hard to say goodbye to my homies\n\n(Master P)\nY'all need to smile for my ghetto heroes nigga\n\nSo many homies gone, trying to ball till they fall\nNow I'm left with nothing but old cards\nAnd a bunch of pictures on the wall\nR-I-P tatoos nigga, just to show you that we real\nBut I still can't believe that your dead fool, and how you got killed\nAnd on your birthday me and my boys visit your grave\nAnd I remember when you first got high\nAnd the first time you got laid\nAnd I'm going through a thing, Kevin nigga, what should I do\nI never imagined living life without a nigga like you\n\n(Sons of Funk/Mo B. Dick)\n{'Cause it's so hard to say goodbye to my homies }x2\n\n\n(Master P)\nWe shed so many ghetto tears, see time is crazy\nAnd every Sunday grandma go to church\nShe said she gotta pray for her baby\nAnd ah, your little son, he look just like you\nAnd momma going through a thang, but she gonna pull it through\nAnd ah, me, C and Silkk, we got all the money but that don't mean shit\n'Cause I burn all that shit up nigga, just to have you again\nAnd it's real out here, all you niggas that's goin' through some pain\nKeep your head up, and this for everybody that lost a relative in the street\nGame\n\n(Sons of Funk/Mo B. Dick)\n'Cause it's so hard to say goodbye to my homies\nAnd it's so hard to say goodbye to my homies\n\n(Silkk The Shocker)\nNow look, I couldn't imagine life without you\nI just sit here and wonder why\nBut the law of life, and god placed us here\nAnd said everybody must die\nAin't it hard trying to move on, but still I try\nEven though we got money, judgement day\nJust some things we can't buy\nEven though you gone, I never let you move on\nCause every time I think about you\nI sit back and write your name in a song\nNow ashes to ashes, and dust to dirt\nIt's kinda spooky when I see your face on a t-shirt\nI just pray to god it's hard wishing it would get better\nAnd watch it, cause death or funerals bring our family together\nNow look, we done lost a brother, your son done lost a father\nLife ain't promised us so tell somebody you love them\nYou'll never know if they'll be here tomorrow\n\n(Sons of Funk/Mo B. Dick)\n'Cause it's so hard to say goodbye to my homies\nAnd it's so hard to say goodbye to my homies"}