{"song_id":20441,"song_name":"Dr. Greenthumb","artist_id":299883,"display_artist":"Cypress Hill","spotify_id":"44R9Y5VvrDbWx9K3xPYmnc","lyrics":"Hello, I'm Dr. Greenthumb\nHave you ever had the problem of running out of weed\nAnd just can't find some anywhere?\nWell try my Dr. Greenthumb grow tips\nI'll show you how to grow inside and out\nFrom seed to clone, and the best homegrown\nAnd if you're afraid of those pesky pork choppers in the sky\nNo worries, we'll fix them too\nWith one of our Dr. Greenthumb 'Sizzlean' screens\nTo block the nosy pig's vision\nDon't believe me?\nJust ask one of my many satisfied clients here Jed Sanders\nHow well it works\n\nHyuh, hyuh, hello mah name is Jaid\nAnd ahm a farmer and I've been growin'\nMary-jah-wana fer about twenty years and uh\nUh, with Dr. Greenthumb's 'Sizzlean' screen\nI don't hafta point my shotgun\nAt them pesky porkers no more\nThanks Dr. Green, you're tha shit\n\nYes, Dr. Greenthumb's got it all, I guarantee it\nTry my book and you'll have the chronic in no time\n*Lighter flicks* Dial 1-800-713-GROW\n*Inhaling noise* That's 1-800 *cough cough* *inhale*\n*Lighter flicks* 713 *cough cough*\nG *inhale* R *inhale* O-W\n\n\"Hello Dr. Greenthumb, paging Dr. Greenthumb!\"\n\n(B-Real)\nHello my name is Dr. Greenthumb\nI'd like to tell you just where I'm from\nIn the hills where the trees grow wild with weed fields\nThe fucking pigs with shields holding the blue steels\nGreenhouse effect with the weed connect\n(Doctor) DEA can't keep the Greenthumb in check (Doctor!)\nHPS, God Bless the whole crop\nPlease God, don't let me see no cops\nTrunkload, ready to hit the highway\nDon't let the eye in the sky fly my way\nOr we gonna have big trouble, that's no shit\nCan't be growin' without no permit\nBut fuck that, I study the 215 trip\nThat way when they come they can suck my dick\nWeed can't grow without attention\nHello my name is Dr. Greenthumb\n\n(B-Real) Hello my name is Dr. Greenthumb\n(SenDog) Hello my name is Dr. Greenthumb!\n(B-Real) I'd like to tell you just where I'm from\n(SenDog) Hello my name is Dr. Greenthumb\n(B-Real) Hello my name is Dr. Greenthumb\n(SenDog) Hello my name is Dr. Greenthumb!\n(B-Real) I'd like to tell you just where I'm from\n(SenDog) Aiyyo Dr. Greenthumb, come on back one time!\n\n(B-Real)\nPeople can't live without the herb man\nIf not they'd be drinkin' and drivin' and swervin\nBut thanks to Dr. Greenthumb weed grow\nIn the backyard or inside with hydro\nTo the cush plant brushin a tangerine dream\nTasty, blowin' a fuckin' smokescreen\nCycles of weed are constantly grown\nSomebody give me the razor to cut groves\nI'd like to stop, but it feels so good\nHorny plants stinkin up my whole neighborhood\nSticky angel, I neva wanna leave green alone\nBut never ever ever got a warrant for my home\nWhat that funny sound knockin' at the door (Open up it's the DEA!)\nSorry Greenthumb can't talk no more\nPlease don't follow me into the sun\nHello my name is Dr. Greenthumb\n\n(B-Real)\nOut from the lab, no need for rehab\nIf I can't drive then call me a cab (taxi!)\nIn my closet the weed is dried out\nLike Eiht said, ain't no place to hide out\nI don't wanna buy no weed from no cop\nGet locked up and they close up my shop\nThat's why I buy no weed from no one\nThat's why they call me Dr. Greenthumb\nThe scientifical, mystical one\nGrowin' my crops with the rays of the sun\nCome one come all and see how it's done\nIf you see the pigs there's no need to run\nCause some of these pigs are down with Greenthumb\nBut you never know what be the outcome\nYou see the photo in the album\nThe weed is growin' like my erection\nLook I never told you where I was from\nSome call me Real, but I'm Dr. Greenthumb\n\nDr. Greenthumb\nDoctor, your Bulova plant needs special tending to\nDoctor, we need more oxygen we need more CO2\nDoctor, Dr. Greenthumb you're needed\nDoctor, dahyahahah... Doctor"}