{"song_id":20446,"song_name":"How's It Goin' Down","artist_id":300046,"display_artist":"DMX Featuring Faith Evans","spotify_id":"343xt5q01Q73Yw6uL0jGVD","lyrics":"Whose dick you sucking?\nDon't call me with that bullshit, all right\nYou lying, you lying to me, Di\nYeah exactly\nWhose dick you sucking? C'mon Di, I just heard some shit about\nYou, some foul shit. The fuck is the deal?\nSuck my fucking dick you bitchass nigga! I don't\nNo you explain it to me bitch. You know what I'm talking about.\nI don't know nobody up here! I don't fuck with nobody up here and\nI ain't been fucking with nobody up here! I don't know nobody in\nFucking Yonkers!\nLying ass bitch. You ain't shit. Do I got to hollar his name too?\nWho the fuck is he!?\nBitch you fuckin' up!\n\n\"All I want is you, all I want\"\nWhat type of games is being played, how's it going down?\nIf it's on till it's gone, then I gots to know now\nIs you wit me or what, nigga try to give me a nutt\nJust honeys wanna give me the butt, wha...\n\nI'm politicking with this trick and wondering if I'ma creep her\nLittle hoodrat bitch from 25th named Tenika\nComing through, like I do, you know\nGetting my bark on\nKnew she was a thug because when I met her she had a scarf on\n5411, size 7 in girls\nBabyface, would look like she was 11 with curls\nGirlfriend, remember me, (what?), from way back, I'm the same cat\nWith the wave cap- the motherfucker that tnt used to blaze at\nStill here so it's all good\nOh you know my niggas Rich and them doing they thing on 35th Ave\nIt's a small hood, and it's all wood, so let me get that number\nHook it up, aight\nHit you on da track later on, say wassup\nTalking to shorty made me wanna do something nice\nLooking at that ass made me wanna do something tonight\nAnd I know right when I see right, shorty looking like she tight\nShe bite, better give a nigga the green light, we might...\n\n\"All I want is you, all I want\"\nWhat type of games is being played, how's it going down?\nIf it's on till it's gone, then I gots to know now\nIs you wit me or what, nigga try to give me a nutt\nJust honeys wanna give me the butt, wha...\n\n\"All I want is you, all I want\"\nWhat type of games is being played, how's it going down?\nIf it's on till it's gone, then I gots to know now\nIs you wit me or what, nigga try to give me a nutt\nJust honeys wanna give me the butt, wha...\n\nI'm getting at shorty like what you need, what you want\nOffer nothing, 'cause I got you, must you front?\nI see you with your baby father but it don't matter\nYou gave me the pussy, that ass is getting fatter\nLet that nigga play daddy, make moves with me\nI'da kept it more than real boo, can't lose with me\nHeard he smacked you 'cause you said my name while y'all was sexin'\nRan up on this cat, thought was me, and started flexin'\nYou know I ain't even with that\nSo he gon' have to get that just on TV\nTry to creep me, what? Leave that nigga sleepy\nOn the strength of you, that's your kid's daddy\nI ain't gon' send him on his way, put him up in that big caddy\nBut let him know\nNever mind yo, I need you to go\nTake this snow up to 150, see Joe\nGet that, come back with that\nWe can split that, sit back\nFuck, puff a L, forget that\nYou wit dat?\n\n\"All I want is you, all I want\"\nWhat type of games is being played, how's it going down?\nIf it's on till it's gone, then I gots to know now\nIs you wit me or what, nigga try to give me a nutt\nJust honeys wanna give me the butt, wha...\n\n\"All I want is you, all I want\"\nWhat type of games is being played, how's it going down?\nIf it's on till it's gone, then I gots to know now\nIs you wit me or what, nigga try to give me a nutt\nJust honeys wanna give me the butt, wha...\n\nAiyyo this chicken got me digging her moves, 'cause she smooth\nWanna lose, whoever she choose, it's the dues\nRespect is not expected but it's given 'cause it's real\nBeing neglected to know em, expect it, the deal\nLie, cheat, and steal for me\nPutting something in a nigga's wig if you squeal for me\nKill for me, you still with me\n'Cause we get down like what\nTold you from the door, it ain't all about a nutt\nI'm gon' be fair, try to be there\nWe gon' see then, hit me with the question boo\nThat answer gon' be yeah\nSee there, something can go wrong, it does\nLove'd it, Let it go\nBut it came back, that's how strong it was\nBut you belonged to 'Cause, couldn't belong to me\nYou had two kids by this nigga, it was wrong for me\nBut we gon' always be, best of friends\nHaha\nMad love, Boo, to the end\nHaha\n\n\"All I want is you, all I want\"\nWhat type of games is being played, how's it going down?\nIf it's on till it's gone, then I gots to know now\nIs you wit me or what, nigga try to give me a nutt\nJust honeys wanna give me the butt, wha..."}