{"song_id":20454,"song_name":"Lost In Love","artist_id":277000,"display_artist":"Nastyboy Klick","spotify_id":"1nHHbeFTpQXZPbyTsio6NV","lyrics":"(Feat. Tracy Celaya)\n\nHow ya doin' sweetheart?\nHeya, you know these last few months we've been together\nHappened so right and I'm just so happy for what we shared\nI've been wonderin'...how do you feel?\n\nI wanna get lost in love with you\nAnd do all the things you want me to\nCaress your body touch your soul\n'Cause boy I love you so\n(Repeat)\n\nThe love we shared something so especial\nEs tan contigo is all I wanna do every night\nEver since el primer dia, the first day\nI knew it'd last forever if I had it my way\nSo the days go on, no hago otra cosa\nBut dream about the moment, our hearts will come closer\nHoldin' tu mano in your face tan bonita\nNever met another young lady senorita\nAnd that is why I gotta say that you're the best\nA million and one ways just to express\nMi amor I know that we will be together\nSo, sing to me, baby, and sing forever\n\nI wanna be with you always\nTogether forever till our ending days\nHold me baby don't let go\nMakin' love like never before\n(Repeat)\n\nMakin' love in the night time, walks and romance\nI'm telling you, hermosa, my heart is in a trance\nThey say that true love is so hard to find\nI thank the man up above for makin' you mine\nTalkin' on the telephone, sendin' you kisses\nA dozen of roses just to say that I am missin'\nThe warmth of your body right next to mine\nEre es tu la mejor like a toast of fine wine\nOut to the movies, maybe sharing some ice cream\nSi estoy dormido, don't wake me from my dream\nTodo lo que quiero, all I need is your affection\nMy life was fine but you brought profection\nNow we sit here just holdin' hands\nWhispers in my ear tell me that I'll be your man\nToday, manana in a paradise for two\nI feel the same way 'cause I'm so in love with you\n\nI love the way you make me feel\nMy love for you is all so real\nEmbrace my body, touch me softly\nLove me till the morning\n(Repeat)\n\nYou know that love we shared is just something so special\nI just don't know what to say, girl\nWould you sing to me one more time?\nDo it like this, c'mon\n\nI wanna get lost in love with you\nAnd do all the things you want me to\nCaress your body, touch your soul\n'Cause boy I love you so\nI wanna be with you always\nTogether forever till our ending days\nHold me baby, don't let go\nMakin' love like never before"}