{"song_id":20483,"song_name":"Whatcha Wanna Do?","artist_id":310683,"display_artist":"Mia X Featuring Charlie Wilson","spotify_id":"39v562NvNkB2pNkFISUc34","lyrics":"(Feat. Charlie Wilson)\n\n(Intro: Charlie Wilson)\nAnd you can't keep runnin' in and out of my life\nWhatcha Wanna Do?\nAnd you better change your ways and start treatin me right\n(x3)\n\n(Verse 1: Mia X)\nI tried to feed you everything you needed\nAnd if I wrote I love you in the sky, you probably wouldn't read it\nCause, you actin' like it don't even matter no more\nSometimes, I feel we in a race, tryin' to make it to the door\nIs it that I bore you, is it someone else again?\nShould we put this to an end, and maybe start again as friends\nI'm tryin' to be mature, but mentally, I'm so tired\nAnd you can't even tell me why\nI cry feelin' stupid, used and alone\nWhen it's four in the mornin and you still not home\nWhere did we go wrong, it used to be all gravy\nMakin' love all night, callin me your baby\nBut things got shady, now we ain't even close\nTreat me like I should leave, and then don't want me to go\nSometimes I think I'm stuck, ?some say we goin' on that path?\nAnd then you raise me on the phone and please let you come back\nWhatcha Wanna Do?\n\n(Chorus: Charlie Wilson)\nCause my heart is yearnin for your love\n(x2)\n\n(Verse 2: Mia X)\nNow we been through all kinds of drama\nBut I'm the only other woman who loves you just as much as mama\nI'm tryin' to hold on, 'cause what we had was so deep\nAnd in relationships, you got to take the bitter with the sweet\nYou keep runnin' in and out, messin with my feelings\nPlayin' with my mind and I know you see me trying\nBut even soldiers fall, remember when you fell\nRemember the excuses and the lies I had to tell\n?Put penance? for your bail, even though you gave me hell\nWhen you was snortin more than half of what you had to sell\nPut up with all your flings, hold my head, feelin' sad\nBut through all the bull, you know it wasn't that bad\nYou used to make me laugh, show me love and respect\nBut if you don't make a change, you'll be callin me your ex\nCan't keep runnin' in and out\nCan't keep runnin'\nWhatcha Wanna Do?\nWhatcha Wanna Do?\n\nCause my heart is yearnin for your, let me inside your love\nMy heart is yearnin for your, let me inside your love\nWhatcha Wanna Do?\n\n(Outro: Mia X (Charlie Wilson))\nNow what we gonna do?\nI can't help but think of all the good times we had\nWhen everything was so right\nYou know I can't pull all the weight by myself\nAnd I feel like that's what I've been doin' lately\nIt's a 50/50 love in a relationship, remember that\nNow you runnin' wild out here (Mama Mia, not gonna let you go baby)\nGamblin with all this foolishness in the streets\nWhatcha gon cry about? (Mama Mia, not gonna let you go no)\nYou know what me and you had was real\nWhy you tryin' to let it go?\nIf you wanna let it go, that's cool too (Mama Mia, not gonna let you go\nBaby)\n'Cause I'm lookin' for a Mr. DoRight\nI was hopin it was you (Mama Mia, not gonna let you go no)\n'Cause when I first met you, that's what you was to me\nNow Whatcha Wanna Do? (Mama Mia, not gonna let you go baby)\nI ain't gonna keep askin you (Mama Mia, not gonna let you go no)\nYou already have two strikes\nThink about it\n(Mama Mia, not gonna let you go baby)\n(Mama Mia, not gonna let you go no)\n(Mama Mia, not gonna let you go baby)"}