{"song_id":20497,"song_name":"Pushin' Weight","artist_id":276477,"display_artist":"Ice Cube Featuring Mr. Short Khop","spotify_id":"4tzStSrQFCWoNU82ozFBhs","lyrics":"Yeah, yeah\nBlaze one for the nation\nBrrrrr\nBrrrrr\nBrrrrr\n\nI got lyrics that wake up spirits\nThey told me how to make big hits and spend digits, can you dig it?\nYou fed, you dead, see red\nMy lead, yo head, I fed like you shit\nI got rhymes push that shit like weight\nMy nigga lincoln help me navigate through this hate retaliate,\nIt's official I got that bomb, bomb,\nDiddy, diddy, diddy, bomb, bomb when I hit you\nPush the issue my ghetto dope is amazin\nThe bitch that's with you already know that I'm blazin'\nThat's by the number, we can slumber, on the under\nGirl no wonder, you got a ass full of thunder\nThe frozen tundra ain't cold enough and baby ain't old enough\nFor this game I'm rollin' up\nDe-Zamn it feels good to be the don\nStraight legit, while niggas like gotti just sit\n\nA yeah yeah\nI push rhymes like weight\nI push rhymes like weight\nA yeah yeah\nI push rhymes like weight\nI push rhymes like weight\nA yeah yeah\nI push rhymes like weight\nI push rhymes like weight\nA yeah yeah\nI push rhymes like weight\nI push rhymes like weight\n\nI hold zone like a corleone\nNo more fuckin' with that homegrown hit the shit we on\nThe rolleo's and the baggetts you still fuckin' with them faggets\nWe turn haters into maggets\nOak on the dash, but no coke on the hash\nYou broke ass niggas learn to mash,\nLike me constantly, put the hustle down\nWith four or five niggas that's musclebound\nSend your head to the taxidermist\nWon't be satisfied, till I get my face on a thermos\nYou got to earn this, you can't take it can't fake it,\nGot to live it, or we gots to visit who is it,\nThe exquisite, don mega\nWalkin' with my entourage, I think I'm betta,\nMakin' chedda you see me sag in my jag,\nWith the rag recognize the flag you betta get back,\nEverybody wanna do it like me I got it made,\nBeen makin' rap money since the tenth grade\n(Ch-ching) (since the tenth grade)\n(Ch-ching) (what you need)\n\nA yeah yeah\nI push rhymes like weight\nI push rhymes like weight\nA yeah yeah\nI push rhymes like weight\nI push rhymes like weight\nA yeah yeah\nI push rhymes like weight\nI push rhymes like weight\nA yeah yeah\nI push rhymes like weight\nI push rhymes like weight\n\n(Mr. Short Khop)\nI keeps a firm grip on my shit when in transit\nUncandid, it's the young bandit\nFresh out the trenches, the wood works\nCity of the ?tempeon?, where the hoods lurk\nIn search of the rich blocks, to lick spots, and kick rocks\nFrom shattered glass, down the pig locks\nWant tips by the clock you niggas scramblin for fouyan\nAnd settle for crumbs and croutans\nI'm out for armored bucks and armored trucks, with armed killas\nBitch niggas get swallowed by the armadillos\nAin't no harmin me, the army full honary niggas you can't see\nSo while you pace bitches and saturns livin' jenky\nI hangs with niggas who got patterns on they hankey\nAfter ben frankeys,\nWith the big skullen eyes you niggas bound and nullified\nSit back and mine stack it multiply\n\nChorus: Ice Cube and Mr. Short Khop\na yeah yeah\ni push rhymes like weight\ni push rhymes like weight\na yeah yeah\ni push rhymes like weight\ni push rhymes like weight\na yeah yeah\ni push rhymes like weight\ni push rhymes like weight\na yeah yeah\ni push rhymes like weight\ni push rhymes like weight\n\n (starts during chorus)\nAsk about me\nWorldwide baby\nWorldwide baby (a yeah yeah)\nIce cube makin' more money in the rap game\nThan some of you can (a yeah yeah) with a bird in your hand\nPuttin' it down\nWe wanted in fifty states for this weight\n(A yeah yeah)\nPushin rhymes like weight\nPushin rhymes like weight\n(A yeah yeah)\nYeah, blaze one for the nation\n(A yeah yeah)\nYou know my name\nYou know my name\n(A yeah yeah)\nYou know my name\n\n(Mr. Short Khop)\nYeah, some of you fools just got in it\nAnd think you gonna change the game\nYou ain't changin nothin'\n\n(Ice Cube)\nI been doin' this, I been doin' this\nAsk about me\nAsk about me"}