{"song_id":20499,"song_name":"Money's Just A Touch Away","artist_id":276912,"display_artist":"Mack 10 Featuring Gerald Levert","spotify_id":"7aSxhMIWO0oeGbAqb9vve1","lyrics":"(Mack 10)\nThis song is dedicated\nTo all the up and coming rappers, singers, hustlers, actors\nWhatever you may be remember:\nWithout no struggle, you get no progress\nSo keep grindin, keep on mashin, get yours\n\nChorus: Gerald Levert\n\nYou're nothin' far from comin' up (keep on)\nMoney's just a touch away (keep on)\nSo keep on grindin don't give it up (keep on)\nThere'll always be another day (keep on)\n\n(Mack 10)\nAnd now I'm sittin' at the pad, teary eyed and depressed\nStarvin and sufferin from mental stress\nNow a true center to the game of beginner\nBut hard to feel like a winner when you eat spreads for dinner\nHit the streets late night in the form of star mushin\nOn the 211 mission just to pay tuition\nFor my kids I got to grind and develop street saavy\nServin' stress 'cause I just ain't got enough to cop cavi\nBut I can't stop, I won't stop, till I got it made\nEither build my clientele, get a job or learn a trade\nLike hip-hop, and make enough to live good forever\nSo I learned to write the rhymes and get my metaphors together\nThen I joined a rap crew, with the homies on my street\nSellin underground tapes out the local swap meet\nGettin' tighter on the mic, as I worked day to day\nSo now I lay down at night, and I hear voices say, \"Mack\"\n\n(Mack 10)\nNow I'm new to the scene, H as in Hard, N as in Nympho\nSo like EPMD, could you Please Listen to My Demo?\nI left the local crew, felt like I was the man\nIn popular demand and now ready for SoundScan\nSo I searched for a deal with no luck I kept rappin'\nFelt like it would take a miracle to make it all happen\nMarble said it was a test, \"Mack don't do nuttin wrong!\nJust have faith in God and keep your hustle goin' strong\nStay hongry, keep writin, don't quit you're too close\nRemember good things come to those who want it most\"\nSo I never left the house, without my rap book\nThought I found a new crew but eventually got shook\nFirst they said I was cool, but then started to doubt me\nPut me on the backburner and just forgot all about me\nPartna said I wasn't fresh, and sent me on my way, but you know what?\nAs I was leavin', I could hear voices say, \"Mack\"\n\n(Mack 10)\nNow the tables turned, but I remember they used to clown me\nThe hard work paid off, and luck finally found me\nSo call every publication, Billboard and the editor\nAnd tell 'em Mack's being signed by dude workin on The Predator\nI got the Midas touch, now everything be the bomb\nHooked up with The Don, now made a few mill-ion\nI don't bang I write the good rhymes, you know about mines\nMan I'm the tightest MC, Ice Cube ever signed\nNow if ain't the radio, it's a video shoot\nLivin' life in the limelight, with a bank full of loot\nNow my crew is solid, shook the haters and the leeches\nRunnin' full court at my house with our girls on the beaches\nPlus the violence is ceased, no more bi-coastal beef\nCause now I get down with the North South and the East\nI reminisce on hard times, seem like yesterday, but now\nHoo Bangin' is official and I remember they used to say, \"Mack\"\n\n Money's just a touch, just a simple touch\nMoney's just a touch away...\nMoney's just a touch, just a simple touch\nMoney's just a touch away...\n\n Man I knew I was gonna make it, but they didn't believe me\nYaknowhatI'msayin? Clowned me -- gon' be a rapper, what?\nHahahaha"}