{"song_id":20503,"song_name":"Enjoy Yourself","artist_id":275217,"display_artist":"A+","spotify_id":"1fEUW2mfGlCaawNaNOXdjl","lyrics":"Enjoy yourself, 9-8,\nGet it straight, yo\n\nYes yes y'all steady playin' the wall, you're\nToo young to sip alchohol at the bar.\nI'm ready to jet, girls actin' bougouise.\nYo Kedar, let me hold the keys to the car!\n\nI'm in front of the club tryin' to bag a chick,\nTryin' to get five of 'em 'cause the whip seats six.\nFeeling alright, chrome lookin' real tight.\nWatch the moonlight bounce off the pearl white.\n\nWord money, I earn money just to burn money,\nTryin' to get this federal reserve money.\nThere's two types of artists, expert and novice,\nExperts always hit the mark of their target.\n\nEnjoy yourself, enjoy yourself, enjoy yourself for me\n\nYou know you gotta\nEnjoy yourself, enjoy yourelf, enjoy yourself with me\nYou gotta enjoy yourself, come on!\n\nI have the baddest foundation ever established.\nMe and my team bubble like Alka Seltzer tablets.\nNigga, don't sleep when it's time to creep,\nA little pimp like me will crawl underneath.\n\nIt takes a lot more than words to move me,\nI don't give a p-h-u-k what you say.\nActing all wild, unprofession-al,\nWho got beef, I knock the teeth out of ya smile.\n\nMy lyrical lubricant keeps the crowd moving,\nYou get booed when your stageshow needs improvement.\nSo if you wanna see A+, the artist,\nYou gotta Western Union me a key grand deposit.\n\nWhile that cats out there steady kickin garbage,\nGirls steady saying \"Look, I can see who the god is.\"\nYou can't harm me or stop me,\nEven on a poor quality bootleg cassette copy.\n\nEnjoy yourself, enjoy yourself, enjoy yourself for me\nYou know you gotta\nEnjoy yourself, enjoy yourelf, enjoy yourself with me\nYou gotta enjoy yourself, come on!\n\nTake your time, make up your mind,\nThe dime pieces love the diamonds and the shine.\nReal friends never fall in love,\nStaling my heart is like stealing a car with the club.\n\nNevertheless I get an occasional crush,\nSay some romantic stuff that make you wanna blush.\nGirls in all flavors, no matter what their race is,\nRyhmes amazing, making Craig Mack faces.\n\nTake 'em back to the lab and touch three bases.\nTake my time, don't wanna catch no rape cases,\nKiss on the forehead and say \"goodnight\",\nA+ y'all, and I'm out like 3 strikes...\n\nEnjoy yourself, enjoy yourself, enjoy yourself for me\nYou know you gotta\nEnjoy yourself, enjoy yourelf, enjoy yourself with me\nYou gotta enjoy yourself, come on!\n\nEnjoy yourself, enjoy yourself, enjoy yourself for me\nYou know you gotta\nEnjoy yourself, enjoy yourelf, enjoy yourself with me\nYou gotta enjoy yourself, you gotta enjoy yourself\nCome on, come on, enjoy yourself, come on!\n\nA+, big time,\nThe key you know, now get 'em,\nIt's my time, nigga,\n9-8,\nCheck it out"}