{"song_id":20525,"song_name":"Have You Ever?","artist_id":297075,"display_artist":"Brandy","spotify_id":"2cvOcTvQPu3W373W0v3xKc","lyrics":"Have you ever loved somebody so much it makes you cry?\nHave you ever needed something so bad you can't sleep at night?\nHave you ever tried to find the words but they don't come out right?\nHave you ever, have you ever?\n\nHave you ever been in love, been in love so bad?\nYou'd do anything to make them understand?\nHave you ever had someone steal your heart away?\nYou'd give anything to make them feel the same\n\nHave you ever searched for words to get you in their heart\nBut you don't know what to say and you don't know where to start\n\nHave you ever loved somebody so much it makes you cry?\nHave you ever needed something so bad you can't sleep at night?\nHave you ever tried to find the words but they don't come out right?\nHave you ever, have you ever?\n\nOoh, have you ever found the one you've dreamed of all your life?\nYou'd do just about anything to look into their eyes\nHave you finally found the one you've given your heart to?\nOnly to find that one won't give their heart to you\n\nHave you ever closed your eyes and dreamed that they were there?\nAnd all you can do is wait for that day when they will care\n\nHave you ever loved somebody so much it makes you cry? (Makes you wanna break down and cry)\nHave you ever needed something so bad you can't sleep at night?\nHave you ever tried to find the words but they don't come out right?\nHave you ever, have you ever, ever, ever, ever?\n\nOoh, what do I gotta do to get you in my arms, baby?\nWhat do I gotta say to get to sugar your heart?\nTo make you understand how I need you next to me\nGotta get you in my world 'cause, baby, I can't sleep\n\nHave you ever loved somebody so much it makes you cry?\nHave you ever needed something so bad you can't sleep at night? (Breaks you up inside)\nHave you ever tried to find the words but they don't come out right?\nHave you ever?\n\nHave you ever loved somebody so much it makes you cry?\nHave you ever needed something so bad you can't sleep at night?\nHave you ever tried to find the words but they don't come out right?\nHave you ever, have you ever?\nOoh, have you ever?"}