{"song_id":20622,"song_name":"You Got Me","artist_id":419012,"display_artist":"The Roots Featuring Erykah Badu","spotify_id":"4pdLZsxq0y5oJDb6Cxlokw","lyrics":"(Erykah Badu):\nIf you were worried 'bout where\nI been or who I saw or\nWhat club I went to with my homies\nBaby, don't worry you know that you got me\n\n(Black Thought):\nSomebody told me that this planet was small\nWe used to live in the same building on the same floor\nAnd never met before until I'm over seas on tour\nAnd peep this Ethiopian queen from Philly takin' classes abroad\nShe's studyin film and photo, flash, focus, record\nSays she's workin' on a flick and could my click do the score\nShe says she loved my show at Paris at Elys'e Montmartre\nThat I stepped off the stage and took a piece of her heart\nWe knew from the start that things fall apart and tend to shatter\nShe like, that shit don't matter, when I get home get at her\nThrough letter, phone, whatever\nLet's link, let's get together\nShit, you think not? You think that Thought went home and forgot?\nTime passed, now we're back in Philly and she up in my spot\nTellin' me the things I'm tellin' her is makin' her hot\nStarted buildin' with her constantly, 'round the clock\nNow she in my world like hip-hop\nAnd keep tellin' me'\n\n(Erykah Badu):\nIf you were worried 'bout where\nI been or who I saw or\nWhat club I went to with my homies\nBaby, don't worry you know that you got me\n\n(Black Thought)\nYo, I'm the type that's always catchin' a flight\nAnd sometimes I got to be out at the height of the night\nThat's when she flip and get on some\n\n(Eve):\nAnother lonely night?\nSeems like I'm on the side, you only lovin' your mic\nI know you gotta get that paper daddy\nKeep that shit tight\nBut I need some sort of love in my life\nYou dig me?\nWhile politicin' with my sister from New York City\nShe say she know this ball player and he think I'm pretty\nPsyche,\nI'm playin' boo\nYou know its just with you I'm stayin' boo\nWhen cats be poppin' game I don't hear what they sayin' boo\nWhile you're out there in the world, I'm still your girl\nWith all my classes I don't have the time for life's thrills\nSo when you're sweatin' on the stage, think of me when you rhyme\nAnd don't be listenin to your homies, they be leadin you blind\n\n(Black Thought):\nSo what you sayin' I can trust you?\n\n(Eve):\nIs you crazy, you my king, for real.\n\n(Both):\nBut sometimes relationships get ill. No doubt.\n\n(Erykah Badu):\nIf you were worried 'bout where\nI been or who I saw or\nWhat club I went to with my homies\nBaby, don't worry you know that you got me\n\n(Black Thought):\nThe snake could be that chick\nAnd that rat could be that cool cat\nThat's whisperin' 'She tryin' to play you for the fool, Black'\nIf something's on your chest then let it be known\nSee I'm not your every five minutes all on the phone\nAnd on the topic of trust it's just a matter of fact\nThat people bite back and fracture what's intact\nAnd they'll forever be,\nI ain't on some 'Oh I'm a celebrity'\nI deal with the real so if it's artificial let it be\nI seen people caught in love like whirlwinds\nListenin to their squaws and listenin to girlfriends\nThat's exactly the point where they whole world ends\nLies come in and that's where the drama begins\nShe like'\n\n(Erykah Badu):\nIf you were worried 'bout where\nI been or who I saw or\nWhat club I went to with my homies\nBaby, don't worry you know that you got me"}