{"song_id":20661,"song_name":"Life","artist_id":1496746,"display_artist":"K-Ci","spotify_id":"2LuubKHueqlJbx0ylKGFmy","lyrics":"Just like a birdie, (umm) I just wanna fly free. (so High so High)\nAnd own a piece of land, (umm) somewhere, (somewhere, somewhere, somewhere)\nSomewhere, off in the country.\n\n(Oh, Listen)\n\nTemperatures like a hundred degrees, like I got chains on me.\nBlack male in a family of three, been robbed of my destiny.\nWhere can I fly away? 'Cause it's to much for the man.\nShouldn't gone down this way, what happened to my master plan? (oh)\n'Cause I can't figure out, I coulda been a love child.(love child)\nShouldn't gone down this way,\nTell me how did I get Life?\n\nLife life, (oh oh yeah, talk to me) life life, life life, (oh oh, How did I\nGet Life? tell me) life life, life life,\nLife life, life life, life life (oh oh yeah, oh yeah)\n\nOh somebody done done me wrong, done me wrong, eyes to the ceiling all\nNight long.\n(All night long...)\nTime is slippin away from me (away from me). And It ain't no tellin' when I\nGet home (gotta get home yeah).\n\nJust about to see the dollar signs, that close to a piece of mind\nEverything was about to be fine...\nSo tell me so how did I get life?\n\nLife life, (oh oh oh) life life, life life, (tell me, yeah, I wanna know\nNow, now) life life, life life,\nLife life, life life, life life (and you know, and you know, and you know,\nAnd you know)\n\n(Everything), Everything (everything)\nI hoped for (that I hoped for)\nIs gone now, (is gone now)\nBuried in the ground (buried in the ground)\nHopes and dreams (My hopes and Dream)\nAnd all those things (and all those things)\nI never see (I will never, never, never see), Said I'll never see\nSomebody gave me life...\n\nLife life,(yeah, yeah) life life, life life, (yes they did... yeah eh eh eh\nEh eh eh eh yeah, yeah) life life, life life, (oh yeah) Life life, life\nLife, life life (oh you you, oh, oh, oh, oh ooh, oh life somebody gave me\nLife uh uh uh uh uh uh)\n(Say it again say it again yeah)\nLife life, oh wee) life life, life life, (oh oh oh oh) life life, life life,"}