{"song_id":20713,"song_name":"Wild Wild West","artist_id":431377,"display_artist":"Will Smith Featuring Dru Hill","spotify_id":"5AMvBCtX2rspUdoeJ9IsPN","lyrics":"Uh\nWicka wicka wild\nWicka wild wicka wild wicka\n\nWild Wild West, Jim West, desperado, rough rider\nNo you don't want nada\nNone of this, six gunin this, brotha runnin this,\nBuffalo soldier, look it's like I told ya\n\nAny damsel that's in distress\nBe out of that dress when she meet Jim West\nRough neck so go check the law and abide\nWatch your step, reflex and get a hold in your side\nSwallow your pride\n\nDon't let your lip react\nYou don't wanna see my hand where my hip be at\nWith Artemus, from the start of this\nRunnin the game, James West tamin' the west so remember the name\n\nNow who ya gonna call?\nNot the G.B.'s\nNow who you gonna call?\nJ dub n' ag\n\nIf you have a riff with either one of us\nBreak out before you get bum rushed at the (Wild Wild West)\nWhen I roll into the (Wild Wild West)\nWhen I stroll into the (Wild Wild West)\nWhen I bounce into the (Wild Wild West)\nSisqo, Sisqo\n\nWe going straight to the Wild Wild West\nWe going straight to the Wild Wild, c'mon\n\nNow, now, now, now once upon a time in the west\nMad man lost his damn mind in the west\nLoveless, givin' up a dime, nothin' less\nNow I must put his behind to the test (can you feel me)\n\nThen through the shadows in the saddle, ready for battle\nBring all your boys in, here come the poison\nBehind my back, all the riffin' ya did\nFront and center, now where your lip at kid?\n\nWho dat is? A mean brotha, bad for your health\nLookin' damn good though, if I could say it myself\nTold me Loveless is a mad man, but I don't fear that\nHe got mad weapons too, ain't tryin to hear that\n\nTryin' to bring down me, the champion\nWhen y'all clowns gon' see that it can't be done\nUnderstand me son, I'm the slickest they is\nI'm the quickest as they is, did I say I'm the slickest they is?\n\nSo if you barking up the wrong tree we comin'\nDon't be startin' nothin'\nMe and my partner gonna test your chest, Loveless\nCan't stand the heat then get out the Wild Wild West\n\nWe going straight to\nWhen I roll into the (Wild Wild West)\nWhen I stroll into the (Wild Wild West)\nWhen I bounce into the (Wild Wild West)\n\nWe going straight to the Wild Wild West\nWe going straight to the Wild Wild West\n(Can you feel it?)\n\nTo any outlaw tryin' to draw, thinkin' you're bad\nAny draw in West best with a pen and a pad\nDon't even think about it, six gun, weighin' a ton\n10 paces and turn, just for fun, son\n\nUp till sundown, rolling around\nSee where the bad guys are to be found and make 'em lay down\nThe defenders of the west, crushin on pretenders in the west\nDon't mess with us 'cause we're in the (Wild Wild West)\n\nWe going straight to\n(when I roll into the) the Wild Wild West\n(when I stroll into the) We going straight to\n(when I bounce into the) the Wild Wild West (Sisqo, Sisqo)\nWe going straight to\n(when I roll into the) the Wild Wild West\n(when I stroll into the) We going straight to\n(when I bounce into the) the Wild Wild West (Sisqo, Sisqo)\nStraight to the Wild Wild West\nStraight to the Wild Wild West\n\nWhen I roll into the \n(Wild Wild West) When I stroll into the \n(Wild Wild West) When I bounce into the \n(Wild Wild West) Straight to (Sisqo, Sisqo) the\n(Wild Wild West) whoo, uh\n(Wild Wild West) ha ha ha ha\n(Wild Wild West) uh Dru, Dru\n(Wild Wild West) I done done it again y'all done done it again\n(Wild Wild West) ha ha ha ha\n(Wild Wild West) Big Will, Dru Hill, uh\n(Wild Wild West) Big Will, Dru Hill ha ha ha ha\n(Wild Wild West) the Wild Wild West\n(Wild Wild West) uh\n(Wild Wild West) one time\n(Wild Wild West) uh,\n(Wild Wild West) the Wild Wild West bring in the heat, bring in the heat, what?\n(Wild Wild West)\n(Wild Wild West) uh can't stop the bum rush the Wild Wild\n(Wild Wild West)"}