{"song_id":20746,"song_name":"Jigga My N****","artist_id":304305,"display_artist":"Jay-Z","spotify_id":"null","lyrics":"Roc-A-Fella, Ruff Ryders, Swizz Beats\nIt's almost over y'all\nJigga, how real is that?\nUh, uh, uh, lights out niggaz!\n\nChorus: Jay-Z (and Amil)\n\n(Jigga) What's my motherfuckin name?\n(Jigga) And who I'm rollin' with huh?\n(My niggaz) Uh-huh-uh-uh-uh-uh\nNiggaz better get it right, bitches better get it right, WHO?\n(Jigga) What's my motherfuckin name?\n(Jigga) And who I'm rollin' with huh?\n(My niggaz) Uh-huh-uh-uh-uh-uh\nNiggaz better get it right, bitches better get it right\n\n(Jay-Z)\nYeah... yeah...\nFrom the crap tables down in A.C.\nBack on the block Jay-Z motherfucker from the, the, the Roc\nWent solo on that ass but it's still the same\nBrooklyn be the place where I serve them thangs\nB. my niggaz was strugglin, to the 'burbs they came\nAnd then we got to hustlin, murderin thangs\nI dipped in my stash, splurged on a chain\nNow I'm Titanic, Iceberg's the name\nLeave players on injured reserve, hurt the game\nThe best way to describe me in a word, insane\nI dick down chicks all emerged in my fame\nJigga been dope since Slick Rick's first chain\nThe God, send you back to the earth from which you came\nI'm baking soda, waterfire, merged with 'cane\nLadies don't know me said, \"I heard he's vain\"\nWell guess what mami? I heard the same\nYou heard the name\n\n(Jay-Z)\nYeah, uh, I got a\nLicense to kill so I stare at the gat\nRoc-A-Fella, Ruff Ryders, niggaz scared of that\nGot a new motto this year, \"Don't Fuck With My Ones\"\nKnock on your door, three in the mornin,\n\"It's just us and the guns!\"\nSee I scrambled with priests, hustle with nuns\nI got the, mind capacity of a young Butch Cassidy\nNiggaz get fly, let 'em defy gravity\nFo'-five rapidly lift your chest cavity\nStreets won't let me chill\nAlways been a clumsy nigga, don't let me spill\nMuh'fuckers wanna wet me still, I remain y'all\nMore than one, like five divided by four\nShit, this just the hate that's been provided by y'all\nReciprocated and multiplied by more\nYou likely to see Jigga in a widebody or\nDrop-top Bentley Azure, holla at me y'all\nUh\n\n(Jay-Z)\nI don't give a fuck\nIf I sold one or one million, but I think you should\n'Cause if I only sold one, then out comes the hood\nAll black in the club, the outcome ain't good\nThem niggaz act like wolves, how come? They could\n'Cause we don't drop hits, we drop bombs that smash\nTill the wrists is lit up, the arm looks like glass\nThe necklace chipped up, the charm it flash\nCould fuck up your eyes like the bombest hash\nSee the reason why chicks let me palm they ass\nAll I gotta do is let 'em call me Shawn they glad\nLet me sit up in they whip till I launch it back\nSnap they neck, then shoot 'em till they arch them back\nThe calmest cat, trust me when I palm this gat\nKill your mind, body and soul, push your conscience back\nMonster's back, and Flex drop a bomb to that\nAnd e'rybody sing-a-long to the track, c'mon\nUh-huh uh uh\n\nChorus: Jay-Z (and Amil)\n\n(Jigga) What's my motherfuckin name?\n(Jigga) And who I'm rollin' with huh?\n(My niggaz) Uh-huh-uh-uh-uh-uh\nNiggaz better get it right, bitches better get it right, WHO?\n(Jigga) What's my motherfuckin name?\n(Jigga) And who I'm rollin' with huh?\n(My niggaz) Uh-huh-uh-uh-uh-uh\nNiggaz better get it right, bitches better get it right, WHO?\n(Jigga) What's my motherfuckin name?\n(Jigga) And who I'm rollin' with huh?\n(My niggaz) Uh-huh-uh-uh-uh-uh\nNiggaz better get it right, bitches better get it right, WHO?\n(Jigga) What's my motherfuckin name?\n(Jigga) And who I'm rollin' with huh?\n(My niggaz) Uh-huh-uh-uh-uh-uh\nNiggaz better get it right, bitches better get it right...\n(Jigga) ..."}