{"song_id":20824,"song_name":"Satisfy You","artist_id":355143,"display_artist":"Puff Daddy Featuring R. Kelly","spotify_id":"00FROhC5g4iJdax5US8jRr","lyrics":"(Puffy)\nAll I want is somebody who's gonna love me for me\nSomebody I can love for them\nAll this money don't mean shit\nIf you ain't got nobody to share it with\nLove rules the world, you feel me\n\n(R. Kelly)\nHe don't understand you like I do\nNo he'll never make love to you like I do\nSo give it to me\n'Cause I can show you 'bout a real love\nAnd I can promise anything that I do\nIs just to satisfy you\n\n(Puffy)\nWhen it hurt I ease the pain girl, caress your frame\nGet them worries off your brain girl, I'm in your corner\nDo what you want, it's your thing girl, opposites attract but\nWe one and the same girl, it ain't a game\nSo I can't play witchu, I wanna lay witchu\nStay witchu, pray witchu, grow old and gray witchu\nIn good and bad times, we'll always make it through\n'Cause what we got is true, no matter what they say to you\nI could straight lace you, not just appearance\nStimulate your mind, strengthen your spirits\nBe that voice of reason when you ain't tryna hear it\nYou want it but you fear it, but you love it when you near it\nSit her on the sofa, get a little closer\nTouch you right, do it like a man's suppose to\nKnew you was the one, that's why I chose you\n'Cause you get down for yours and ride like a soldier\n\n(R. Kelly)\nHe don't understand you like I do\nNo he'll never make love to you like I do\nSo give it to me\n'Cause I can show you 'bout a real love\nAnd I can promise anything that I do\nIs just to satisfy you\n\n(Puffy)\nYour soul ain't a toy, you ain't dealin' with a boy\nFeel emptiness inside? I can fill that void\nWhen you spend time with your woman and listen\nIt shines more than any bagguette diamond can glisten\nI can't impress you with the cars and the wealth\n'Cause any woman with will and drive can get it herself\nI'd rather show you it's heartfelt, make your heart melt\nAnd prove to you you're more important than anything else\nWorthwhile, special like my first child\nWhen I see your face it's always like the first time\nOur eyes met, I knew we'd be together in a tri jet\nI wanna give you things that I didn't buy yet\nHold you, mold you, don't know, let me show you\nAin't no tellin' what we could grow to\nLet it be known, I told you\nAnd I'mma be there for whatever you go through, my love's true\n\n(R. Kelly)\nHe don't understand you like I do\nNo he'll never make love to you like I do\nSo give it to me\n'Cause I can show you 'bout a real love\nAnd I can promise anything that I do\nIs just to satisfy you\n\n(R. Kelly II)\nDon't let him sing you a sad song (No baby)\nWaiting for love like this too long\n(You don't have to wait, you don't have to wait on him, baby)\nAll that you need I can give you\n(You don't have to wait, you don't have to wait on)\nI do, satisfy you\n(You don't have to wait on him)\n\n(Puffy)\nI'm that light when you can't see\nI'm that air when you can't breathe\nI'm that feeling when you can't leave\nSome doubt, some believe, some lie, cheat, and deceive\nSo it's only you and me\nWhen you weak, I'll make you strong, here's where you belong\nI ain't perfect, but I promise I won't do you wrong\nKeep you away from harm, my love is protected\nI'll wrap you in my arms so you'll never feel neglected\nI'll just make you aware of what we have is rare In the moment of despair\nI'm the courage when you're scared\nLoyal, down for you, soon as I saw you\nWanted to be there 'cause I could hold it down for you\nBe around for you, plant seeds in the soil\nMake love all night, bending bed coils\nYou're a queen, therefore I treat you royal\nThis is all for you, 'cause I simply adore you\n\n(R. Kelly)\nHe don't understand you like I do\nNo he'll never make love to you like I do\nSo give it to me\n'Cause I can show you 'bout a real love\nAnd I can promise anything that I do\nIs just to satisfy you\n\n(Puffy)\nThis one right here goes out to all my sisters"}