{"song_id":20820,"song_name":"I Want It All","artist_id":277837,"display_artist":"Warren G Featuring Mack 10","spotify_id":"7GFytG8skEsUMTtNcqCxx7","lyrics":"(Warren G)\nWhat's up?\nThis Warren G chillin' with the home boy Mack 10\nWe gon' lay a lil' sumpin' down for y'all\nLet y'all know what time it is\nShow you how we keepin' it real wit' it\nYou know, 'cause this world is built on material thangs\nBut we ain't trippin' off that\nWe want y'all to know this, check it\n\n(Chorus- Warren G)\nI want it all; money, fast cars\nDiamond rings, gold chains and champagne\nShit, every damn thing\nI want it all; houses, expenses\nMy own business, a truck, heep, and a couple a Benz's\nI want it all; brand new socks and drawers\nAnd I'm ballin every time I stop and talk to y'all\nI want it all, all, all, all\nI want it all, all, all, all, all\n\n(Warren G)\nThey say, 'There go Warren G with that envious stare'\nI love this game too much, I wish these haters wasn't here\nIt's a shame, we came too far to turn back\nIt's a cold world, it gets so hard, you learned that\nWon't fall tryin' to walk from crawl\nTryin' to hustle up from broke to ballin'\nAnd, yeah, y'all in effect that's all me\nThe jiggy G-Z, all my niggas that keep it real and do it easy\nBelieve me, young nigga, gettin' fat meat is greazy\nAnd bitches stank, 'So what?' you reply, they can hear the bank\nGet away, or get gappled, the very next day\nDon't cry, hold your head up high\nAnd remember what you told yourself, nigga\nI said remember what you told yourself, nigga\nI said remember what you told yourself, nigga\nI said remember what you told yourself, nigga\n\n(Mack 10)\nI want it all, so I got to wake up and ball\nAnd thanks to y'all, I got plaques on the wall\nMack 10 laced with the know how to paper chase\nCrushed ice, throw my Rollie face in the platinum fan base\nFrom net workin' and hustlin', no doubt, I got slout\nAnd live the lifestyle that Robin Leash talkin' about\nSlow down, player, don't hate 'cause you can't relate\nThe Bently Coupes and kickin' gears on Harley's with the straights\nI got more lime light than Vegas on cable\nWilling and able to shoot, seen nervios at the craps table\nAnd while you can't get off the ground, I'm getting high\nMy nigga fly and fly, with desire to build an empire\nI strapped up and took flight like a missile\nTold them loud and clear as a whistle 'Hoo Bangin' is official'\nHanding out Roman diamonds at roll-call\nI'ma ball and never fall 'cause Mack 10 want it all\n\n(Warren G)\nMe and 10 get paid escapade to the spot\nWe hots like rocks served on hot blocks\nI notice money make the world circulate\nSo we gon' stack and stack and take a sip in ?Perkle Lake?\nBump, let the woofers sub (sub), show the homies love (love)\nWarren to the G (G), and Little G-Dub (Dub)\nSurface on the low, slide or don't slide at all\nRide or don't ride at all\nHa ha\n\n(Mack 10)\nWarren, I couldn't be more serious about my 'fetti\nI stay tight on the mic and keep the pen movin' steady\nI want it all, dawg, and it might be greed\nI hate to trip, but I got two little mouths to feed\nThey don't know nuttin' about no excuses and disrespect\nOr somebody bein' zig with they Daddy's royalty check\nAnd at that point, I'm through talkin', dawg, enough said\nSo, if you owe Mack money, then I suggest you break bread\n\n(Warren G) (Mack 10)\nMack 10 What up? I know\nThe paper's out there, ha ha Yeah, Warren G\nWhat up? You know\nThe paper's out there, ha ha Yeah\nG Funk What up? You know\nThe paper's out there, ha ha That's right\nWhat? Hoo Bangin' What up? We know\nThe paper's out there, ha ha That's right, what?\nThe whole world\nPaper's out there Speak on it\nHa ha\nAll the hood\nPaper's out there"}