{"song_id":20847,"song_name":"Got Your Money","artist_id":277100,"display_artist":"Ol  Dirty Bastard Featuring Kelis","spotify_id":"5fsjS6L83RSJBqRJKL0BTY","lyrics":"Oh Baby\nI dedicate this to all the pretty girls\nTo all the pretty girls... to oh...\nAll the pretty girl in the world\nAnd the ugly girls too\nBut to me your pretty anyway baby.\n\nYou give me your number\nI call you up\nYou act like your pussy don't interrupt\nI don't have no trouble with you fuckin' me\nBut I have a little problem with you not fuckin' me\nBaby you know I'm a take care of you\nCause you say you got my baby & I know it ain't true.\nIs it a good thing?? No, it's bad bitch\nFor good or worse, makes you switch\nSo I walk on over with my Cristal\nBitch ass niggas put away your pistols\nDirty won't be havin' it in this house\nCause bitch I'll cripple your style\nNow that you heard my calmin' voice\nCouldn't get another nigga, hoochie won't get moist\nIf you want to look good and not be bummy\nGirl you better give me that money.\n\nHey, dirty, baby I Got Your Money\nDon't you worry\nI said hey, baby I Got Your Money.\n\nYo, so I glanced at the girl girl glanced at me\nI whispered in her ear \"You wanna be with me?\"\nYou want to look pretty though in my video\nOl' Dirty on the hat & I let you all know\nJust dance like your caught up in the Holy Ghost trance\nIf you stop, I'm a put the killer ants in your pants\nI'm the ODB as you can see\nFBI, don't you be watchin' me\nI don't want no problem 'cause I'll put you down\nIn the ground where you can not be found\nI'm just Dirt Dog tryin' to make some money\nSo give me my streaks and give me my honey\nRadio's play this all day every day\nRecognize I'm a fool and you lovin' me\nNone of you, nuh, better look at me funny\nNuh, you know my name now give me my money.\n\nCHROUS x2\n\nSing it\nSing it girls...\nJust shake it right now!\nIf Dirty want his money I think y'all should give him his money\nThat's how I like girl\nSexy, sexy, sexy,\nSexy, sexy, sexy\nSexy, sexy, sexy\nSexy, sexy, sexy.\n\nYo, yo, nigga playin' in the club like this all night\nBitches put your ass out and let me hold it tight\nYou lookin' at my wrist sayin' \"It's so nice!\"\nThe price fits the diamonds, shinin' in disco lights\nYou better help me solve my problem\nOr I'm a get this money and rob them\nLucky dog when I won the lotto\nRan up my cards for carryin' raw loads\nWell hold on now you can call me Dirty\nAnd then lift up your skirt\nAnd if you want some of this dirty\nGod made dirt and dirt bust your ass\nStop annoying me, yeah I play my music loud\nTake the bastard Old Dirty to move the crowd\nThey said he had his dick in his mouth\nEddie Murphy taught me that back at the house\nNow give me my money.\n\nCHORUS repeats fading out"}