{"song_id":20857,"song_name":"4, 5, 6","artist_id":279767,"display_artist":"Sole Featuring JT Money","spotify_id":"3SsO5zbbDfcU95HD0ygg7c","lyrics":"(Jt money)\nYo, what's up?\nWhat's up baby?\nDis yo nigga\n(Sole')\nNigga, where da fuck you at?\n(Jt money)\nMr. good dick, what you say?\n(Sole')\nI said where da fuck you at?!\n(Jt money)\nWhat how you feel?\nHow you say you feel?\n(Sole')\nI feel like you need to get home before yo shit be outside\n(Jt money)\nYou say you daddy to come through and regulate?\nWhat? put his thang down, what? it's all good\n\n(Sole')\nIt could be 4, 5 or 6, you bet' not be nowhere laid up wit no bitch\nYou betta bring that home to momma, don't be playin' and shit\nIf you get horny when you out, no need for eyein' them hoes\nWhy eat a burger when you got steak and potatoes at home?\nA short drive is all it takes, I'm just a phone call away\nAin't no excuses mutha fucka for you runnin' astray\nI give it to you when you want it ain't no other's like mine\nYo ex-bitch can't fuck with this, so don't be wastin' yo time\nThe Indian, black mix, boy like I told you before\nAnd we can ay yi yi the fur rug on my living room floor\nAnd ain't nan hoe gon' bring it like you know I'mma bring it\nAnd ain't nan hoe gon' freak it like you know I'mma freak it\nAnd ain't nan hoe gon' shake it like you know I'mma shake it\nAnd ain't nan hoe gon' take it like you know I'mma take it\nSo don't make me come lookin' for you, pull you outta some mix\nThen turn around and bust you in yo shit for 4, 5 or 6\n\n1 - (kandi)\nI don't care if it's 4, 5, 6, 7, 8 in the morning\nBoy you better call me when you think you gettin' horny\nI don't give a damn bout who you with\nJust as long as you ain't givin' up my shit\n\nRepeat 1\n\n\n\n(Jt money)\nYou know me as your player, your pipe layer, your all night stayer\nAll up in your sauce when you need your rocks off\nKnock your socks off, baby off the chain in this bitch\nHave your wide ass open while I'm slangin' this dick\nGot you lovin' this shit, suckin and fuckin' this dick\nWanna go and make some bucks for this dick\nFightin' all in the club for this dick\nI'm that player that you chose\nLong as you satisfied, baby fuck them other hoes\nJust keep my pussy horny so you can put it on me\nGirl you know I'm the only one who can satisfy your monkey\nAin't nobody gon' do you like I do when I put this love stick inside you\nMoney man guaranteed to satisfy you\nHave you open all night like a drive-through\nSo bring yo thang on so I can get my bang on\nI hope you likes a good fuck because my game strong\nAnd I ain't lyin' girl you wouldn't if you could quit\nI signs my name on that pussy, mr. good dick\nThat's my shit\n\nRepeat 1\nRepeat 1\n\n(Sole')\nNow nigga what you gone do, ugh, let me put this good lovin' on you\nWe can do everything that you want to\n'Cause I like it real freaky, nigga don't you\nThat's right, don't make no promises\nCan't find none better than mommas is\nStay wet, stay tight, keep you comin' back\nGo all night feelin' right, you be lovin' that\nHell yeah, like wanna make enough moves\nFuckin' you boy like I got something to prove\nRunnin' loose, fuck it nigga gotta pay dues\nMake you wanna tell ya boys all about whose\nNo talkin' now, come get the good shit\nMake you never wanna fuck another hood bitch\nHave ya breakin' off plans to come and lay me\nMutha fucka, don't ever try and play me\n\nRepeat 1 to fade"}