{"song_id":20867,"song_name":"Step To This","artist_id":"null","display_artist":"Master P Featuring D.I.G.","spotify_id":"null","lyrics":"(D.I.G.)\nWhassup man?\nI think you need to back up off me brah\nCause right now, I'm not feelin' too good\nAnd I have a attitude problem\nYou might push that button to strike that nerve\nSo you need to just go 'head on and back up\n\n(Master P)\nWhich one of you wenches scratched my 600??!\n\nY'all don't wanna step to dis, hah, whut? (repeat 4X)\n\n(Master P)\nI used to check domes, now it's platinum over chrome\nSurveillance in my home, but they still tappin my phone\nSee I'm the thug of the century\n'Cause I done laid it down\nFrom the streets to overseas to penitentiary\nWe got beef, diss 3rd Ward and get the soldiers\nI represent the 3rd Ward Callio' I thought I told ya\nSee the eyes of the tiger in my blood\nAsk TLC, am I a motherfuckin scrub?\nWe attack from the back whether it's a Jag or some cat\nI'm all about my scratch -- you get that? (hahah)\nSee nuttin don't last forever\nBut Only God Can Judge Me, 'cause I'm down to do whatever\n\nY'all don't wanna step to dis, hah, whut? (repeat 4X)\n\n(Master P)\nSoldiers make some noise (HOODY HOO) whassup, where you at?\nAll my thugs in the front and all my thugs in the back\nSee I'm a soldier for life and that's real I keep it trill\nBody full of tattoos and a motherfuckin gold grill\nI like my Henn and my trees 'cause I'm a baller\nCan I really hoop? Fool, ask Vince Carter\nSix million on top, now y'all suckers pop\nWhen I close down shop, don't make me get the glock\nFrom the South to the East, give it up\nAnd from the West to the North we bout to tear the fuckin' club up\n(UNNNNNNNNGGGH) Lotta players wanna serve me\n'Cause I'm the ghetto Bill Gates but I'm legit, ya heard me??\n\nY'all don't wanna step to dis, hah, whut? (repeat 4X)\n\n(D.I.G.)\nHere come dem boys out the bricks, a-lil-daddy whassup\nYou say you bout trigger play, now show me that you a thug\nI ain't wit that mouthin off, I'm out spillin your blood\nMess around if you wanna box, gon' stay in the mud\nNo Limit soldiers known for bustin' it up\nBetter tell him it's real, we be tossin it up\nSo if you step to these soldiers I think you better show some love\n'Cause we 99 strong, and we nuttin but thugs\nAnd pistols bein cocked at all times\nAnd when you run up you gon' fall down\n'Cause I'ma hit you with the heat and make you calm down\nYou ain't ready to go to war with a real soldier\nSo don't step to me fool, cause the game is over\n\nY'all don't wanna step to dis, hah, whut? (repeat 8X)"}