{"song_id":20889,"song_name":"Tha Block Is Hot","artist_id":307264,"display_artist":"Lil  Wayne Featuring Juvenile","spotify_id":"6wCbHb0QEEdka3ymfImn4l","lyrics":"Wha wha, wha wha, wha wha, wha wha, what\n\nStraight off the black gold, nuts in my hand, trustin' no man\nGot my glock cocked, runnin' this thing, ya understand\nWe be steamin'.. blazin'.. nines, pumps, and K's, and\nHolly Grove 17th, (what) the hood where I (what) was raised in (what)\nNiggas bustin' heads and, runnin' duckin' Feds and\nRocks under they tongues and, ki's under they beds and\nHood fulla real niggas, twenty-four seven hustlers\nEh, until we shove a barrel down your pipe suckers\nAin't no love for no busta, no fear for no coward\nNo respect from no stunt, and no money without power\nWe keepin' niggas hotter, ewww nasty and sour\nPile up in the Eddie Bauer and BLAKA at every hour\nSome niggas like that powder, foldin' up what they drain\nSome like that weed or that dope and some shoot it up in they veins (oh)\nFrom the home of that 'caine, jackin' and crackin' brains\nBroadcastin' live from tha Block it's Lil Wayne (who it is?)\n\nJuve: Nigga you got that yayo?\nB.G.: Well cook something nigga\nJuve: Nigga you let them K's go?\nB.G.: Well bust somethin' nigga\nJuve: Are you duckin' that law?\nB.G.: You better run from 'em nigga\nJuve: Are you playin' with that raw?\nB.G.: Well won't you front somethin' nigga\n(Wayne) Tha block is hot, tha block is hot ha, ha-ha\nTha block is hot, tha block is hot ha, ha-ha\nTha block is hot, tha block is hot ha, ha-ha\nTha block is hot, tha block is hot ha...\n\nSee where I'm from we keep our guns out\nDodgin' cops and burnin' blocks, so we be thugged out\nIt's time to floss, bring the big bodies on dubs out\nAnd they got quarters, halfs, and birds in that one house (I got it)\n(I got it) It's all good in the hood but a lot illegal\nSoon as you get it, hot skirt, there go them people\nBreak up the block and hit the cut by the corner sto'\nEnd up in Miss Taylor backyard, be quiet, she on the porch\nThis everyday, at the spot where niggas murder off top, boy\nIt's the spot where they got Fire Girls and Hot, Boys\n\nWe don't know what be goin' 'cause we so blunted from trees\nAnd we'll be 'round you all day till we \"400 Degreez\"\nAnd you see where niggas go, nobody be on the pulpit\nThey got a nigga got on a scarf, he flippin' out off that raw\nBetta stay in yo' car, and make sure (beep beep) your door is locked\nCause this ain't nothing proper, cause Tha Block, is just Hot\n\nJuve: Nigga you got that yayo?\nB.G.: Well cook something nigga\nJuve: Nigga you let them K's go?\nB.G.: Well bust something nigga\nJuve: Are you duckin' that law?\nB.G.: You better run from 'em nigga\nJuve: Are you playin' with that raw?\nB.G.: Well won't you front something nigga\n(Wayne) Tha block is hot, tha block is hot ha, ha-ha\nTha block is hot, tha block is hot ha, ha-ha\nTha block is hot, Tha block is hot ha, ha-ha\nTha block is hot, Tha block is hot ha...\n\nSee watch your step on my set, gotta walk like, talk like\nWe done shot out all the street lights\nSo you can't see who we be like\nAnd we like, to dress in all black up in my residence\nAin't got on no suits, 'cause we ain't tryin' to be presidents\nAnd ever since the coke drought, niggas been on a trip y'all\nSo you better watch what y'all playin' wit\nCause a nigga will try to flip y'all\nThey hit y'all, jam you up and put a gun to your jug\nHah, catch your breath, now shhhhh, catch a slug\nIt's street smarts, plenty niggas that keep spots\nWhen the heat starts, ain't nobody got sweethearts\nCallin' weak shots, you could come try to cheap talk\nWe cut your week short, them lil' boys don't give a damn\nGo all out for that cake, won't hesitate to kill a man\nRun in his house and kidnap the nigga, him and his fam\nTie 'em up put 'em in the vans, then put a gat in his jaws\n... Tch, one move blow his cactuses off\n\nJuve: Nigga you got that yayo?\nB.G.: Well cook something nigga\nJuve: Nigga you let them K's go?\nB.G.: Well bust somethin' nigga\nJuve: Are you duckin' that law?\nB.G.: You better run from 'em nigga\nJuve: Are you playin' with that raw?\nB.G.: Well won't you front somethin' nigga\n(Wayne) Tha block is hot, tha block is hot ha, ha-ha\nTha block is hot, tha block is hot ha, ha-ha\nTha block is hot, tha block is hot ha, ha-ha\nTha block is hot, tha block is hot ha...\n\nWhoot! Some people call me 'cause tha block is hot\nShk-a-blaow! Bust ya guns 'cause tha block is hot\nNigga chshhhhh, cook it up, 'cause tha block is hot\nSay look Daddy, just hook it up, 'cause tha block is hot\nNigga whoot! Some people call me 'cause tha block is hot\nShk-a-blaow! Bust ya guns 'cause tha block is hot\nNigga chshhhhh, cook it up, 'cause tha block is hot\nSay look Daddy, just hook it up, 'cause tha block is hot\nNigga my block hot, nigga my block burn\nMy block on fire, nigga what about yours?\nNigga my block hot, nigga my block burn\nMy block on fire, nigga what about yours?\nThe block is hot ha ha ha ha"}