{"song_id":20905,"song_name":"Left & Right","artist_id":275903,"display_artist":"D'Angelo Featuring Method Man And Redman","spotify_id":"0nElzVRcJKKeC1RueSm60W","lyrics":"Yo, yo, yo, yo, yo, yo, yo, yo, yo\n\nMy flows remarkable, Doc walk like Kane\nFrom Kung Fu 'round the globe\nThrow obstacles, I'll hurdle them\nHerb and whack MC's\nDrum racks to the rims, to the caps\n\nYo Meth, Tical and D, I'm ASAP\nI'm crack a don chicken hunting at KFC\nIn '83, I was that scrub TLC talking 'bout\nNow I rock the house, chalk 'em out\n\nYeah, no doubt who gots the biggest ass in the house?\nYoung miss fillet a fish, salt water trout\nPretty young thing got a tongue ring and dirty mouth\nAnd she whispering them sweet nothings\nI hear it out, I hear it out\n\nBaby you got me like Joni had Cha Chi\nUntil she got high and went and fucked Potsi\nLady Godiva, from day one a dick rider\nLiar, liar set your pussy on fire\n\nI see you dancing right now\nI don't need to tell you that you know how\nBaby, you do, I say you belong\nAnd if you dream, you'd be free\nI can take you there just follow me\nBaby I won't, I won't steer you wrong\n\nAnd it seems like to me\nYou want someone to treat you like their queen\nBabe, I do, so what'cha want?\nSmack your ass, pull your hair\nAnd I even kiss you way down there\nYou know, I will, think I won't?\n\nThat's the way we do it, left and right\nKeep it moving, up and down\nHow we do it, babe, left and right\nKeep it moving, up and down\n\nSo what'cha doing? Left and right\nI love it went you do it, up and down\nLove it went you do it left and right\nKeep doing it babe, yeah\n\nLeft and right and up and down\nHey yo, D how we do it\nLeft and right and up and down\nYo D, how we do it\n\nLeft and right and up and down\nFunk Doc, how we do it\nLeft and right and up and down\nYo Stallion, this is how we do it\n\nYeah, I hear you calling my world\nMake you feel like a pearl\nI'll rub your back and fulfill your needs\nSo I would suggest you get undressed\nFingertips touching and you'll come back\nAs I want, why don't you give it to me?\n\nI will have you believe\nThere's no reason for you to leave\nStay right here, stay right here\nIn my arms, in my arms\n\nBring you fears stay secure\nHere with me you can be sure\nThere's no faking, you turn me on\nThat's the way we do it\n\nLeft and right, up and down\nYou keep it moving\nLeft and right, up and down\nYeah, she's moving, oh yeah\n\nLeft and right, up and down\nLove it when you do it\nDon't stop, left and right\nJust keep doing it, baby\n\nLeft and right and up and down\nHey yo, D, how we do it\nLeft and Right and up and down\nYo D, how we do it\n\nLeft and Right and up and down\nFunk Doc how we do it\nLeft and Right and up and down\nYo Stallion, this is how we do it\n\nWhy don't you know?\nThe sexy little things you do\nThe sexy little things you do\nWhy don't you know?\nThe sexy little things you do\n\nYo Doc, be off the wall, we keep a Marley cheap\nPulling a Harley deep with a jar of grease\nCome 151, straight endo, the spot\nI fuck brown sugar behind the fiber glass window\nIt's Doc, pack guns, don't sling weight\nThe only thing I sling is condoms for spring break\n\nFuck 'em, how we do it?\nLeave 'em, how we do it?\nGet the money, the pussy\nThe weed, now do it\n\nNow take your coat off and stay a while\nNow honey child, if you're gon' be acting funny style\nThen I don't need ya\nIt's Saturday, this night fever\n\nShit is popping, Acheeva my mouth cotton\nTis the season for draws dropping and heavy breathing\nYou ain't skeezin', you dick teasin', I'm leavin'\nActing rotten, I got no time for games, I'm no joke\nDrop that ass when I'm finished and watch it smoke\nYeah, yeah, yeah"}