{"song_id":20924,"song_name":"Love Is Blind","artist_id":301945,"display_artist":"Eve Featuring Faith Evans","spotify_id":"6aLVv2NbwkBGxcaVTlMXXC","lyrics":"Hey, yo I don't even know you and I hate you\nSee all I know is that my girlfriend used to date you\nHow would you feel if she held you down and raped you?\nTried and tried, but she never could escape you\nShe was in love and I'd ask her how? I mean why?\nWhat kind of love from a nigga would black your eye?\nWhat kind of love from a nigga every night make you cry?\nWhat kind of love from a nigga make you wish he would die?\nI mean shit he bought you things and gave you diamond rings\nBut them things wasn't worth none of the pain that he'd bring\nAnd you stayed, what made you fall for him?\nThat nigga had the power to make you crawl for him\nI thought you was a doctor be on call for him\nSmacked you down 'cause he said you was too tall for him, huh?\nThat wasn't love, babygirl you was dreamin'\nI coulda killed you when you said your seed was growin' from his semen\n\n1 - Love is blind\nAnd It'll take over your mind\nWhat you think is love is truly not\nYou need to elevate and find\n\nI don't even know you and I'd kill you myself\nYou played with her like a doll and put her back on the shelf\nWouldn't let her go to school and better herself\nShe had a baby by yo\nAss and you ain't giving no help\nUh-huh big time hustler, snake mothafucka\nOne's born everyday and everyday she was your sucka\nHow could you beat the motha of your kids?\nHow could you tell her that you love her?\nDon't give a fuck if she lived\nShe told me she would leave you, I admit it she did\nBut came back, made up a lie about you missing your kids\nSweet kisses, baby ain't even know she was your mistress\nHad to deal with fist fights and phone calls from your bitches\nLost like, you possessed her, tellin' me to mind my business\nThat it was her life and stay the fuck out of it\nI tried and said just for him I'll keep a ready clip\n\nI don't even know you when I want you dead\nDon't know yo facts but I saw the blood pour from her head\nSee I laid down beside her in the hospital bed\nAnd about two hours later, doctor said she was dead\nHad the nerve to show up at her mother's house the next day\nTo come and pay your respects and help the family pray\nEven knelt down on one knee and let a tear drop\nAnd before you had a chance to get up\nYou heard my gun cock\nPrayin' to me now, I ain't God but I pretend\nI ain't start your life but nigga I'm a bring it to an end\nAnd I did, clear shots and no regrets never\nCops come and lock me under da jail\nNigga wheneva my bitch, fuck that my sister\nYou could never figure out even if I let you live\nWhat our love was all about\nI consider her my blood and it ain't come no thicka\n\nRepeat 1 till end"}