{"song_id":20954,"song_name":"Best Friend","artist_id":"null","display_artist":"Puff Daddy Featuring Mario Winans","spotify_id":"7Gfzoer3tsu6AVTce0TwSM","lyrics":"I've seen a lot of things in my life\nA lot of ups and downs\nMade a lot of mistakes\nNo matter what you've always been by my side\nYou've always been my best friend\n\nYou're the love of my life\nYou're everything to me\nYou've never left my side\nI love you so much\nYou're my best friend\n\nSince the beginning of time, all you did was bless me\nToo young to understand but now you my best friend\nHow could they doubt you, never think about you\nDon't they know nothing's possible without you?\nFaith without fear, that's how they raised me\nWords of man kill but never phase me\nGrateful for wisdom that you gave me\nBut still I'm like: \"Dear God, I wonder, could you save me?\"\nToo much sinning, gotta be more than plush living\nGotta be more than grabbing nines to buck tin in\nGotta be more than just to lust women\nGotta be more than platinum Rolexes, 600's and crushed linen\nPraise your name, I know some of them hate to do\nJudgment day, don't they know they can't escape your crew?\nI'm just trying to live right and pray you take me through\nAnd with this song, I dedicate to you\nMy Lord\n\nLord, you mean the world to me\nBefore I was born, you chose me\nYou always hear me when I'm calling\nEven catch me when I'm falling\nYou're the closest one to me\nI surrender all to thee\nI want the whole wide world to see\nThat we've always been and we'll always be\nBest friends\n\nSometimes I reminisce and wonder how I made it this far\nBecause of you, I'm me, so you the real star\nYour hindsight, the time's right to get my mind tight\nThen give it to you and let it shine bright\nMy best friend only know how to teach the truth\nPlant the seeds of life and let them eat the fruit\nCan't you see that He spread love for you\nShed blood for you, cry for, and die for you\nWillies with Mac millies know how you get down\nWe know the drama you bring whenever you hit town\nJust remember when you pray, God is love\nGracious, merciful, forgive even the hardest thugs\nLife as we know it, it all begins with Him\nLife as we know it, it all ends with Him\nIf I was you I would never try to pretend with Him\nHe might spazz and blow it, I'm best friends with him\n\nBeen two and a half years, since my man Big passed\nBeen two and a half years, since my world crashed\nI needed help, God gave me the power\nGave me the strength to go face to face with my darkest hour\nLooked me in the eyes and ask \"What you doing unhappy?\"\n\"Don't you know why I'm here?\" and started shooting at me\nBack to the wall, is my faith gonna play out\nNever wavered once, gave me no way out\nYour time to die don't even stress the date\nYou're coming with me your soul I'm next to take\nI told him \"I'm too much blessed with faith\"\n\"And living for Christ\" and then he said \"Manifest the great\"\nAll of a sudden, what I'm remembering\nGround started to shake, everything trembling\nThe power of the truth was shooting through my Timberlands\nHere was my Lord Jesus Christ, my best friend again, come on\n\n(Said Over Chorus)\nYou mean everything to me\nYou've been with me from day one\nEven when I thought nobody was there\nYou were there\nYou're my best friend\nI love you like no other\nThere is no feeling like this in the world\nIf you can relate to what I'm feeling\nPut your hands in the air for me\nLet me see you\nNaw, matter of fact, clap your hands for me\nClap your hands, come on\nThank you Jesus\nYou always hear me when I'm calling\nAlways catch me when I fall, yeah\nI surrender all to thee\nI want the whole world to see\nThat you've always been, you'll always be\nMy best friend\nI love you Jesus\nThank you, forgive me for my tresspasses\nAs I forgive those who tresspass against me\nThank you!"}