{"song_id":21055,"song_name":"The Next Episode","artist_id":301270,"display_artist":"Dr. Dre Featuring Snoop Dogg","spotify_id":"4LwU4Vp6od3Sb08CsP99GC","lyrics":"Snoop Dogg and Kurupt:\nDa da da da da\nIt's the motherfuckin' D-O-double-G (Snoop Dogg)\nDa da da da da\nYou know I'm mobbin' with the D.R.E.\n(Yeah, yeah, yeah)\n(You know who's back up in this motherfucker) What, what, what, what?\n(So blaze the weed up then) Blaze it up, blaze it up\n(Blaze that shit up, nigga, yeah, 'sup Snoop?)\n\nSnoop Dogg:\nTop Dogg, bite 'em all, nigga, burn that shit up\nD-P-G-C, my nigga, turn that shit up\nC-P-T, L-B-C, yeah, we hookin' back up\nAnd when they bang this in the club, baby, you got to get up\nThug niggas, drug dealers, yeah, they givin' it up\nLowlife, yo' life, boy we livin' it up\nTakin' chances while we dancin' in the party fo' sho'\nSlip my hoe a 44 when she got in the back do'\nBitches lookin' at me strange but you know I don't care\nStep up in this motherfucker just a-swingin' my hair\nBitch quit talkin', crip-walk if you're down with the set\nTake a bullet with some dick and take this dope on this jet\nOut o' town, put it down for the father of rap\nAnd if yo' ass get cracked, bitch shut your trap\nCome back, get back, that's the part of success\nIf you believe in the S, you'll be relievin' your stress\n\nDr. Dre, Snoop Dogg, and Kurupt:\n(Da da da da da)\nIt's the motherfuckin' D.R.E. (Dr. Dre, motherfucker)\n(Da da da da da)\nYou know I'm mobbin' with the D-O-double-G\n\nDr. Dre:\nStraight off the fuckin' streets of C-P-T\nKing of the beats, you ride to 'em in your Fleet (Fleetwood)\nWood Coupe DeVille rollin' on dubs\nHow you feel, whoopty-whoop, nigga what?\nDre and Snoop chronic'd out in the 'lac (In the 'lac)\nWith Doc in the back, sippin' on 'gnac (Yeah)\nClip in the strap, dippin' through hoods (What hoods?)\nCompton, Long Beach, Inglewood\nSouth Central out to the Westside (Westside)\nIt's California Love, this California bud got a nigga gang o' pub\nI'm on one, I might bail up in the Century Club\nWith my jeans on and my team strong\nGet my drink on and my smoke on\nThen go home with somethin' to poke on (What's up bitch?)\nLoc', it's on for the two-triple-oh\nComin' real, it's the next episode\n\nNate Dogg:\nHold up\nHey, for my niggas who be thinkin' we soft\nWe don't play, we gon' rock it till the wheels fall off\nHold up\nHey, for my niggas who be actin' too bold\nTake a seat, hope you ready for the next episode\nHey\n\nSmoke weed everyday"}