{"song_id":21097,"song_name":"It's So Hard","artist_id":281677,"display_artist":"Big Punisher Featuring Donell Jones","spotify_id":"5Fqk9TyFwQAg2fzNnfAEbO","lyrics":"(Big Punisher)\nYou can catch me in the cherry red one-fifty\nGot the grizzy locked in the stizzy\nPop the clizzy goin' sixty down a one-wizzy\nDrunk pissy, tryin' to cruise through the avenue\nWhile my peoples is poppin' bottles up in ?Sue's rendezvous?\nFuck that, spun the U-ey lost a hubcap\nIt's back to the shack - came back and now, \"What's that?\"\nStraight from Paris, checkin' Gaby's new baby carriage\nPerry Ellis (nice), auburn cherry reddish\nFresh out the dealer, got the Tec for the squealers\nWear a vest for the killers, nuttin less 'cause it's reala\nIn the Big Apple, where it's quick to get your shit tackled\nEnemies spit at you, best friends kidnap you\nTrust no one (eh eh) got beef bust yo' gun\nYou don't need no one (nope) talkin' bout that you owe him\nI'ma go for dolo - Scarface without Manolo\nOne deep, I be solo, bustin' heat, throwin' bolos, it's hard\n\nChorus 1 + 2 overlap\n\nChorus 1: Donnell Jones\n\nAnd it's so haaaaaard, yeah\nNiggaz wanna be like Pun, but they don't bust they guns\nAnd it's so haaaaaard...\nNiggaz wanna fuck my wife, niggaz wanna take my life\nBut it's so haaaaaard...\n\nChorus 2: Big Punisher\n\nIt's hard work baby\nI just lost a hundred pounds, I'm tryin' to live\nI ain't goin' nowhere I'm stayin alive baby...\nThat's my wife, I paid for them titties\nGet your own, your own, ya heard?\nNiggaz wanna fuck my wife, niggaz wanna take my life\nBut it's so haaaaaard...\n\n(Big Punisher)\nRollin' with the Squad, we like Gods\nCatch us at the bar-de-bar-de-bars\nStrip bars in Miami, almost came home with the Grammy\nNext year, bringin' home three for the family\nWatch me, you can catch it live on the Hitachi\nPoppin' shit like a Nazi, iced out like DeBiase\nFuck that, Liberace\nFo'-X Versace, somebody stop me!\nNever that, SKEE-YU! Where my niggaz at?\nUptown! Uptown! You know you feelin' that\n\"Cash Rule,\" hardcore you can dance to\nThat old Biggie give me, \"Onnne More Chaaaaance..\"\nTake a glance and I'm off with yours\nWith both hands take off my drawers\nAnd jerk me like the Source Awards\nI love hip-hop, I ain't even probably the best lyricist alive\nTerror Squad nigga stop sleepin', ooh yeah\n\n - overlaps chorus\nWhat you say your name was again?\nAnd I know you from where? Elementary school?\n... I don't know you maaaaan!\nMoney, not you again\nGo THAT way!\nLoser!\n\nChorus 3: Donell Jones (starts where Pun says \"I don't know you\")\n\nNiggaz wanna be like Pun, but they don't bust they guns\nAnd it's so haaaaaard...\nNiggaz wanna fuck my wife, niggaz wanna take my life\nBut it's so haaaaaard...\nYeah, cause you ain't fuckin' my wife, takin' my life\nAnd if you just hatin' just walk on by...\nAll you haters just walk on by"}