{"song_id":21124,"song_name":"Cherchez LaGhost","artist_id":302806,"display_artist":"Ghostface Killah","spotify_id":"5OsVXAWDMK7v37MwKEDjcD","lyrics":"(Madam Majestic (Ghostface Killah))\nTommy Mattola, lives on the road\nHe lost his lady, two months ago\n(For real son what?)\nMaybe he'll find her, maybe he won't\nOh wonder that love\n\n(Ghostface Killah, (U-God))\nBrothers try to pass me, but none could match me\nNo girl can freak me, I'm just too nasty\nLost on the dance floor as I attack y'all\nSnuck through the back door, guess who they saw?\nGoldie and Ghost, black African Rose\nStar-studded low lenses, plus the mural was dope\nAirbrush W-B's, STOP! (Shake your body, body)\nAnd cop a couple of these (She's a hottie, hottie)\n\n(Madam Majestic)\nScottfree and Chauncey, very upset\nThey're sick and tired of living in debt\nTired of roaches and tired of rats\nI know they are over\n\n(Ghostface Killah)\nBrooklyn jumpin' - it's girls by the thousands\nHeart-throb music - girls come out your blouses\nShakin' ya ass - it's Cherchez Laghost\nShe could hustle with a sick style - jump off the boat!\n\n\nEverybody's in the song - no bad boys\nScene hot and muggy - you might end up in the wrong house\nYou hear the feelin' - snatch that boy\nHe a herb - catch him for a brand new toy\n\n(Madam Majestic, (Ghostface Killah), {U-God})\nThey'll take all your rhymes with a Colgate smile, hey baby\n(Get 'em girl, get 'em girl)\nThey'll love you one second, then hate you the next\nOh ain't it crazy baby, yeah (So crazy, so crazy)\nTony's his name, the undefeated champion, whoa, yeah\n{Blow 'em down}\nNow he's alone, he's just the king of his throne\n(Yeah, aha, true)\nAlways will be my friend, Ghostface Killah\n(Truly yours, peace boo)\n\n(Ghostface Killah)\nCatch me on the stage with about ten kicks\nBlister hard headed - grinnin' all day\nCan you say \"Oww! We just got paid\"\nKeep ya frown son if you ain't gettin' laid\n\n(Madam Majestic)\nOoh, Ghostface, Ghostface\nOoh, Ghostface, Ghostface *repeated to end*\nAmore, amore, he rhymes, he rhymes, amore\nOh Tony, he rhymes, he rhymes, he rhymes"}