{"song_id":21209,"song_name":"Souljas","artist_id":309928,"display_artist":"Master P","spotify_id":"1mtUwv8L4nhMRfbP2pa36V","lyrics":"(Master P)\nYou in the ghetto... and you ain't got no hustlin skills?\nGet down and give me ten private!\n(Where y'all at? Where y'all at? Where y'all at? Where y'all at?)\n\n(Chorus: Master P - army drill style)\nI don't know what you've been told\n(I don't know what you've been told)\nBut No Limit Soldiers came to rock'n'roll\n(But No Limit Soldiers came to rock'n'roll)\nWhere are all my whodis at?\n(Where are all my whodis at?)\nFrom the North to the South to the East to the West\n(From the North to the South to the East to the West)\nThugged out (one two) what we bout? (Knockin' boots)\nShinin it out (N... O... L... I... M-I-T!)\n\n(Master P)\nUnnnnnnnnnghhhhhhh!\nSee I'm a thug nigga, and I was - born to die\nI hang with drug dealers, that's - ready to ride\nWe got BEEF nigga, then we - ready for war\nI can't SLEEP nigga till I - have my enemies heart\nI'm Uptown on the blocks with the bricks ba-bay\nFiends roll up and get fixed ba-bay\nFifties and doves or the bic ba-bay\nSmoke weed with my nigga but don't trick ba-bay\nNow if you step to one of my niggaz, then you steppin to me\nI heard you famous cat, but you don't mean shit to me\nI'm out that C-P-3 and I'm a soulja for life\nAnd all my real niggaz wild out from left to the right\n\n(Master P)\n(What? What?) Now how the war WAS WON (HUH) on, blocks in the hood\n(HUH) We got enemies (WHAT) then it's, glocks we pulled\nIn God we trust nigga; I ain't got no friends (Ya heard?)\nSouljarettes, they love, money and ends\nYou need some work? Meet me in the bricks nigga\nYou come short? I'ma wet your shirt nigga\nIt's like Vietnam on the ghetto in these streets\nYou die how you live, the strong eat the weak\nRed and blue rags for the souljas that be bangin'\nAnd warriors on the wall for the souljas left hangin'\nTwenty-one gun salute, for the souls on the street\nAnd the souljas up in heaven, may you all rest in peace (Ya heard me?)\nUnnnnnngggggh!\n\n(Master P)\nThem Down South souljas they be ready to ride\nAnd we can take it outside if you ready to ride\nThem Midwest souljas they be ready to ride\nAnd we can take it outside if you ready to ride\nThem East Coast souljas they ain't ready to ride\nAnd we can take it outside if you ready to ride\nThem West Coast souljas they be ready to ride\nAnd we can take it outside if you ready to ride\nDon't start no shit it won't be no shit\nLet me tell you muh'fuckers who you fuckin' wit\nDon't start no shit it won't be no shit\nThis no limit army's who you fuckin' wit!\n\nWild out... wild out... No Limit is in and y'all out\nWild out... wild out... so y'all haters keep our name\nOut y'all motherfuckin mouth, hahah you heard me?\nRide ride niggaz (ride ride) Lah lah\n(All the way to the motherfuckin top of the charts ya heard me?)\nDJ's... hut one, hut two... hut one, hut two\nHut one, hut two...\nDJ cut the fuckin' lights off 'cause I'm through!"}