{"song_id":21307,"song_name":"Who's That Girl?","artist_id":301945,"display_artist":"Eve","spotify_id":"3uVE5vLKkigiWBOQEgmdDk","lyrics":"Yo, yo, yo\nThey wanna know\n\nWho's that girl?\n(La, la, la, la, la, la, la, la, la, la, la)\nEve's that girl\n(La, la, la, la, la, la, la, la, la, la, la)\nWho's that girl?\n(La, la, la, la, la, la, la, la, la, la, la)\nEve's that girl\n(La, la, la, la, la, la, la, la, la, la, la)\n\nYo, yo\nCan I turn you on by my word spell\nLook into my eyes think I want you, can't tell\nMe I keep it sexy, daddy so I can't fail\nKeep it gangsta for the cowards so I give 'em hell\nCall me misfit, lips spit a gang of trash\nWrist glist now 'cause I make a gang of cash\nLight glance, still street with the doo-rag\nSlang, spit game, change speech, how they do that?\nWatch they mouths drop, watch the crowds pop up and act out\nBroads with the screw face, smash on and knock out\nAin't changed game don't run me, I run the game\nIf I gotta keep it gritty so be it, I'm supposed to change\nLike simple, dizzy broads ain't fuckin' with my mental\nNatural born hustlin' bitch check what I've been through\nGot mine took it from you, and now you slot mine\nExec to my own shit, dawg I ownin' dot coms'\n\nWho's that girl?\n(La, la, la, la, la, la, la, la, la, la, la)\nEve's that girl\n(La, la, la, la, la, la, la, la, la, la, la)\nWho's that girl?\n(La, la, la, la, la, la, la, la, la, la, la)\nEve's that girl\n(La, la, la, la, la, la, la, la, la, la, la)\n\nYo, yo I can understand why you're scared of eve\nThought I did it one way, ain't prepared for me\nHuh, mad cause an image I don't care to be\nRealness, real shit, spit reality\nAttitude rude, that's the philly in i\nNeed me in the game, I'm the thrill in your life\nBreath of fresh air\nLittle boys hang me on their wall, I grow 'em chest hair\nWhy you listenin to other shit? you go the best here\nCome on try your luck shorty, I got the rest scared\nBet you anything you ain't ready and you get left there\nAin't known for frontin' vouch for my behavior,\nSame way they get down I get down for this paper\nSixteen lean from my pence so you can test her\nStill need to know who I am then cop the record\nTake it like a class on me and learn the lesson\nBottom line my world, my way any questions\n\nWho's that girl?\n(La, la, la, la, la, la, la, la, la, la, la)\nEve's that girl\n(La, la, la, la, la, la, la, la, la, la, la)\nWho's that girl?\n(La, la, la, la, la, la, la, la, la, la, la)\nEve's that girl\n(La, la, la, la, la, la, la, la, la, la, la)\n\nUh, yo power moves is made everyday by this thorough bitch\nI'mma get this bank anyway that I do this shit\nI was born to shine while most of y'all was borderline bullshit\nKnow exactly what I want from me, you cats is clueless,\nDispose the flow through my hands like water\nHeat starts growing from my son or my daughter\nEve want her own cash, fuck what you bought her\nHe spend, you owe, that's what mommy taught her\nAll ball is played, won't starve today\nSong after song I write so I get paid\nThought I wasn't followin' up with the second round\nNow bitch swallow it up while I shut it down\nMake 'em love me over again and over your name\nBetcha they get over your style and over your fame\nWhy you lookin' sad at me, I ain't the blame\nBack to plan b baby I can feel your pain\n\nWho's that girl?\n(La, la, la, la, la, la, la, la, la, la, la)\nEve's that girl\n(La, la, la, la, la, la, la, la, la, la, la)\nWho's that girl?\n(La, la, la, la, la, la, la, la, la, la, la)\nEve's that girl\n(La, la, la, la, la, la, la, la, la, la, la)"}