{"song_id":21312,"song_name":"Ride Wit Me","artist_id":312110,"display_artist":"Nelly Featuring City Spud","spotify_id":"06iMqWThw4w8fTFyccvOwr","lyrics":"Where they at? Where they at?\nWhere they at? Where they at?\nWhere they at? Where they at?\nWhere they at? Come on, now\n\nIf you wanna go and take a ride with me\nWe three-wheelin' in the fo' with the gold D's\nOh, why do I love this way? (Hey, must be the money!)\nIf you wanna go and get high with me\nSmoke a L in the back of the Benzy\nOh, why must I feel this way? (Hey, must be the money!)\n\nIn the club on the late night, feelin' right\nLookin' tryin' to spot somethin' real nice\nLookin' for a little shorty hot and horny so that I can take home\nI can take home\nShe can be 18, 18 with an attitude\nOr 19 kinda snotty actin' real rude\nBoo, as long as you a thicky thicky thick girl, you know that it's on\nYou know that it's on\n\nI peepin' somethin' comin' towards me up the dance flo'\nSexy and real slow, hey\nSayin' she was peepin' and, \"I dig the last video\"\n\"So when, Nelly, can we go?\"\nHow could I tell her no?\nHer measurements was 36-25-34\nYellin' I like the way you brush your hair\nAnd I like those stylish clothes you wear\nI like the way the light hit the ice and glare\nAnd I can see you boo from way over there\n\nIf you wanna go and take a ride with me\nWe three-wheelin' in the fo' with the gold D's\nOh, why do I love this way? (Hey, must be the money!)\nIf you wanna go and get high with me\nSmoke a L in the back of the Benzy\nOh, why must I feel this way? (Hey, must be the money!)\n\nFace and body, front and back, don't know how to act\nWithout no vouchers or no boozers, she's bringin' nuttin' back\nYou should feel the impact, shop on plastic\nWhen the sky's the limit and them haters can't get past that\nWatch me as I gas that, 4 dot 6 Range\nWatch the candy paint change, every time I switch lanes\nIt feel strange now\nMakin' a livin' off my brain instead of 'caine now\nI got the title from my mama put the whip in my own name now\nDamn, shit done changed now\nRunnin' credit checks with no shame now\nI feel the fame now (come on), I can't complain now (no more)\nShit I'm the man now, in and out my own town\nI'm gettin' pages out of New Jersey, from Courtney B\nTellin' me about a party up in NYC\nCan I make it? Damn right, I be on the next flight\nPayin' cash, first class, sittin' next to Vanna White (come on)\n\nIf you wanna go and take a ride with me\nWe three-wheelin' in the fo' with the gold D's\nOh, why do I love this way? (Hey, must be the money!)\nIf you wanna go and get high with me\nSmoke a L in the back of the Benzy\nOh, why must I feel this way? (Hey, must be the money!)\n\nIf you wanna go and take a ride with me\nWe three-wheelin' in the fo' with the gold D's\nOh, why do I love this way? (Hey, must be the money!)\nIf you wanna go and get high with me\nSmoke a L in the back of the Benzy\nOh, why must I feel this way? (Hey, must be the money!)\n\nCheck, check\nYo, I know somethin' you don't know\nAnd I got somethin' to tell ya\nYou won't believe how many people straight doubted the flow\nMost said that I was a failure\nBut now the same muthafuckers askin' me fo' dough\nAnd I'm yellin' \"I can't help ya\"\n\"But, Nelly, can we get tickets to the next show?\"\nHell no! (What's with you?!) You for real?\n\nCity Spud:\nHey yo, now that I'm a fly guy, and I fly high\nNiggas wanna know why, why I fly by\nBut yo it's all good, Range Rover, all wood\nDo me like you should, fuck me good, suck me good\nWe be no stud niggas, wishin' you was niggas\nPoppin' like we drug dealers, sippin' Crissy, bubb' mackin\nHoney in the club, me in the Benz\nIcy grip, tellin' me to leave wit you and your friends\nSo if shorty wanna... knock (knock), we knockin' to this\nAnd if shorty wanna... rock (rock), we rockin' to this\nAnd if shorty wanna... pop (pop), we poppin' the Crist'\nShorty wanna see the ice, then I ice the wrist\nCity talk, Nelly listen; Nelly talk, City listen\nWhen I fuck fly bitches; when I walk, pay attention\nSee the ice and the glist'; niggas starin' or they diss\nHunnies lookin' all they wish, come on boo, give me kiss, come on\n\nIf you wanna go and take a ride with me\nWe three-wheelin' in the fo' with the gold D's\nOh, why do I love this way? (Hey, must be the money!)\nIf you wanna go and get high with me\nSmoke a L in the back of the Benzy\nOh, why must I feel this way? (Hey, must be the money!)\n\nIf you wanna go and take a ride with me\nWe three-wheelin' in the fo' with the gold D's\nOh, why do I love this way? (Hey, must be the money!)\nIf you wanna go and get high with me\nSmoke a L in the back of the Benzy\nOh, why must I feel this way? (Hey, must be the money!)\n\nHey, must be the money\nHey, must be the money\nHey, must be the money\nHey, must be the money\nMust be the money\n\nIf you wanna go and take a ride with me\nWe three-wheelin' in the fo' with the gold D's\nOh, why do I love this way? (Hey, must be the money!)\nIf you wanna go and get high with me\nSmoke a L in the back of the Benzy\nOh, why must I feel this way?"}