{"song_id":21328,"song_name":"Take It To Da House","artist_id":430432,"display_artist":"Trick Daddy Featuring The SNS Express","spotify_id":"1wLhwzPAtze5JT8qqXlqaO","lyrics":"(\"Get down!\") Yessuh, (uh huh uh huh uh huh..)\nSlip-N-Slide Records\nUh, fin' to take it to da house\nJust get on up and (\"Get down!\")\n\nsung:\nCallin my peoples all across the world\nThis song goes out to all the boys and girls\nYou want them thugs to come and turn yo' party out\nYou better take it to da house, (c'mon) now (uh uh uh)\n(Uh... yessuh!)\n\n(Money Mark)\nSlip-N-Slide get loose\nMo' punch than your bowl of juice\nAnd ain't nobody mo' jiggier then us\nStuff so ruff it causes head rush like what?\nGive it to me bring it here\nDon't stop girl shake it here shake it there\nLet Money Mark get off in yo' derriere\nWe off da chain fo' the whole year\nSo if you look with a big ol' butt\nLive in yo' own crib and make yo own bucks (yessuh!)\nHit me up, Tre+ dot com\nAnd tell me where you from, uh...\n\n(J.V.)\nSmoked out, choked out, we get\nOff da chain like we just broke out\nYou don't know 'bout me J. Dot\nWhen I come though all the haters get hot\n'Cause I got mo' hoes, mo' dank\nMo' cheese in da bank, mo' rank\nMy dawgs on dubs, yours ain't\nMy dawgs do whatever, yours cain't\n\n(Chorus: Slip-N-Slide)\n'Cause we them niggaz that's gon' make you\nGet up out yo seat and (\"Get down!\")\n...\nWe don't play we - take it to da house\nM.I.A. - take it to da house\nThis the way we - take it to da house\nTake it to da house - take it to da house\nThree-oh-five - take it to da house\nBoy we got dat fire - take it to da house\nSlip-N-Slide - take it to da house\nTake it to da house - take it to da house\n\n(Trina)\nOkay play with it yo ain't no stoppin' it\nS-N-S and we rock rock rockin' it\nWe gon' lock it and do our thang\nCause my dream team takin' all the rings\nI got, Tre+ who beatin' much guts\nAnd uh, Deuce Pop' pimpin' news non-stop an'\nLost Tribe to my side just vibin\nAnd J.B. gon' ball with me\nT double D, he off in that 'Xcursion\nSwervin all on the curve with a virgin\nAnd I'm Trina, you heard my name\nI'm still \"Da Baddest\" ain't a damn thang changed\n\n(Co)\nNow it's time to get down with yo boy C.O.\nIt's me 'n' Money Mark in the big freak show\nNiggaz recognize, hoes do too\nWhen I creep through the room with the Slip-N-Slide crew\nGimme room 'cause I'm buckwild man\nI'll get'cha krunk, get'cha loose in the sand\nTre+ and we're runnin' it still\nFunk Boogie, spin the wheel!\n\n(Trick Daddy)\nWell order two mo' bottles of Crissy Cris'\nAnd get drunk pissy while you listen to this\nAll you rookie-ass niggaz don't try the shit\nSome busta-ass niggaz can't buy a hit\nGimme a break, and a beat I can vibe with\nA New Quest video and a fine bitch\n'Bout fifty-five spins and a mic check\nAnd you'll play my shit\nI never had sex that costed\nI fuck so much I'm exhausted\nAnd this new shit I'm flossin\nI got that 'cause I ran with the Dolphins, huh\nSlip-N-Slide's fin' ta take it to da house\nNew hot shit, fo' you to ride out\nAnd for the niggaz that tried there's nuttin left\nYo' hoe must think we somethin' else\nFuck fame, we out to get paid\nBorn and raised in the County of Dade\n\nTake it to da house (*repeat to fade*)"}