{"song_id":21334,"song_name":"Drops Of Jupiter (Tell Me)","artist_id":430350,"display_artist":"Train","spotify_id":"0bj6fsWQQg7DoYepGjIbbx","lyrics":"Now that she's back in the atmosphere\nWith drops of Jupiter in her hair, hey\nShe acts like summer and walks like rain\nReminds me that there's time to change, hey\nSince the return of her stay on the moon\nShe listens like spring, and she talks like June, hey, hey\n\nTell me, did you sail across the sun?\nDid you make it to the Milky Way to see the lights all faded\nAnd that Heaven is overrated?\nTell me, did you fall from shooting star\nOne without a permanent scar?\nAnd did you miss me while you were looking for yourself out there?\n\nNow that she's back from that soul vacation\nTracing her way through the constellation, hey, mm\nShe checks out Mozart while she does Tae-Bo\nReminds me that there's a room to grow, hey, yeah\n\nNow that she's back in the atmosphere\nI'm afraid that she might think of me as plain ol' Jane\nTold a story about a man who was too afraid to fly so he never did land\n\nBut tell me, did the wind sweep you off your feet?\nDid you finally get the chance to dance along the light of day\nAnd head back to the Milky Way?\nAnd tell me, did Venus blow your mind?\nWas it everything you wanted to find?\nAnd did you miss me while you were looking for yourself out there?\n\nCan you imagine your love, pride, deep-fried chicken?\nYour best friend always sticking up for you\nEven when I know you're wrong\nCan you imagine your first dance, freeze dried romance?\nFive-hour phone conversation, the best soy latte that you ever had\nAnd me\n\nBut tell me did the wind sweep you off your feet?(feet?)\nDid you finally get the chance to dance along the light of day (light of day)\nAnd head back toward the Milky Way?\nTell me did you sail across the sun?\n\nDid you make it to the Milky Way to see the lights are faded\nAnd that Heaven is overrated?\nTell me, did you fall from shooting star\nOne without a permanent scar?\nAnd did you miss me while you were looking for yourself?\n\nAnd did you finally get the chance to dance along the light of day?\n\nAnd did you fall from a shooting star, fall from a shooting star?\nAnd are you lonely looking for yourself out there?"}