{"song_id":21338,"song_name":"Lay Low","artist_id":279664,"display_artist":"Snoop Dogg Featuring Master P, Nate Dogg, Butch Cassidy & Tha Eastsidaz","spotify_id":"4QNJd8ma02Oy9PBenHErs1","lyrics":"(Feat. Master P, Nate Dogg, Butch Cassidy and Tha Eastsidaz)\n\n{*Snoop's message actually starts at the end of \"Stacey Adams\"*}\n\n(Snoop Dogg)\nYo what's Crip-a-lat'n? Dis big Snoop Dogg\nLeave your name and your number at the motherfuckin beep\nIf dis one of my hoes, two-way me\n\n{*BEEP*}\n\n(Dr. Dre)\nAy ay Snoop whattup? This your nigga Dre\nAy man I was thinkin' I ain't said shit on your whole motherfuckin album\nSo check it out, put this on there:\nAll you motherfuckin haters out there, can suck my motherfuckin dick!\nAnd we still smokin', what?!\n\n(Chorus: Nate Dogg)\nFor the nigga who be talkin' loud and holdin' his dick\nTalkin' shit, he better LAY LOW\nFor the bitch that said I shot some shit up out of my dick\nNow she sick, she better LAY LOW\nFor the niggaz who be claimin my hood\nAnd really ain't from my gang, better LAY LOW\nI hope he don't be thinkin' I'm just talkin'\nAnd I won't do a thing, really HOPE SO!\n\n(Snoop Dogg)\nHmm, lay low, nobody move until I say so\nLimo tint rollin' deep like the President\nSee I don't go to clubs, I never chase a bitch (beitch)\nI'm here to bang that gangsta shit to the apocalypse\nWe call it stress, some of y'all call it chocolate\nReturn of the Top Dogg, and ain't no stoppin' this\nWhatever the case, I ain't tryin' to catch it\nLay low, blow big dope, and slang records\nUnseen but well heard, do not disturb\nThe only reason you alive 'cause I ain't sent the word\nI flip, faster than birds, Snoop Dogg will emerge\nFrom the smoke and go loc, you shouldn't provoke\nI bring the worst from the L.B.C.\nSmash motherfuckers thinkin' they gon' smash on me\nSnoop and Dre give a FUCK about what y'all say\nFrom the \"World's Most Dangerous Group\" - N.W.A\nAy, ay\n\n(Butch Cassidy)\nOur rise, it was no surprise\nI always knew these fools would trip\nHatin', fakin, schemin on mine\nAnd on the down low talkin' shit\nBest move 'cause I refuse to lose\nNo matter which damn road I choose\nSo lay low cause you might be bruised\nTop story on the evening news\nI ain't for games, so if you wanna play 'em lay low\nLay down on the floor\nI'm in a rage, so if we gotta do this let me know\nThat's what I came fo'\n\n(Goldie Loc - Eastsidaz)\nWhere that nigga who be talkin' shit?\nHe don't come around no more because I fucked his bitch\nI made her suck my dick, while I was squeezin the tits\nThen I hit it from the back, gripped tight on them hips\nShe tried to make me cum, but I was tryin' to take her home\nDropped you off and seen you fishin on your raggedy Brougham\nCoulda thumped you and the dog (you little fag)\nAnd don't sag too hard, you show everybody your thong\n\n(Tray Deee - Eastsidaz)\nBooyaka booyaka, we bring it straight to ya\nFrom 22's to Luger's the shit that shoot through ya\nWho you motherfuckers think the Top Dogg bang with?\nThe same click he came with and made the game flip\nNow niggaz grow they hair, hope they stayin act hard\nThat's even tho' yo' CEO talk shit get slapped hard\nThe backyard is where we get our scrap on\nThe black car drive by then you get capped on\n\n(Master P)\nWhassup pimpin'? It's P and Snoop\nWith Dre on the beat, this ain't nuttin but loot\nThey call me Jed Clampett for all the bread I got\nBut they call me Bill Clinton for all the head I got\nI keeps it real-ah, 'cause I'm all about my scrilla\nThe ladies love me 'cause I'm a million dolla hitta\nIt's, No Limit till I D-I-E\nC-P-3, or Richmond, Cali's where I be"}