{"song_id":21393,"song_name":"Pop","artist_id":432017,"display_artist":"'N Sync","spotify_id":"0Jc8qF1mUPo1A96HE9QxZz","lyrics":"Dirty pop\n\nSick and tired of hearing all these people talk about\nWhat's the deal with this pop life and when is gonna fade out?\nThe thing you got to realize what we doing is not a trend\nWe got the gift of melody, we gonna bring it till the end (Come on now)\n\n(It doesn't matter) 'Bout the car I drive or what I wear around my neck\n(All that matters) Is that you recognize that it's just about respect\n(It doesn't matter) About the clothes I wear and where I go and why\n(All that matters) Is that you get hyped and we'll do it to you every time, come on now\n\nDo you ever wonder why this music gets you high?\nIt takes you on a ride, feel it when your\nBody starts to rock (Your body starts to rock), baby, you can't stop (You can't stop)\nAnd the music's all you got (Come on now), this must be pop\n\nDirty pop, baby, baby, you can't stop\nI know you like this (Dirty pop) (This must be)\n\nNow why you wanna try to classify the type of thing that we do?\n'Cause we're just fine doin' what we like, can we say the same for you?\nTired of feelin' all around me animosity\nJust worry about yours 'cause I'm-a get mine, now people can't you see?\n\n(It doesn't matter) 'Bout the car I drive or the ice around my neck\n(All that matters) Is that you recognize that it's just about respect\n(It doesn't matter) About the clothes I wear and where I go and why\n(All that matters) Is that you get hyped and we'll do it to you every time, come on\n\nDo you ever wonder why this music gets you high?\nIt takes you on a ride, feel it when your\nBody starts to rock (Your body starts to rock), baby, you can't stop (You can't stop)\nAnd the music's all you got (Come on now), this must be pop, ooohooohooo\n\nMan, I'm tired of singing\n\nDirty, dirty, dirty (Pop)\n\nDirty pop\n(Do you ever wonder?)\n\n\n(Do you ever wonder why) Ever wonder why (This music gets you high?), gets you high\n(It takes you on a ride) Feel it when your\n(Body starts to rock) When your body starts to rock (Baby, you can't stop), baby, don't stop\n(And the music's all you got) Come on now (This must be)\n\n(Do you ever wonder why) Do you ever wonder (This music gets you high?), how this gets you so high, baby?\n(It takes you on a ride) Feel it when your\n(Body starts to rock) When your body starts to rock (Baby, you can't stop\nAnd the music's all you got) Oh, oh, oh (This must be)\n\n(Do you ever wonder why) Ever wonder why (This music gets you high?), music gets you high\n(It takes you on a ride, feel it) When your\n(Body starts to rock) When your body starts to rock (Baby, you can't stop\nAnd the music's all you got) Baby, come on (This must be, pop)"}