{"song_id":21394,"song_name":"Music","artist_id":301838,"display_artist":"Erick Sermon Featuring Marvin Gaye","spotify_id":"2g4SumkFZpHOypfF5xng9Z","lyrics":"Just like music...\n\nUh-huh, aiyyo yo, uh-huh yeah yeah, uh uh uh\nThere's no doubt, no doubt, no doubt, uh\nWorrdd up...\n\nAh baby...\nJust like music...\n\nTo relax my mind, so I can be free\nAnd ab-sorb sound that keep me 'round\nDoin' my thang, constantly with no worries\nPeace to Keith Murray... (\"just like music\")\nTo keep me flowin and keep me goin'\nAnd keep me growin', and keep me the E from knowin'\nWhat happens out there, is not my concern\nYou wanna die it's not my turn (\"just like music\")\nTo do somethin' to me like jump in the Mercedes\nOn the highway, doin' over eighty\nWithout music baby... (\"Oww! I'll go crazy... just like music\")\nMake me call my homey on the phone\nLike there's somethin' new out, that got me in the zone\nJust that feelin', got me\nI wish music can adopt me (\"just like music\")\n\n(Chorus: Marvin Gaye)\nTurn on some music, I got my music\nTurn on some music, I got my music\nTurn on some music, I got my music\nTurn on some music, I got my music - just like music\n\nPut me in the mood with my woman\nGot me in the ear, sayin' sweet nothings\nMake love come out the mouth, no frontin\nLike all of a sudden, (\"just like music\")\nTakin' away your worries and cares\nAny problems, music'll be right there\nTogether match yo, we a perfect pair\nIs that true Marvin? (\"Yeah! Music\")\nYo, to get you to bang this\nBody soul-snatcher, universal language\nIt be the light, so open up\nThis is it, what the fuck? (\"just like music\")\nOne fly tune\nThat have black and white vibe in one room\nNo confrontation, parlay all night\nIt's just the sensation (\"just like music\")\n\n(Marvin Gaye)\nMusic is the soul of the man\nMusic makes a, happy day\nMusic makes a, cloud flow by baby\nYour music is my tears in-side my eyes (just like music)\nYour music makes me want to sing\nGirl music, is a joy to bring (just like music)\nMusic is my heart and soul, more precious than gold\n(Turn on some music, I got my music)\nHappiness for days, justice all the way\n(Turn on some music, I got my music)\nI love your music baby (I got my music)\n(Turn on some music, I got my music - just like music)\nHey (la-da-da-da-daaaa-dah-dah-dah) doo-doo, doo-doo-doo\nTurn on some music (la-da-da-da-daaaa) turn on some music\nJust like music (la-da-da-da-daaaa-dah-dah-dah) doo-doo, doo-doo-doo\nTurn on some music (la-da-da-da-daaaa) turn on some music\nJust like music (la-da-da-da-daaaa-dah-dah-dah) doo-doo, doo-doo-doo\nTurn on some music (la-da-da-da-daaaa) turn on some music\nJust like music...\n\n{*Fades out*}"}