{"song_id":21461,"song_name":"Ghetto Girls","artist_id":307281,"display_artist":"Lil Bow Wow","spotify_id":"7HKmixWG7VbRhtMfvo2TtH","lyrics":" Bow Wow\nOh, uh, huh, uh, huh\nWhat I like uh, huh ghetto girls uh, huh\n(Ghetto girls)\n(Uh, huh, oh, uh, huh, oh)\n(Lil' bow wow)\n(Ghetto girls)\n(Ghetto girls)\n(Ghetto girls)\nVerse 1 (JD)\nLike when Janet was Justice that's what I'm talkin' bout\nA shorty that can tell ya when the J's come out (okay)\nGet creative with the hair cuts like T-Boz\nFavorite rappers is bow wow, snoop, JD, and nas (ha, ha)\nAlways up in somebody's face tryin' to fuss\nAnd to get where she going she can take the bus (uh)\nLike when Jada was Peaches in the movie Shame (uh huh)\nHard to find her time to be sittin' at the Rucker's game (okay)\nThey only like dealin'wit cats that love to floss\nOnly like rockin' the stuff that really costs\nLip gloss shinin'(uh), tattoos on the back\nAttitude like Mary J. mixed wit Brat (I like that)\nYou can find 'em at a beauty shop, mall, or church\nName brand hat, shoes, with the matching purse\nSo all that sedity stuff, y'all can keep\n'Cause only girls that keep it ghetto that can ride wit me fo' sho\n(Ghetto girls)\nThey like hot boyz that push hot toys\nAnd ball wit the best of them\n\n(Ghetto girls)\nThey rock braids and do 'em straight\nAnd in the kitchen fix da bomb kool-aid\n(Ghetto girls)\nThey think they can hang and talk more slang than I do\n(Ghetto girls)\nThat's all I like so tell me baby\nIs that you?\n(Bow wow let's talk about it)\nWhen they ride wit for man like you won't believe\nSwitch the color on the hair like EV-E (okay)\nWhen they talk like I talk\nBut walk like a lady (uh)\nSnap like I snap and get a little crazy\nI love that (ha, ha)\nSpecially when they 'bout the cheese\nThe type that pull front on some Mickey D's (oh)\nBandanas to Barrettes\nDaisy dukes to spandex\nAll that's good wit me\nI like 'em G-H-E-T-T-O\nNow believe me she got to go (uh, huh)\nAt the corner store buying up all the sweets\nFrom choo-choos to rice krispies treats on my street\nThat's all I see like everyday (uh, huh)\nAnd they do what they do in a crazy way (and what else)\nHang with the ballers so they never pay (and)\nAnd they usually got a name that's hard to say, ya heard\n\n(Ghetto girls)\nThey like hot boyz that push hot toys\nAnd ball wit the best of them\n(Ghetto girls)\nThey rock braids and do 'em straight\nAnd in the kitchen fix da bomb kool-aid\n(Ghetto girls)\nThey think they can hang and talk more slang than I do\n(Ghetto girls)\nThat's all I like so tell me baby\nIs that you?\nUh, let's talk about it now\n(Ooh)\nIf ya know what I mean shorty let yo' self be seen ya heard\nIf ya know what I mean shorty let yo' self be seen ya uh, uh\nIf ya know what I mean shorty let yo' self be seen ya heard\nIf ya know what I mean shorty let yo' self be seen ya uh, uh\n(Ghetto girls)\nThey like hot boyz that push hot toys\nAnd ball wit the best of them (keep it getto)\n(Ghetto girls)\nThey rock braids and do 'em straight\nAnd in the kitchen fix da bomb kool-aid\n(Ghetto girls)\nThey think they can hang and talk more slang than I do\n(Ghetto girls)\nThat's all I like so tell me baby\nIs that you?"}