{"song_id":21473,"song_name":"Livin' It Up","artist_id":276599,"display_artist":"Ja Rule Featuring Case","spotify_id":"0UZ5D7IZkiR3ZUYl6AK0do","lyrics":"(Ja Rule)\nYeah, yeah, yeah\nWhere all my...\nUh, Yeah\nC'mon, c'mon, uh\nTo all my bitches that be givin' it up, uh\nTo all my niggaz that be livin' it up, we say...\nTo all my bitches that be givin' it up, ah\nC'mon\n\n(Verse 1: Ja Rule)\nBaby, this ain't your typical, everyday, one night thing\nIt's a physical, ima fuck, you tonight thing\nFuck, knowing your name, get your ass in the Range\nAnd rollover, gettin' blown while blowing the doja\nBring head to a closure\nThat's a good bitch\nBefore it's all over, ima leave this bitch\nProbably treat this bitch, smoke better\n'Cause if you ain't know, gangsters an hoe's go together\nPoppin' my collar, partna\nWho in the spot?\nBaby, Rule in the spot\nIn the mug and the watch, love me\nHalf the hoes hate me, half them love me\nThe ones that hate me only hate me\n'Cause they ain't fucked me\nAnd they say I'm lucky\nDo you think I've got time to fuck all these hoes?\nAnd do all these shows?\nOr flight in the llama, Dodge and White Rolls\nUh-oh, another episode\n\n(Hook: (Case) & Ja Rule)\n(What, do I do?)\nTo all ma niggaz that be livin' it up, we say...\n(What, I do)\nTo all ma bitches that be givin' it up, uh\n(What, you do)\nTo all ma niggaz that be livin' it up, we say...\n(What, do I do?)\nTo all ma bitches that be givin' it up, uh\n(My love for you)\nC'mon\n\n(Verse 2: Ja Rule)\nBitches, just wanna hold the name that's active\nThat's why they suck dick with mo' passion than average\nAnd I ain't mad at'cha\nNever leave you alone\n'Cause we fucks when I'm home, phone sex when I'm gone\nWe both grown, both got minds of our own\nPlus I freaks off like O-Dog in \"Love Jones\"\nBeen in, many zones, baby one hoes, two hoes\nFrom, prissy bitches to hoes that do porno\nBut you know, the Rule be livin' it up\nAnd got all these hoes, givin' it up\nI like a, little ooh baby, how cute are you?\nWith a body that rides on sexual\nI got a stick, I'll ride right next to you\nDo a doughnut, and cut, then I'll open it up\nOn the freeway, diggin them out, foot on the clutch\nRule baby, not givin' it up\n\n(Ja Rule)\nC'mon, we get high\nC'mon, we get ride\nC'mon, we get live\nLive yo' life\n(Ooh baby)\n\n(Verse 3: Ja Rule)\nLove you so sexy, I just want you next to me\nYour whole vibe, like you high on Extasy\n'Cause ain't nothin' but an \"E\" thang baby\nI know that pussy wet like crazy\nI wanna feel your passion, come when you ask me\nLaugh when you cry, cry when you laughin'\nBut ain't nothin' happenin'\nThe bitch got a little too high\nPicked up my ride and started crackin'\nThe radio blastin' \"Between Me And You\"\nBut you ain't on the low with that freak thing you do\nI thought you knew (What I do)\nKnow I know (What you do)\n'Cause it's been a good night, your head ain't right\nLike Teddy P, let's \"Turn Off The Light\"\nAnd grind it out, takin' no times out\nTill the sun come out\nBitch, when you find out\n\n(Ja Rule)\nC'mon, we get high\nC'mon, we get ride\nC'mon, we get live\nC'mon, it's my time\n(Ooh baby)"}