{"song_id":21474,"song_name":"Ugly","artist_id":298472,"display_artist":"Bubba Sparxxx","spotify_id":"3NOq1Gpiy4KwDni8NhOmHQ","lyrics":"(Timbaland)\nUh... uh-oh, uh-oh\nTch-tchka-tchka-tchka-tchka uh\nUh-oh, uh-oh\nTchka-tchka uh\nUh-oh, uh-oh\nSay what, say what? Freaky freaky uh\nTchka-tchka-tchka-tchka Bubba\n\n(Bubba Sparxx)\nI ain't choose to rhyme; rhymin chose me\nSo I hit the track runnin' - like a nosebleed\nLife ain't great now, but it's much improved\nYour album droppin' this summer? That sucks for you\nCause this is Bubba's moment - I put my mother on it\nI said my momma; it seems as if I love her don't it?\nSo buckle up, 'cause it's gon' get bumpy\nI call my girlfriends Betty's, and my shits grumpies\nThat Bubba talk - gotcha open wide\nI giggle outside the booth; but ain't no joke inside\nThis is complicated - at least to y'all it is\nJust let me sell fifty million, then I'll call it quits\nBut until that day, y'all in deep doo doo\nI never once saw you crank it 'cause I just sleep through you\nWhat you need to do, is just admit you love me\nThe South has always been Dirty but now it's gettin' ugly\n\nUgly - in here!\nHuh, in here! Huh, in here!\nIt's gon' get ugly - in here!\nHuh, in here! Huh, in here!\nIt's gon' get ugly, ugly, ugly\nIn here! Huh, in here!\nIt's gon' get ugly - in here!\nHuh, in here! Huh, in here - uh-oh!\n\n(Bubba Sparxx)\nThough I am country, don't get the wrong idea\nMy ego's gettin' bigger, with every song I hear\nCause y'all been bullshittin, spittin' that booty chatter\nOut here for two days and came with somethin' that truly matters\nOn goes the saga - of Bubba's plight\nShe won't see tomorrah, if I don't cut tonight\nThat's just my mood now; I hate it came to this\nHow else can I say it I don't speak no other languages\nI'm fairly ripped now, so this the jimmy talkin'\nYou hear that beat don'tcha? That's just Timmy talkin'\nGo 'head throw dem bows - fuck it, break a bottle\nLet's be honest none of us will ever date a model\nSo let's just cut it loose, ignore the repercussions\nIf you scared, then just forget what we discussin\nThis that new South - take a picture of me\n'Cause I'm a fuckin' legend, and this is gettin' ugly\n\n(Bubba Sparxx)\nNow this thang is jumpin' - ain't it somethin'?\nWhat makes it special, this whole moment came from nothin'\nNow you see it triples; I bet she slurp tonight\nLames hide your wallets hatin' broads clutch your purses tight\nIf you ain't tryin' to live, you with the wrong crowd\nAnd if you feelin' brave then better sport that thong proud\nAnd if you finally breathin, then sing this song loud\nI'm glad I got you wet I know you had a long drought\nDon't worry about the law - they can't arrest us all\nI had to crank couldn'ta done nothin' less for y'all\nForget your inhibitions; I wanna see you whylin\nAnd if Bubba dies tonight - know he was smilin'\n\n(Timbaland)\nHa ha, it's gon' get (ugly - in here!)\nThck-thck (Huh, in here! Huh, in here!)\nIt's gon' get (ugly - in here!)\n(Huh, in here! Huh, in here!)\nIt's gon' get (ugly) say what?\n(Ugly, ugly) Say what? (Ugly!) In here! Huh, in here!\n(It's gon' get ugly - in here!)\n(Huh, in here! Huh, in here - uh-oh!)\nThcka-thcka-thcka-thcka-thcka check switch uh\n\n{*\"Get Ur Freak On\" beat*} Switch it one time\n{*Bubba's \"Ugly\" beat*} Now switch it back baby\n{*\"Get Ur Freak On\" beat*} Switch it one time\n{*Bubba's \"Ugly\" beat*} Now switch it back baby\n\n(Missy) \"Holla! Ain't no stoppin' me\"\n\"Copywritten so\" (so what?) \"don't copy me\"\n\n{*Bubba's \"Ugly\" beat*} I want you to...\n\n(Missy) \"Holla! Ain't no stoppin' me\"\n\"Copywritten so, don't copy me\"\n\n(Timbaland) C'mon Bubba, let's go"}