{"song_id":21506,"song_name":"Who We Be","artist_id":300046,"display_artist":"DMX","spotify_id":"5v1SSuJCyPHJv9ylVK3LBL","lyrics":"Uh, yeah\nAnother one of those - this is for my nigga Q - down to earth joints\nRest in peace baby, you're not for me dawg\n\nThey don't knooow, who we beee\nThey don't knooow, who we beee\n\nThat's how many that don't know, they knew I could do it!\nThis goes out to my nigga Q - rest in peace baby\nThey still ain't ready...\n\nWhat they don't know is!\nThe bullshit, the drama (uh), the guns, the armour (what?)\nThe city, the farmer, the babies, the mama (what?!)\nThe projects, the drugs (uh!), the children, the thugs\n(Uh!) The tears, the hugs, the love, the slugs (c'mon!)\nThe funerals, the wakes, the churches, the coffins (uh!)\nThe heartbroken mothers, it happens, too often (why?!)\nThe problems, the things, we use, to solve 'em (what?!)\nYonkers, the Bronx (uh!), Brooklyn, Harlem (c'mon!)\nThe hurt, the pain, the dirt, the rain (uh!)\nThe jerk, the fame, the work, the game (uh!)\nThe friends, the foes, the Benz, the hoes (what?!)\nThe studios, the shows, comes, and it goes (c'mon!)\nThe jealousy, the envy, the phony, the friendly (uh-huh!)\nThe one that gave 'em the slugs, the one that put 'em in me\n(Whoo!) The snakes, the grass, too long, to see (uh, uh!)\nThe lawnmower, sittin', right next, to the tree (c'mon!)\n\nThey don't knooow, who we beee\nThey don't knooow, who we beee\n\nThey don't knooow, who we beee\nThey don't knooow, who we beee\n\nWhat we seeing is!\nThe streets, the cops, the system, harassment (uh-huh)\nThe options, get shot, go to jail, or getcha ass kicked\n(Aight) The lawyers, the part, they are, of the puzzle (uh-huh)\nThe release, the warning, \"Try not, to get in trouble\" (damn!)\nThe snitches, the odds (uh), probation, parole (what?!)\nThe new charge, the bail, the warrant, the hole (damn!)\nThe cell, the bus, the ride, up North (uh-huh)\nThe greens, the boots, the yard, these hearts (uh!)\nThe fightin, the stabbin, the pullin, the grabbin (what?!)\nThe riot squad with the captain, nobody knows what happened\n(What?!) The two years in a box, revenge, the plots (uh!)\nThe twenty-three hours that's locked, the one hour that's not\n(Uh!) The silence, the dark, the mind, so fragile (aight!)\nThe wish, that the streets, would have took you, when they had you\n(Damn) The days, the months, the years, despair\nOne night on my knees, here it comes, the prayer\n\nThey don't knooow, who we beee\nThey don't knooow, who we beee\n\nThey don't knooow, who we beee\nThey don't knooow, who we beee\n\nThis here is all about!\nMy wife, my kids (uh-huh), the life that I live (uh-huh)\nThrough the night, I was his (uh-huh), it was right, but I did\n(Uh-huh) My ups, and downs (uh), my slips, my falls (uh)\nMy trials and tribulations (uh), my heart, my balls (uh)\nMy mother, my father, I love 'em, I hate 'em (uh!)\nWish God, I didn't have 'em, but I'm glad that he made 'em\n(Uh!) The roaches, the rats, the strays, the cats (what, what?!)\nThe guns, knives and bats, every time we scrap\nThe hustlin, the dealin', the robbin, the stealin (uh!)\nThe shit, hit the ceilin, little boy, with no feelin's\n(Damn) The frustration, rage, trapped inside a cage\nGot beatin's till the age, I carried a twelve gauge\n(Aight!) Somebody stop me (please!), somebody come and get me\n(What?!) Little did I know, that the Lord was ridin' with me\nThe dark, the light (uh), my heart (uh), the fight (uh)\nThe wrong (uh!), the right (uh!), it's gone (uh!), aight?\n\nThey don't knooow, who we beee\nThey don't knooow, who we beee\n\nThey don't knooow, who we beee\nThey don't knooow, who we beee\n\nThey don't knooow, who we beee\nThey don't knooow, who we beee\n\nThey don't knooow, who we beee\nThey don't knooow, who we beee\n\nMan listen\nThese motherfuckers don't know, who we are!\nThey don't know\nThey couldn't possibly fuckin' know dawg\nThat's from the heart"}