{"song_id":21510,"song_name":"I'm A Slave 4 U","artist_id":297529,"display_artist":"Britney Spears","spotify_id":"5xuu2VJq5QaMO7gLHiI8PZ","lyrics":"I know I may be young\nBut I've got feelings too\nAnd I need to do what I feel like doing\nSo let me go and just listen\n\nAll you people look at me like I'm a little girl\nWell did you ever think it'd be okay for me to step into this world\nAlways saying, \"little girl don't step into the club\"\nWell I'm just tryin' to find out why cause dancing's what I love\n\nCan you get it, get it get it, whoa\nCan you get it, get it get it, whoa (Do you like it?)\nCan you get it, get it get it, whoa (This feels good)\n\nI know I may come off quiet\nI may come off shy\nBut I feel like talking\nFeel like dancing when I see this guy\n\nWhat's practical is logical\nWhat the hell, who cares?\nAll I know is I'm so happy when you're dancing there\n\nI'm a slave for you\nI cannot hold it\nI cannot control it\nI'm a slave for you\nI won't deny it\nI'm not trying to hide it\n\nBaby, don't you wanna, dance upon me? (I just wanna dance next to you)\nTo another time and place\nOh baby, don't you wanna, dance up on me? (Are you ready?)\nLeave behind my name and age (Let's go)\n\n(Like that)\n(You like it)\n(Yeah)\n(Now watch me)\n\nCan you get it, get it, get it?, whoa\nCan you get it, get it, get it?, whoa (Do you like it?)\nCan you get it, get it, get it?, whoa (This feels good)\n(Panting)\n\nI really wanna dance, tonight with you (I just can't help myself)\nI really wanna do what you want me to (I just feel I let myself go)\nI really wanna dance, tonight with you (Wanna see you move)\nI really wanna do what you want me to (Uh uh uh)\n\nBaby, don't you wanna, dance up on me? (I just wanna dance next to you)\nTo another time and place\nOh baby, don't you wanna, dance up on me? (Are you ready?)\nLeave behind my name and age (Let's go)\n\nI'm a slave for you (Like that)\nI cannot hold it\nI cannot control it\nI'm a slave for you (It just feels good)\nI won't deny it\nI'm not trying to hide it, baby\n\nCan you get it, get it, get it?, whoa\nCan you get it, get it, get it?, whoa\nCan you get it, get it, get it?, whoa\n(Panting)\nCan you get it, get it, get it?, whoa\nCan you get it, get it, get it?, whoa\nCan you get it, get it, get it?, whoa\n(Panting)\n\nI'm a slave for you (Here we go now)\nI cannot hold it\nI cannot control it\nI'm a slave for you (Here we go)\nI won't deny it (Yeah yeah)\nI'm not trying to hide it (Yeah)\n\n(Like that)"}