{"song_id":21522,"song_name":"We Thuggin'","artist_id":302021,"display_artist":"Fat Joe Featuring R. Kelly","spotify_id":"2EcW94ak7kYH4mDMvI7iWg","lyrics":"(Fat Joe)\n(Ooh, mmm)\nYeah, uh, uh (Fat Joe and the R)\nThat shit y'all (Breakin shit down)\nShake that, funky, funky, funky (Yeah)\nSticky, icky, icky - yeah uh\nI got that shit y'all\nI got that shit y'all\nUh yo yo\n\n(Fat Joe)\nCrackman and I'm at it again\nNiggas had they run, now it's time for change\nWhen we step in the club, nigga tuck ya chain\nGot the mink on - same color the Range\nUh, pour liqour for my nigga that's gone\nBig Pun! Then we party like we just came home\nFuck a bitch if she act to grown\nI don't need that shit, I got my wife at home\nUh words slurrin, dirty urine\nDrunk of off Henny and the Joe keep burnin\nDancin with shorty and her friend keep flirtin\nI don't always crush two but tonight seems certain\nParty hard like \"Fuck all y'all!\"\nBottles in the air like we stuck up the bar\nTerror Squad man you know who we are\nCruise through ya block and them drop-top Bentley's is ours\n\n(R. Kelly)\nYeah, we thuggin', rollin' on dubs and,\nOff up in the club, whylin like what\nGot Cris' on pop, Henny wit no chaser, mami don't stop\nThrowin' up six o'clock, plus I got four hun-nies in the drop\nAnd my man Joe's got the keys to the spot\nAnd it's full with hunnies, panties with no tops\nWe take a puff of 'dro be-atch\n\n(Fat Joe)\nYeah uh, yeah yeah yo\nEverybody wanna know where the crib's at\nNiggas just now gettin' ice, so we get that\nMami starin' at me like she wanna get kidnapped\nMoney lookin' happy with his wife but we triz that\nAlong with Lisa, Aisha, Shonda, Renee\nEven ran through the dorms down in Morgan State\nIn Miami, pool-party off the chain\nGettin' brains in the water on Memorial Day\nUh, grand-mami all cool and shit\nIt's ya birthday, show me what I'm foolin with\nLike no doubt, pokin doll out, pull ya g-string down south\nOwww! Pass that, give shorty a shot\nTrue enough we gon' see if she naughty or not\nI'm on E feelin' ready and hot\nI give 'em twenty a pop, leave the pennies atop\n\n(R. Kelly)\nYeah, we thuggin', rollin' on dubs and,\nOff up in the club, whylin like what\nGot Cris' on pop, Henny wit no chaser, mami don't stop\nThrowin' up six o'clock, plus I got four hun-nies in the drop\nAnd my man Joe's got the keys to the spot\nAnd it's full with hunnies, panties with no tops\nWe take a puff of 'dro be-atch\n\n(R. Kelly)\nFat Joe, R. Kelly we pop up\n\n(Fat Joe)\nYeah, Terror Squad, Rockland what the fuck what\n\n(R. Kelly)\nFat Joe, R. Kelly we pop up\n\n(Fat Joe)\nUh, uh, Rockland, Terror Squad what the fuck what\n\n(R. Kelly)\nSome of these kids is doin' they own thing\nBut none of these kids stack chips like us\nSome of these cats is doin' they own thing\nBut none of these cats run tricks like us\n\n(R. Kelly)\nYeah, we thuggin', rollin' on dubs and,\nOff up in the club, whylin like what\nGot Cris' on pop, Henny wit no chaser, mami don't stop\nThrowin' up six o'clock, plus I got four hun-nies in the drop\nAnd my man Joe's got the keys to the spot\nAnd it's full with hunnies, panties with no tops\nWe take a puff of 'dro be-atch\n\n(Fat Joe)\nHaha, yeah uh\nYou know what this is\nCha-town - BX\nWhat the fuck what?\nOut..."}