{"song_id":21523,"song_name":"Diddy","artist_id":"null","display_artist":"P. Diddy Featuring The Neptunes","spotify_id":"6EtkH6EfTfNLjUHKDylEym","lyrics":"Yeah... it's Bad Boy baby\n(Yeah, c'mon) Neptunes (mm, mm, mm, mm, c'mon)\nAnd we won't stop (I like this right here)\n'Cause we can't stop (yeah)\nYeah, let me tell you somethin'\nYeah, check this out\n\n(Verse One)\nSometimes I rhyme slow, sometimes I rhyme quick\nI was on 1-2-5 and Saint Nick\nChillin' with this chick named Tondalea\nWas a hot girl and everybody wanted to slay her\nBut she wasn't fond of players, only wanted ballers to spoil her\nWith six figures and camcorders\nSo what you tryin' to tell me dear?\nI got Bently, Benson and Mr. Belverdere\nAnd I just want to blow your mind\nI'm talkin' literally blow your mind\nMy repetoire is menage-a-trois and exotic cars\nChillin' with the hottest stars\nAnd it ain't no stoppin' this\nI can't help it I'm a optomist\nAnd I'ma make ya head bop to this\nAnd at the end you gon' rock to this\nNow say my name, c'mon\n\n(Chorus: Neptunes)\nD the I the D the D the Y, the D the I the D\nIt's Diddy (Hold up!) It's Diddy (That shit's crazy!)\nThe D the I the D the D the Y, the D the I the D\nIt's Diddy (Hold up!) It's Diddy (Say whaaat?!)\n\n(Verse Two)\nAiyyo, I came in the door, I said it before\nI never the ladies hypnotize me no more\nBut... but back to the manuscript\n'Cause I don't think you can handle this\nFrom New York to Los Angeles\nI think the whole world scandalous\nI'm just tryin' to keep the candles lit\nLet the party people dance to this\nGet out your seats and clap your hands to this\nBecause I came too far for me to be bourgeoise\nIt's a Bentley to you, to me it's a blue car\nSo Branson pass me a jar\nCause these cats done went too far\nYeah one phone call send two cars\nAnd I still get searched by security guards (that's right)\nI guess that's what I have to do\nTake the game international, now what you call me?\n\n(La La La La La La La La La La La La)\nC'mon work it out girl\nI'm tryin' to see you work it out girl\n(La La La La La La La La La La La La)\nC'mon work it out girl\nI wanna see you work it out girl\n\n(Verse Three)\nNow hold up, stop (stop) now wait a minute\nWe don't stop we rock cause ain't a limit\nMy aim is winnin', got Asian women that'll change my linen\nAfter I done blazed and hit 'em, but\nI just wanna rock wit you (that's right)\nAnd take it straight to the top with you\nAnd do what I gots to do, if it's possible\n'Cause I ain't trying to stop you boo\nI, got an agenda, got on a Ninja\nOne wheelin and killin' it not to offend ya\nThat's when I met this chick named Brenda\nTender, her whole body bend like fender\nSo let me see you shake it girl (c'mon)\nI just wanna see you shake it girl (c'mon)\nFor the return of the Don, the world in my palm\nMy moms calls me Sean but y'all call me\n\n(La La La La La La La La La La La)\nC'mon work it out girl\nI'm tryin' to see you work it out girl\n(La La La La La La La La La La La)\nC'mon work it out girl\nI wanna see you work it out girl"}