{"song_id":21559,"song_name":"Ooohhhwee","artist_id":309928,"display_artist":"Master P Featuring Weebie","spotify_id":"588edszV0cVhtgjxhwnigg","lyrics":"(Master P)\nWeebie! Holla at me (c'mon)\nI got like twelve bottles of bubbly (oh)\n\n(Chorus One 2X: Weebie)\nI like it when she shakes it in that thong - OOOHHHWEE!\nThe way she make it twurk and grab the wall - OOOHHHWEE!\nOh, baby you know whatchu doin' - OOOHHHWEE!\nNo Limit got the steps bouncin' and movin - OOOHHHWEE!\n\n(Master P)\nI know a big girl, with a ironed skirt\nGive her couple dollars, she'll make it work\nI mean holla at me whoadie, you know our crew large\nOur fantasy's to have sex wit two broads\nOn a boat or a plane or exotic cars\nBring it to the next girl, bring the toys\nOn the dance floor, shawty started takin' it off\nTook her to the V.I.P., started breakin me off\n'Cause she knew I was a baller by my iced out wrists\nI told her \"Wait, it don't stop, keep drinkin' the Cris'\"\nI'ma country boy just like the dukes of hazzard,\nSee a fine chick, you know I'm gon' grab her\nElly May girl where you at?\nThis No Limit boy tryin' to do that thang\nI said \"Rock the boat, don't let it sank\"\nIt's time to go to war, I got the tank\n\n(Chorus One)\n\n Say that then\n\n(Weebie)\nI could work, put ya body, c'mon back it up, back it up\nYou know Weebie and Master P, we gon' tank it up, tank it up\nTurn around to the ground, you know how it goes\nCatch the flow, tippie-toe, come and wobble some mo'\nLike you know how I do it so don't act surprised\nFor a fact gotchu dancin till you hurtin' your thighs\nNow won'tcha tune it up and wobble wit it\nAct a fool and wobble wit it\nWon'tcha make it hustle, ooh baby don't pull a muscle\nGotcha workin on the wall till you run outta breath\nNo Limit like I told ya so y'all give us respect\nNow you could shake it like a dog, break my fuckin' balls\nDo it how ya do it, lemme see ya take it off\n\n(Chorus One)\n\n(Chorus Two: Weebie)\nNow won'tcha rock, rock on, rock, rock on, rock, rock on\nRock, rock on, rock, rock on, rock, rock on, rock, rock on, rock\nNow won'tcha turn around and hustle wit it\nBack it up and hustle wit it, test around and hustle wit it\nOoh baby ooh baby\n\n(Master P)\nMary had a big ol' butt them tight a*s*s jeans and shorts\nAnd every club that Mary was at then thugs was sure to go\nThat mean she had the bo-legged wit the curves just like a bottle\nProject chick but pretty just like a model\nWhen I'm rollin' through the hood she loved thugs\nDon't mind gettin' in and shakin her thang in the club\nI mean, beat bopper she loved the tote shoppers\nCall her head nurse then I'ma be the doctor\nA real country mamma cook grits and eggs\nAnd she don't leave the farm except to get laid\nCandice on twaps 'cause she love the ball\nThought she had the nizzle on the dresses at the mall\nBuyin, high heels and some leather boots\nAnd lookin' for them ballers wit the crazy loot, WHAT?!\n\n(Chorus One)\n\n(Chorus Two)\n\n(Master P over Chorus Two)\nWhere them No Limit boys at? Throw them 'bows\nThem No Limit girls, get money and what?\nTold y'all clownz ain't no stoppin' us\nPutcha \"Gameface\" on when ya watchin us\n\n (Weebie)\nEast side (OOOHHHWEE!), Mid West (OOOHHHWEE!)\nWest coast (OOOHHHWEE!), Dirty South (OOOHHHWEE!)\nThe ghetto clique (OOOHHHWEE!), No Limit! (OOOHHHWEE!)\nHaters off, can't stop us, can't stop me (OOOHHHWEE!)\nY'all, know, where we be (OOOHHHWEE!)\nSomebody tell valet to bring my Bentley\nI'm about to (?) wit a couple these poppers y'heard?\nThe party's not over, Ooh-WEE-WEE!"}