{"song_id":21598,"song_name":"What's Luv?","artist_id":302021,"display_artist":"Fat Joe Featuring Ashanti","spotify_id":"2mKouqwAIdQnMP43zxR89r","lyrics":"Fat Joe:\nPut the fuckin' mic on...\nMic is on? Joe Crack the Don, uh!\nUh... Irv Gotti!\n\nAshanti: What's love?\n\nFat Joe:\nAshanti, Terror... Terror Squad\nIt should be about us, be about trust\n\nAshanti (Ja Rule):\nWhat's love? (Got to do, got to do with it, babe)\nWhat's love? It's about us, it's about trust babe\nWhat's love? (Got to do, got to do with it, babe)\nWhat's love? It should be about us, it should be about trust babe\nWhat's love?\n\nFat Joe:\nYeah, uh, uh, uh\nWoo! Yeah, slow down baby\nLet you know from the gate I don't go down lady\nI wanna chick with thick hips that licks her lips\nShe can be the office type or like to strip\nGirl you get me aroused how you look in my eye\nBut you talk too much, man you're ruinin my high\nDon't wanna lose the feelin' cause, the roof is chillin'\nIt's on fire and you lookin' good for the gettin'\nI'ma, rider, whether in a hoodie or a linen\nA provider; you should see the jewelery on my women\nAnd I'm, livin' it up, the Squad stay fillin the truck\nWith chicks that's willin' to triz with us, uh\nYou say you gotta man and you're in love\nBut what's love gotta do with a little menage?\nAfter the par-tay, me and you\nCould just slide for a few and she could come too\nThat's love!\n\nAshanti (Ja Rule):\nWhat's love? (Got to do, got to do with it, babe)\nWhat's love? It's about us, it's about trust babe\nWhat's love? (Got to do, got to do with it, babe)\nWhat's love? It should be about us, it should be about trust babe\nWhat's love?\n\nFat Joe:\nYeah, uh - yeah... yo, uh, yo\nMami I know you got issues; you gotta man\nBut you need to understand that you got somethin' with you\nAss is fat, frame is little\nTattoo on your chest with his name in the middle, uh\nI'm not a hater I just crush a lot\nAnd the way you shake your booty I don't want you to stop\nYou need to come a little closer... (come a little closer)\nAnd let me put you, under my arms like a Don is supposed ta\nPlease believe, you leave with me\nWe be freakin all night like we was on E\nYou need to trust the God and jump in the car\nFor a little heartache at the Taj Mahal\nWhat's love?\n\nAshanti (Ja Rule):\nWhat's love? (Got to do, got to do with it, babe)\nWhat's love? It's about us, it's about trust babe\nWhat's love? (Got to do, got to do with it, babe)\nWhat's love? It should be about us, it should be about trust babe\nWhat's love?\n\nFat Joe:\nYeah, uh, yo\nYo I stroll in the club with my hat down\nMichael Jack style, hot steppin who the mack now?\nNot my fault 'cause they love the kid\nMight be the chain or the whip, I don't know what it is\nWe just party and bullshit; c'mon mami\nPut your body in motion, you got a nigga open\nYou came here with the heart to cheat\nSo you need to sing the song with me\nAll my ladies come on\n\nAshanti (Fat Joe):\nWhen I look in your eyes there's no stoppin' me\nI want the Don Joey Crack on top of me (uh-huh)\nDon't want your stacks just break my back (yeah)\nGonna cut you no slack, 'cause I'm on it like that (uh, woo, uh)\nCome on (yeah yeah y'all)\nAnd put it all (yeah yeah y'all) on me (put it on ya girl)\nOn me (I'ma put it on ya girl)\n\nAshanti (Ja Rule):\nWhat's love? (Got to do, got to do with it, babe)\nWhat's love? It's about us, it's about trust babe\nWhat's love? (Got to do, got to do with it, babe)\nWhat's love? It should be about us, it should be about trust babe\nWhat's love?\n\nAshanti (Ja Rule):\nWhat's love? (Got to do, got to do with it, babe)\nWhat's love? It's about us, it's about trust babe\nWhat's love? (Got to do, got to do with it, babe)\nWhat's love? It should be about us, it should be about trust babe\nWhat's love?"}