{"song_id":21676,"song_name":"Guess Who's Back","artist_id":278349,"display_artist":"Scarface Featuring Jay-Z & Beanie Sigel","spotify_id":"43dtVVfeBWkiXKfFqBi4Qz","lyrics":"Jay-Z\nTalk to me man...\nThis ya boy Young Hova, yo turn the muh'fuckin' noise up\nWe'll get right into the proceedings this evening\nHeadphones are distortin, bring it down a lil' bit\nOkay - now we workin wit it\nThe boy Face on the bassline, Face - Mob!\nWelcome to New York City... it's ya boy Young Hov' chea\nKanye West on the track (whoo!) Chi-Town, what's goin' on now?\nCan I talk to y'all for a minute? Lemme talk to y'all for a minute\nJust gimme a minute of ya time baby - I don't want much (whoo!)\nLemme talk to these muh'fuckas, uh\n\nGuess who's bizack?\nYou still smellin crack in my clothes\nDon't make me have to relapse on these hoes\nTake it back out to taxin them roads\nWhen I was huggin it, niggaz couldn't do nuttin wit it\nStraight from the oven wit it - came from the dirt\nI emerged from it all without a stain on my shirt\nYou can blame my old earth, for the shit she instilled in me\nStill with me, pain plus work\nShit she made me milk this game for all it's worth\nThat's right, these niggaz can't fuck with me\nI'm callin guts every time, drag my nuts every time\nHomey, we make a great combination don't we?\nMe and the Face Mob, every time we face-off\nFace it y'all, y'all niggaz playin' basic ball\nI'm on the block like I'm eight feet tall\nHomey, I'm in the drop with the AC on\nThat's why the, streets embrace me dawg, I'm so cool!\n\nGuess who's bizack?\nBack on the block with the old Face Mob\nMack Mittens and Hov'\nDon't make me relapse\nBack to the block with the fo'\n'Cause this street shit is all I know\n\nScarface\nFrom the womb to the tomb - a hot pot of joy and a spoon\nTryna make me forty thousand and move\nMotels, star-studded, rock stars and goons\nPlain clothes wanna run in my room (whooooo...)\nBut nigga guess who's bizack? It's ya boy Face Mob\nStarted with an eightball, gotta get this cake dawg\nGive niggaz a break, nah, you know how the game go\nFuck you think I slang fo', to go against the grain (no)\nI'm out here to grind mo', rapped up in the paper chase\nI wanna fuck a fine hoe and candy paint the 88\nDon't got no wholesale, 'cause that ain't how I wanna run it\nHere take these five stones and bring a nigga back a hundred\nGotta see my feet dude, you do shit a fiend do\nThe fire get too hot in the kitchen, I hit the streets fool\nMoney is an issue - and that's on the fa' shizzle my nizzle\nYa block warm, then I come by with the fizzle\nAnd make fa' sho' I get to work mines, for part of the time\nWe go to war and you ain't makin' a dime (ha ha!)\n'Cause I got, shit to lose - a nigga out here payin' his dues\nMy baby walkin' gotta get him some shoes\nIt's a new game doin', lemme give ya the rules\nGet outta line and I'ma give ya the blues\nIt's a new game doin', lemme give ya the rules\nGet outta line and I'ma give ya the blues, whoa!\n\nBeanie Sigel\nGuess who's bizack?\nThe boy B. Mizack - a.k.a. Mr. Crack-A-Brick\nTurn a whole one from a half a brick, look I mastered this\nYou can smell it once the plastic rips\nA hot plate'll make ya swell up if ya gasket clicked\nYou can make ya chips swell up, ya don't hafta pitch\nPlay them corners like a safety, watch the traffic switch\nYoung'n never pump fake, and you'll get past the blitz\nAnd keep ya whole hood on flip - like old box-spring\nPissy mattress shit, low old box of things\nStrictly glassy shit - I hug the block like quarter waters\nShit I used to hug a corner like a old deuce and a quarter\nTill like deuce in the mornin, with the old heads\nSlangin loose quarters, this Philly cat back gatted (had it)\nStill fuckin' with them crack addicts\nStill bustin' with that black-matic\n\n*Whistling till fade*"}