{"song_id":21731,"song_name":"Baby","artist_id":280057,"display_artist":"Ashanti","spotify_id":"6cZPfzVtkicrA3CyjqYKhu","lyrics":"I don't remember feeling like this...\nBaby... Baby I love you... Baby... Baby I love you.\n\nI got this jones forming in my bones (from a man),\nWho indeed took over my soul, (understand),\nI couldn't breathe if he ever said (he would leave),\nGet on my knees till they bloody red, (baby please),\nSee I don't know if you get it yet (just don't know),\nHe's like a lighter to my cigarette (watch me smoke),\nI never knew another human life (didn't know),\nCould have the power to take over mine,\nSo baby baby.\n\nBaby, baby, baby, baby, baby (baby I love you),\nBaby, baby, baby baby, baby,\nI love it when I hear ya name,\nGot me sayin' baby, baby, baby,\nBaby, baby,(baby I love you)\nBaby, baby, baby, baby, baby.\n\nSee, I could never feel alone with you (in my life),\nI'll give up everything I own for you (won't think twice),\nAlmost a shame how I'm mesmerized (such a shame),\nI lose my thought looking in your eyes (I know why),\nBecause your kisses make my lips quiver (and that's real),\nAnd when you touch me my whole body shivers (I can feel),\nNow, I can see how another life (nother life),\nCould have the power to take over mine... 'cause you're my...\n\nBaby, baby, baby, baby, baby,(baby I love you),\nBaby, baby, baby baby, baby,\nI love it when I hear ya name,\nGot me sayin' baby, baby, baby, baby, baby (baby I love you)\nBaby, baby, baby, baby, baby.\nBreak it down\n\nBaby, I can't see my world (can't see)\nLiving here on God's green earth, (God)\nYou don't know what ya done to me (done to me),\nI never thought I'd need you desperately (desperately),\nIt's kind of sick how I'm stuck on you (stuck on you),\nBut I don't care 'cause I'm needa you (I'm needing you),\nAnd how I feel will remain the same (remains the same),\nCause your're my baby ('cause you're my baby),\nListen and when the world starts to stress me out (where I run),\nIt's to you boy without a doubt (you're the one),\nWho keeps me sane and I can't complain (can't complain),\nYou're like a drug you relieve my pain (may seem strange),\nYou're like the blood flowing through my vains (ooh),\nKeeps me alive and feeding my brain (ooh),\nNow this is how another human life (nother life),\nCould have the power to take over mine... 'cause you're my\n\nBaby, baby, baby, baby, baby (baby I love you),\nBaby, baby, baby baby, baby, I love it when I hear ya name,\nGot me sayin' baby, baby, baby, baby, baby (ooh... baby I love you),\nBaby, baby, baby, baby, baby.\n\nBaby baby baby baby\nBaby baby baby\nBaby baby baby baby\nBaby baby baby baby baby\n\nBaby, baby, baby, baby, baby\nBaby, baby, baby baby, baby\nBaby, baby, baby, baby, baby\nBaby, baby, baby, baby, baby."}