{"song_id":21806,"song_name":"React","artist_id":301838,"display_artist":"Erick Sermon Featuring Redman","spotify_id":"4psCG36I4hy1h3qgG6o03m","lyrics":"Just Blaze, yeah, uh, yeah\nCheck me out now\nYo, yo, yo, yo, check me out now\nYo, yo, yo\nLet me hear ya say\nUh huh, uh huh, uh huh\nKisi ko\nKhudkushi ka shok ho to\nKya kare tu?\nPut your hands in the air everybody, c'mon\nWhere them dogs at\n\n(Erick Sermon)\nHey yo, I'm immaculate, come through masculine\nWide-body frame, E-Dub's the name, whoa\nIn the field of rap, I'm supurb, I'm fly\nI should be in the sky with birds\nI ride 20 inch rims when I lean, yo\n(Ayyo, them 10's)\nI know, I keep 'em clean though\nCome through stormin' the block like El Nino\nScoop up an average chick before she close\nShe goes, KISI KO those my people\nYeah, them broads from Puerto Rico, them key folks\nYeah, watch how the \"E\" locs 64\nBlack rags, black interior, shift on the floor\nBurn out, I do it for the kids\nThey're hoppin' it turn style, the \"E\" goin' wild\nYo, like them white chicks on a DVD\nYeah, I'm worldwide, MTV and BET\nKisi ko\nKhudkushi ka shok ho to\nKya kare tu?\n(1)\nWhateva' she said, then I'm that\nIf this here rocks to y'all, then react\nKisi ko\nKhudkhusi ka shok ho to\nKya kare tu?\nWhateva' she said, then I'm that\nIf this here rocks to y'all, then react\n\nYo, do I gotta go ape or go nutty\nI leave your eye like a 9-9 biz-buggy, puffy\nBrit niggas get real ugly\nTrust me, keep your four if you feel lucky\nMug me, I ain't got nothin' but four figures\nAnd weed and hash chopped in the coffee blender\nMy shots like squeegy men on your window\nUsual suspect, I'm the crippled member\nGet away when I sat down in the office\nHeat in my lap keep me walkin' awkward\nWhile y'all talk it, the doc reinforce it\nThe mic, it's hard to keep my paws off it\nYo' bitch is my bitch when it's over\nNo Cristal, I'll pour duck with King Cobra\nOut in the Nova, don't bother\nMy knee not brown, cost is a shot down the Carter\nKisi ko\nKhushusi ka shok ho to\nKya kare tu?\n\nHey yo Red, he's over (Word?) with his shit right now\nWatch this, told ya\nChi-chi-chi-chi-chi-chi-chi-chillin', I'm milk\nI'm that kid Gizmo, we top billin'\nYo, when the roof is on fire, believe it, it's me\nSparks when I rock the mic like Siegal and Free\nWhen the pen hit the pad, the evil in me come out\nTotal recall for people to breathe\n\nI got dogs in the backyard shittin' their lawns\nWe got chickens ain't leaving till six in the morning\nRound and round we go, circle the area\nLeave the party, go straight to the Marriott\nDozy-doe, we're cowboys with a saddle-lac\nRodeo with 20 fours on the Cadillac\nWhat your name is, yo, R.E.D.\nCrack cost money, but the \"E\" is free, yeah\n\nRepeat (1) until fade."}