{"song_id":21855,"song_name":"Paradise","artist_id":276751,"display_artist":"LL Cool J Featuring Amerie","spotify_id":"2xYiHM6BbKacRXjbwCNrL3","lyrics":"10...\nMmm, mmm, mmm, mmm\n\nIf you need me baby I'm, for real,\nThe rest of your life, I'll take you to paradise...\nIf you want it baby just be real\nThe rest of your life, I'll take you to paradise\nI'm gonna give you all my love, yeah\n\nWe went through this before\nActin' like the L's can't bag 'em no more\nNightgown draggin on the heated marble floor\nFlash Cartier when you open up the door - slide these on baby\nSo butter, still relate to the gutter\nJust your lifestyle's different, spirit uplifted\nFell in love with a cat who's gifted\nTurn you back to paradise, damn I missed it\nPop a bottle, light a purple candle\nI got somethin' that you can't quite handle, that's why you love me\nPour bubbly, glow from the flame make your skin shine lovely\nI'm sayin' baby\nTouch it why don'tcha (oh) touch it why don'tcha (oh)\nTouch it why don'tcha (ay) touch it why don'tcha (mmm)\nHey girl... aw, girl!\nHey girl, I wanna rock your world\n\nIf you need me baby I'm for real\nThe rest of your life, I'll take you to paradise...\n(Paradise, is very nice)\nIf you want it baby just be real\nThe rest of your life, I'll take you to paradise (uh, uh)\nI'm gonna give you all my love, yeah\n\nNext phase is this\nBlack sand, Tahiti, ten days to reminisce\nGod's my witness (uh)\nI paid the price for paradise, so I'm livin' this\nI never limit myself, the L's fearless\nLay back while I illuminate the darkness\nLike it smooth don'tcha\nMake it move won'tcha, think I won't?\nTake you to your peak I know them other cats don't\nAnd it won't stop - this is beyond paper\nFirst I get your mind right, then I might drape ya\nNever pimpin', raise my girls well\nYoung thoroughbreds get schoolled by Uncle L.L.\nC-double, L tattooed on the bubble\nI lay the mink down, let you walk over a puddle\nTrue love is so rare\nBut don't you worry I ain't goin' nowhere\n\nTrust me, trust me, trust - me, baby\nThe rest of your life I'll take you to paradise\nI'll take you to paradise, ooh\nSo won't you try me, try me - try, this, lady\nThe rest of your life I'll take you to paradise\nI'm gonna give you all my love, yeah\n\nBelly to belly, one hand on the jelly\nAt the telly on the celly - get that money Elle\nPlease believe it, if the mind can conceive it\nThen the man can achieve it; you gotta breathe it\nAnd I breathe deep, I'm one with the universe\nMinimum, ten percent go to God first\nLay back baby, close your eyes\nIce on the pinky finger froze your thighs\nSo much shade baby, the waterbed fries\nWalk around nude in the suite yellin', \"Recognize!\"\nDo your dance, baby pour me a class\nIt feels so good to have the world in a smash\nTouch it why don'tcha (oh) touch it why don'tcha (oh)\nTouch it why don'tcha (ay) touch it why don'tcha (mmm)\nHey girl... aw, girl!\nHey girl, I wanna rock your world\n\nYeah yeah, gotta keep your eyes on the prize baby\nSky's the limit\nIf you can see it, you can be it\nHa ha, it's on you, word up\nEverybody put your hands in the air\nIt's high time baby\nOne love, one God, recognize, uh\n\nIf you need me, just call me\nSaid if you want me, just be for real\nAnd if you like me, come and talk to me\nAnd if you want me, tell me how you feel"}