{"song_id":21899,"song_name":"A.D.I.D.A.S.","artist_id":305859,"display_artist":"Killer Mike Featuring Big Boi","spotify_id":"4Ol9JFw2Icl79oTqH1sG4t","lyrics":"Pussy nigga whatcha doin'!\nAll day I dream about, all day I dream about\nSex\nIt's the way you move your sexy groove\nThat's got my mind all over you\nAll day I dream about, all day I dream about\nYour sex feels so savoifare\nI'm tired of jercking off cause your not there\n\nBig Boi\n65' Chevrolet Impala peachy cream\nOozing down the street like toothpaste\nCause the ivory is clean\nTalkin' bout mean at the inseam on the inside of the ship\nNot a honey dip to hunch on, testes more blue than a Crip\nOr the blue man group caught that on the Vegas strip\nChillin' with good game, Ju Ju, Pimpin' Ken and my nigga Don Magic\nPimpin' Ken and my nigga Diamond Jit\nPimps (pimps), lips (lips), legs (legs), arms (arms),\nNecks (necks), hips (hips), head (head) monk test\nIt's the camel toe and that's fo' sho'\nMy brain is on one track\nLike Marion Berry thoughts for crack\nOr like a rock star does for smack.\nNone of that but the female genitalia's where it's at\nI'm a man and I demand a woman for that act\nPersonal preference plus I use the law of nature as a reference\nNow I don't ever recall seeing a man turn up pregnant, but that's just me\nFeminine female fantasies frolic freely in my cockpit\nEvery thirty something seconds I can't stop it\n\nKiller Mike\nKiller Kill from Adamsville and in my Bonneville I chill\nHeifers call me Black and Decker, I don't screw them hoes I drill\nI've been cuttin' cute lil' coochies since before the record deal\nCatch me daydreaming about them, thick, medium or slim\nDoctors call that thing vagina, in the hood we call it trim\nWhite boys call it snatch, Puerto Ricans call it chocha\nNathaniel likes his white, I like mines dark as cola\nIt's the first thing on my mind in the morn when I roll over\nAll men young and old in the end it's what we're after\nEven my grandpappy's happy. He got prescribed Viagra.\n(Granddaddy, granddaddy, what's up? what's up? It's me.\nHey, let me get about three of them blue diamonds.\nI promise I gotcha back tomorrow)\n\nKiller Mike\nWhen I drill I don't spill even if she's on the pill\nKeep my weapon covered concealed and in a shield\n'Cause I don't need that A.I.D.S.\nA \"D\" and a \"A\" missing out my A.D.I.D.A.S. (plus)\nWe don't need no DNA mixing between us\nWe just need to keep this thing friendly and hush, hush\nOn the down low, like R. Kelly and youngsters\nBut over eighteen only cause baby I'm no perv!\nFrom the tour bus to the lobby, elevator to the room\nWe can jump each other's bones but there's no jumping brooms!\n\nBig Boi\nBuffoon you are to consumed in the womb\nIt is too early for you to jump the broom (boom!)\n\n\"Monster\"\nVerse One\nI'm an ungodly figure\nWhen in the company of hard liquor\nTexas niggaz turned me on to water\nI smoked the river\nApocalyptic creature, stay lacing reefer\nStay serving geekers, stay holding heaters\nMurder fanatic, killer fantastic\nSwerving semi-conscious with a half a blunt and an automatic\nBought it to snort it, just in case I meet with static\nWhat I deliver to your address is dead tragic\nYour mother scream in that limousine\nFollowed by some slow traffic\nHere's the reason for my murder tactics\nI'm Killer Kill I ain't a fuckin' rapper! I'm a crack sacker!\nI'm a strong-armed robbery and kidnapper!\nI'm a carjacker! I'm a if you owe dough then yo' ho snatcher!\nI'm a Slumlord for life not a fuckin' actor!\nI'm the fear that haunts you! I'm the tool that's used to haunt you!\n\nI'm the monster! I'm your sick and twisted monster!\n(Repeat)\n\nVerse Two\nI'm the hate in the dark heart of heartless men!\nDeprived of love, feed crack, nurtured in sin!\nI'm unwanted children doped up on Ritalin by age ten\nAt sixteen a fiend! Nurturing a weed habit and a bottle of gin\nI'm the soul of women that's been betrayed by men\nThat trifling nigga looking to deceive her again\nEarn her trust again, then I lust again\nWhen she turn her back, I'm diggin in her friend again!\nI motivate your hate and embody your sin\nI spit it for Bloods, Crips and Mexicans\nI spit for Disciples and El Rukns\nThis sick soundtrack to robbing and looting\nNeighbor shootings, murder and boosting\nIts fear engaged, with a fury and rage\nFor my lost generation in these last days\nThe fear that haunts you! It's the tool that's used to hunt you!"}