{"song_id":21895,"song_name":"What We Do","artist_id":302485,"display_artist":"Freeway Featuring Jay-Z & Beanie Sigel","spotify_id":"5kDkWHFx0AEvJ1Pfm2i0ac","lyrics":"(Freeway)\n\nMan if I get rocked, this shit for my kids nigga\nIt's that real shit...\n\n(Female singer, repeated throughout the verses)\nEven though what we do is wrong...\n\nWe still hustle till the sun come up\nCrack a 40 when the sun go down\nIt's a cold winter\nY'all niggaz better bundle up\nAnd I bet it be a hotter summer, grab a onion\nYes the ROC gets down, you hot now, listen up\nDon't you know cops' whole purpose is to lock us down?\nAnd throw away the key\nBut without this drug shit your kids ain't got no way to eat, huh?\nWe still try to keep Mom... smilin'...\n'Cause when the teeth stop showin' and the stomach start growlin'\nThen the heat start flowin'\nIf you from the hood I know you feel me ( Keep goin'...)\nIf a sneak start leanin' and the heat stop workin'\nThen my heat start workin' I'm-a rob me a person\nCatch a nigga sleepin' while he out in the open... and I'm-a get him ( Keep flowin'...)\nWe gotta raise our kids while we livin'\nMake a million off-a record bail my niggaz outta prison\nFuck a Bentley or a Lexus just my boys in the squadder\nNigga talk reckless then I hit 'em with the Smif 'n...\nBut I'm never snitchin' I'm a rider\nIf my kids hungry snatch the dishes out ya kitchen\nI'll be wylin' till they pick me outta line-up...\nWe keep the nines tucked, chopped dimes up, rap about it\nWyle out, fuck niggaz up, laugh about it\nI'm not tryin' to visit the morgue but Freeway move out till I sit with the Lord\nTill I... get my shit together, clean up my sins\nFreeway got it in like 10 in the mornin'\nAnd I can get it to ya like 10 while you yawnin' mang...\nStill deliver the order mang!\nAnd I ain't talkin' bout chicken and gravy mang!\nI'm talkin' bout bricks 'o ye-yo, halves and quarters\n4 and a halves of hash you do the math\nSwing past us scoop up your daughter\nShe wanna roll wit' a thug that rap, you do the math\nHe won't blast till my stacks in order mang!\n\n(Jay-Z)\n...MANG! Lemme get 'em Free\nHove never slackin' mang, zippin' in the black Range\nFaster than the red ghost, gettin' ghost wit' Pac-Mang\nOne-time know a got a knack to get that change\nLeader of the black gang, R-O-C mang\nBang like T-Mac, ski mask air it out\nGotta kill witnesses 'cause Free's beard's stickin' out\nY'all don't want no witness shit, we squeeze hammers mang\nBullets breeze by you, like Lousiana mang...\nBut I gotta feed Tianna mang...\nSo I move keys you can call me the Piano Man\nRain... sleet, hail... snow man\nSlang dough, E, hydro man...\n\n(Beanie Sigel)\n...No, B. Sige in the third lane\nGramps still prayin' workin on my nerves man...\nLike, \"Son you gotta get your soul clean...\nBefore they blow them horns like Coltrane...\"\nBut still I cry tears of a hustler\nWipe tears from my mother, pull out beers for her brothers...\nThat's above us, make beds for the babies\nTuck kids under covers, buy cribs for their mothers\nShit I'll probably be wylin' with their fathers\nTell Ms. Robert, tell Enijah that I'm ridin' for her father\nThat's like my brother, like same mother different father\nAny problems dog know I got 'em\nAnd still we grind from the bottom\nJust to make it to the bottom sold crack in the alleyways\nStill gave back Marcy a Dollar Day\nReal gangstas make hood holidays\nThey ain't thank us but we still paid homage mang\nSoul Food Sunday lookin' like Big Momma's mang\nTell the gang I never break my promise mang... mang... unnh!"}