{"song_id":21918,"song_name":"Choppa Style","artist_id":299162,"display_artist":"Choppa Featuring Master P","spotify_id":"73oaAjfHAtUJDtul0QFlfs","lyrics":"C'mon C'mon C'mon C'mon C'mon C'mon\nOoooowwwww!\nWhat she want (ugh) what she want She want (repeat)\nOoooowwwww!\nOh yeah! OOOOOWWWWW!\nOh yeah! OOOOOWWWWW!\nOh yeah! OOOOOWWWWW! oh yeah!\n\nWho they want??\nChoppa Style Chop Chop Choppa Style\nChoppa Style Chop Chop\nShe want chop chop\nShe love chop chop\nShe want chop chop\nShe love chop chop\n\n(1)\nNow, I don't mean to sound rude, baby or hurt ya or nothin'\nI want a slim, fine woman who is workin with somethin', twurkin with somethin'\nBaby gotta hurt me wit nothin'\nIf you a slim, fine woman that mean you workin with somethin'\nI want a big, fine woman with some pop wit her\nShe ain't got a lot of ass but tiddy-bop wit her\nNow I came here to get it buck\nFor you hoes shake down if you wanna wobble, what\nBack it up or toot it up or don't stop\nWon't you bend that ass over now pop it like it hot\nPut yo head between your legs and touch your toes\nBounce your booty up and down--Ooh girl, there you go\nWon't ya walk like a model\nIf you a independent woman, maybe I'ma holla\nYou got your hair fixed nice, wit ya clothes tight\nYou wanna shake it like a dog and do it all night, all night\nNow assume the position and get it right\nPut your hands in the air, won't you make ya tiddies fight\nI'm Choppa Chop, you know what I'm bout\nI wanna see ya turn around and stick ya booty out, ya booty out\n\nWho they want??\nChoppa Style Chop Chop Choppa Style\nChoppa Style Chop Chop\nShe want chop chop\nShe love chop chop\nShe want chop chop\nShe love chop chop\nWho they want??\nChoppa Style Chop Chop Choppa Style\nChoppa Style Chop Chop\nShe want chop chop\nShe love chop chop\nShe want chop chop\nShe love chop chop\n\nIf you a...\n\n(Hold up Choppa! You gon hold it down for the independent women.\nWell what about them independent niggas?\nThe ones holdin' it down on that block, ridin' on dub doozies.\nShow what ya got, ya heard me?)\n\nAll right...\nIf you a independent woman holla (OOOOOWWWWW)\nIf you hate your baby-daddy holla (OOOOOWWWWW)\nIf you keep ya hair fixed holla (OOOOOWWWWW)\nHolla (OOOOOWWWWW) holla (OOOOOWWWWW)\nIf you a independent nigga holla (Oh Yeah!)\nIf you ridin' on dubs holla (Oh Yeah!)\nIf you hate your baby-mamma holla (Oh Yeah!)\nHolla (Oh Yeah!) holla (Oh Yeah!)\n\nNow won't you walk wit it walk it walk wit it\nWalk it walk wit it walk it walk wit it\nShake it shake wit it\nShake it shake wit it\nShake it shake wit it\nShake it shake wit it\n\nNow, we got a brand-new dance and it just won't stop\nPut your hand to the air and do the Choppa Rock\nIt go Choppa-pa Rock Rock\nChoppa Rock Rock\nChoppa-pa Rock Rock\nY'all ready? (Y'all ready?)\n\nWest Bank, where you at? Lemme get a handclap\nATL, where you at? Lemme get a handclap\nHouston, where you at? Lemme get a handclap\nMiami, where you at? Lemme get a handclap\nChi-Town, where you at? Lemme get a handclap\nDetroit, where you at? Lemme get a handclap\nMississippi, where you at? Lemme get a handclap\nNew Orleans, where you at? Lemme get a handclap\n\nWho they want??\nChoppa Style Chop Chop Choppa Style\nChoppa Style Chop Chop\nShe want chop chop\nShe love chop chop\nShe want chop chop\nShe love chop chop\nWho they want??\nChoppa Style Chop Chop Choppa Style\nChoppa Style Chop Chop\nShe want chop chop\nShe love chop chop\nShe want chop chop\nShe love chop chop\n\nNow where yo head go at when you want it from the back\nToot Toot that ass up\nShe like it like that\nWhere my niggas go at when they hit it from the back\nSmack smack that ass up\nShe like it like that\nWon't you wobble wobble, move that, show me how ya do that\nGirl you a fool yeah, make me holla ooh yeah!\nWobble wobble, move that, show me how ya do that\nGirl you a fool yeah, make me holla ooh yeah!\nNow won't you wobbbble for me? (C'mon) Won't you back it up for me? (C'mon)\nWon't you wobbbble for me? (C'mon) Won't you back it up for me? (C'mon)\n\nI said I don't know we ready\nI said I don't know we ready\nI said I don't know we ready\nI said I don't know we ready"}