{"song_id":21954,"song_name":"Never Scared","artist_id":296201,"display_artist":"Bonecrusher Featuring Killer Mike & T.I.","spotify_id":"6kXTho2v0p2hyPq7KdZGlq","lyrics":"Yeah! This nigga think we hoez or somethin' my nigga...\nSheeeit, man what the... lemme talk to the ma'fucca\nHow hard we really ma'fuccin is in this biaaaatch... nah'm sayin'?\nFuck nigga... sheit man, ole punk ass kids, we out the club nigga...\nDat sheeit don't mean nuttin nigga! I'm gon fuck this nigga up, my nigga!\nSheeeeit, lemme show this ma'fucca how hard this shit really is!\n\nSo I'm outside of da club and you think I'm a punk\nSo I go to my loaded tech 9 that's up in da trunk\nI told that muthafucka\nI ain't never scared (eastside!)\nI ain't never scared (westside!)\nI ain't never scared (southside!)\nI ain't never scared (northside!)\nI ain't never scared (southside!)\nI ain't never scared (eastside!)\nI ain't never scared (westside!)\n\nLet a choppa go PLOOOOOOWWW! to yo melon\nNow the plasma is oozin outta yo cerebellum\nAttenSHUNNNNN! Fuck nigga, now you swellin\nYou ain't talkin' hardcore, now is ya? Lil' bitch!\nGot'em runnin' scared of a... BIGGA NIGGA!\n'Cause I put the heat to his ummm... HILFIGER!\nNow on dat drank and on some of dat dank\nPistols gettin' bursted now I need somethin' to drank\n\nI got a hot 4 fever, call it bitch Benita\nKnock the apple off any bum or the hollow heat seaker\nRan 'cross bitch niggaz, fuck the pint, she take blood by the liter\nI'll never leave her, my viscous vixen\nOn liquor, send dat ass to God quicker\nNo matter yo religion, you Muslim, Hebrew or Christian\nShe indiscriminate with punishment, she send'em missin'\nMy gun's my favorite bitch and\nAnd she got permanent PMS so she stay bitchin!\n\nNo, I ain't bad, just don't kiss no ass or take shit\nAnd I'm a grown man, find you somebody to play wit\nIf you'on like me when you see me, betta not say shit\nI'll choke yo ass out like Dre did that bitch\nYou betta tell these pussies they ain't fuckin' wit no rookie\nI'm a Bankhead nigga, I'll take yo cookiez!\nSo don't make it a me or you situation\nI'll have yo partner down and I'll see you visitation\nLike, hope for the best, but I'on think he gon make it\nNot the way he was shiverin and shakin on the pavement\nI'll tell you wha, if you make it, call'em grace 'cause he amazin\nFind out these verses wasn't the only thang blazin' and\nJust when you thought that I was done I was savin' the\nBest for last, nigga kiss my ass\nLike Della Reese they my folkz, itz best you just let'em be\n'Cause I do the shit precincts and them FED's just ain't never see nigga!\n\nYEA NIGGA! Just break'em off muthafucka!\nWe the real niggaz! All you hatin' muthafuckaz, underachieverz...\nStep back, hoe nigga! Listen closely...\nWe ain't neva scared of none of you niggaz!\nT.I., Bone Crusher, Killer Mike, just break'em off niggaaaaaaaaaaa!"}