{"song_id":21992,"song_name":"How You Want That","artist_id":1496831,"display_artist":"Loon Featuring Kelis","spotify_id":"0EEYgsFx2xUQcFcQrwwEV3","lyrics":"(Pharrell Williams)\nHah hah hah hah - hah\nHah hah hah hah - hah\n\n(Intro: P. Diddy)\nYeah, Bad Boy baby!\nLoon! {*Loon humming*}\nIt's your turn now kid\nShow 'em what you got\n\n(Verse: Loon)\nI be that young handsome cat\nSame color chocolate\nSame nigga pop shit, same nigga got shit\nLoon ain't no lame, Loon never gossip\nNigga Loon in the game cause Loon got some hot shit\nSick of you cats screaming out block shit\nI done sold numerous drugs and drew the block sick\nLook at me now, pull up in the drop six\nBitch in your block looked at my watch and she got sick\nLook at her now, all up in the cock pit\nRolling my windows up to get a kid top quick\nLoon is a pimp, trick ain't the topic?\nNigga you do the shrimp, trip to the tropics\nThat's not my steez, not like me\nIt's not the way I wanna blow my cheese, like I blow my trees\nThe whole world know I need, a girl that'll curl my toes for me\n\n(Chorus: Kelis) (2x)\nHow you want that? Tell me how you want that\nHow you want that? Tell me how you want that\nDaddy how you want to give it to me\nA Bad Boy is what I need\n\n(Verse: Loon)\nLess confusion, party with Puff last conclusion\nGrab shorty there wit the hair, ass is huge and\nLips is juicy, way she move her hips so loosely\nCritical curves see it through furs\nCurious so I want to see if it's hers\nDelirious so I had to see if it's her (it wasn't me)\nI ain't touch you that's on me and my words\nYou ain't gotta flip the script, kick me to the curb\n'Cause I was, just checking you wasn't disrespecting you\nLips so sexual while your friend's protecting you\nBaby girl I know you're far from a slut\nI know the difference between a car and a truck\nI'm not a dumb nigga\nYou had these young niggas scarring you up\nYou know the difference between a scar and a cut\nYou're not a dumb nigga\nSo let's take it from the car to the club\nAnd hit the bar and get a bottle of bub, and have fun nigga\n\n(Verse: Loon)\nBaby all bubble, have a lil chat a small huddle\nTime to make money and more trouble\nAnd we all hungry and all hustle\nAnd we all humble, but together we got more muscle\nAnd we got dough, nigga me and P we hot yo\nMake a hip hop show look like a rock show\nOoh Jesus Christ! look the way that the rocks glow\nWant the world to see so we keeping them tops low\nRascal, keep it on my lap for Broscoe\nOne shot your blood drip thicker than Basco\nDrop though, keep the illest cat wit the hot flow\nWatch your pro turn grown men to a snot nose\nI pity a fool, never touch titties in schools\nSon you can't hang wit Diddy and Loon\nWe allstars, nigga playing bet he was cool\nGot more broads than you and any nigga in your crew, Bad Boy\n\n(P. Diddy) (Kelis in background)\nYeah! Bad Boy baby\nThe Legacy continues!\nWe won't stop, yeah, and another one\nAnd another one, let's go\n\n(Chorus - to fade)"}