{"song_id":22006,"song_name":"Flipside","artist_id":302485,"display_artist":"Freeway Featuring Peedi Crakk","spotify_id":"3dSsqTvkWZLQ7V4y4ftFgV","lyrics":"(Intro: Peedi Crakk)\nWHOOOOOOOOOO! UH!Now clap for me mami, OH\nJust clap for me mami, JUST BLAZE\nOkay, and Free, okay, yeah get wild lady UH\nQue tu quieres mujeres, said she blow la-la\nFLIPSIDE - and she my baby mama\nGet wild! Okay\n\n(Freeway)\nFreeway got the hood on smash\nPop in tape, step on gas and get ghost nigga!(ghost nigga!)\nFreeway got the club on lock, step on stage\nSet it down leave with a broad, check for her age\nPost up, fans suffer circle the block\nCall the cops - it's the Roc in your area!(rock in your area!)\nPost up, distribute to the block\nFreeway move the rocks in your area!(rocks in your area!)\nYeah, pop tried to shut me down\nCops tried to shut me down, haters wanna hit me up\nWhat? My glock carry heavy rounds\nMack carry heavy rounds packed in the Chevy truck\nWhat? You better ring the alarm\nBefore I cock back, dump on you and your boys\nAnd have black suits, tucked on you and your mom\nBut back to the song, said she wanna suck on me and the boys\nHer ass look good in a thong\nAnd she want me to sneak in the building like Trojan of Troy\nBest believe there's Trojans involved\nHats lift over the boy, oh boy\n\n(Chorus: Freeway)\nWe rip crowds, whole lot of VOLUME and a little bit of bass\nIs all it takes to make the place\nGET WILD, whole lot of style and a little bit of cake\nIs all it takes to make her skate\nFLIPSIDE (flipside) crack house and a little bit of base\nIs all it takes to make the block\nGET WILD (get wild) car keys and a little bit of cheese\nIs all it takes to make her leave\n\n(Peedi Crakk)\nWith these (with these) O.G.'s (O.G.'s)\nTell that hoe until she roll on a pole I'm tryna squeeze\nWith ease (with ease) then breathe (then breathe)\nI ain't Hov', I just know what I know\nI'm talkin' O. Sparks five, ride for a dollar bill\nFamous up in Hollywood, high in them Holly-hills\nI, can't deny how the mamis feel\nHidin the cable bill, slide with your baby girl\nP. Crakk and I ain't for play\nI got a mack that'll change your day\nFall back, get your act in tact\nP-I-M-P U-P H-O-E-S is all the rest\nAnd yes, this is Philly, you welcome to come check us\nCrakk, wherever I holla at be gettin' neck in\nPass her the thing, tell her make it go ring\nThe prince of S.P., is soon to be the king\nAnd we...\n\n(Freeway)\nNow how many hoes in your motherfuckin group?\nWanna take a ride in my '89 Delk\nShe felt the kid, thumbtack, held the roof\nUp on her cell phone, \"Freeway got me in the squadder\nHe a rider, from the block to the booth\"\nI'm as, real as they come, the gorillas'll come\nSix could chill till they come, gotta peel when they done\nBut let her spend the night, all night\nCause the heat call me a liar\nShe just like +Honey+ so I called her Mariah\nWanna see, if she got what it takes to carry across state\nAnd travel across state, with things taped to her waist\nMami wanna ride with pa\nBad bitches get scooped like Haagan Daas\nAnd put on the team shoot, put on the Bean bitch\nLean bitch, shoot at they entourage\nHit up the team camp, pull on your jeans bitch"}