{"song_id":22010,"song_name":"Where Is The Love?","artist_id":385091,"display_artist":"Black Eyed Peas","spotify_id":"3CNqo3gYrfexdrtjFmC9he","lyrics":"What's wrong with the world, mama?\nPeople livin' like they ain't got no mamas\nI think the whole world's addicted to the drama\nOnly attracted to things that'll bring you trauma\n\nOverseas, yeah, we try to stop terrorism\nBut we still got terrorists here livin'\nIn the USA, the big CIA\nThe Bloods and the Crips and the KKK\n\nBut if you only have love for your own race\nThen you only leave space to discriminate\nAnd to discriminate only generates hate\nAnd when you hate then you're bound to get irate, yeah\n\nMadness is what you demonstrate\nAnd that's exactly how anger works and operates\nMan, you gotta have love just to set it straight\nTake control of your mind and meditate\nLet your soul gravitate to the love, y'all, y'all\n\nPeople killin', people dyin'\nChildren hurt and you hear them cryin'\nCan you practice what you preach\nOr would you turn the other cheek?\n\nFather, Father, Father help us\nSend some guidance from above\n'Cause people got me, got me questionin'\nWhere is the love? (love)\n\nWhere is the love? (the love)\nWhere is the love? (the love)\n\nWhere is the love, the love, the love?\n\nIt just ain't the same, all ways are changed\nNew days are strange, is the world insane?\nIf love and peace is so strong\nWhy are there pieces of love that don't belong?\n\nNations droppin' bombs\nChemical gasses fillin' lungs of little ones\nWith the ongoin' sufferin' as the youth die young\nSo ask yourself is the lovin' really gone?\n\nSo I can ask myself really what is goin' wrong\nIn this world that we livin' in people keep on givin' in\nMakin' wrong decisions, only visions of them dividends\nNot respectin' each other, deny thy brother\nA war is goin' on but the reason's undercover\n\nThe truth is kept secret, it's swept under the rug\nIf you never know truth then you never know love\nWhere's the love, y'all, come on (I don't know)\nWhere's the truth, y'all, come on (I don't know)\nWhere's the love, y'all (come on yeah)\n\nPeople killin', people dyin'\nChildren hurt and you hear them cryin'\nCan you practice what you preach\nOr would you turn the other cheek?\n\nFather, Father, Father help us\nSend us some guidance from above\n'Cause people got me, got me questionin'\nWhere is the love? (love)\n\nWhere is the love? (the love)\nWhere is the love? (the love)\nWhere is the love?\nWhere is the love?\nWhere is the love? (the love)\nWhere is the love? (the love)\n\nWhere is the love, the love, the love?\n\nI feel the weight of the world on my shoulder\nAs I'm gettin' older, y'all, people gets colder\nMost of us only care about money makin'\nSelfishness got us followin' the wrong direction\n\nWrong information always shown by the media\nNegative images, is the main criteria\nInfecting the young minds faster than bacteria\nKids wanna act like what they see in the cinemas\n\nYo, whatever happened to the values of humanity?\nWhatever happened to the fairness and equality?\nInstead in spreading love we're spreading animosity\nLack of understanding, leading us away from unity\n\nThat's the reason why sometimes I'm feelin' under\nThat's the reason why sometimes I'm feelin' down\nThere's no wonder why sometimes I'm feelin' under\nGotta keep my faith alive till love is found (now ask yourself)\n\nWhere is the love?\nWhere is the love?\nWhere is the love?\nWhere is the love?\n\nFather, Father, Father help us\nSend some guidance from above\n'Cause people got me, got me questionin'\nWhere is the love? \n\nSing with me y'all:\nOne world, one world (We only got)\nOne world, one world (That's all we got)\nOne world, one world\nAnd something's wrong with it (Yeah)\nSomething's wrong with it (Yeah)\nSomething's wrong with the wo-wo-world, yeah\nWe only got\n(One world, one world)\nThat's all we got\n(One world, one world)"}