{"song_id":22029,"song_name":"Love At 1st Sight","artist_id":"null","display_artist":"Mary J. Blige Featuring Method Man","spotify_id":"null","lyrics":"Lookin' at you from a distance\nGettin' all of my attention\nCould this be love at first sight, baby\nYou walked away and I missed you\nVisions of wanting to kiss you\nHow could this be if I don't really know you?\nOh baby, baby\n\nCould it be love at first sight?\nAnd I never knew that I, could fall in love on the very first night\nCould this be love?\n\nYou had on the latest fashion\nIt was a bigger distraction\nIt drew me closer and closer to you, yeah, baby\nI never saw anything like this\nBut you I just could not resist\nI swallowed my pride and stepped through your side\nOr could it be - be\n\nCould it be love at first sight?\nAnd I never knew that I, could fall in love on the very first night\nCould this be love?\n\nI wanna know if you could call me up (could you call me up sometime? please)\nAnd maybe somebody we just might hook up, could this love at first sight?\n\nOnce again, it's that other M&M now\nHow many women feelin' him?\nSomebody call the coroner, quick, Mary is killin' 'em\nTell 'em what's the 411 and who came runnin'\nWhen Clef dialed 911 from shots comin'\nThis somethin' for the radio, guest starring M.C.\nJohnny Blazin' the hip hop and R&B\nWhat, y'all thought ya wasn't gon' see me\nYou can't spell Mary J. Blige without a J.B.\nWell back to the matter, and it's sex on the platter\nShe only wanna be happy and I ain't mad at her\nYou go momma, nowadays, I'm more calmer\nAnd if you take a look at my life, no more drama\nNow you know, you searchin' for a Wu-Tang pro\nYou find me, just bout everywhere the poontang go\nNow you know, feel me like your favorite love song\n'Cause my computer love is the thetruth.com\n\nCould it be love at first sight?\nAnd I never knew that I, could fall in love on the very first night\nCould this be love?\n\nCould it be love at first sight?\nAnd I never knew that I, could fall in love on the very first night\nCould this be love?"}