{"song_id":22032,"song_name":"Let's Get Down","artist_id":297014,"display_artist":"Bow Wow Featuring Baby","spotify_id":"43h9fe3xELbJJlyvG363SM","lyrics":"Huh... here I go y'all\nOk what is in () is what is being said in tha back ground...\nLet's get down\n\nBaby:\nBirdman! (ladies and gentlemen) mm-huh\nJazzy Fizzle product-shizzle my nizzle\nOh boy! wit lil bow wizzle (bow wizzle)\nAy... ay, I see you wit shorty huh\nTake her to tha mall pimp! (ah-huh)\n\nBow:\nOkay\n\nBaby:\nShow me how lil man roll! (ooowwee!)\n\nBow Wow\nI know this chick named Nichole\nThey call her boochie\nDidn't wanna shop nowhere but Gucci (but gucci)\nAnd Burberry and Proda was her style (ok)\nI'm tryin' to tell y'all that shorty could get down (uh-wow)\nConversations Amazing\nIn my 4, shorty's in heavy rotation (4-sho)\nThinkin' to myself like, this is the one\nBroke her down, told shorty how to do this hun! (4-sho)\nNeva gave her tha cold shoulda'\nIf she's in the benz, I let her take ova' the Rova (vrrm-Vrrm!)\nThen it's off to the movies, tell her\nI'm like austin, Let's get Groovy\nFrom tha movies to tha crib\nGit her (?) for ya heard that's what I did, And!(ok)\nI'll find me another one\nMore interesting, more fun\nTha man has just begun\n\nBow:\nIt's really, really nice to meet cha' ma (what's hap'nin)\nI'm really, really diggin yo style (yo style)\nSay you wanna go chill wit a balla huh (bow weezy Baby!)\nLet's get Down\n\nGirl:\nIt's really, really nice to meet ya boy\nYa know I'm really feelin' yo style\nYa know I wanna chill with a balla so\nLet's get down\n\nBaby:\nAy! I see what cha doin' lil bow wow (uh-huh)\nYa had a date. Ya did that. Now I want you to go world wide with it\nEastcoast, westcoast, mid-west, and down bound\n\nBow Wow\nI know this girl named Cindi (ok)\nLoves to rock Fendi (wow)\nWhen she leaves the mall\nThe stores is all empty\n\nEastcoast, Newyork, my up town chic (wow)\nI see her when I cruiz the park and 106 (holla)\nNext... Her name is Ra'nette (ghetto chic)\nShe lives on the west side I hit the L.A.X (ok)\n\nI'm so impressed by the way that she dress (she got gear)\nShe walks like a model, the girl is so fresh (so fresh)\nI got a few of them, here's what I do to them (what chu' do?)\nTake 'um out, try to teach somethin' new to them (hah-ok)\n\nIt's no thang, when you heavy in the game\nI got anotha' one who loves th mid-west swang!(st, loi-e)\nShe's from the show-men state\nSo I showed her my 'b' and my quater to eight, hey!(do yo thang)\n\nI know you cought on late\nBut that's 7:45\nNow shorty, now let's ride\nHop in the wip\n\nBaby:\nAy! now I'm about to test ya' p's lil bow wow. (uh-huh)\nSee lil one ova' there. She bout 25, and she been lookin' at cha'\nPull ova' there in ya ride on 22's and bust her out\n\nBow Wow Verse 3:\nI know this girl named keisha\nShe's no groupi\nBe far from the stars\n22's made her choose me\nLike oowwee\nTellin' all her friends in the benz\n'He don't really look 16 do he?'\n112, youngest thing on tha scene\nCouldn't believe when I seen\nHow she sqeezed in them jeans\nLooks like a tight situation\nMake a young man make flight reservations\nJust step, no intimidations\nI'm bow wow boo\nAccept no imitations\nShould have seen tha looks on they faces\nThe Ice plus light, makes for good converation\nYou tellin' me\nIt's a felony, to yell at me\nI blew her mind she was dazed momentarily\nBut luckily\nShe stayed for some therapy\nI stay pimpin' heavily\nMy game spittin' therolly (ha ha ha)\nSha-ty (shorty) ya lookin' fly boy. certified. Ya went platnium. Round tha world coast to coast\nYa good wit me. ya get a stunna Certification. R.R.A.A. ya good playa. lil bow weezy\nIt's yo turn shine baby (shine baby boy) do you lil daddy. (do U) Bow weezy baby!...\nLive it up bird call baby! Sha-ty (shorty) 5ft pimpin' boy. ya good wit me lil one. let's roll\n\n(Girls part in chorus)"}