{"song_id":22072,"song_name":"Where The Hood At?","artist_id":300046,"display_artist":"DMX","spotify_id":"4GyjcWah0pbgHf248WPQju","lyrics":"Now I gotta deal with this shit?\nAiyyo, ya niggas must be outcha fuckin' mind,\nThinkin' dog can't pull another motherfuckin' rabbit out the hat!\nNigga, I ain't gotta check out my motherfuckin' sleeves, you bitch ass niggas!\nFuck is y'all niggas...\nY'all niggas just thinkin' I'm sittin' around doin' nothin'?\nOh my God, y'all niggas can't be serious!\n\nWhere the hood, where the hood, where the hood at?\nHave that nigga in the cut, where the wood at?\nAll them niggas actin' up?! Where the wolves at?\nYou better BUST THAT if you gon' pull that!\n\nWhere the hood, where the hood, where the hood at?\nHave that nigga in the cut, where the wood at?\nAll them niggas actin' up?! Where the wolves at?\nYou better BUST THAT if you gon' pull that!\n\nMan, cats don't know what it's gonna be\nFuckin' with a nigga like me, D-to-the-M-to-the-X\nLast I heard, y'all niggas was havin' sex, with the SAME sex!\nI show no love to homo thugs\nEmpty out, reloaded, and throw more slugs!\nHow you gonna explain fuckin' a man?\nEven if we squashed the beef, I ain't touchin' ya hand!\nI don't fuck with chumps, for those that been to jail,\nThat's the cat with the Kool-Aid on his lips and pumps.\nI don't fuck with niggas that think they broads.\nOnly know how to be ONE WAY, that's the dog.\nI know how to get down, know how to BITE,\nBark very little, but I know HOW TO FIGHT!\nI know how to chase a cat up in the tree.\nMan, I'll give y'all niggas the b'iness for fuckin' wit me, is you crazy?!\n\nWhere the hood, where the hood, where the hood at?\nHave that nigga in the cut, where the wood at?\nAll them niggas actin' up?! Where the wolves at?\nYou better BUST THAT if you gon' pull that!\n\nOnce a song, I come though, guns is drawn\nBLAM BLAM, lungs is gone, sons'll mourn.\nFrom dusk till dawn, night time belongs to the dog\nOn the street past midnight? Look for 'em in the morgue.\nDon't play with these cats, 'cause I ain't got nothin' to say to these cats.\nFor the mothers that really do love 'em, please pray for these cats.\n'Cause I know niggas is hardheaded, but I ain't got the patience\nDon't want me havin' no patience, turn into more patients.\nMore trips to ICU 'cause I see you\nTryna get away with shit a real nigga wouldn't do\nWhere my dogs at? (RIGHT HERE) See them niggas? (RIGHT WHERE?!)\nGET 'EM BOYS! (RIGHT THERE) That's how we do... (AIGHT THEN)\nThis is for my dogs, this is for my dogs\nYo, where we at baby?! (creepin' through the fog)\nFrom then till now, don't ask me how\nKnow that we gon' roll like them niggas and hit every block on the job!\n\nWhere the hood, where the hood, where the hood at?\nHave that nigga in the cut, where the wood at?\nAll them niggas actin' up?! Where the wolves at?\nYou better BUST THAT if you gon' pull that!\n\nI did tapes doin' crimes, stomp niggas like grapes makin' wine.\nFive CDs with mad rhymes.\nDon't hit me with that positive shit, I know you lyin'\nYou really wanna stop niggas from dyin'? Stop niggas from tryin'!\n'Cause I ain't really got that time to waste\nAnd I thought I told you to get these fuckin' bums out my face\nLookin' atchu in your grill, I might be nice to cut\nOnce I split ya ass in two, you'll be twice as butt\nYeah, you right, I know ya style - PUSSY 'cause I'm fuckin' it\nSince we all right here, you hold my dick while he's suckin' it\nMOTHERFUCKER, don't you know you'll never come near me\nShove ya head up ya ass, have you seein' shit clearly\nNever heard that D be runnin', 'cause D be gunnin'\nI beat my dick and bust off in ya eye, so you can see me comin'\nEmpty clips and shells are what I leave behind\nAnd if they get me with the joint, they hit me with a three-to-nine\n\nWhere the hood, where the hood, where the hood at?\nHave that nigga in the cut, where the wood at?\nAll them niggas actin' up?! Where the wolves at?\nYou better BUST THAT if you gon' pull that!\n\nWHERE THE FUCKIN' HOOD AT?! (It's all good, the dog is the hood)\nNO ONE'S FUCKIN' WITH ME NIGGA, FO' REAL (It's all good, the dog is the hood)\nI AM THE HOOD, I AM THE STREETS (It's all good, the dog is the hood)\nYOU BITCH ASS NIGGA (It's all good, the dog is the hood)\nTAKE IT HOW YOU WANT, MOTHERFUCKER (It's all good, the dog is the hood)\nI'M IN THE HOOD ALL DAY (It's all good, the dog is the hood)\nI THINK I'M LIKE THE ONLY NIGGA, DOG (It's all good, the dog is the hood)\nThat can go to the projects (school street, home of the brave)\nBy his fuckin' self and be good\nYeah nigga, ask niggas on y.o. (my projects, y.o.)\nWHEN THE LAST TIME THEY SEEN DOG (Not too long ago baby)\nMotherfucker...\nDEE, WAAH, UGH... (Y'all niggaz is homeless)\nKATO... (Where the hood at?)"}