{"song_id":22106,"song_name":"If I Can't","artist_id":431969,"display_artist":"50 Cent","spotify_id":"7JeKXMQKm6GoLGTkNy2jZ0","lyrics":"Yeah, ha ha, yeah... yeah\n\n(Hook - 50 Cent)\nIf I can't do it, homie, it can't be done\nNow I'ma let the champagne bottle pop\nI'ma take it to the top\nFo sho I'ma make it hot, baby (baby)\n\n(50 Cent)\nI apply pressure to pussies that stuntin I pop\nStand alone squeezin my pistol I'm sure that I gotta\nNow Peter Piper picked peppers and don't rock rhymes\nI'm 50 Cent, I write a lil bit but I pop nines\nTell niggaz, \"Get they money right,\" 'cause I got mine\nAnd I'm around quit playin' nigga you can't shine\nYou gon be that next chump to end up in the trunk\nAfter bein hit by the pump, is that whut you want?\nBe easy nigga, I'll lay your ass out\nBelieve me nigga, that's whut I'm about, gangsta\nYou could find a nigga sittin' on chrome\nHit the clutch, hit the gear, hit the gas & I'm gone (Yeah!)\n\n(Hook - 50 Cent)\nIf I can't do, homie, can't be done\nNow I'ma let the champagne bottle pop\nI'ma take it to the top\nFo sho I'ma make it hot, baby (baby)\n\n(50 Cent, Dr Dre)\nI'm down for the action, he smart with his mouth so smack em\nYou holdin' a strap, he might come back so clap em\nReact like a gangsta, die like a gangsta for actin'\n'Cause you'll get hit and homicide'll be askin, \"Whut happened?\"\nOH NO look who clapped 'em with the VOLVO\n20 inch rims sittin' CHRO-CHROME\nEastside, Westside niggaz OH NO, NO GO\nEven my mama said, \"Something really wrong with my brain\"\nNiggaz don't rob me they know I'm down to die for my chain\nG-UNIT! We get it poppin' in the hood\nG-UNIT! Muthafucka whuts good?\nI'm waitin on niggaz to act like they don't know how to act\nI had a sip of too much Jack, I'll blow 'em off the map\nWith the mack, thinkin' it's all rap\nTill that ass get clapped and Doc say \"It's a wrap\"\n\n(It's a wrap, nigga)\n\n(Hook - 50 Cent)\nIf I can't do it, homie, can't be done\nNow I'ma let the champagne bottle pop\nI'ma take it to the top\nFo sho I'ma make it hot, baby (baby)\n\n(50 Cent)\nI been feelin' I had to teach lessons to slow learners\nGo head act up, get smacked in the head with the burner\nI don't fight fair, I'm dirty-dirty\nI'm from Southside Jamaica, Queens, nigga ya'heard me?\nWhen streetlights come on niggaz blast the nines\nGet locked up, they read books to pass the time\nIn the game there's up's and down's, so I stay on the grind\nNiggaz on my dick more than my bitch, I stay on they mind\nThey ain't nothin' they could do to stop my shine\nThis is God's plan homey, this ain't mine\nI played the music loud so Grandpa called me a nuisance\nAnd Grandma; who always gotsta put in her two cents\nI'm the drop out who made more more money than these teachers\nRuthless like the Coupe but I come with more features\nI am whut I am, you could like it or love it\nIt feels good to pull 50 grand and think nothin' of it\nFuck it\n\n(Hook - 50 Cent)\nIf I can't do, homie, can't be done\nNow I'ma let the champagne bottle pop\nI'ma take it to the top\nFo sho I'ma make it hot, baby (baby)\n\nIf I can't do it, homie, can't be done\nNow I'ma let the champagne bottle pop\nI'ma take it to the top\nFo sho I'ma make it hot, baby (baby)\n\nUh huh, hood make it hot\nDr Dre, Aftermath\nShady, ha ha"}