{"song_id":22190,"song_name":"The Set Up","artist_id":"null","display_artist":"Obie Trice Featuring Nate Dogg","spotify_id":"null","lyrics":"(Intro - Obie Trice)\nBitch I see you, cause you know I know you\nYeah I know you.\n\n(Verse - Obie Trice)\nLast time I saw you\nYou was brewed up, booed up, ready for a new fuck\nLast time you saw me\nI was P-I to the motherfucking M-P WHAT!\nAnd lately I heard you's a broke bitch livin' in the lower class suburb\nAnd lately the word is I live in a suburb and I don't fuck with birds\nShe used to pump on the block\nSell a nigga rocks, bail a nigga out BUT!\nShe tried to plot on a nigga, vacan't lot one shot bitch died go figure\nHe used to pay this bitch, gave her lots of shit\nFuck's wrong with this nigga man?\nHe used to bring her through the hood\nTreat the bitch to fuckin' good, my opinion\nWe used to blaze with the bitch, faded off the lick she x-rays the clip\nThis nigga bought braids for the bitch\nLouis Vuitton kicks and tricked on some sucka shit\nMeanwhile in the hood she drivin' around good\nThis bitch thinks she's in Hollywood\nMeantime she settin the nigga up\nTelling us what his stuff she's ready to get him stuck WHAT!\n\n(Chorus - Nate Dogg (Obie Trice))\nThick eyes but she full of surprises\nI swear this bitch is Shady (that's what I know)\nSex on her mind all the time\nAnd you think that that's your baby (you don't know)\nYou a good guy that's living a lie\nBut she told us where your safe be (it's what I know)\nIf you cool and she satisfied\nHow come that bitch just paged me? (you don't know)\n\n(Verse - Obie Trice)\nWe had to ride on a nigga\nWATCH HIM! for the right time to get richer\nWe decided when the hit was, run up on him, .45 in the ribs WHAT!\nThis nigga screamed like a bitch\nShowed us what his shit hit her, hell of a lick BUT!\nThe bitch, who told us 'bout the bricks exposed us to the nigga\nHe knew that we'd come BUT! {*gun shot*}\nMeanwhile in his hood, his niggaz is suiting up and Timbed, looted up\nRims and new trucks your man 'Livin' It Up'\nThen a van with no hubs suddenly pulled up and erupt\nShot a nigga the fuck up\nJust my luck, the bitch got us both touched, it's like a rush\nThe bitch who blushed and smoked blunts wit us\nTurned out to be nuts, switched up\nMixed up wit the wrong slut\nGot my friend zipped up in the bag, it's all bad\nMy niggaz got my back, in fact\nThey caught on her Ave, flossin in another nigga cab"}