{"song_id":22237,"song_name":"Ride Wit U","artist_id":1496519,"display_artist":"Joe Featuring G-Unit","spotify_id":"28DDh8OK8Ls6dWEwz1Tm1A","lyrics":"(Joe)\nEverybody say ride wit u, ride wit u, yeah its\n\n(50 Cent)\n50 cent, yeah and lloyd banks, yeah, and young Buck, yeah, and joe. G-Unit!\n\n(Lloyd Banks)\nBaby were gonna rock 'n' roll, with joe to the cover\nWe'll still hit the blocks and I'm sold\nWith you can you picture, me and you none of your friends, no crew we gonna do whatever you wanna do\nI'll take ya mind off whatever you goin' through\nJust sit back and relax to the sound of the sax\nI'm hood but that don't mean I ride around with the rats\nI work and make ya lose a couple pounds in the sack\n\n(Joe)\nLook at what we got right here such a work of art\nSomeone I'll give my heart to any thing, it's what I'll do\nJust so that she would be mine, I give her all my time, every part of me my\nMind, soul, and my body what's up?\n\nRide with ya, ride with ya, I wanna move with ya, move with ya, move with ya, I wanna ride with ya, ride with ya, ride with ya, I wanna move with ya, move with ya, move with ya, I wanna ride\n\n(Joe)\nThe type that just don't care\nIf it's you I want I'm gon' come and get you and see what's really good with you\nPlease believe I'll take you there\nBut first lets see if your intellectual matches up with your physical baby\n\n(Young Buck)\nCome on and ride with a thug we can do what you like\nA baller baby you see the blue in my ice\nDrop the top and let your hair blow back\nThem j.lo jeans girl that ass so fat\nBuck know just what to do with all that\nChest to chest so ill hit it from the back\nI do it like a pro, wont nobody know\nLets pop some more ride and listen to joe\n\n(Joe x2)\nI just want to let you know that, that ooh your so beautiful (your so beautiful) and that Nothings impossible the places that we can go (we can go anywhere baby)\n\n(Joe x2)\nI just want to let you know that, that ooh your so beautiful (your so beautiful) and that Nothings impossible the places that we can go (we can go anywhere baby)"}