{"song_id":22292,"song_name":"Whats Happnin!","artist_id":431622,"display_artist":"Ying Yang Twins Featuring Trick Daddy","spotify_id":"6QVDBajBKQAz7RSS66k4vF","lyrics":"(Intro) (Airplane taking off in background)\nMiiiaaammmmiiii... (echo)\nHey, hey, hey, hey, hey, hey, hey, hey, hey, hey\nHey, hey, hey, hey, hey, hey, hey, hey, hey, hey\nHey, hey, hey, hey, hey, hey, hey, hey, hey, hey\n\nBOOM! it's on, bitch nigga we'll rock yo' Dome\nBOOM! bitch what's happnin'? (WHAT?!)\nBOOM! bitch what's happnin'? (WHAT?!)\nBOOM! it's on, bitch nigga we'll rock yo' Dome\nBOOM! bitch what's happnin'? (WHAT?!)\nBOOM! bitch what's happnin'? (AIGHT YEP!)\n\n(Verse One - Trick Daddy)\nHalf step pussy ass nigga\nWhy you lookin' at a nigga like you wanna run one wit' me?\nI got my big gun wit' me don't feel like doofin' I feel like shootin' FOOL!\nAnd I don't like your atitude\nYou do shit that dem hoes on a rag'll do\nOl' faggot, you better watch your mouth\nFo' I be in front yo' house, when yo' ass come out\nOl' bitch ass, hold another nigga dick ass, BITCH ASS, NIGGA!\nKeep lookin' at a nigga like you gonna tell somethin'\nI'll fuck around and, kill ya!\nSo now that you set you ready, YO!\nIf this shit get silly I'm lettin' it go\nFirst scrito in the front seat\nYou ever come my way, it's gon' be gunplay\nHEEEYYY... I ride wit' the AK, get high and spit five out the AK\nOk, let a nigga play and watch T-Double-D knock ya ass of the free seat\nAll my Dade County Chevy boys, who drive candy toys and tolt guns galore\nAnd treat the Hummer like a Tonka toy\nGot shit you niggaz ain't seen before\n\nBOOM! it's on, bitch nigga we'll rock yo' Dome\nBOOM! bitch what's happnin'? (WHAT?!)\nBOOM! bitch what's happnin'? (WHAT?!)\nBOOM! it's on, bitch nigga we'll rock yo' Dome\nBOOM! bitch what's happnin'? (WHAT?!)\nBOOM! bitch what's happnin'? (AIGHT YEP!)\n\n(Verse Two)\nYing Yang and the T-Double-D\nWe, in this motherfucker crunk in this motherfucker\nAtlanta niggaz wit' a Miami boy\nAnd I still like to play wit' my Tonka toy\nI'm a Toys R Us kid, yes I is\nYou can't be serious, yes I is\nYou think I'm playin' than ask my brother\nYou still don't believe me than ask my mother\nBecause I love my gun, I play wit' my gun\n\n\nHave fun wit' my gun, have sex wit' my gun\nAnd I don't put the motherfucker out for fun\n'Cause I ain't funna' get ya ass tryin' to run\nI'ma bust one time, bust two times\nAnd the third time yo' ass is mine\nGo down for the count, \"He can't get up!\"\nDAMN! he fallen and he can't get up!\n\nBOOM! it's on, bitch nigga we'll rock yo' Dome\nBOOM! bitch what's happnin'? (WHAT?!)\nBOOM! bitch what's happnin'? (WHAT?!)\nBOOM! it's on, bitch nigga we'll rock yo' Dome\nBOOM! bitch what's happnin'? (WHAT?!)\nBOOM! bitch what's happnin'? (AIGHT YEP!)\n\n(Verse Three)\nYou a soft mo'fucka, kind of gay mo'fucka\nIf you mad 'cause you like you never had mo'fucka\nFuck yo' ass mo'fucka, that's the past mo'fucka\nAnd I know the fact make ya mad mo'fucka\nIt iiiss... what I thought nigga think it ain't\nFor reeeaall... Ying Yang and we off the chain\nWit the T-Double-D, we bolo\nF**K hoes niggaz ride by my Dolo\nGet the keys to my car, and I jump in\nHit the Liquor store, buy my Cigars and 'gen\nGet drunk and I'm off in the wind\nLookin' for a itty bitty pretty that could hold a sin\n\nWe smokin', and ridin'\nDon't tell nobody be quiet\nMight cut it lil' butt it\nCan't let this shit get ugly\n\nBOOM! it's on, bitch nigga we'll rock yo' Dome\nBOOM! bitch what's happnin'? (WHAT?!)\nBOOM! bitch what's happnin'? (WHAT?!)\nBOOM! it's on, bitch nigga we'll rock yo' Dome\nBOOM! bitch what's happnin'? (WHAT?!)\nBOOM! bitch what's happnin'? (WHAT?!)\n\nHey, hey, hey, hey, hey, hey, hey, hey, hey, hey\nHey, hey, hey, hey, hey, hey, hey, hey, hey, hey\nHey, hey, hey, hey, hey, hey, hey, hey, hey, hey\nOh my god, from the south to the bottom\nTrick Daddy Dollaz, Ying Yang Twins, Beat N Azz\nCollipark Music Incorperated\nThis that next level right here, it's that crunk party\nAll these niggaz doin' crunk music, we crunk party nigga\nBe original wit' it, Hey man who really run the south?"}