{"song_id":22306,"song_name":"Selfish","artist_id":279605,"display_artist":"Slum Village Featuring Kanye West & John Legend","spotify_id":"7sZCAHP2duHwr5M5K7lHsb","lyrics":"Artist: Slum Village featuring: Kanye West and John Legend\nSong: Selfish\n\n\n(Intro and Chorus: John Legend) (Slum Village and Kanye West)\n...Calling (yeah maybe I'm selfish)\nOut to (I want you to myself I can't help it)\nAll my (yeah maybe I'm selfish)\nY'all my, ladies and I can't (maybe I'm selfish)\n(I can't) Let you (let you)\n(I want you to myself I can't help it)\nBe with no one (yeah) but me (yeah) baby\n\n(T3)\nTo my thick chicks down in Texas\nAll the way to New Orleans where da girls cook catfish\nAnd in LA every chick's an actress\nHollywood status with the shaded glasses\nTo Detroit, yeah the place that I rest\nWhere the ladies got ass to sell a lot of sex\nAnd Hot Atlanta y'all is one of the best\nWhere they speak southern and slang and smoke la cess\nAnd New York women are way too fresh\nToo much on your mind let me ease that stress\nI wish you all were mine it's so selfish\nMaybe I'm feelin' myself too much I guess\nBut, to my ladies all across the globe\nIn small towns that I don't even know\nTo all local international codes\nWhether you see me in streets or catch me at shows, I'm callin...\n\nI'm callin (yeah maybe I'm selfish)\nOut to (I want you to myself I can't help it)\nAll my (yeah maybe I'm selfish)\nY'all my ladies and I can't (maybe I'm selfish)\n(I can't) Let you (let you)\n(I want you to myself I can't help it)\nBe with (yeah) no one (yeah) but me (yeah) baby\n\n(K. West)\nUh! And I'll be trying to come around my girl acting like Mr. Friendly\nAnd steal the spotlight like Mr. Bentley\nI spotted her like Spud McKenzie\nAnd for them fake boobies I paid them Benjies\nGet your own, I got Paris he got Nicky he tried to get 'em a clone\nHe said yeah you know you got extra hoes\nAnd everything you do is extra cold\nFrom the Polo fleece to the Jesus piece\nI got family in high places like Jesus' niece\nCan I please, say my peace\nIf y'all fresh to death, then I'm deceased\nAnd this one here, is a heat rocks\nSpit like a beat box, the way the beat rocks\nNew version of Pete Rock!\nBut for that Benz I get CL love\nSo I switch my girls around like 3LW\nI'm calling\n\nI'm calling (yeah maybe I'm selfish)\nOut to (I want you to myself I can't help it)\nAll my (yeah maybe I'm selfish)\nY'all my ladies and I can't (maybe I'm selfish)\n(I can't) Let you (let you)\n(I want you to myself I can't help it)\nBe with (yeah) no one (yeah) but me (yeah) baby\n\n(Baatin)\nWhat up Pam how your little man doin' in New Jersey\nLast I heard he caught the flu and you was worried\nHope he feels better, and thanks Jonetta from Cleveland\nFor that good head in your Jetta better believe it\nShanice you're my piece from Compton\nBefore I mark the plane make sure you cop them trees to spark up\nDanielle ATL got them pictures in the mail\nYou sealed with a kiss and you send it with Chanel\nYou lookin' good in that one showin off your body\nHad a Beverly Hills mami that would buy me Cardi's\nTake me to after parties her name was Carrie\nAnd it sucks that we didn't keep in touch I'm sorry\nBut, hey Kim how's Minneapolis?\nYou so pretty hate to show off your titties for silly classes\n'Cause I love you girls though you ain't mine\nI wish my arms was long enough to hug you all of the same time\n\n(Chorus: John Legend)\nI'm calling (yeah maybe I'm selfish)\nOut to (I want you to myself I can't help it)\nAll my (yeah maybe I'm selfish)\nY'all my ladies and I can't (maybe I'm selfish)\n(I can't) Let you (let you)\n(I want you to myself I can't help it)\nBe with (yeah) no one (yeah) but me (yeah) baby\n\n(Outro: John Legend)\nI'm calling (calling) out to (out to) all my (all my)\nY'all my, ladies and I can't (I can't) let you (let you)\nBe with, no one, but me, baby"}