{"song_id":22325,"song_name":"Sunshine","artist_id":307297,"display_artist":"Lil' Flip Featuring Lea","spotify_id":"7FH0VxmvgfPJWfvillVzfE","lyrics":"(Feat. Lea)\n\n(Intro: Lea, (Lil' Flip))\n\n(Lea) Uh\n(Lil' Flip) Yeah\n(Lea) Oh, oh, oh, oh baby\n(Lil' Flip) Lil' Flipper (Lil' Flipper)\n(Lea) Ooh baby\n(Lil' Flip) My girl Lea (my girl Lea) hit it\n\n(Chorus: Lea)\nSunshine\nI can call you my baby boy\nYou can call me your baby girl\nMaybe we can spend some time (some time)\nI can be your sunshine!\nI can call you my baby boy\nYou can call me your baby girl\nMaybe we can spend some time (some time)\nI can be your sunshine!\n\n(Verse 1: Lil' Flip)\nLook, I know you wanna chill wit a player\nBut all you got to do is keep it real wit a player\nJust answer your phone whenever I call\n'Cause I'm riding on chrome whenever I ball\nI like them short and tall but not too thick\nI just walk in the spot and take my pick\nAnd they wanna roll 'cause they like my style\nAnd when I pop my collar I make them smile\nI need a lady in the streets but a freak in the sheets\nThat know how to cook cause a nigga like to eat\nSpaghetti, shrimp and steak and I'll adore you\nI'll treat you like milk, I'll do nothing but spoil you\n\n(Chorus: Lea)\n\n(Verse 2: Lil' Flip)\nI know your friends wanna holla 'cause I got them dollars\nPush the Maybach Monday, Tuesday Impala\nI switch whips like kicks I'm a balla (I'm a balla)\nAnd if I get your phone number I'm a call ya (I'm a call ya)\nAnd we can meet up the next day and chill\nBut I'm always on the road baby girl, that's how I live\nI got bills to pay, I got moves to make\nBut when my plane touch down, pick me up at 8:00, don't be late\n\n(Chorus: Lea)\n\n(Verse 3: Lea)\nWe don't have to be in love (love)\nWe can just be friends!\nI will be right there, beginning to the end!\nI can bring my girls (girls), you can bring your friends (friends)\nWe can both have fun, don't want this stuff to end!\n\n(Verse 4: Lil' Flip)\nThey say love is pain and pain is love\nI know ya Momma mad cause you talk to a thug\nYou think you know my type but you ain't got no clue\nAbout - what a nigga like me do\nI like to stack my bread and flip my chips\nAnd I can change ya life if ya get wit Flip\nI take private jets to Vagas, man\nIt's twenty bread each pick 'cause I'm major man\nWe can cruise the world in a Bently Azure\nBut don't worry, the chauffeur open the door\nYou couldn't ask for more 'cause we got it all (we got it all)\nCause you my baby girl right?, right?\n\n(Chorus: Lea)\n\n(Outro: Lea)\nWe don't have to be in love (love)\nWe don't have to be in love (love)"}