{"song_id":22330,"song_name":"So Sexy","artist_id":430584,"display_artist":"Twista Featuring R. Kelly","spotify_id":"2Hj9KZKzACUkCgd4tLcsvj","lyrics":"(Feat. R Kelly)\n\n(Intro: R. Kelly)\nUh, uh (uh-huh) uh\nYeah, this is for all the sexy ladies out there\nUh... walkin' around downtown\nShoppin' at the malls, yeah\n... I see you in your sexy jeans\nManicure, pedicure mamis\nYour hair is good, yeah, I see you\n\n(Chorus: R. Kelly)\nLADIES! (You're... so... se-xy) So sexy\n(Per-fect... for... me) And I like you\n(You're... so... se-xy) So sexy\n(Per-fect... for... me) And this is for\n\n(Verse One: Twista)\nMy ladies that be steady sippin Cris'\nAlways lookin' nice, put some ice on they belly or they wrist\nGirls that be thick off in they thigh, I wanna kick it in the Chi\nThey gon' be fuckin' with some Kelly and the Twist'\nBaby now look, model girls, Gucci and Prada girls\nAnd all the ghetto divas in the hood\nWomen that be steady stackin ends\nRollin' Lexus or Benz with rims and know how to keep it lookin' good\nGo on witcha fine thick ass\nSomebody gon' snatch you so I gotta make you mine quick fast\nSee I come and pass, I don't really wanna wonder\nSo I gotta put her numbers on my sidekick fast\nRollin' witcha mob workin hard, gettin' money, pullin capers\nIf I ain't got papers you will bring me some beans home\nSupervisor givin' orders on the job\nBut you still lookin' good with them skin-tight jeans on\nLookin' hot in them heels, I think I want that\nCome and back it up to the bottom of my throwback\nWith you rollin' yo' rims lookin' like a Kodak\nWatch I drive I wanna smoke, she will roll that\nMiss mobstress rollin' with the hardest\nHoldin' it down like a female Joe Pesci\nAnd I wanna make her a made woman\nAnd I hope she gon' let me, 'cause she looks so sexy\n\n(Interlude: R. Kelly)\nOh! And this is for them girls that be wantin - the D\nAnd this is for them girls that be lovin' - the D\nAnd this is for them girls that be ridin' - the D\nThe ones that like to keep the D up inside 'em now\nSo many girls off up in the mall boy a nigga be in the club (oh!)\nSoon as one of them walk by me and I be like, \"Yo whassup?\"\n\n(Verse Two: R. Kelly)\nAll the shrimp and lobster honeys, downtown shoppin' honeys\nStayin on the grind, gotcha own car and crib honeys\nDro puffers, Remi sippers, V.I.P. real honeys\nNo dummies, takin' no shit from a nigga that's full of shit honeys\n\n(Verse Three: Twista)\nMe and my clique was - rollin' thick on 24's on a dirty lick\nMet a chick, lookin' fine and her measures was\n36-24-36, come here shorty\nAin't no reason to be scared of us\nLovin' how you do your own thang\nAnd how you smokin' on your own flame\nLookin' finer than a girl that be groovin on Soul Train\nI try to to hit her with some cold game\nI hope she - feel me; try to holla at a shorty\nGet a better vibe wit her while I'm sippin on my - Henny\nI wanna kiss her on her body\nBut I gotta make her holla while I'm givin' her - the D\nGotta really love a girl\nThey know to kick it but she know she gotta make that - money\nGoin' shoppin' for the minks and the leather\nBut come back and bounce that ass - for me\nMy East coast girls, that's what's up\nTell my Southside shorties we can get it crunk\nMy Cali girl make it bounce like a six-fo'\nMy Chi girl bust down, make it straight buck\nWhen I see up all the girls that get down for hers\nI gotta get up wit her if she gon' let me\nCareer woman with some goals, fuck the broke-ass hoes\nBaby girl cause you look so sexy"}