{"song_id":22429,"song_name":"Westside Story","artist_id":1490221,"display_artist":"The Game Featuring 50 Cent","spotify_id":"61GzG81BTR3pxEPOX24I1i","lyrics":"Crip niggas, Blood niggas, Ese's, Asians\nDominicans, Puerto Ricans, White Boys, Jamaicans\nLatin Kings, Disciples, Vicelords, Hatians\nAll these muthafuckers been patiently waitin'\nSince the west coast fell off the steets been watchin'\nThe west coast never fell off I was sleep in Compton\nAftermath been here the beats been knockin'\nNate Dogg doin' his thing DPG still poppin'\nI got California love fuckin' bitches to that Pac shit\n& westside connection been had it locked bitch\nI'm in the rear view my gun's is cockin'\nI'll put red dots on that nigga head like rodman\nAll stars, phat laces, gun charge, court cases\nFaught that, not guilty I'm back\nNiggas hate me been there, done that, sold crack\nGot jacked, got shot, came back jumped on Dre's back, payback\nHomey I'm bringin' CA back\n& I don't do button up shirts or drive Mayback's\nAll you old record labels tryin' to advance\nAftermath bitch take it like a muthafuckin' man.\n\nIf you take a look in my eyes\nYou see I'll be a gangsta 'til I die\nThat California chronic got me so high\nGame tell them where you from\nNigga Westside! \n\nI'm lowridin' homey, 6 Trey impala\nGold D spinnin' chrome hydraulics\nRun up on my low-low you stop breathin'\nHollow tips make niggas disappear like houdini\nGang bangin' is real\nHomey I'm livin' proof like Snoop Dogg C-Walkin' on top of the devil's roof\nRap critics wanna converse about this & that\nCause red strings in this converse & this a Dre track\nKeep jibberin' jabberin' I'll pull a .38 magnum\n& get the clickin' & clackin'\nYa homies will wanna know what happened\nCome to Compton & see Thriller like Michael Jackson\nI might be Spike Lee, All this gun clappin'\nPrior to rappin' I was drug traffic\nIn the dope spot playin' John Madden\nHomey I ain't braggin' I took 5\nYou wanna die? ...Run up on that black 745...\n\nIf you take a look in my eyes\nYou see I'll be a gangsta 'til I die\nThat California chronic got me so high\nGame tell them where you from\nNigga Westside! \n\nNew York New York, big city of dreams\nI got my L.A. Dodger fitted on I'm doin' my thing\nGot me fuckin' wit G-Unit you know the drama that brings\nI got niggas in Westside Compton & Southside Queen's\n& Buck told me in Cashville I'm good when I come through\nSo I don't gotta tuck in my chain like DJ Po'\nI'm gangsta more like Deebo when he was Zeus\nPlay bishop I paint that picture now who got the juice\nYou niggas is nuts so, I take off your roof\nLeave your ass streched out like a Cadillac Coupe\nGod gotta let me in Heaven all the shit I been through\nI was an OG in the hood before I turned 22\nHomey I'll let the .38 special rip through that vest\n& I now Ion contemplatin' whether or not he left that shit on the dresser\nGot Compton on my back\nI'm startin' to feel the pressure\nI'm lyrically Kool G. Rappin' these Dre Records.\n\nIf you take a look in my eyes\nYou see I'll be a gangsta 'til I die\nThat California chronic got me so high\nGame tell them where you from\nNigga Westside! "}