{"song_id":22439,"song_name":"1, 2 Step","artist_id":299324,"display_artist":"Ciara Featuring Missy Elliott","spotify_id":"3x9LFpV6tzq0qWaBMvY2UT","lyrics":"Ladies and gentlemen (ladies and gentlemen, ooowee)\nThis is a Jazze Phizzle Productshizzle (Jazze Phizzle)\nMissy (Missy)\nThe princess is here (Ooowee) (She's here)\nCiara! (This beat is)\n\nAutomatic, supersonic, hypnotic, funky fresh\nWork my body, so melodic, this beat flows right through my chest\nEverybody, ma and papi, came to party, grab somebody\nWork your body, work your body, let me see you one, two, step (Here we go)\n\nRock it, don't stop it, everybody get on the floor\nCrank the party up, we about to get it on\nLet me see ya, one, two, step, I love it when ya, one, two, step\nEverybody, one, two, step, we about to get it on (This beat is)\n\nOutrageous, so contagious, make you crave it (Jazze made it)\nSo retarded, top-charted, ever since the day I started\nStrut my stuff and, yes, I flaunt it\nGoodies make the boys jump on it\n\nNo, I can't control myself\nNow let me do my one, two, step (Come on!)\n\nRock it, don't stop it, everybody get on the floor\nCrank the party up, we about to get it on\nLet me see ya, one, two, step, I love it when ya, one, two, step\nEverybody, one, two, step, we about to get it on (This beat is)\n\n(We gon' drop the beat like this, ooowee)\n\nIt don't matter to me, we can dance slow (Ladies and gentlemen!)\nWhich ever way the beat drop, our bodies will go (I like this)\nSo swing it over here, Mr. DJ (Hey, hey)\nAnd we will, we will rock you (Oh yeah)\n\nIt don't matter to me, we can dance slow (Dance slow yeah, yeah)\nWhich ever way the beat drop, our bodies will go (Hey, hey)\nSo swing over here, Mr. DJ (Ladies and gentlemen)\nAnd we will, we will rock you\n\n(I shake it like jello, make the boys say 'Hello'\n'Cause they know I'm rockin' the beat\nI know you heard about a lot of great MC's\nBut they ain't got nothing on me)\n\n(Because I'm 5 foot 2, I wanna dance with you\nAnd I'm sophisticated fun\nI eat fillet mignon and I'm nice and young\nBest believe I'm number one) (Ooh!)\n\nRock it, don't stop it, everybody get on the floor\nCrank the party up, we about to get it on\nLet me see ya, one, two, step, I love it when ya, one, two, step\nEverybody, one, two, step, we about to get it on (This beat is)\n\nRock it, don't stop it, everybody get on the floor\nCrank the party up, we about to get it on\nLet me see ya, one, two, step, I love it when ya, one, two, step\nEverybody, one, two, step, we about to get it on\n\n(This is for the hearing impaired\nA Jazze Pha production)\n\n(Ooowee!\nOoowee!)"}