{"song_id":22451,"song_name":"Encore","artist_id":301722,"display_artist":"Eminem Featuring Dr. Dre & 50 Cent","spotify_id":"null","lyrics":"(50 Cent) \nSh-Sh-Sh-Shady \nAftermath, ha ha \nG-G-G-G-G-Unit!, ha ha \n\nFirst we came here to set this party off right \nLet's bounce tonight \nAnd if they don't let us in through the front \nWe'll come through the side\n\n'Cause I don't ever wanna leave the game without \nAt least saying goodbye \nSo all my people on the left, all my people on the right \nScream one last time \n\n(Eminem)\nGet your ass up for the Doctor \nOne more time, get your ass up for the Doctor \nCome on now, here we go \nCliff hanger, it's another club banger \nGot you hangin' on the edge of your seat \nGet on down \n\n(Dr. Dre)\nTimes up, game's over, you lose, I win \n'Bout to show these knuckleheads how to do this here \nOoh yeah, new year, next phase, begin \nLook who's got you goin' crazy again\n\nI'm a trend, I set one every time I'm in \nI go out and just come back full circle again \nYou a fad, that means your something that we already had \nBut once you're gone, you don't come back, too bad \n\n(Eminem)\nYou're off the map now, radar can't even find you \nWe stay on the grind, you slip, we out-grind you\nYou walk around mad, you let your anger blind you \nWe walk around just playin' the violin behind you\n\nEnough with all the pissin' and moanin', whinin' and bitchin' \nSit and observe, listen, you'll learn if you pay attention\nWhy 10 multi-platinum albums later, three diamond\nWorldwide, we're on the charts with a bullet and still climbin' \n\nFirst we came here to set this party off right \nLet's bounce tonight \nAnd if they don't let us in through the front \nWe'll come through the side\n\n'Cause I don't ever wanna leave the game without \nAt least saying goodbye \nSo all my people on the left, all my people on the right \nScream one last time \n\n(Eminem)\nWhen Dr. Dre say crunk, you will get it crunk, get it crunk \nCrunk, crunk, crunk \nAnd when 50 Cent says jump, you get on one foot and jump \nJump, jump, jump, jump \n\n(Dr. Dre)\nThe buzz is tremendous, we drop you all to sense it \nI don't gotta promote it for you to know that Doc is off the benches \n\n(Eminem)\nWe keep the party rockin' off the hinges \nWe ain't showin' off, we just goin' off popular consensus \n\n(Dr. Dre)\nBut critics say that Doc is soft, Doc is talk \nDoc is all washed up, knock it off \nWho the fuck is Doc impressin'? \nDoc is this, Doc is that, you got the wrong impression \nYou must be on the cock of Doc, 'cause Doc left you all guessin'\n\nSo DJ take the needle and just drop it on the record (what) \nWe gon' have this motherfucker hoppin' in a second (bump bump) \nThat's why we always save the best cut last \nTo make you scratch and itch for it like fresh cut grass\n\n(Eminem)\n'Cause we done swam with the sharks, wrestle with alligators \nSpoke to a generation of angry teenagers \nWhom if it wasn't for rap to bridge the gap \nMaybe raised to be racist\n\nWho may have never got to see our faces \nGrace the cover of Rolling Stone pages \nBroke down barriers of language and races \nJust call on the cape crusaders\nAnd leave it to me and Dre to pass the mic \nAnd we can play the back and forth all day \nLike the hot potato game, that's why we came to \n\nFirst we came here to set this party off right \nLet's bounce tonight \nAnd if they don't let us in through the front \nWe'll come through the side\n\n'Cause I don't ever wanna leave the game without \nAt least saying goodbye \nSo all my people on the left, all my people on the right \nScream one last time \n\n(Eminem)\n50 Cent, come on! \n\n(50 Cent)\nBounce now, hands up, you know how we do \nWe make the club jump everywhere we go\nIt's no secret, everybody know \nWhen Dre's involved, there's plenty money involved \n\n(Dr. Dre)\nAnd plenty honeys involved, the sunny Sundays and palm trees \nCali, every day it's just another party from the valleys \nAll the way to them 8 Mile alleys, let's rally \n\n(Eminem)\nHands up for the grand finale \n\nNow raise up out your seat, Dre is about to speak \nBlaze a pound of weed six days up out the week \n\n(Dr. Dre)\nYou could catch me in the studio bangin' out the beats to \nProvide you with the heat that keep blazin' out your speaker \n\n(Eminem)\nSo nervous, ain't never 'cause Shady Aftermath together \nAlong with G-Unit Records presents the return of the-the Doc (and Shady) \nNo one could do it better \nWe tear the club up and leave without a strand of evidence and uh \n\nFirst we came here to set this party off right \nLet's bounce tonight \nAnd if they don't let us in through the front \nWe'll come through the side\n\n'Cuz I don't ever wanna leave the game without \nAt least saying goodbye \nSo all my people on the left, all my people on the right \nScream one last time \n\n(Eminem)\nYeah, ha ha \nStill Aftermath, 2006 \nAnd don't worry about that Detox album \nIt's comin', we gonna make Dre do it, ha ha \n\n50 Cent, G-Unit, Obie Trice, D-Twizzy, Stat Quo, Dr. Dre \nWe ain't leavin', let's go! Ha ha \nLadies and gentlemen, thank you all for comin' out, peace! \n\n...Oh shit, I almost forgot, you're comin' with me! *gunshots*\nHa ha, bye bye!\n*final gunshot*\n\nSee you in hell, fuckers!"}