{"song_id":22468,"song_name":"You're The One","artist_id":303229,"display_artist":"Guerilla Black Featuring Mario Winans","spotify_id":"4dE56AhNEZC6nESs78HsQ3","lyrics":"Mario Winans\nOh yeah, oh yeah! oh baby\nOh oh, oh oh, oh baby, oh yeah\n\nGuerilla Black\nI remember when I met you on Crenshaw\nI almost crashed my truck, and spilled my Hen' dawg\nYes you, God blessed you, I was trying to get next to you\nYour homegirls was hating, but I didn't care\nYou said you had a man, I was like \"where?\"\nIt was something so different about you\nI felt so gifted around you\nEven though you had a man and all\nI took the chance to call, we held hands at the mall\nThat day was so special to me\nYour man left you at Mickey D's\nYou called me, I scooped you up\nI seen fear in your eyes, the tears in your eyes\nHe can't hug you like I hug you\nBetter yet love you like this thug do\n\nMario Winans\nYou're so special, you're the one\nBut you're already taken\nOh I can't help the way I'm feeling\nYou're the one, I wish I could replace him\n'Cause I know that baby you're the one\n\nGuerilla Black\nI'm having the time of my life\nFelt the world on wheels, you and your homegirl got some skills\nNobody make me feel like you do\nOr better yet real like you, I messed around and killed dude\nI seen homegirly just flossin, we made eye contact\nDude always is flossin, me never\nYou and B-l-a-c-k forever, tattered on my neck in green letters\nLate night eating H&#xE4;agen-Dazs, watching Uncut\nAnd me sitting there, playing wit your butt\nTook off your clothes, I hit it on the counch\nEven though mom's in the house\nNothing could replace this feeling\nIt's like winning 2 million, our bond closer than Cicilians\nI know old boy won't leave you alone\nI know you love him, but our love is strong\n\nMario Winans\nYou're so special, you're the one\nBut you're already ta-ken\nOh I can't help the way I'm feeling\nYou're the one, I wish I could replace him\n'Cause I know that baby you're the one\n\nGuerilla Black\nI couldn't leave well enough alone\nHell I had to hit ya cell phone\nI left you a message, it went like this, \"I love you, mmmuah!\"\nI guess it's my luck, I goes to the Magic\nDamn, ain't that his truck?\nI guess you wit him, screw him\nIf it wasn't for you, I'd have to do him\nYou seen 'em at Jack In The Box\nHe was mackin a lot, to some rats in a drop\nNow you call The Beat and The Power, dedicate songs every hour\nAll hell done broke loose\nHe got your passcode to your cell and my Nextel shirt too\nI guess it's time for you to decide\nWhich one of us you want in your ride?\n\nMario Winans\nYou're so special, you're the one\nBut you're already ta-ken\nOh I can't help the way I'm feeling\nYou're the one, I wish I could replace him\n'Cause I know that baby you're the one\n\nYou're so special, you're the one\nBut you're already ta-ken\nOh I can't help the way I'm feeling\nYou're the one, I wish I could replace him\n'Cause I know that baby you're the one"}