{"song_id":22504,"song_name":"U Don't Know Me","artist_id":277486,"display_artist":"T.I.","spotify_id":"2XZ0yrVMiFPmHlk725Bp6m","lyrics":"You might see me in the street\nBut nigga you don't know me\nWhen ya holla on the street\nRememba you don't know me\nSave all the hatin' and the poppin'\nNigga you don't know me\nQuit tellin' niggas you my partna\nNigga you don't know me\nDon't be a groupie keep it movin\nNigga you don't know me\nHey I ain't trippin' pimp the truth is\nReally you don't know me\nYa you know they call me T.I.\nBut you don't know me\nYou be hatin' and I see why\n'Cause you don't know me\n\nI think its time I made a song fo niggas who don't know me\nI graduated out the streets, Ima real OG\nI been trappin shootin pistols since I stood 4 feet\nSo all you niggas actin' bad, you gon have to show me\nYou gone make me bring da chevy to a real slow creep\nMy niggas hangin' out the window, mouth fulla gold teeth\nWhen the guns start poppin', wonder when it's gonna cease\nChoppa hitchu on the side and create a slow leak\nWe can end the speculation 'cause today we gone see\nWhat's the future of a pussy nigga hatin' on me\nI giva fuck about the feds investigation on me\nI don't care they at my shows and they waitin on me\nIma keep a flossin poppin' long as Toomp is on the beat\nTell police that I ain't stoppin' Ima keep it in the streets\nContrary to yo believes, I'm as real as you can be\nFuck yo thoughts and yo feelings nigga you don't know me.\n\nHey once again let me remind you nigga you don't know me\nSo don't be walkin' up and askin what's the deal on a key.\nI don't know if you wearin wires you could be the police\nIf I was slangin dope you couldn't get an OZ\nSee me at the PSC follow through and tha show deep\nPolice holdin' up the door, 'cause they know we tote heat\nI just wanna wrap a C, blowin' dro ina fleet\nOnly hittin 'bout a dozen different bitches ina week\nI just wanna chill with Kuntry and his daddy Freddy G\nBallin out @ anytime, hit every store and spend a G\nWanna ball in the Bahamas curtousy of KT\nMacBoney gotta Mill. as well as a dolla DP\nAk house on the hill right next to JG\nEveryweek meet there for lunch, restaurant and eat free\nGet inda paid Lil Craig an G\nThat's the only shot we got at gettin' Cap back on the streets\n\nYou see a nigga hatin' on a G\nAsk 'em what's it gonna be\nWhatcha lookin' at, pussy nigga you don't know me\nAt the club, in the streets\nOr where ever we should meet\nIt's choppas choppin pistols poppin' nigga you don't know me \n\nGrand Hustlin' Pimp\nUrban Legends Comin' Soon\nThe wait is over hommie\nPSC Pimpin'\n\nYou don't know me dawg..."}