{"song_id":22505,"song_name":"Baby","artist_id":276136,"display_artist":"Fabolous Featuring Mike Shorey","spotify_id":"2FSQYGTyk8GTIaiRyAWu74","lyrics":"Fab, Fab, Fab, Fab, Fab\nCan you be my B A B Y?\nI'll never call another lover mine\n\nAnd why would I? And why should I?\nWhen I seen a lady tonight with my good eye\nThat I would try and make my\n(Baby, baby)\n\nI was up in the club putting my hood high\nWhen I saw you and I stood by\nJust looking at your onion\nGirl, I could cry and I could lie\n\nI mean I could try and say you ain't sweep me off my feet\nBut only one thing could keep me off the street\nAnd that's if you be my, B A B Y\nI can be why you always be fly\n\nAnd I'm from B-Stuy, just like B.I.G. was\nThat's how F A B does\nWe can sip something till we both be buzzed\nIn a V-dub and that's only because\n\nNeed someone to be my\n(Baby)\nKind of girl you find in the club rocking those phat jeans\n(Baby)\n\nGonna find someone to be my\n(Baby)\nI see some ladies tonight that should be having my\n(Baby, baby)\n\nAfter the baby talk, the goo goo ga ga\nYou like this, that, you do bla bla\nCouple good jokes, a few brouhaha's\nIt's time to do you mama\n\nFirst I'ma put you on your back\nAnd make you scream out just like I put you on the track\n(Baby)\nThen I'ma lay you on your side\n\nAnd slowly stroke you while you telling me the way you feel inside\nBut my sex drive won't make me play you on the side\nYou know you get the keys any day you wanna ride\nAnd my baby know how to start me up\nYou got the kind of kiss that'll speed a heartbeat up\n\nAnd you got the kind of touch that'll gimme the chills\nI ask you 'cause I know you gonna gimme it real\nIt won't be fake and don't we make a good couple\nAnd won't we make a good?\n(Baby)\n\nOoh, if I seem just a bit taken, pardon me\nBut you're so amazing\nI just want us to do this exclusively\nSay you'll be my baby\n\nMy baby's the only one I bring to the villa\nThat can get the bling and the scrilla\nGirl, I know you smooth enough to spring a chinchilla\nAnd still take a sting of Tequila, the way you swing is a thriller\n\nI'm watching that like the boxing match\nIn the ring of Manila\nI wanna keep it coming like the singles of 'Thriller'\nI mean if you still uh, my B A B Y\n\nNeed someone to be my\n(Baby)\nKind of girl you find in the club rocking those phat jeans\n(Baby)\n\nGonna find someone to be my\n(Baby)\nI see some ladies tonight that should be having my\n(Baby, baby)\n\nFab, Fab, Fab, Fab, Fab\nCan you be my B A B Y?\nI'll never call another lover mine\n\nFab, Fab, Fab, Fab, Fab\nCan you be my B A B Y?\nI'll never call another lover mine\n\nFab, Fab, Fab, Fab, Fab\nCan you be my B A B Y?\nI'll never call another lover mine\n..."}