{"song_id":22566,"song_name":"How Could You","artist_id":429939,"display_artist":"Mario","spotify_id":"3SjS9Y86t8BiecD1Wq7r4o","lyrics":"It's kind of crazy babe, how I remember things (like where you came from and how you had nothing)\nI went and made you fly, put extras on your ride (didn't miss a birthday now you can't even remember mine)\nYou made it clear to me (you wasn't down for me)\n(Love made me blind baby) but now I see\n(You had things up your sleeve, don't even lie to me)\nI even heard it from your family\n\nHow could you let somebody lay where I laid?\nHow could you give him everything that we made?\nHow could you call him all the names that you used to call me?\nHow could you, How Could You just forget about me?\nHow could you teach him all the things I taught you?\nHow could you put him up to the Ghetto Kamasutra?\nHow could you put me in the back and give him the front seat?\nHow could you, How Could You just forget about me?\n\nYou must be out your mind,\nYou got alot of nerve (to think that I'm going chill after at the shit I heard)\nI damn near carried you, I could've married you\nGood thing I found out before I bought that 7 karat for you,\n(I know your sick about) The way I found you out\n(Go head and pack, get out) I hope he's got room at his house\nYou should have thought of me before you hopped in the sheets\nDamn I can't believe that you did this to me, baby\n\nHow could you let somebody lay where I laid?\nHow could you give him everything that we made?\nHow could you call him all the names that you used to call me?\nHow could you, How Could You just forget about me?\nHow could you teach him all the things I taught you?\nHow could you put him up to the Ghetto Kamasutra?\nHow could you put me in the back and give him the front seat?\nHow could you, How Could You just forget about me?\n\nGirl I tried to give you everything,\nCan't believe the ways you repaid me,\nGirl you had it all, but I guess my all wasn't good enough for you,\nI've accepted it, and I ain't gone trip, girl I'm movin on\nSometimes I can't help but think that another man's gonna get the one that is made for me, Ooh, yeah\n\nHow could you let somebody lay where I laid?\nHow could you give him everything that we made?\nHow could you call him all the names that you used to call me?\nHow could you, How Could You just forget about me?\nHow could you teach him all the things I taught you?\nHow could you put him up to the Ghetto Kamasutra?\nHow could you put me in the back and give him the front seat?\nHow could you, How Could You just forget about me?\n\n(How could you)\nHow could you how could you just go and lay there,\nHow could you how could give him everything (How could you)\nHow could you how could you call him names like that (ooh)\nHow could you baby?\nHow could you baby? (How could you)\nHow could you how could you teach him everything?\nHow could you how could you put him to the ghetto kamasutra?"}