{"song_id":22616,"song_name":"All Because Of You","artist_id":309665,"display_artist":"Marques Houston","spotify_id":"7g52qjkEfZTz8E85KaVdSz","lyrics":"Corner Boys...\nI can't blame you if you wanna leave,\n'Cause I'm not the man that I once used to be.\nBut there's a change that has come over me,\nSo before you go listen to my last plea.\n\nAll because of you\nOh, you're the love of my life\nAnd I was doin' wrong, but I wanna do right girl\nAll because of you\nStayin out all night\nWanna make it right, wanna change my life girl\nAll because of you\nI wanna play games\nWanna change your name to my name baby\nAll because of you\nGon be the man that I used to be\nI've changed because of you.\n\nCan't take back the things that I did before,\nBut baby I'm promisin' that my heart is yours yours\nKnow it ain't easy baby, but you gotta believe me baby\nAll I'm askin for is one more chance, I've changed because of you.\n\nAll because of you\nOh, you're the love of my life\nAnd I was doin' wrong, but I wanna do right girl\nAll because of you\nStayin out all night\nWanna make it right, wanna change my life girl\nAll because of you\nI wanna play games\nWanna change your name to my name baby\nAll because of you\nGon be the man that I used to be\nI've changed because of you.\n\nI I I I, I wanna do right by you, girl.\nI I I I, I wanna spend my life with you, girl.\nSee I don't wanna play no games, wanna change your name to my name baby\nI'm turnin' in my player's card... all because of you.\n\nspoken:\nIt used to be that you in the club poppin' bottles, wrists glistenin\nShorty tried to tell me 'chill', but I wasn't listenin'.\nI can't deny, you knew me from bein Immature\nOnly way of sayin' sorry, take you to the gucci store\nYou told me all you really wanted was to see me more\nThen the stress hit me hard like a meteor\nI hit rock bottom, you was there to pick me up\nI neglected you we didn't hug, didn't kiss enough\nBut you never threw nothin' up in my face\nGave me all your love and your warm embrace yeah\nBut now I see I'll neva find another like you\nYou the type boo, make a playa wanna wife you\nWit me and you, this money's not a issue\nWhen I miss you, when I touch you, I can feel it in my bone gristle\nI'm still wit you and I'm sorry 'bout the way I did you\nKnow I used to ??\n\nAll because of you\nOh, you're the love of my life\nAnd I was doin' wrong, but I wanna do right girl\nAll because of you\nStayin out all night\nWanna make it right, wanna change my life girl\nAll because of you\nI wanna play games\nWanna change your name to my name baby\nAll because of you\nGon be the man that I used to be\nI've changed because of you."}