{"song_id":22682,"song_name":"Badd","artist_id":431622,"display_artist":"Ying Yang Twins Featuring Mike Jones & Mr. ColliPark","spotify_id":"1Epb6Kfe3GTgKrrWs1Y4Wy","lyrics":"(Feat. Mike Jones)\n\n(Scream)\nCollipark, hannnh\nChea! Yoh!\nMike Jones! Who? Mike Jones Jones!\nHannnh...\nHolluh atchu boi baby, you killed it on this one man, uhuh\nChea!\nWe got Ying Yang Twins and Mike Jones in the house tonight! Yo yo.\n(All my dime pieces)\nCollipark and Swishahouse in this bitch,\nCheck it out, yo yo,\n\nI'm lookin' for a dime that's top of the line\nCute face Slim waist wit a big behind\nI need a dime that's top of the line\nCute face Slim waist wit a big behind\n(Ay Shawty) You want this money then you gotta be a\nBadd bitch\nShake that ass for a tip of you a\nBadd bitch\nDrop it down to the floor if you a\nBadd bitch\nAw no she ain't no hoe, she just a\nBadd bitch\n\nI'm in the club, lookin' for a\nBadd bitch\nIn the parking lot, lookin' for a\nBadd bitch\nEverywhere I go I'm trying to find that\nBadd bitch\nYou know me I gotta keep me a\nBadd bitch\nFreak in the mornin', freak in the evenin'\nI'm looking for a freak when I'm done block bleedin\nNow take me to a house, tease me, then please me\nAnd tell all her friends how the dick made her sleepy,\nAnd believe me, when I'm up in there I'm beatin' it,\nGivin' ya that Mike Jones' treatment\nI could tell by the way she walk that she got it\nBody so delit, you can tell when she drop it\nI either gonna hit her imma beat ass tight\nI've seen her walk by me, damn near passed out\nThen crept up behind her, tell her it was time to\nLet a playa like me get in that vagina\n\nI'm lookin' for a dime that's top of the line\nCute face Slim waist with a big behind\nI need a dime that's top of the line\nCute face Slim waist with a big behind\n(Ay Shawty) You want this money then you gotta be a\nBadd bitch\nShake that ass for a tip of you a\nBadd bitch\nDrop it down to the floor if you a\nBadd bitch\nAw no she ain't no hoe, she just a\nBadd bitch\n\nShe's a ghetto ass bitch with some ghetto ass game\nIn the club where she work and she poppin' that thing\nSaid the bread keep her fed and the head at the bar\nShe could never breath on a nigga dick made 'em come,\nCome one! (Come one!) Come all! (Come all!)\nWhere them hoes like to get buckin bald\nAnd can't take off they draws\nAin't standin' now nigga naw\nI love the way she dance, she look like she fuckin' herself\nShawty do a number just touching herself\nFreaky ways she can shake ass for days\nGet kinky in sixty-nine different ways\nJump onstage she get paid she goes off\nYou got enough money she taking the clothes off\nLook at that, I tought I taw a puttycat\nI did I did\nI did taw a puttycat\n\nI'm lookin' for a dime that's top of the line\nCute face Slim waist with a big behind\nI need a dime that's top of the line\nCute face Slim waist with a big behind\n(Ay Shawty) You want his money so you gotta be a\nBadd bitch\nShake that ass for the tip of your\nBadd bitch\nDrop it down to the floor if you'ra\nBadd bitch\nAw no she ain't no hoe, she just a\nBadd bitch\n\nBitch move, like you got somethin' to prove\nKeep runnin' you dick sucka who you gonna lose?\nI don't wanna hear 'bout your motherfuckin' blues\nI'd rather see your ass clap clap in them shoes\nLike\nB-am b-am b-am b-am\nWham wham\nI tought I taw a puttytat\n\nShorty gettin' crunk, love gettin' low\nLove it when she take it to the floor\nMake a booty roll take her clothes off\nAnd she love smokin' weed\nAnd she getting hella freaky on the exstacy\nDo her dance for me song after song\nShawty won't stop she goin' all night long\nNow that's a girl who know what she want and like\nShe a schoolgirl by day and a stripper by night\n\nI'm lookin' for a dime that's top of the line\nCute face Slim waist with a big behind\nI need a dime that's top of the line\nCute face Slim waist with a big behind\n(Ay Shawty) You want this money then you gotta be a\nBadd bitch\nShake that ass for the tip of your\nBadd bitch\nDrop it down to the floor if you'ra\nBadd bitch\nAw no she ain't no hoe, she just a\nBadd bitch"}