{"song_id":22695,"song_name":"Welcome To Jamrock","artist_id":"null","display_artist":"Damian \"Jr. Gong\" Marley","spotify_id":"2e5Vm6VvdlTzuNcRSikeU6","lyrics":"Out in the streets, they call it murder!\n\nWelcome to Jamrock, camp where the thugs them camp at\nTwo pounds a weed inna van back\nIt inna your hand bag, your knapsack, it inna your back pack\nThe smell a give your girlfriend contact\nSome boy nuh know this, them only come around like tourist\nOn the beach with a few club sodas\nBedtime stories, and pose like dem name Chuck Norris\nAnd don't know the real hardcore\nCause Sandals a now back too, the thugs then we do what them got to\nAnd won't think twice to shot you\nDon't make them spot you, unless you carry guns a lot too\nA pure tuff things come at you\n\nWhen Trenchtown man stop laugh and block-off traffic\nThen them wheel and pop off and them start clap it\nWith the pin file dung and it a beat rapid\nPolice come inna jeep and them can't stop it\nSome say them a playboy (them) a playboy rabbit\nFunny man a get dropped like a bad habit\nSo don't bother pose off if you don't have it\nRastafari stands alone!\n\nWelcome to Jamrock, Welcome to Jamrock\nOut in the streets, they call it merther!\n\nWelcome to Jamdown, poor people are dead at random\nPolitical violence, can't done! Pure ghost and phantom, the youth\nThem get blind by stardom\nNow the King Of Kings a call\nOld man to Pickney, so wave one hand if you with me\nTo see the sufferation sicken me\nThem suit no fit me, to win election them trick we\nAnd them don't do nuttin at all\n\nCome on let's face it, a ghetto education's basic\nAnd most a the youths them waste it\nAnd when they waste it, that's when they take the guns, replace it\nThen them don't stand a chance at all\nAnd that's why a nuff little youth have up some fat matic\nWith the extra magazine inna them back pocket\nAnd a bleach a night time inna some black jacket\nAll who not lock glocks, at them a lock rocket\nThem will full you up a current like a short circuit\nThem a run a roadblock which part the cops block it\nAnd from now till a mornin not stop clock it\nIf they run outta rounds a broke- back ratchet\n\nWelcome to Jamrock (Southside, Northside)\nWelcome to Jamrock (East Coast, West Coast, huh, yo)\nWelcome to Jamrock (Cornwall, Middlesex and Surrey) Hey!\nWelcome to Jamrock\nOut in the streets, they call it merther!\n\nJamaica Jamaica! Jamaica Jamaica! Now!\nJamaica Jamaica! Yo! Jamaica Jamaica!\nWelcome to Jamrock, Welcome to Jamrock"}