{"song_id":22701,"song_name":"I'm A King","artist_id":277118,"display_artist":"P$C Featuring T.I. & Lil Scrappy","spotify_id":"5h21AlYy4mgHfQp9jUAUGi","lyrics":"(Intro: T.I.)\nBig catch-a-cane, big homie wat it is?\nI think imma rap straight up fo deze niggaz\n\n(Verse One: T.I.)\nNow, errbody wanna be tha king of tha South\nWen, dey ain't runnin' a damn thing but dey mouf, no doubt\nIz all good, y'all jus statin y'all opinion\nBut in da South and in da hood iz undastood witout sayin', iz a given\nAnd ain't bcause of wat I'm doin' fo a livin'\nIz, mo bcause of wat I do and how I'm livin'\nNot ta mention wen I'm rappin' I'm jus hurtin' niggaz feelins (Niggaz feelins)\nAnd still chillin' on sumthin das inta healing\nMade provisions fo tha clique ta continue keepin' it pimpin'\nWhether crack was in tha house or record sales was through tha ceilin\nSo, say wat'chu want, and do wat'chu please\nBut fo fun, I shoot 22's from ya shoe ta ya knee\nI run a record label and a crew of G's\nSo, niggaz'll cum and look fo ya if ya sneeze\nOr even breathe tha wrong way, ya better do wat tha song say\nAnd be easy, or else it'll be a long day\n\n(Chorus: T.I.)\nI'm a king! Bank rolls in tha pockets of ma jeans\nI'm a king! Ya pussy niggaz couldn't see me in ya dreams\nI'm a king! Top topic of all of ya magazines\nI'm a king! Head of tha body, leader of da team\nI'm a king! Rememba I can get ya block knocked off\nI'm a king! A Bentley Coupe with tha top chopped off\nI'm a king! I'm connected nationwide within tha South\nI'm a king! Jus respect it and keep my name out'cha mouf\n(I'm a king!)\n\n(Verse Two: Lil Scrappy)\nI'm tha prince, shawty, don't get it twisted (Ay!)\nBeen callin shots simplin fo ma flows existed (Flows existed!)\nAnd still find birds in ma momma kitchen (Ay!)\nYa might (Ay!) see me (Ay!) burnin purp (Ay!) in tha subdivision (Ay!) (Lets go nigga!) (Ay!)\nI got soldiers on (Ay!) deck (Uh-huh!), babyface pimpin', wat'chu noe bout dat (Ay!)\nI keep a bad Brenda wit that 'vert, top dat!\nMa jeans feelin' tight 'cause (Yo!) ma flows stay (Ay!) phat, (Ay!) playa betta noe dat\nMa neck got so much shit, danglin\nBig dick, big chain, we jus keep on hangin'\nGotta Hollywood ho, and a bitch dat be sangin\nDey be hatin' 'cause I'm famous, shawty wat I was thankin' (Ay!)\nAnd dis fo every don nigga thankin' he passed me (Thankin' he passed me!)\n\n\nI'll jus thank God you gone and da shit'll be nasty (Shit'll be nasty!)\nImma stay ballin, fallin' off ma ol' skool classic\nLil' Scrap got big bank, now see if you can match it (Haha!)\n\n(Chorus: T.I.)\nI'm a king! Bank rolls in tha pockets of ma jeans\nI'm a king! Ya pussy niggaz couldn't see me in ya dreams\nI'm a king! Top topic of all of ya magazines\nI'm a king! Head of tha body, leader of da team\nI'm a king! Rememba I can get ya block knocked off\nI'm a king! A Bentley Coupe with tha top chopped off\nI'm a king! I'm connected nationwide within tha South\nI'm a king! Jus respect it and keep my name out'cha mouf\n(I'm a king!)\n\n(Verse Three: PSC)\nShawty I'm down wit tha kings (Kings!), so call me tha greatest (Greatest!)\nNumber one hustla, I keep tha street blazin'\nIf tha grapes don't sell, I dry'em up and sell raisins\nWhile y'all cherry-pickin' hustlas, out here slavin\nDat king shit nigga run deep in ma veins\nPump through ma heart, live in ma bone marrow, man\nDas pimpin'! Ma gas iz premium like octane\nCan't tell me nuttin bout stackin dez Benjaminz\n\n(Bridge: T.I.)\nI'm tha king of tha dirty, see me seated in tha throne\nOverruled other dudes, like Caesar did in Rome (Yeah!)\nWit a prince das (Hey!) so demandin, and a aura so strong\nTha South ain't been represented like dis in so long\nImma emperor (Ya instigatin man!), ya best be glad (Hey! Hey!) I'm workin on ma temper\nOthawise I'd cock a pistol, send some missiles ta ya temple\nDisrespect us imma blick'em till I get'cha plain and simple\nBrass knuckles ta ya (Ay!) dentals, blast suckers in dey dimples\n\n(Chorus: T.I.)\nI'm a king! Bank rolls in tha pockets of ma jeans\nI'm a king! Ya pussy niggaz couldn't see me in ya dreams\nI'm a king! Top topic of all of ya magazines\nI'm a king! Head of tha body, leader of da team\nI'm a king! Rememba I can get ya block knocked off\nI'm a king! A Bentley Coupe with tha top chopped off\nI'm a king! I'm connected nationwide within tha South\nI'm a king! Jus respect it and keep my name out'cha mouf\n(I'm a king!)"}