{"song_id":22793,"song_name":"Turn It Up","artist_id":298913,"display_artist":"Chamillionaire Featuring Lil' Flip","spotify_id":"3KcsyKN0GyGQYGZJJhIx3L","lyrics":"Chamillionaire:\nYeah!\nIt's the name they say is runnin' the game\nChamilitary remain.\n\nLil' Flip: Lil' Flip in the building!\n\nChamillionaire:\nGo ahead and hand over the torch\nSuper producer Scott Storch\nAnd of course.\n\nChorus: Chamillionaire\nI'm a show you how to get your shine on\nTurn It Up the DJ playin' my song\nEverybody keep on callin' my phone.\nWhich one of y'all am I gon' take home?\nI'm a show 'em how to get the club crunk\nGive 'em something that's gon' rattle that trunk\nTip your cups up until you get drunk\nTell the DJ to play it loud and turn the beat up.\n\nChamillionaire:\nGive me that million dollar beat and let me show you what to do with it.\nWho that is? That's the illest rapper choppin' and screwin' it\nCouldn't snatch the game that's what they told me, so I'm provin' it\nPut the truth in Texas with Scott Storch and you got you a hit\nHittin' never miss rep yo' click and throw 'em high\nBecause Chamillionaire's the answer to the game like Allen I\nMiddle fingers to the sky, if they don't like that reply\n'Cause any DJ that deny is a muthaf... lie\nSo give the ladies what that want\nGot 'em racin' to the front of the stage\nTo feel the bass and tell the DJ Turn It Up\nYeah Sound of Revenge sayin' Universal to go get my plaque\nRappin's dead so I'm a bring it back, like DJ's do when they hear my track\nCheck out my track record, they'll say I'm a track wrecker\nHotter than a black pepper now that I am back nigga (He's Back!)\nYou can't get mad if you feel that you and cap fit ya\nDrop the biggest stat's ever so don't let that back hit ya.\n\nChorus: Chamillionaire\nI'm a show you how to get your shine on\nTurn It Up the DJ playin' my song\nEverybody keep on callin' my phone.\nWhich one of y'all am I gon' take home?\nI'm a show 'em how to get the club crunk\nGive 'em something that's gon' rattle that trunk\nTip your cups up until you get drunk\nTell the DJ to play it loud and turn the beat up.\n\nLil' Flip:\nWhen it's time to hit the club I let my chain hang\nIf they got clovers on they neck we in the same gang\nI'm 20 deep in V.I.P. puffin' Mary Jane\nSplinters still in my hand from my woodgrain\nI got homies on the West who like to gangbang\nAnd I got homies on the East who do the same thing\nI told Johhny put 50 in my pankyrang\n5 karot diamond chain VVS is in it mayne\nYou know I rep the dirty dirty where they move cane\nYou know we mix purple stuff in that blue drank\nHipnotic, Big Bodies with Blue paint\nWe got that oomp spray, but it still stank\nYou a lame so your dame playin' mind games\nI'm a pimp so I stay in that mindframe\nNiggas talk shit until I let that nine bang\nMe and Duke in that maybach switchin' lanes.\n\nChorus: Chamillionaire\nI'm a show you how to get your shine on\nTurn It Up the DJ playin' my song\nEverybody keep on callin' my phone.\nWhich one of y'all am I gon' take home?\nI'm a show 'em how to get the club crunk\nGive 'em something that's gon' rattle that trunk\nTip your cups up until you get drunk\nTell the DJ to play it loud and turn the beat up.\n\nBridge: Chamillionaire\nHeaded to the bar (I'm headed to the bar)\nYou know I'm V.I.P. (You know I'm V.I.P.)\nAnd since you rollin' with a star (You rollin' with a star)\nYou V.I.P. with me. (Chamillitary hey hey)\n\nChamillionaire\nChamillitary the biggest threat to any of these rapper thinkin' they doin' it.\nWho That Is? That's dem boyz from Texas that always do it big\nMulti-colored diamonds got us shinin' They say our jewelry sick\nHouston got a problem and you don't want nothin' to do wit it.\nDo you kid? I ain't think so I'm tippin' slow\nWen my trunk is liftin' up look at the neons as they glow\nGroupies never givin' up they be everywhere I go\nWhen that elevator go up to my suite they there fo' sho'\nTold me that she didn't care about my money Wasn't hearin' it\nLooks can be decevin' as Chamillion paint appearances\nYou know how we do it at home of Screw and purple syrup is\nShe got turned out quicker than my power steering did.\n\nChorus: Chamillionaire\nI'm a show you how to get your shine on\nTurn It Up the DJ playin' my song\nEverybody keep on callin' my phone.\nWhich one of y'all am I gon' take home?\nI'm a show 'em how to get the club crunk\nGive 'em something that's gon' rattle that trunk\nTip your cups up until you get drunk\nTell the DJ to play it loud and turn the beat up."}