{"song_id":22817,"song_name":"Unpredictable","artist_id":304140,"display_artist":"Jamie Foxx Featuring Ludacris","spotify_id":"3UNrtRxBBlWE70SjxnOo02","lyrics":"Yeah ladies I know you tired of the same old thing,\nThings have become so mundane\nI mean your bedroom is so cold, so cold but I'm here to tell you\nI got a strategy we 'bout to heat it up.\n(I like that.)\n\nGirl get comfortable we bout to do something you never done before\nBaby not the usually tonight we gettin' unpredictable\nSo try to roll wit me baby... baby\nI'm a make you feel like you never felt,\nGirl all because you let me get unpredictable.\n\nBaby, 1 plus 1 ain't 2 when you wit me\nC ain't afta A and B when you wit me\nIt don't make sense right now but it will\nLater on when you see how I make you feel\nRegular ain't in my vocabulary\nWhen it comes to love makin' be the neither is missionary\nPositions, girl pick one better yet two\nNever mind that we tryin' all the fun So\n\nGirl, get comfortable we bout to do something you never done before\nYeah\nBaby not the usual tonight we gettin' unpredictable\nSo try to roll wit me baby\nBaby\nI'm a make you feel like you never felt,\nGirl, all because you let me get unpredictable.\n\nI know you're use to dinner and a movie\nWhy not be my dinner, while makin' a movie\nDo you get it get it\nDo you got it got it\nGood good good\nGirl, I knew you would\nSee what I got over a lot of fellas is that I'm more creative\nAnd soon you will see what I mean, what I mean so.\n\nGirl, get comfortable we bout to do something you never done before\nBaby not the usually tonight we gettin' unpredictable\nSo try to roll wit me baby... baby\nI'm a make you feel like you never felt,\nGirl all because you let me get unpredictable.\n\nLudacris\nAll Aboard!\nThe spontaneous express\nNever the less always the more\nFrom the pool table to the kitchen floor\nNext stops the G spot... Luda!\n(I like that.)\nI like it too baby.\nLet me put a little bit of excitement\nUp in yo lifestyle\nYou gotta know the times of the essence\nI'm talkin' right now\nI can get, get rid of that headache\nWhat you doin' tonight\nSome say that sex is overrated, but they just ain't doin' it right\nI keeps it interestin' baby just take them clothes off\nI'll be yo Tylenol just take me till you dose off\nWake you up in the middle of the night and take you to another world\nYou'll wake up in the mornin' feelin' like another girl.\n\nGirl get comfortable we bout to do something you never done before\nDone before\nBaby not the usually tonight we gettin' unpredictable\nSo try... So try to roll wit me baby\nBaby\nI'm a make you feel like you never felt,\nGirl all because you let me get unpredictable."}