{"song_id":22947,"song_name":"Why You Wanna","artist_id":277486,"display_artist":"T.I.","spotify_id":"7n37dToRMRqUhdOnh9sEhB","lyrics":"Hey T.I.P pimpin'\nHey shorty why you gotta act like that? I'm sayin'...\nI'm just tryin' to be nice to you.\n\nGo and tell a nigga no, wit a ass so fat\nHey why you wanna go and do that love, huh?\nHey-Hey why you wanna go and do that, do that\nHey-Hey why you wanna go and do that-that-that\nIn a relationship been faithful to a nigga so whack\nHey why you wanna go and do that love, huh?\nHey-Hey why you wanna go and do that, do that\nHey-Hey why you wanna go and do that-that-that... hey-hey.\n\nCan't help but notice how you glowin' I can see in yo face\nNow I just wonder if he know he close to being replaced\nSwear I treat you like a queen you put me in his place\nSo you can give back his ring and the key to his place\nTell the nigga one thing that you need yo' space\nSelling niggas is one thing you don't need to chase\nI wanna kiss you everywhere between yo' knees and waist\nHear the sounds that you makin', get yo' knees to shake\nHolla at me in the A, you feel you need to escape\nI gotta mansion and a gate, you wit me you safe\nA Benz, a Phantom and a truck wit 23's the case\n600 Gz in the safe. How much cheese it take?\nThis a chance you need to take, ain't no need to wait\nSay the word we can leave today, this somethin' special\nAnd it feel like fate, hate to make a mistake\nHow the same thing makin' you sad makin' you stay\n\nGo and tell a nigga no, wit a ass so fat\nHey why you wanna go and do that love, huh?\nHey-Hey why you wanna go and do that, do that\nHey-Hey why you wanna go and do that-that-that\nIn a relationship been faithful to a nigga so whack\nHey why you wanna go and do that love, huh?\nHey-Hey why you wanna go and do that, do that\nHey-Hey why you wanna go and do that-that-that... hey-hey.\n\nCan he touch you like that, and make you make you feel like this\nHolla if you came back and it's still like this\nDo he hit it from the back and make you feel it in your chest\nTake advantage of what you concealing in your dress\nWhat, he think he to fresh to show you that you the best\nCompliment you on your hair and legs and treat you wit respect\nGive you sex till you sweat, tongue kissin' on yo neck\nIt's been awhile since she got it like this I bet\nI can tell you ain't just another bitch I met\nAin't nobody got me open like this, not yet\nNo, you confused ain't decided which way you should go yet.\nSo how you keep sayin' no when your panties so wet?\n\nGo and tell a nigga no, wit a ass so fat\nHey why you wanna go and do that love, huh?\nHey-Hey why you wanna go and do that, do that\nHey-Hey why you wanna go and do that-that-that\nIn a relationship been faithful to a nigga so whack\nHey why you wanna go and do that love, huh?\nHey-Hey why you wanna go and do that, do that\nHey-Hey why you wanna go and do that-that-that... hey-hey.\n\nThis nigga playin' mind games man\nI think the time came, that you mind changed you understand\nLife is like a chess move, you need to make yo next move\nYo' best move, keep it pimpin' you understand... hey\nI mean you know what I'm sayin' I done showed you how I feel\nYou know what I'm sayin' I put myself all the way out there you know\nThe ball in yo' court man, but I just got a question for you...\nIs you happy??\n\nGo and tell a nigga no, wit a ass so fat\nHey why you wanna go and do that love, huh?\nHey-Hey why you wanna go and do that, do that\nHey-Hey why you wanna go and do that-that-that\nIn a relationship been faithful to a nigga so whack\nHey why you wanna go and do that love, huh?\nHey-Hey why you wanna go and do that, do that\nHey-Hey why you wanna go and do that-that-that... hey-hey."}