{"song_id":22999,"song_name":"Shoulder Lean","artist_id":431671,"display_artist":"Young Dro Featuring T.I.","spotify_id":"0yJhNVWztLIG6dFYi9aSg3","lyrics":"(Feat. T.I.)\n\nLet me see ya bounce right to left\nN let ya shoulder lean (let cha shoulder lean, jus let ya shoulder lean)\nAy get it right 2 step, and let ya shoulder lean\n(Let ya shoulder lean, jus let ya shoulder lean)\nLet me see ya bounce right to left\nN let ya shoulder lean (let cha shoulder lean, ay letcha shoulder lean)\nAy get it right 2 step, and let ya shoulder lean\n(Jus let ya shoulder lean, let ya shoulder lean)\n\nDro! I'm clean in dis bitch,\nNow I'm finna shoulder lean in dis bitch.\nNigga buck! cost me 15 in dis bitch,\nThis Grand Hustle team, n kings is gettin' rich.\nI lean 'n' get lit, Lima bean six,\nI take breath, the opposite of primotine mist.\nI ride 26, n let my 9 screens flip.\nTrunk be watchin opem, mag 9, n beam clip.\nTriple black phantom, nigga naw it ain't TIP.\nWith Lucky Charm diamonds man, but naw it ain't Flip.\nCan't bounce, ok then ill let my shoulder lean,\nAnd ill bet my car talk, and I bet my motor clean.\nSuicide doors, brown rose, but look like coco to me.\nErrbody know me in the club, 'cause they smoke wit me.\nDro, hold scope wit me, ice come from dope re-ton\nHardly carat, have 'em froze for a eon,\nRed, black, n white chevy, now I'm ridin' Deion,\nPut dem lights up in my rims, now I'm ridin' neon.\nOur cars look like crayon, hold no on demand tho'.\nI can shoulder lean, I dono how to dance do'.\n\nLet me see ya bounce right to left\nN let ya shoulder lean (let cha shoulder lean, jus let ya shoulder lean)\nAy get it right 2 step, and let ya shoulder lean\n(Let ya shoulder lean, jus let ya shoulder lean)\nLet me see ya bounce right to left\nN let ya shoulder lean (let cha shoulder lean, ay letcha shoulder lean)\nAy get it right 2 step, and let ya shoulder lean\n(Jus let ya shoulder lean, let ya shoulder lean)\n\nFirst I let my wheels spin, den I let my screens fall.\nDen I let my trunk beat, the green ridin' 'em all tall.\nThen I pimp a hoe, take a bitch to burn it.\nBitch break niggas, after that we fuck dey girlfriends.\nMy gurl got a girlfriend, Chevy blue like whirlwind.\nNiggas is a child, n dey boy, so I got they girl in.\nBourbon, cock 'n' hammer, arm 'n' hammer, propaganda.\nBitches think I'm pimpin' 'n' leanin in salamanda silence.\nDurty south hawks in Atlanta, show niggas witout em,\nWe ride phantoms, hardly shoutin fo grammar.\nYup, now I be on TV, BET our channel,\nHood nigga from Bankhead, I stay wit my grandma nana.\nI lay by my banana, dumpin at punky monkeys.\nDon't nobody live wit my mom but a buncha junkies.\nDonut donkey, bitch I ride glazed on a haze,\nGator green chevy, gator gut, alligator chaain.\n\nLet me see ya bounce right to left\nN let ya shoulder lean (let cha shoulder lean, jus let ya shoulder lean)\nAy get it right 2 step, and let ya shoulder lean\n(Let ya shoulder lean, jus let ya shoulder lean)\nLet me see ya bounce right to left\nN let ya shoulder lean (let cha shoulder lean, ay letcha shoulder lean)\nAy get it right 2 step, and let ya shoulder lean\n(Jus let ya shoulder lean, let ya shoulder lean)"}