{"song_id":23072,"song_name":"That Girl","artist_id":302401,"display_artist":"Frankie J Featuring Mannie Fresh & Chamillionaire","spotify_id":"0K46fg1qHY1Y5E7q23zSTG","lyrics":"(Mannie Fresh)\nThe incredible drum patterns of ya dude\nLadies and gentleman, the most beautifulest girl in the world pageant, brought to you by (ha) Frankie J, Slim Thugga and Fr Fr Fr Fr Fr Fresh (Slim Thugga)\n\n(Slim Thug)\nI got my eyes on you baby from ya feet up to ya head\nA perfect night itd be if I could see ya in my bed\nI won't beat around the bush, I'm a be real instead\nYou need a thug in ya life, is you down or you scared?\n\n(Frankie J)\nEverybody knows when I step in the club\nGirls see me and they wanna show me love\nI got my chain on, with my shades on\nRockin' designer shoes and I sold a million\nSo many girls, but there's one that caught my eye\nPretty lady so fine she blew my mind, oh my, 'cause she's the one for me\n\nI've been around the world, and seen so many girls\nBut none can compare 'cause I can't keep my eyes off that girl\nShe got a bill and a face like a supermodel\nAnd her body built just like a coke bottle\nBut none can compare 'cause I can't keep my eyes off that girl\nShake it shake it shake it shake it shake it shake it snap!\nShake it shake it shake it shake it shake it bring it back!\nBut none can compare 'cause I can't keep my eyes off that girl\n\n(Frankie J)\nI think she knows that I'm tryin' to get at her\nI'm a go ahead and try to put in work\nWhat's your name, what's your number can I hit you up\nIf you digging what I'm sayin' let me know what's up\nSo baby let me know if I can take you home (take you home)\nI just wanna be somewhere where were alone alone\n'Cause you're the one for me\n\nI've been around the world (around the world), and seen so many girls (so many girls)\nBut none can compare 'cause I can't keep my eyes off that girl\nShe got a bill and a face like a supermodel\nAnd her body built just like a coke bottle\nBut none can compare (none can compare) 'cause I can't keep my eyes off that girl (she's that girl)\nShake it shake it shake it shake it shake it shake it snap!\nShake it shake it shake it shake it shake it bring it back!\nBut none can compare 'cause I can't keep my eyes off that girl\n\n(Frankie J)\nWelcome to Miami, I've seen so many mommys\nOverseas the girls I've seen but none compare to you oh baby\nI've been around the world and back\nI've never seen a girl like that\nNow its clear to me that\nYour that girl for me\n\n(Slim Thug)\nNow I done been around the whole world played with the best of em\nBut by far baby girl got the rest of em\nShe's so blessed from her back to her chest\nGot a playa on the quest to try to get her out her dress\nYes, I'm feelin' like I just hit the lotto\nA caramel model shaped like a coke bottle\nI'm a mack on attack like who the hell is that girl\nWhen you leave I'm tryin' to be where you at girl\n\nShe got a bill and a face like a super model\nAnd her body built just like a coke bottle\nBut none can compare 'cause I can't keep my eyes off that girl\nShake it shake it shake it shake it shake it shake it snap! (come on come on come on come on baby)\nShake it shake it shake it shake it shake it bring it back! (come on come on come on your so sexy)\nBut none can compare 'cause I can't keep my eyes off that girl\nShake it shake it shake it shake it shake it shake it snap! (I love the way your body moves)\nShake it shake it shake it shake it shake it bring it back! (I love your sexy attitude)\nBut none can compare 'cause I can't keep my eyes off that girl"}