{"song_id":23101,"song_name":"My Love","artist_id":1490153,"display_artist":"Justin Timberlake Featuring T.I.","spotify_id":"13X42np3KJr0o2LkK1MG76","lyrics":"Ain't another woman that can take your spot my...\n\nIf I wrote you a symphony\nJust to say how much you mean to me, what would you do?\nIf I told you you were beautiful\nWould you date me on the regular, tell me, would you?\n\nWell, baby I've been around the world\nBut I ain't seen myself another girl like you\nThis ring here represents my heart\nBut there's just one thing I need from you, say \"I do\"\n\nYeah, because\nI can see us holdin' hands\nWalkin' on the beach, our toes in the sand\nI can see us on the countryside\nSittin' on the grass, laying side by side\n\nYou could be my baby\nLet me make you my lady, girl, you amaze me\nAin't gotta do nothin' crazy\nSee, all I want you to do is be my love\n\n(So don't give away) My love\n(So don't give away) My love\n(So don't give away) Ain't another woman that can take your spot, my love\n\n(So don't give away) My love\n(So don't give away) My love\n(So don't give away) Ain't another woman that can take your spot, my love\n\nOh, girl\nMy love\nMy love\n\nNow, if I wrote you a love note\nAnd made you smile with every word I wrote, what would you do?\nWould that make you want to change your scene\nAnd wanna be the one on my team, tell me, would you?\n\nSee, what's the point in waiting anymore?\n'Cause girl I've never been more sure, that baby, it's you\nThis ring here represents my heart\nAnd everything that you've been waiting for, just say \"I do\"\n\nYeah, because\nI can see us holding hands\nWalking on the beach, our toes in the sand\nI can see us on the countryside\nSitting on the grass, laying side by side\n\nYou could be my baby\nLet me make you my lady, girl, you amaze me\nAin't gotta do nothin' crazy\nSee, all I want you to do is be my love\n\n(So don't give away) My love\n(So don't give away) My love\n(So don't give away) Ain't another woman that can take your spot, my love\n\n(So don't give away) My love\n(So don't give away) My love\n(So don't give away) Ain't another woman that can take your spot, my love\n\nOh, girl\nMy love\nMy love\n\n\nAlright, it's time to get it JT\nI don't know why she hesitates for a man\nShorty, cool as a fan on the new once again\nBut he still has fan from Peru to Japan\nListen baby, I don't wanna ruin with your plan\nBut if you got a man, try to lose him if you can\n\n'Cause the girl's real wild, throw their hands up high\nWhen they wanna come kick it with a standup guy\nYou don't really wanna let the chance go by\n'Cause you ain't been seen wit' a man so fly\n\nBaby, friend so fly I can go fly\nPrivate, 'cause I handle mine\nT.I. they call me candle guy\nSimply 'cause I am on fire\n\nI hate to have to cancel my vacation so you can't deny\nI'm patient, but I ain't gonna try\nYou don't come, I ain't gonna die\n\nHold up, what you mean, you can't go why?\nMe and you boyfriend we ain't no tie\nYou say you wanna kick it when I ain't so high\nWell baby, it's obvious that I ain't your guy\n\nI ain't gon' lie, I feel your space\nBut forget your face, I swear I will\nSame bark, same bullet, anywhere I chill\nJust bring wit me any pair, I will\n\nI can see us holding hands\nWalking on the beach, our toes in the sand\nI can see us on the countryside\nSitting on the grass, laying side by side\n\nYou could be my baby\nLet me make you my lady, girl, you amaze me\nAin't gotta do nothin' crazy\nSee, all I want you to do is be my love\n\n(Love) My love\n(Love) My love\n(Love) Ain't another woman that can take your spot, my love\n\n(Love) My love\n(Love) My love\n(Love) Ain't another woman that can take your spot, my love\n\nOh, girl\nMy love\nMy love"}