{"song_id":23170,"song_name":"Let's Ride","artist_id":1490221,"display_artist":"The Game","spotify_id":"4JKwW0A2OQeAUpYZd99Lfo","lyrics":"Pull the rag off the six-fo',\nHit the switch, show niggas how the shit go,\nThe Game is back, the Aftermath chain is gone,\nThe D's is chrome, the frame is black.\n(So watch it lift up)\nTill the motherfucker bounce and break,\nAnd knock both of the screws out the licence plate.\nLet the games begin,\nThese other rap niggas so far behind they can taste my rims,\nShit, let the chronic burn as the daytons spin.\nIt ain't been this much drama since I first heard Eminem,\nIn the club, poppin' X pills like M & Ms,\nCall it Dre day, we celebratin', bitch bring a friend.\nBottles on me, tell the waiter to order another round,\nAnd put that cheap-ass hypnotic down.\n(Put your 'cris up!)\nIf you feel the same way,\nWho got 'em hittin' switches NY to LA\n\n(If I could fit the whole hood in the club)\nHop in the low-rider, 'long as it got bitches in the back,\n(I turn it into a strip-club)\nCall it a lap-dance, when the six-fo' bounce that ass,\n(If I could fit the hole world in the club)\nTell the DJ to bang my shit, the west-coast in this bitch\n(Pop bottles and twist up)\nRoll up chronic and hash,\nIn a blunt, call it Aftermath\n\nSomebody tell me where the drinks at,\nWhere the bitches at,\nYou fucking on the first night, meet me in the back.\nI got a pound of chronic, and a gang of freaks,\nMove bitch! Who the fuck you think they came to see?\nThe prot&#xE9;g&#xE9; of the D R E,\nTake a picture with him, and you gotta fuck me,\nThen you gotta fuck Busta, can't touch Eve,\nGot sumthin on my waist say you can't touch Eve,\nThat's - my gangsta bitch, and like Crips and Bloods,\nI'm in the club on some gangsta shit.\n(So nigga twist up)\nLight another dub,\nBitches get scared when niggas start fighting in the club.\n\nAin't nothing but a g-thing, baby it's a g-thing,\nBounce like you got hydraulics in your g-string,\nI fuck a different bitch seven days a week,\nHit the switch, watch it bounce like a Scott Storch beat.\n\n(If I could fit the whole hood in the club)\nHop in the low-rider, long as it got bitches in the back,\n(I turn it into a strip-club)\nCall it a lap-dance, when the six-fo' bounce that ass,\n(If I could fit the hole world in the club)\nTell the DJ to bang my shit, the west-coast in this bitch\n(Pop bottles and twist up)\nRoll up chronic and hash,\nIn a blunt, call it Aftermath\n\nNiggaz thought I wasn't coming back?\nLook at me now,\nHoppin' out the same Cherry six-fo' with the motherfucking top down,\nI'm The Game, nigga\nCall your bitch, she ain't home, she with Game, nigga\nRemember that, Dre\nYou passed me the torch, I lit the chronic with it, now the world is my ashtray,\nRidin' three-wheel motion till the ass scrapes,\nTurn sunset into a motherfucking drag-race.\nNow watch it bounce,\nHit the switch, let it bounce till the police shut the shit down.\n{When you hit the club)\nTell 'em you came with me,\n(We gonna twist up)\nIn the V.I.P.\nIt's a new day, and if you ever knew Dre,\nMotherfucker, you would say I was the new Dre.\nSame Impala, different spokes\nSame chronic, just a different smoke.\n\n(If I could fit the whole hood in the club)\nHop in the low-rider, long as it got bitches in the back,\n(I turn it into a strip-club)\nCall it a lap-dance, when the six-fo' bounce that ass,\n(If I could fit the hole world in the club)\nTell the DJ to bang my shit, the west-coast in this bitch\n(Pop bottles and twist up)\nRoll up chronic and hash,\nIn a blunt, call it Aftermath"}