{"song_id":23254,"song_name":"Wouldn't Get Far","artist_id":1490221,"display_artist":"The Game Featuring Kanye West","spotify_id":"39yRhjDdSTP4A7VehxBXDb","lyrics":"For you baby, I'd find you\nYou wouldn't get far\n\n(The Game)\nI done been around the world, been around the block\nBeen around hoes that fucked Biggie and 'Pac\nLike Vida Guerra, ass took her to the top\nShe'll give you some brains you let her throw up the Roc\nLet her put on your chain, she'll throw you some cock\nPicture that like Meagan Good and Jamie Foxx\nHype said it's a wrap, she still on the set\nPuttin' oil on her likes like she Gloria Velez\nShe was (Eye Candy) in the XXL\nHopped off the page and on a skateboard with Pharrell\nI knew she {\"wouldn't get far\"} cause five hundred dollars\nCan't get you that {\"far\"} how you get that {\"far\"}\nAnd all these new video bitches tryin' to be Melissa Ford\nBut they don't know Melissa Ford drive a Honda Accord\nShe a video vixen, but behind closed doors\nShe do whatever it take to get to the Grammy Awards\nHa ha\n\n(Chorus: The Game)\n{\"You wouldn't get far\"} Fuckin' them rap stars\nYou know who you are, put your hands up ladies\n{\"You wouldn't get far\"} If you kept your legs closed\n{\"It would be best to wait your turn\"} But you know\n{\"You wouldn't get far\"} Fuckin' them rap stars\nYou know who you are, I wrote this song for you\n{\"For you baby, I'd find you\"} For you\nAnd you, for alla y'all\n\n(Kanye West)\nFor you... uh...\n\nPop quiz, how many topless, black foxes\nDid I have under my belt, like boxers\nNot to brag but, if it add up\nOne, two, nigga that's mad nuts\nGame you mad nuts, how you gon' call out all these\nBitches knowin' damn well they gon' call me?\nThe only dream, of that ghetto prom queen\nWas to make it to the screen, maybe get seen\nMaybe get chose by a nigga from my team\nHead so good he don't ask for a pre... nup\nNow ask yourself this question, umm\nWould you be with Jay-Z if he wasn't C-E-O\nWould you be with F-A-B-O if he drove a Neo\nWould you ride with Ne-Yo, if he was in a Geo\nWell why the hell you think these bitches comin' at me fo'?\nBut since they all fall in my palm, I take a trio\nYo\n\n(Chorus - sub \"mouth closed\" for \"legs closed\")\n{\"You wouldn't get far\"} Fuckin' them rap stars\nYou know who you are, put your hands up ladies\n{\"You wouldn't get far\"} If you kept your legs closed\n{\"It would be best to wait your turn\"} But you know\n{\"You wouldn't get far\"} Fuckin' them rap stars\nYou know who you are, I wrote this song for you\n{\"For you baby, I'd find you\"} For you\nAnd you, for alla y'all\n\n(The Game)\nI done had my share of bitches with long hair\nShort doo like Kalissa, Halle in \"Boomerang\" yeah\nI been around the block in the Bentley drop top\nIn Miami Beach when Lil' Kim was fuckin' with Scott\nI got the scoop on Hoops, whatever the case\nShe'll let you spray in her face long as she Bathing Apes\nAnd ain't nobody tryin' to take Beyonce from Jay\nBut I know a bitch named Superhead he fucked back in the day\nThe things niggaz do when pussy sittin' on they face\nStabbed Un in the stomach\nShe must have had a pussy like Wonder Woman, on that superhero shit\nFly as Gabrielle Union in the back of my six, fo'\nImpala, forget the double D's\nI put 'em right in your face like that model bitch Takara\nAnd she ain't win the show but she ridin' in that Galata\nThat's why I fuck 'em today and forget 'em tomorrow\n\n{\"You wouldn't get far\"} Fuckin' them rap stars\nYou know who you are, put your hands up ladies\n{\"You wouldn't get far\"} If you kept your legs closed\n{\"It would be best to wait your turn\"} But you know\n{\"You wouldn't get far\"} Fuckin' them rap stars\nYou know who you are, I wrote this song for you\n{\"For you baby, I'd find you\"} For you\nAnd you, for alla y'all\n\n(The Game)\nGod damn! Y'knahmsayin?\nI'm sittin' back watchin Kanye video\nAnd I see the same bitch that was in the homeboy Busta Rhymes video\nThen I flip the muh'fuckin' channel\nCheckin' out my uncle Snoop Dogg video\nAnd I see the same BITCH, that was in my video! Y'knowhatI'msayin?\nAnd then y'knahmsayin, to make that even mo' fucked up\nI'm watchin Oprah cover Hurricane Katrina\nI see the same bitch on Oprah, floatin away on the hood of a Camry\nThat was in the nigga Lil Weezy video!\nI mean DAMN! Everywhere I look\nEverywhere I go I see the same hoes\nDon't get mad, I'm only bein real\nYeah"}