{"song_id":23282,"song_name":"Outta My System","artist_id":297014,"display_artist":"Bow Wow Featuring T-Pain & Johnta Austin","spotify_id":"1cb7x6ypOTkoY9naUUddYQ","lyrics":"(Bow Wow: Spoken)\nDamn...\nI mean I just keep thinkin' about you.\nI mean I wanna move on but I can't move on.\nIt's like you got some kind of hold on me\nAnd I don't know.\nBut I'm a go ahead and talk about it.\n\nListen...\n\nBow Wow:\nI'm sittin' lookin' out the window like damn\nTryin' to fix the situation that's at hand\nYou still runnin' through my mind when I'm knowin' that you shouldn't be\nMe I'm on your mind? & I'm knowin' that it couldn't be\n'Cause you ain't called I ain't even appalled\nI still got alot of pain I ain't dealt with at all\nI've been runnin' around with other chicks\nI'm single and they lovin' it\nI'm likin' it but I just want the one that I was in love with\nThat's not the end of it I'm tryin' to let you know\nI can't get a grip of it is what I'm tryin' to let you know\nYou got a hold of some kind of control of me\nI don't know what it is but I gotta get you gone from me\nI'm workin' at it and it ain't gettin' no better\nJust tryin' to be like \"Yeah, Forget It, Whatever\"\nInstead of starin' out this glass lookin' at this bad weather\nDamn, I gotta pull myself together 'cause...\n\nT-Pain:\nWhen I'm with somebody all I think about is you, yeah\nWhen I'm alone that's all I wanna do, yeah\nI miss the smilin' faces in my sidekick\nOut of town visits all the time we spend together makes it hard to get you Outta My System.\nAnd you know what you do to me, do to me\nYou don't even understand damn\nAnd you know what you do to me do to me\nIt's so hard to get you Outta My System.\n\nBow Wow:\nI'm too attached my heart won't let me fall back\nI got it bad that's what you can call that\nAnd when I see you in the streets that's the worst for me\nI used to love the little things you did that's what works for me\nIt's too major I see you on my pager\nKnowin' what your doin' where you at or \"Can I see you later?\"\nThe fellas tellin' me \"Just let her go Bow.\"\nBelieve me I'm tryin' man I just don't know how\nI be in all the top spots even with the hot shots knowin' they just want me 'cause I'm in the top spot\nThat's not poppin' and my brain ain't stoppin' thinkin' who she with or where she goin' is she club hoppin'?\nI never had this kind of problem in my life\nThis is my first time dealin' with this kind of fight\nIt's every night and every flight and every time you in my sight\nDamn, this ain't even right 'cause...\n\nT-Pain:\nWhen I'm with somebody all I think about is you, yeah\nWhen I'm alone that's all I wanna do, yeah\nI miss the smilin' faces on my sidekick\nOut of town visits all the time we spend together makes it hard to get you Outta My System.\nOh.\nAnd you know what you do to me, do to me\nYou don't even understand damn\nAnd you know what you do to me, do to me\nIt's so hard to get you Outta My System.\n\nBow Wow:\nIs it wrong for me to feel this way?\nYou've been runnin' through my mind all day.\nCan you feel me?\nI've been tryin' to get you off my mind\nBut I can't after all this time that's what kills me.\nIs it wrong for me to feel this way?\nYou've been runnin' through my mind all day.\nCan you feel me?\nI've been tryin' to get you off my mind\nBut I can't after all this time and it kills me.\n\nT-Pain:\nWhen I'm with somebody all I think about is you\nWhen I'm alone that's all I wanna do\nI miss the smilin' faces on my sidekick\nOut of town visits all the time we spend together makes it hard to get you Outta My System.\nHard to get you out.\nAnd you know what you do to me, do to me\nYou don't even understand damn\nAnd you know what you do to me do to me\nIt's so hard to get you Outta My System.\n\n(Bow Wow: Spoken)\nI remember everything that me and you talked about\nMe and you had a whole life planned out together\nAnd if I could I would turn back the heads of time\nAnd correct all my mistakes that I ever did...\nBut now I guess I gotta move on right?\nIt's still hard & I still love you to this day.\nPeace."}