{"song_id":23381,"song_name":"Big Things Poppin' (Do It)","artist_id":277486,"display_artist":"T.I.","spotify_id":"7HS6itAEkzdEIFPfqneenx","lyrics":"Hey, hey whatchu waitin' for?\nDo it, (you better) do it, (you better) do it\nWhatchu waitin' for?\nDo it, ('cause I'ma) do it, ('cause I'ma) do it\nWhatchu waitin' for?\nDo it, (you know we) do it, (you know we) do it\n\nLet me hear ya say big shit poppin' and little shit stoppin'\nBig shit poppin' and little shit stoppin'\nBig shit poppin' and little shit stoppin'\nBall on these niggas, bein' broke is not an option\n\nDo it, do it, do it whatchu waiting for\nDo it, do it, do it whatchu waiting for\nDo it, do it, do it whatchu waiting for\nNow lemme hear you say\nBig shit poppin', and lil shit stoppin'\nBig shit poppin', and lil shit stoppin'\nBig shit poppin', and lil shit stoppin'\nBall on these niggas being broke is not an option\n\nDo it, do it, do it whatchu waiting for\nDo it, do it, do it whatchu waiting for\nDo it, do it, do it whatchu waiting for\nNow lemme hear you say\nBig shit poppin', and lil shit stoppin'\nBig shit poppin', and lil shit stoppin'\nBig shit poppin', and lil shit stoppin'\nBall on these niggas being broke is not an option\n\n\nNow do it to the maximum, take it while you askin' em\nDon't listen to them suckers when they say you too irrational\nSee, I said I was \"King\" and them lames started laughin' and\nSame suckers now want the King on a track with 'em\nI composed several classicals, you know like \"Top Back\"\n\"Dope Boy\", \"Bring 'Em Out\", and \"What You Know About That\"\nNow they ask how I talk, what you know about that?\nDominated '06, now I'm goin' right back\nSee me rain hell, I just showed you like that\nEven Denzel say, \"Damn, I ain't know it like that\"\nNigga yeah, still Bankhead, you can tell\nAin't nothin' changed but the name on the mail\nI still kick in doors with them thangs in the air\nUp in Benihana's, see me slangin the chair\nI will slang 'caine, no such thing as a jail\nSay you need a hundred squares? It just came off the scale\n\nDo it, do it, do it whatchu waiting for\nDo it, do it, do it whatchu waiting for\nDo it, do it, do it whatchu waiting for\nNow lemme hear you say\nBig shit poppin', and lil shit stoppin'\nBig shit poppin', and lil shit stoppin'\nBig shit poppin', and lil shit stoppin'\nBall on these niggas being broke is not an option\n\nNow do it like a ball player\nWhere you see me ball at\nStacks tall as ball players\nFrom the stage to the air\nWhether in Miami, Cincinnati, or the Riverdale\nArizona, California, make it rain anywhere\nPullin' out that pistol nigga, who you think you fin' to scare?\nTwenty rounds of missiles'll have you pissin' in your underwear\nI tote about 40 cal so you better tone it down\nOr I suggest you just prepare yourself for when it goin' down\nA-Town, West Side, Club Krucial\nRight up at the top where Big Kuntry, Dro, and Mack be\nJackers lie, say they caught me slippin', how could that be?\nI'm something like a stalker, I be e'rywhere the strap be\nThe trap be, jumpin' with them hundred dollar slabs\nIf I want it nigga, I could get a hundred on the tab\nSell 'em all, double down, nigga do the math\nThink I won't pull up in something with 200 on the dash?\n\nDo it, do it, do it whatchu waiting for\nDo it, do it, do it whatchu waiting for\nDo it, do it, do it whatchu waiting for\nNow lemme hear you say\nBig shit poppin', and lil shit stoppin'\nBig shit poppin', and lil shit stoppin'\nBig shit poppin', and lil shit stoppin'\nBall on these niggas being broke is not an option\n\nNow I do it like I wanna do it and do that shit in front of you\nReal nigga vision pimpin', I ain't seein' none of you\nI do it for my nigga Phil's daughter and his mama too\nI do it for my oldest sons and their grandmama too\nDo it for my daughters and my youngest son's mama who\nGo buy what she want because she know it ain't a problem to\nYou do something to them and to you I'll bring the drama to\nYou do it for a day or so, we do it for a month or two\nI do it for my partners, go make sure them niggas stuntin' too\nWe do it with them choppers, ain't no problem, where you runnin' to?\nI do it for the block, that why ain't nobody stoppin' me\nI do it for my pop and my cousins too, they watchin' me\nI did it nonstop, now see how these niggas copy me\nI made it from the bottom to the top where I oughta be\nWho do it did good and do it did fresh\nNo matter what I do you know I do it to death\n\nDo it, do it, do it whatchu waiting for\nDo it, do it, do it whatchu waiting for\nDo it, do it, do it whatchu waiting for\nNow lemme hear you say\nBig shit poppin', and lil shit stoppin'\nBig shit poppin', and lil shit stoppin'\nBig shit poppin', and lil shit stoppin'\nBall on these niggas being broke is not an option"}