{"song_id":23406,"song_name":"Shawty","artist_id":342441,"display_artist":"Plies Featuring T-Pain","spotify_id":"6olIWF9LZgO0Eij4CeORQV","lyrics":"Plies:\nWhat's happenin' Homie this Ya Boy Plies Man Hey Pain Tell 'em\nBout Your shawty homie I'ma Tel Em Bout mine dawg!\n\nEven Though I'm Not Your Man, You Not My Girl,\nI'm A Call You My Shawty,\n'Cause I Can't Stand To See You Treated Bad,\nI Beat His Ass For My Shawty,\nAnd we ain't did nothin' that we ain't supposed to do,\nCause you my shawty,\nBabygirl you know I be home, keep me on the ringtone shawty,\nSing It To Me Girl.\n\nVerse 1 (plies)\nSoon As I Seen Her, shit Told Her I'd Pay For It,\nLil Mama the baddest thing 'round here and she already know It,\nI pointed at the donk and told her this supposed to be yours,\nShowed her a couple stacks and told her I'd let her blow It,\nThe hottest thing in the city baby you can't ignore it,\nI showed her I was a real nigga and she went for it,\nFirst time I caught her shit, she ain't even know how to throw it back,\nNow she an animal, I got her sex game right,\nI taught her how to talk to me while she take pipe,\nAnd opened her up and showed her what a real nigga like,\nI told her I don't usually do this, I don't fuck on the first night,\nCause after I beat ya baby I'm liable To fuck up your whole life,\nI gotta train her, now she suck me with ice,\nI call her my lil' bust it baby 'cause she keep it tight,\nWhenever I tell her to bust, ain't gotta tell her twice,\nWhenever I wanna get off she know how to get me right.\n\nFull Chorus:\nEven Though I'm Not Your Man, You Not My Girl,\nI'm A Call You My Shawty,\n'Cause I Can't Stand To See You Treated Bad,\nI Beat His Ass For My Shawty,\nAnd we ain't did nothin' that we ain't supposed to do,\nCause you my shawty,\nBabygirl you know I be home, keep me on the ringtone shawty,\nSing It To Me Girl\nWhoa W-W-Whoa Whoa whoa Whoa Whoa Whoa,\nWhoa W-W-Whoa Shawty.\nWhoa W-W-Whoa Whoa whoa Whoa Whoa Whoa,\nWhoa W-W-Whoa Shawty.\n\nVERSE 2: Plies\nI love to show her off, cause all the dope boys want her,\nKnow why they wanna beat badly, look at all that ass on her,\nLook how that pussy sit up in them shorts, you gotta want her,\nLove when she act like she bow-legged and bend the corner,\nShe proud to be fuckin' me, 'cause I'm stuntin on 'em,\nIt feels good to be fuckin' a real nigga don't' uh,\nAin't called her in 2 days, gotta let her mind wonder,\nBut when she miss me, she call to tell me to jump on her,\nThat's why I don't mind breakin' her off, 'cause she ain't with the drama,\nIf you done ripped her before, you know how to cuff Lil' Mama,\nYou know she gotta be somethin' 'cause I done beat her under,\nI'm baby snatchin' I'm tellin' ya, I promise,\nI exposed her to real, & now she hate lame,\n'Member she used to run from me, & now she like Pain,\nShe call me sometimes just to ask is it her thing,\nEver since I ran up in shawty she ain't been the same.\n\nFull Chorus:\nEven Though I'm Not Your Man, You Not My Girl,\nI'm A Call You My Shawty,\n'Cause I Can't Stand To See You Treated Bad,\nI Beat His Ass For My Shawty,\nAnd we ain't did nothin' that we ain't supposed to do,\nCause you my shawty,\nBabygirl you know I be home, keep me on the ringtone shawty,\nSing It To Me Girl\nWhoa W-W-Whoa Whoa whoa Whoa Whoa Whoa,\nWhoa W-W-Whoa Shawty\nWhoa W-W-Whoa Whoa whoa Whoa Whoa Whoa,\nWhoa W-W-Whoa Shawty.\n\n(Music to fade)"}