{"song_id":23494,"song_name":"Duffle Bag Boy","artist_id":341875,"display_artist":"Playaz Circle Featuring Lil Wayne","spotify_id":"null","lyrics":"Yeah...\nOk...\nNew Playaz Circle...\nAs a matter of fact its gun kill me\nBitch!...\n'Cause you ain't!\nHa!\n(Tell 'em shortie)\nSo get high!\n(Tell'em weezy!)\nOr get low! yeah!\nIf I don't nothin' imma ball\nI'm countin' all day like tha clock on the wall\nNow go and get your money little duffle bag boy\nSaid go and get your money little duffle bag boy get money!\nAnd I ain't ever ran from a nigga and I\nDamn sho ain't bout to pick today to start runnin'\nLook honey I ain't never ran from a nigga and I\nDamn sho ain't bout to pick today to start runnin' get money\n\nTha beat so hot tha flow is so ice cold\nWalkin' to the gucci store honey I'm home\nI am on my shit I need a pamper on\nToilet paper on the side for example hommie\nI... get... money\nI know you niggas ain't heard no shit like this and\nWhile you wishing on that fallin' star I'm in a foreign car\nSmoking out with the doors ajar\nSuede sun roof hangin' out the big top\nWe leave the dealership head to the rim shop\nYou niggaz bearly dressin I got thousands piling\n\n\nThat's that salad dressin I'm on my thousand island\nWhylin... stylin... I be I get so much money it's my I.d\nDon't try me and if I don't do nothin' ima fuckin' ball\nAnd I ain't bout to start runnin' naw nigga naw\n\nIf I don't nothin' imma ball\nI'm countin' all day like a clock on the wall\nNow go and get your money little duffle bag boy\nSaid go and get your money little duffle bag boy get money\nAnd I ain't ever ran from a nigga and I\nDamn sho ain't bout to pick today to start runnin'\nLook honey I say I ain't never ran from a nigga and I\nDamn sho ain't bout to pick today to start runnin' get money\n\nAin't nothin' to a boss we ballin when you see us\nWe hear them hataz callin they too far off to see us\nUnless they got they glasses on get your bifocal game\nClass is now in session now try to stay focus mayne\nYour boy ain't good enough style ain't hood enough\nWould've could've should've wont do with us true enough\nNeed a hoe break a hoe never nothin' new to us\nTurnin' hoes to house wives never been cool with us\nSoon enough all these dealers are gonna catch up\nTill then fuck it I'm winnin' so ima stack up\nFlows like a river tha current is so rapid\nHit with the wrachet that's how shit happens\nNext time you're yappin make sure it be about big money talk\nLet that lil money walk call me what you want but don't call me for fronts\nSouthside I got wut you want come holla at me"}