{"song_id":23659,"song_name":"Roll","artist_id":302239,"display_artist":"Flo Rida Featuring Sean Kingston","spotify_id":"72yHcYTFilEkFY1cJigOaE","lyrics":"(Feat. Sean Kingston)\n(Intro - Sean Kingston (Flo Rida))\nBunk camera wit it, show me I'm tha man (man)\nShake it on tha flo, like dice pon ya hon\nLemme say dat ass roll, roll, roll, roll, roll\nThey go!\nIt's Kingston and Flo Rida (Flo Rida)\nKingston and Flo Rida (Sean Kingston)\nKingston and Flo Rida (J.R. on da track, Poe Boy)\nKingston and Flo Rida (let's get it!)\n\n(Chorus X2 - Sean Kingston)\nBunk camera wit it, show me I'm tha man (man)\nShake it on tha flo, like dice pon ya hon\nLemme say dat ass roll, roll, roll, roll, roll\nThey go!\n\n(Verse 1 - Flo Rida)\nHey...\nI could beat a man, dat's a shawty undastand it\nRoll da police, when da feda jock panic\nPull ova, Flo Rida can handle it\n'Gon place ya bets, or we betta yet alan it\nCity to Vegas, God's 2 bust it babies\nI stay on da tragic, your pretty pussy from Haden\nRappas' tables invaded, great, watch it belated\nBlock paper, I make it so I been gamblin' lately\nYeah, we could play casino\nYou can be my ginger\nSam rock steam, shawty, I supply the dealas\nI gotta thank my no-go\nBumpin' of da game pit\nBoss, ghetto boss, 'gon show me I'm da man\n\n(Chorus X2 - Sean Kingston)\nBunk camera wit it, show me I'm tha man (man)\nShake it on tha flo, like dice pon ya hon\nLemme say dat ass roll, roll, roll, roll, roll\nThey go!\n\n(Verse 2 - Flo Rida)\nHey, got money on the shooter am I talking about the ruga\nCommand that roulette, click, click, I'm no loser\nYeah, you the shit, southern slang from Anua\nThe booty connoisseur when I'm drinking on Kahlua\nGo see this rose, gal I won't try you with tulips\nI'm coppin' ros&#xE9;, now my chicken's hard as Hooters\nI'm Mandalay Bay, The Bellagio abuser\nMy paper don't amuse ya then you haven't see my Muler\nHot rod, coat tail, I need the Pink Flamingo\nGambling female, like your hips is playing Cee-Lo\nCheck out your Channel, see, I stroke your ego\nI'm here for the gazebo, pure cooker, you's a kilo\n\n(Chorus X2 - Sean Kingston)\nBunk camera wit it, show me I'm tha man (man)\nShake it on tha flo, like dice pon ya hon\nLemme say dat ass roll, roll, roll, roll, roll\nThey go!\n\n(Verse 3 - Flo Rida)\n7, 11, there it go, I called it, no guessing\nAin't naked but all these shawties, they looking at you, they threatened\nI reckon cause you high rolling, they begging, you begging\nSnake eyes while you collecting, them thighs I will invest in\nThousand dollar chips for your thousand dollar hips\nGot these thousand dollar gifts, leave more thousand dollar tips\nI'll be your supplier, spend it like a dryer\nRoll for me baby, be my NASCAR tire\nI know the odds of winning, like I do my Fellini's\nThe gangster proud of women, I call it Robin Givens\nFlo Rida extort you, take you Pinto to Porsche\nSay look what you bottom bought ya\nNow do what your mama taught ya!\n\n(Chorus X2 - Sean Kingston)\nBunk camera wit it, show me I'm tha man (man)\nShake it on tha flo, like dice pon ya hon\nLemme say dat ass roll, roll, roll, roll, roll\nThey go!"}