{"song_id":23696,"song_name":"American Boy","artist_id":301898,"display_artist":"Estelle Featuring Kanye West","spotify_id":"41on8RwRh22IHcChAN2gm8","lyrics":"This a number one champion sound\nYeah, Estelle, we about to get down (get down)\nWho the hottest in the world right now\nJust touched down in London town\nBet they give me a pound\nTell them put the money in my hand right now (yes)\nTell the promoter we need more seats\nWe just sold out all the floor seats\n\nTake me on a trip, I'd like to go some day\nTake me to New York, I'd love to see L.A.\nI really want to come kick it with you\nYou'll be my American boy\n\nHe said, \"Hey, sister, it's really, really nice to meet ya\"\nI just met this 5-foot-7 guy who's just my type\nI like the way he's speaking, his confidence is peaking\nDon't like his baggy jeans, but I'ma like what's underneath them\n\nAnd no, I ain't been to M-I-A\nI heard that Cali never rains and New York's all awake\nFirst let's see the West End, I'll show you to my brethren\nI'm liking this American boy, American boy\n\nTake me on a trip, I'd like to go some day\nTake me to New York, I'd love to see L.A.\nI really want to come kick it with you\nYou'll be my American boy, American boy\n\nLa la-la, la-la dee-ah\nLa la-la, la-la dee-ah\nLa la-la, la-la dee-ah\nWill you be my American boy, American boy\n\nCan we get away this weekend, take me to Broadway\nLet's go shopping, maybe then we'll go to a caf&#xE9;\nLet's go on the subway, take me to your hood\nI never been to Brooklyn and I'd like to see what's good\n\nDressed in all your fancy clothes\nSneakers looking fresh to death, I'm loving those shell toes\nWalkin' that walk, talk that slick talk\nI'm liking this American Boy, American boy\n\nTake me on a trip, I'd like to go some day\nTake me to New York, I'd love to see L.A.\nI really want to come kick it with you\nYou'll be my American boy\nTell 'em wha-what, blood\n\nWho killin' 'em in the U.K.\nEverybody gonna to say you, K\nReluctantly, cause most of this press don't fuck wit me\nEstelle once said to me, \"Cool down, down\nDon't act a fool now, now\"\nI always act a fool ow, ow\nAin't nothing new, now, now\nHe crazy, I know what you're thinkin'\nRibena, I know what you're drinkin'\nRap singer, chain blinger\nHolla at the next chick soon as you're blinkin'\nWhat's you're persona about this Americana\nBrama, am I shallow cause all my clothes designer\nDressed smart like a London bloke\nBefore he speak, his suit bespoke\nAnd you thought he was cute before\nLook at this pea coat, tell me he's broke\nAnd I know you ain't into all that\nI heard your lyrics, I feel your spirit\nBut I still talk that ca-a-ash\nCause a lot of wags want to hear it\nAnd I'm feelin' like Mike at his baddest\nLike the Pips at they Gladys\nAnd I know they love it\nSo to hell with all that rubbish\n\nWould you be my love, my love (would you be mine)\nWould you be my love, my love (could you be mine)\nCould you be my love, my love (ooh)\nWould you be my American boy, American boy\n\nTake me on a trip, I'd like to go some day\nTake me to Chicago, San Francisco Bay\nI really want to come kick it with you\nYou'll be my American Boy, (be my) American Boy\n\nTake me on a trip, I'd like to go some day\nTake me to New York, I'd love to see L.A.\nI really want to come kick it with you\nYou'll be my American boy, American boy\n\nLa la-la, la-la dee-ah\nLa la-la, la-la dee-ah\nLa la-la, la-la dee-ah"}