{"song_id":23748,"song_name":"Homecoming","artist_id":276709,"display_artist":"Kanye West Featuring Chris Martin","spotify_id":"2iaCM7WvOknQI1230hA9eK","lyrics":"Yeah\nAnd you say Chi-City?\nChi-City, Chi-City\n\nChris Martin and Kanye West:\nI'm coming home again\nDo you think about me now and then? (Yeah)\nDo you think about me now and then?\n'Cause I'm coming home again\nI'm in home again (Ow)\n\nKanye West:\nI met this girl when I was 3 years old\nAnd what I loved most she had so much soul\nShe said \"Excuse me lil homey, I know you don't know me\nBut, my name is Windy and I like to blow trees\"\nAnd from that point I never blow her off\nNiggas come from out of town, I like to show her off\nThey like to act tough, she like to tow 'em off\nAnd make 'em straighten up their hat cause she know they soft\nAnd when I grew up she showed me how to go downtown\nIn the nighttime her face lit up, so astounding\nI told her in my heart is where she'll always be\nShe never messed with entertainers cause they always leave\nShe said it felt like they walked and drove on me\nKnew I was gang affiliated, got on TV and told on me\nI guess that's why last winter she got so cold on me\nShe said, \"'Ye, keep making that keep making that platinum and gold for me\"\n\nChris Martin:\nI'm coming home again\nDo you think about me now and then?\nDo you think about me now and then?\n'Cause I'm coming home again\nI'm in home again\nDo you think about me now and then?\nDo you think about me now and then? Oh\nNow I'm coming home again\nMaybe we could start again\n\nKanye West:\nBut if you really cared for her\nThen you wouldn't have never hit the airport to follow your dreams\nSometimes I still talk to her, but when I talk to her\nIt always seems like she talking 'bout me\nShe said, \"You left your kids, and they just like you\nThey want to rap and make soul beats just like you\nBut they just not you\" and I just got through\nTalking 'bout what we tryna do: just not new\nNow everybody got the game figured out all wrong\nI guess you never know what you got 'til it's gone\nI guess that's why I'm here and I can't come back home\nAnd guess when I heard that? When I was back home\nEvery interview I'm representing you, making you proud\nReach for the stars so if you fall, you land on a cloud\nJump in the crowd, spark your lighters, wave 'em around\nIf you don't know by now, I'm talking 'bout Chi-Town\n\nChris Martin:\nI'm comin' home again\nDo you think about me now and then?\nDo you think about me now and then?\n'Cause I'm comin' home again\nI'm in home again\nMaybe, do you remember when\nFireworks at Lake Michigan, oh\nNow I'm coming home again\nI'm in home again\nMaybe you, do you remember when?\nFireworks at Lake Michigan, oh\nNow I'm comin' home again\nMaybe we can start again\n\nLoyee oyeee oh, loyee oyeee oh\nI'm in home again\nLoyee oyeee oh, loyee oyeee oh\nI'm in home again\nMaybe we can start again"}