{"song_id":23762,"song_name":"Lookin Boy","artist_id":303624,"display_artist":"Hot Stylz Featuring Yung Joc","spotify_id":"00RYiT3a2lNQ1wTKBQXWSw","lyrics":"(Verse 1: Raydio G)\nWeak lookin' boy, you slow lookin' boy,\nDirty white sock on your toe lookin' boy,\nYou rat lookin' boy, will you marry me, splat lookin' boy,\nWhoopi Goldberg black lip lookin' boy,\nMidnight train Gladys Knight lookin' boy,\nYou poor lookin' boy, Don Imus ol' nappy headed ho lookin' boy,\nDick in your booty that smell lookin' boy,\nDo you run with the KY jelly lookin' boy,\nGetchya Riiiickky! Morris Chestnut shot in ya back lookin' boy,\nValtrex brand new gay lookin' boy,\nYou in house L Cool J lookin' boy,\nGetchya No Mama! No Mama! Penny off good times big J.J. lookin' boy,\n\nPoint Em' Out\nGet Em'\n\n(Verse 2: Yung Joc)\nOh L.L. I need love lookin' boy,\nFake I.D. can't get in club lookin' boy,\nRemember me from school? Hell no you gets no love lookin' boy,\nGangsta homo thug lookin' boy,\nRing around yo tongue lookin' boy,\nOh it's the first of the month, Bone Thug lookin' boy,\nGot yo hand off the chain lookin' boy,\nThis yo brain on drugs lookin' boy,\nJang-A-lang, Jang-A-lang, Jang-A-lang, Bernie Mac lookin' boy,\nNo eyelids can't blink lookin' boy,\nYou are the weakest link lookin' boy,\nNo Chris, no Chris, no! Raz B lookin' boy,\n\nPoint Em' Out\nGet Em'\n\n(Verse 3: Krazee)\nYou better getchya weak lookin' boy,\nGeek lookin' boy, Pepe Le Pu you stink lookin' boy,\nYou don't do nothin' but wash my feet lookin' boy,\nBang, bang, bang, skeet, skeet, lookin' boy,\nTight lookin' boy, I fight lookin' boy,\nHad to retaliate, Mike lookin' boy, you dike lookin' boy,\nYour momma so slow she can't cook Minute Rice lookin' Boy,\nFlop lookin' boy, Stop lookin' boy,\nCan't take off her top lookin' boy,\nWomen be shoppin', women be shoppin', black Chris Rock lookin' boy,\nCase lookin' boy, Horse and carriage, Cam'ron and Mase lookin' boy,\nYou ape lookin' boy, Can I help you? Yeah put 2 on eight lookin' boy,\n\nPoint Em' Out\nGet Em'\n\n(Verse 4: Meatball)\nCome on man!\nYou'ze a broke lookin' boy, joke lookin' boy,\nLet me clear my throat lookin' boy,\nSpongebob on your shirt lookin' boy,\nI play in dirt lookin' boy,\nAll dirt K-Swiss lookin' boy,\nBrown dookie stains in drawers lookin' boy,\nScooby Dooby-Dooby-Doooo! Mike Vick lookin' boy,\nI won't need no rent lookin' boy,\nLookin' real ugly in the face lookin' boy,\nJail lookin' boy, weave lookin' boy,\nNeed to brush yo teeth lookin' boy,\nBoot lookin' boy, soup lookin' boy,\nWearin' green Joc in suit lookin' boy,\nSay it again! Say it again! Ol' pinky lookin' boy,\n\nPoint Em' Out\nGet Em'\n\n(Verse 5: Raydio G  {Krazee} (Meatball))\nJust letchya soul gllloooowww! Curl lookin' boy,\nI know you wanna leave me, David Ruffin lookin' boy,\n\n\n\n(You'ze a brawl lookin' boy,\nIf I was a little bit tall lookin' boy,\n(Sniff, Sniff, Sniff, Sniff) now that's the smell of clean... ol' Pine-Sol lookin' boy,)\n\n{This is the song that doesn't end, lamb chop lookin' boy,\nBang-bang, bang-bang, bang-bang, ol' pops lookin' boy,}\n\nPoint Em' Out\nGet em'"}