{"song_id":23823,"song_name":"My Life","artist_id":1490221,"display_artist":"The Game Featuring Lil Wayne","spotify_id":"4GXH9A6fzuE0MNtqtzjhLg","lyrics":"Punk ass motherfucka!\nBitch ass nigga!\nWhat were you gonna do?\nKill me in my sleep you bitch ass nigga?\nTupac, Biggie shut the fuck up!\nFucking dogs, alwayz barking shit...\nDon't shoot me! Don't shoot me!\nFuck you nigga!\n\nLil Wayne\nAnd I'm grindin' until I'm tired\n'Cause they say you ain't grindin' until you die\nSo I'm grinding with my eyes wide\nLooking to find\nA way through the day\nA light for the night\nDear lord, you done took so many of my people\nI'm just wondering why you haven't taken my life (my life)\nLike what the hell am I doing right?\n\nThe Game\nTake me away from the hood, like a state penitentiary\nTake me away from the hood, in a casket or a Bentley\nTake me away...\nLike I overdosed on cocaine\nOr take me away, like a bullet from Kurt Cobain\nSuicide, I'm from a windy city\nLike Do or Die\nFrom a block close to where Biggie was crucified\nThat was Brooklyn's Jesus, shot for no fucking reason.\nAnd you wonder why Kanye wears Jesus pieces. (My life!)\nCause that's Jesus people, and Game he's the equal\nHated on so much, Passion of Christ need a sequel\nYeah, like Roc-a-Fella needed Sigel\nLike I needed my father, but he needed a needle (My life!)\nI need some meditation, so I can lead my people\nThey askin' why?\nWhy did John Lennon leave The Beatles?\nAnd why every hood nigga feed off evil?\nAnswer my question, 'fore this bullet leave this desert eagle\n\nLil Wayne\nAnd I'm grindin' until I'm tired\nAnd you ain't grindin' until you die\nSo I'm grinding with my eyes wide\nLooking to find\nA way through the day\nA light for the night\nDear lord, you done took so many of my people\nI'm just wondering why you haven't taken my life (my life)\nLike what the hell am I doing right?\n\nThe Game\nWe are not the same, I am a Martian.\nSo approach my Phantom doors with caution.\nYou see them 24's spinnin'\nI earned 'em.\nI ain't no preacher, but here's my Erick Sermon\nSo eat this black music, and tell me how it taste now\nAnd fuck Jesse Jackson 'cause it ain't about race now\nSometimes I think about my life with my face down\nThen I see my sons and put on that Kanye smile\nDamn I know his mama proud\nAnd since you helped me sell my dream, we can share my mama now\nAnd like MJB, no more drama now\nLivin' the good life, me and Common on common ground\nI spit crack, and niggas could drive it outta town\nGot a Chris Paul mindstate, I'm never out of bounds\nMy life used to be empty, like a glock without a round\nNow my life full like a chopper with a thousand rounds\n\nLil Wayne\nAnd I'm grindin' until I'm tired\nAnd you ain't grindin' until you die\nSo I'm grinding with my eyes wide\nLooking to find\nA way through the day\nA light for the night\nDear lord, you done took so many of my people\nI'm just wondering why you haven't taken my life (my life)\nLike what the hell am I doing right?\n\nThe Game\nWalked through the gates of hell, see my Impala parked in front\nWith the high beams on\nMe and the devil sharing chronic blunts\nListening to The Chronic album, playin' backwards\nShootin' at pictures of Don Imus for target practice\nMy mind fucked up, so I cover it with a Raider hood\nI'm from the city that made you motherfuckers afraid of Suge\nMade my grandmother pray for good\nIt never made her happy, but I bet that new Mercedes could\nAin't no bars, but niggas can't escape the hood\nThey took so many of my niggas, that I should hate the hood\nBut it's real niggas like me that make the hood\nRidin' slow in that Phantom just the way I should\nWith the top back, and my Sox hat\nI'm Paid in Full, the nigga Alpo couldn't stop that\nEven if they brought the nigga Pac back\nI'd still keep this motherfucker cocked back\n\nLil Wayne\nAnd I'm grindin' until I'm tired\nAnd you ain't grindin' until you die\nSo I'm grinding with my eyes wide\nLooking to find\nA way through the day\nA light for the night\nDear, you done took so many of my people\nI'm just wondering why you haven't taken my life (my life)\nLike what the hell am I doing right?\n\nMy Life (my life, my life, my life)\nMy Life (my life, my life, my life)\nMy Life (my life, my life, my life)\nMy Life (my life, my life, my life)"}