{"song_id":23820,"song_name":"Just Dance","artist_id":306341,"display_artist":"Lady GaGa Featuring Colby O'Donis","spotify_id":"3E5XrOtqMAs7p2wKhwgOjf","lyrics":"(Shit!)\nAh, RedOne\nKonvict\nGaga, oh-oh, eh\n\nI've had a little bit too much, much (Oh oh oh-oh)\nAll of the people start to rush (Start to rush by)\nHow does he twist the dance, can't find my drink, oh man\nWhere are my keys? I lost my phone, phone (Oh oh oh-oh)\n\nWhat's goin' on on the floor?\nI love this record, baby, but I can't see straight anymore (Whoo!)\nKeep it cool, what's the name of this club?\nI can't remember but it's alright, a-alright\n\nJust dance, gonna be okay, da dat doo-doo-mmm\nJust dance, spin that record, babe, da dat doo-doo-mmm\nJust dance, gonna be okay, duh duh duh \nDance, dance, dance, just, j-j-just dance\n\nWish I could shut my Playboy mouth (Oh oh oh-oh)\nHow'd I turn my shirt inside out? (Inside outright)\nControl your poison babe, roses have thorns they say\nAnd we're all getting hosed tonight (Oh oh oh-oh)\n\nWhat's goin' on on the floor?\nI love this record, baby, but I can't see straight anymore\nKeep it cool, what's the name of this club?\nI can't remember but it's alright, a-alright (Whoo!)\n\nJust dance, gonna be okay, da dat doo-doo-mmm\nJust dance, spin that record babe, da dat doo-doo-mmm\nJust dance, gonna be okay, duh duh duh \nDance, dance, dance just, j-j-just\n\nWhen I come through on the dance floor checkin' out that catalog (Hey)\nCan't believe my eyes, so many women without a flaw (Hey)\nAnd I ain't gonna give it up, steady trying to pick it up like a call (Hey)\nI'ma hit it, I'mma hit it and latch onto it until tomorrow, yeah\n\nShawty, I can see that you got so much energy\nThe way you're twirlin' up them hips 'round and 'round\nAnd now there's no reason at all why you can't leave here with me\nIn the meantime, stay and let me watch you break it down and\n\nDance, gonna be okay (Oh-oh) da dat doo-doo-mmm \n(Oo yeah) Just dance, spin that record, babe, da dat doo-doo-mmm\n(Oo yeah) Just dance, gonna be okay, da dat doo-doo-mmm \n(Oo yeah) Just dance, spin that record, babe, da dat doo-doo-mmm\n(Oh-oh-oh) Just dance, gonna be okay, duh duh duh (Gonna be okay, yeah)\nDance, dance, dance, just, j-j-just dance (Oh-oh)\n\nAmazing. Music.\nWhoo! Let's go!\n\nHalf psychotic, sick hypnotic\nGot my blueprint, it's symphonic\nHalf psychotic, sick hypnotic\nGot my blueprint electronic\n\nHalf psychotic, sick hypnotic\nGot my blueprint, it's symphonic\nHalf psychotic, sick hypnotic\nGot my blueprint electronic\n\nGo! Use your muscle, carve it out, work it, hustle\nI got it, just stay close enough to get it on\nDon't slow! Drive it, clean it, lights out, bleed it\nSpend the lasto (I got it) in your pocko (I got it)\n\nJust dance, gonna be okay, da dat doo-doo-mmm\nJust dance, spin that record, babe, da dat doo-doo-mmm\n\nJust dance, gonna be okay, da dat doo-doo-mmm (Baby)\nJust dance, spin that record, babe, dat da doo-doo-mmm (Baby yeah)\nJust dance, gonna be okay, duh duh duh (Spin that record, baby, yeah)\nDance, dance, dance just, j-j-just dance"}