{"song_id":23852,"song_name":"So Fly","artist_id":1496888,"display_artist":"Slim Featuring Yung Joc","spotify_id":"6nqscDOWhTkD1tfpTNrh5A","lyrics":"I'm so fly, so fly, so high, so high, so fly, so fly, so high.\n\nJust stepped out, fresh out the shower.\nGotta stay fresh, take about an hour.\nGotta get dressed, your boy's so clean.\nBoth of 'em' off, I got them blue jeans.\nFresh pair of shades, house on my wrists.\nSocks to the drawers, your boy stay fit.\nI'm ready, can't nobody tell me nothing.\n\nI'm so fly, so fly.\nFeels like I'm taking off, I'm so high, so high.\nLooking for a shorty to break me off.\nSo fly, so fly.\nFeels like I'm taking off, I'm so high.\nLooking for a shorty to break me off, I'm so fly.\n\nGot my keys, picked my toy.\nTop drop down, let the haters hear the noise.\nHit that paddle, turn that wheel.\nPush that run, make it all disappear.\nPhone is ringing, it's the bluetooth.\nCall me on the phone, like \"aye, what it do?\"\nI'm coming and we gonna take this over.\n\nI'm so fly, so fly.\nFeels like I'm taking off, I'm on top of the world.\nLooking for a shorty to break me off.\nSo fly, so fly.\nFeels like I'm taking off, I'm so high.\nDon't you hate on me, I said don't you hate on me, no, I'm so fly.\n\nMade it to the club, everybody know what's up (Superstar status).\nThrough the door VIP, all the ladies come with me (Come with me, yeah).\nWant a drink?\nCome on in everybody its on me.\nShowing love, everybody showing me love.\n\nYoung Joc:\nShe ask me how the air up there, you can catch me in the tree-top.\nThis right here is a classic like a pair of Reebok.\nSwitching four lanes in the old school T top.\nDoing the h chop chop chopping up the street tops.\nHit the club on fire but anything the beat drop.\nYou hit the juice box wet make the pussy beat box.\n\nShe on my handstand and I love the way she p pop.\nShe can tell I'm a g she can tell I'm a g she can tell I'm a g she can tell I'm a g and the g man and g cold I touch the g spot.\nAnd do the g fold.\nA hundred dollar bill that's the cino.\nYou got a ten though, that's a g though.\nI check the time ice blocks on my g shot.\nYou know who it is, slim and young jeezock.\n\nI'm so fly, so fly, I'm so, feels like I'm taking off I'm so high, so high.\nDon't mean nothing, looking for a shorty to break me off.\nCan't nobody tell me nothing, so fly, peace up a town top down calling young jock till you know it's going down, so fly, feels like I'm taking off I'm so high, looking for a shorty to break me off peace up a town top down calling young jock till you know it's going down."}