{"song_id":23908,"song_name":"Get Up","artist_id":431969,"display_artist":"50 Cent","spotify_id":"4lyphUu7lt4KKuf8jZKjjh","lyrics":"Man I'm gonna do my thing,\nIt's crazy in the club when I'm in there, man\nTrust me homie, I'm not playin'\nThe dance floor of the chain I say (Get Up!)\n\nI came to bring you that California Love\nIn the middle of New York,\nHaters all of the above.\nI'm not playin' I said I'm off the chain\nYou niggers better follow instructions, I say (Get up!)\n\nI ball till I fall\nI stunt till I drop\nI'm off the showroom floor,\nNot the used car lot.\n\nYou buy a bottle,\nI but the bar.\nI make any other week feel like Mardi Gras.\n\nWhen I get into, I get into it\nEverybody can't do it the way I do it\n\nI make it rain, then the sun comes out.\nA nigger playin' then the guns come out, now\n\nMy question is who they goin' to blame\nWhen I' back number one on that billboard again.\nShit chip now The Game don't change.\nSince Mike made Triller and Prince made Purple Rain.\n\nI guess I make they kids want slangin,\nThen N.W.A. made the West Coast bangin'\nNah, It's just music\nMan it's just music\nNow get your ass on the dance floor and move it\n\nI have the savoir-faire\nI'm the reason everybody here I say (Get Up!)\nI make it hot I make it hot in here\nYour feet hurting I really don't care\nI say (Get up!)\nI wanna see, I wanna see you move\nAnd get on a little groove\nI said (Get up!)\nI'm getting money man I really don't care\nNow lemme see you put your hands in the air I say (Get Up!)\n\nYou look good, I want to get to know you better\nYou look good in them jeans and them red stilletos\nYou got a Bentley Coup booty baby I wanna drive\nSee I tell you what your mileage is just when I'm inside\nI wanna take you for a spin, you know round and round\nSwitch gears until your love come down\nI take you to the point of no return,\nIf you listen you learn,\nJust how a nigger earn\nI got money to burn.\nWhile The Game ban bitched\nShe dropped the bomb on me\nShe suck it down and up and down, gracefully\n\nRick James would have said she a brick house\nBut 50 you should go ahead and see what that bitch bout'.\nI found out she like hard I like it huh\nBack it up and get you some\nI know how to get you sprung\nTune you up\nPierce your tongue\nUnder the hood it's so good\nShe said so good god damn I'm so good\nNigga what up?\n\nI have the savoir-faire\nI'm the reason everybody here I say (Get Up!)\nI make it hot I make it hot in here\nYour feet hurting I really don't care\nI say (Get up!)\nI wanna see, I wanna see you move\nAnd get on a little groove\nI said (Get up!)\nI'm getting money man I really don't care\nNow lemme see you put your hands in the air I say (Get Up!)\n\nAnd get into it\nYou now rock the building you know that\nI said (Get Up!)\nAnd get into it\nImma show you just how we do it\nI said (Get Up!)\nAftermath, still Shady aftermath\nI said (Get Up!)\nAftermath, still Shady aftermath"}