{"song_id":23918,"song_name":"Pop Champagne","artist_id":"null","display_artist":"Jim Jones & Ron Browz Featuring Juelz Santana","spotify_id":"6ZULTiMcrmGeuj6GilRgod","lyrics":"Ether boy! Hey!\n\nHow we ball in the club I know you hate it\nMami dancin on the floor all like she naked\nWhen she lay down with you I know she fake it\nAll the girls give it to me I ain't gotta take it\nOh! Pop champagne!\nOh! Pop champagne!\nOh! We pop champagne!\nOh! We pop champagne!\n\nWe need more bottles tell ma hurry up\nTell 'em Ron Browz here hottest in America\nGimme sixteen bars and you know I tear it up\nKnow it's me when you see this fur in your area\nAnd she call me all night cause you can get it up\nOn my neck on my wrist everything is litted up\nDrinkin' bottles of that Clique till I spit it up\nOnly get one life so you gotta live it up\n(HEY!) If you in the things I'm in\nShorty we can be friends, shorty we can be friends\nRight now, I wanna see you dance, see you dance\nI wanna see you dance, see you dance\nI wanna see you dance, see you dance\nI wanna see you dance, see you dance\n\nWhen I go to the dealer you know I cop that (What's that?)\nBrand new 'rarri and the roof drop back (The 60)\nCame through Harlem like the Rooftop back (AIYYO!)\nMoney in the bank man you know don't stop that (Stop that stop that stop that!)\n(*Oh!) Now we tryin' to get up in the club\n(*Oh!) Try to tell me no 'cause I'm rollin' with the thugs\n(We got money bitch!) Until I flash a couple of dollars (Yep!)\nTell 'em we only want tables and we buyin out the bottles\n(*Oh!) Y'all know the order\nTell 'em ten Rose's and a few cold waters (Right!)\nOnly Petron and a couple of lemons (Let's go)\nTen thousand dollars stuffed up in the denims (What else)\nWe standin on couches, a couple of women (Hey baby)\nWe was ballin hard it was just the ninth inning (Early)\nHe told shorty we could be friends (Yep)\nAnd your friends could meet with my friends (What else)\nAnd we could do this on the weekend or on the weekday\nWe could do this on the freeway and get in the freak way\nSHIT! We could get in on three way (Oh)\nBlackberry two way, souped up cars on the thruway (Yep)\nWe superstars no Lupe, we could do this like a duet\nBut y'all be the singers on the mic, wait let me dim the lights\nThis was in the car while I was stoppin' at the light\n\nHow we ball in the club I know you hate it\nMami dancin on the floor all like she naked\nWhen she lay down with you I know she fake it\nAll the girls give it to me I ain't gotta take it\nOh! Pop champagne!\nOh! Pop champagne!\nOh! We pop champagne!\nOh! We pop champagne!\n\nBaby I wanna see you work (Go) See you dance (Go)\nWithout no shirt, without those pants\nPop champagne ain't a damn thing change\nSpray it in the air make it champagne rain\nBuckets of ice keep the champagne cool\nMami got a body see that damn thing move\nIt's no sex in the champagne room\nSays who? Baby I'll break all rules\nBring it here and I'll break off you\nShe see me in V.I.P. and wanna break on through\nWhen she with you she lyin' but she fake it\nWhen she with me she like it she never fake it\n\nI wanna see you dance, see you dance\nI wanna see you dance, see you dance\nI wanna see you dance, see you dance\nI wanna see you dance, see you dance\n\nHow we ball in the club I know you hate it\nMami dancin on the floor all like she naked\nWhen she lay down with you I know she fake it\nAll the girls give it to me I ain't gotta take it\nOh! Pop champagne!\nOh! Pop champagne!\nOh! We pop champagne!\nOh! We pop champagne!"}