{"song_id":23940,"song_name":"My President","artist_id":431677,"display_artist":"Young Jeezy Featuring Nas","spotify_id":"4Onlx3t98YDeu8bM7wRS5K","lyrics":"Yeah, be the realest shit I never wrote\nI ain't write this by the way nigga, some real shit right here nigga\nThis'll be the realest shit you ever quote\nLet's go!\n\n(Chorus: Young Jeezy)\nMy president is black, my Lambo's blue\nAnd I'll be goddamned if my rims ain't too\nMy momma ain't at home, and daddy's still in jail\nTryna make a plate, anybody seen the scale?\nMy president is black, my Lambo's blue\nAnd I'll be goddamned if my rims ain't too\nMy money's light green and my Jordans light grey\nAnd they love to see white, now how much you tryna pay?\nLet's go!\n\n(Verse 1: Young Jeezy)\nToday was a good day, hope I have me a great night\nI don't know what you fishin for but catch you a great white\nMe, I see great white, heavy as killer whales\nI cannot believe this, who knew it came in bails\nWho knew what came with jail, who knew what came with prison\nJust cause you got opinions, does that make you a politician?\nBush robbed all of us, would that make him a criminal?\nAnd then he cheated in Florida, would that make him a seminal?\nI say and I quote, \"We need a miracle\"\nAnd I say a miracle cause this shit is hysterical\nBy my nephews and nieces, I will email Jesus\nTell him forward to Moses and CC Allah\nMr. Soul Survivor, guess that make me a Konvict\nBe all you be, now don't that sound like some dumb shit\nWhen you die over crude oil as black as my nigga Boo\nIt's really a Desert Storm, that's word to my nigga Clue\nCatch me in Las Vegas, A.R. Arizona\nRep for them real niggas, I'm winnin' in California\nWinnin' in Tennessee, hands down Atlanta\nLandslide Alabama, on my way to Sevana\n\n(Verse 2: Young Jeezy)\nI said I woke up this morning, headache this big\nPay all these damn bills, feed all these damn kids\nBuy all these school shoes, buy all these school clothes\nFor some strange reason my son addicted to Polos\nLove me some spinach dip, I'm addicted to Houston's\nAnd if the numbers is right I take a trip out to Houston\nAn earthquake out in China, a hurricane in New Orleans\nStreet Dreams Tour, I showed my ass in New Orleans\nDid it for Soulja Slim, brought out B.G.\nIt's all love Bun, I'm forgivin you Pimp C\nYou know how the Pimp be, that nigga gon' speak his mind\nIf he could speak down from heaven he'd tell me stay on my grind\nTell him I'm doin' fine, Obama for mankind\nWe ready for damn change so y'all let the man shine\nStuntin on Martin Luther, feelin' just like a king\nGuess this is what he meant when he said that he had a dream\n\n(Verse 3: Nas)\nYeah, our history, black history, no president ever did shit for me\nHad to hit the streets, had to flip some keys so a nigga won't go broke\nThen they put us in jail, now a nigga can't go vote\nSo I spend doe, all these hoes is trippin'\nShe a ain't a politician, honey's a polotician\nMy president is black, rolls golden charms\nTwenty-two inch rims like Hulk Hogan's arms\nWhen thousands of peoples is riled up to see you\nThat can arouse ya ego, we got mouths to feed so\nGotta stay true to who you are and where you came from\nCause at the top will be the same place you hang from\nNo matter how big you can ever be\nFor whatever fee or publicity, never lose your integrity\nFor years there's been surprise horses in this stable\nJust two albums in, I'm the realest nigga on this label\nMr. Black President, yo Obama for real\nThey gotta put your face on the five-thousand dollar bill\n\n(Outro: Young Jeezy)\nSo I'm sittin' right here now man\nIt's June 3rd haha, 2:08 AM\nNigga I won't say win, lose or draw\nMan we congratulate you already homie\nSee I motivate the thugs right\nYou motivate us homie, that's what it is\nThis a hands on policy, y'all touchin me right nigga\nYeah, first black president, win, lose or draw nigga\nHaha, matter of fact, you know what it is man\nShouts out to Jackie Robinson, Booker T, Washington homie\nOh you ain't think I knew that shit?\nSydney portea what dey do?\nHaha, my president is black\nI'm important too though, my Lambo's blue\nI was, I was the first nigga to ride through my hood in a Lamborghini yeah haha"}