{"song_id":23983,"song_name":"Just Like Me","artist_id":304140,"display_artist":"Jamie Foxx Featuring T.I.","spotify_id":"6Gm1DPTZmMEB8U1db5oVyh","lyrics":"Say Foxx? (Yeah) I had I had a chick man (Yeah)\nShe went and did me real wrong, I mean (Yeah)\nI did the same thing to her but she ain't have no right to do\nMe like that though dog, for real (Yeah)\n\nYou, been seeing him, and I know\nAnd I was with her, and you knew about it\nBut I was too blind to see it baby\nAnd you was out here doing the same thing as me\nI wanna ask, has he been by the crib?\nHas he been in our, car? And did you let him, drive?\n'Cause she's been by the house, she's been in the car\nI've even let her push the Porsche around a couple times\n\nOh, we were so the same\nI don't know why I can't see it baby\nAnd it ain't a point to feeling blue\nYou're just like me and I'm just like you\n\nYou're just like me\nShorty all up in the club popping bottles of that Bud\nGiving all them dudes hugs and you just like me\nShe don't know how to act on the floor backing it back\nMan I can't be mad she just like me,\nShe just like me, she just like me, she just like me\n\nNow it ain't so easy for me to imagining what you been doing baby\nSo I don't even have to ask (No)\n'Cause you ain't the only one that keeping secrets baby\nSo really, no sense in me playing back\nAnd I, can't stay up though 'cause I did you wrong\nAnd I was on some bullshit when I let that nigga bring her home\nShe's out from us just like me and she played the game like one of my homies\n\nOh, we were so the same\nI don't know why I can't see it baby\nAnd it ain't a point to feeling blue\nYou're just like me and I'm just like you\n\nYou're just like me\nShorty all up in the club popping bottles of that Bud\nGiving all them dudes hugs and you just like me\nShe don't know how to act on the floor backing it back\nMan I can't be mad she just like me,\nGettin' money having fun man, she just like me,\nIn the club throwin' ones she just like me,\nTwenty fours on the Range she just like me, go on shawty do ya thang\n\nHey! Shawty who you fooling? You\nKnow I'm way too cool for you\nTo run that game when we play me\nTrying to do me like I be doing you\nSay you heard I was screwing her\nJust like I hear he doing you\nWhy you worry about me doing me I see you doing you\nI can make her better though\nYou goin' let him ruin you\nJust for the record know, I wouldn't have her\nUnless I could have the two of you\nI know why he pursuing you that booty do be moving boo\nLate night, straight pipe that ain't nothing new to you\nWait a minute can't tell me wanna tell me something tell me this\nIf I would of never would of hit that chick\nWould you even ever know that dude existed? No\nGot me twisted yo ass goodbye I've kissed it\nNow you all on his dick, shawty look at this dick\n\nYou're just like me\nShorty all up in the club popping bottles of that Bud\nGiving all them dudes hugs and you just like me\nShe don't know how to act on the floor backing it back\nMan I can't be mad she just like me,\nShe just like me, she just like me, she just like me"}