{"song_id":24004,"song_name":"Crack A Bottle","artist_id":"null","display_artist":"Eminem, Dr. Dre & 50 Cent","spotify_id":"null","lyrics":"Eminem\nOh!\nLadies and gentlemen\nThe moment you've all been waiting for...\nIn this corner: weighing 175 pounds,\nWith a record of 17 rapes, 400 assaults and 4 murders\nThe undisputed, most diabolical villain in the world:\nSlim Shady!\n\nSo crack a bottle, let your body waddle\nDon't act like a snobby model, you just hit the lotto\nUh-oh, uh-oh, bitches hoppin' in my Tahoe\nGot one riding shotgun and no not one of them got clothes\n\nNow where's the rubbers? Who's got the rubbers?\nI noticed there's so many of them and there's really not that many of us\nAnd ladies love us, my posse's kicking up dust\nIt's on till the break of dawn and we're starting this party from dusk\n\nOk! Let's go!\n\nBack with Andre the Giant, Mr. Elephant Tusk\nFix your musk, you'll be just another one bit the dust\nJust one of my mother's sons who got thrown under the bus\nKiss my butt, lick frumunda cheese from under my nuts\n\nIt disgusts me to see the game the way that it looks\nIt's a must, I redeem my name and haters get mushed\nBitches lust, man they love me when I lay in the cut\nFist the cup, the lady give her eighty some paper cut\n\nNow picture us, it's ridiculous, you curse at the thought\n'Cause when I spit the verse the shit gets worse than Worcestershire sauce\nIf I could fit the words as picture perfect, works every time\nEvery verse, every line, as simple as nursery rhymes\n\nIt's elementary, the elephants have entered the room\nI venture to say with the center of attention, \"It's true\"\nNot to mention back with a vengeance so here's the signal\nOf the bat symbol, the platinum trio's back on you hoes\n\nSo crack a bottle, let your body waddle\nDon't act like a snobby model, you just hit the lotto\nUh-oh, uh-oh, bitches hoppin' in my Tahoe\nGot one riding shotgun and no not one of 'em got clothes\n\nNow where's the rubbers? Who's got the rubbers?\nI noticed there's so many of them and there's really not that many of us\nAnd ladies love us, my posse's kicking up dust\nIt's on till the break of dawn and we're starting this party from dusk\n\nLadies and gentlemen... Dr. Dre!\n\nDr. Dre\nThey see that low rider go by, they like, \"Oh, my!\"\nYou ain't got to tell me why you're sick 'cause I know why\nI dip through in that six tre like, \"Sick 'em, Dre\"\nI'm an itch that they can't scratch, they're sick of me\n\nBut hey, what else can I say? I love L.A.\n'Cause over and above all, it's just another day\nAnd this one begins where the last one ends\nPick up where we left off and get smashed again\n\nI'll be damned, just fucked around and crashed my Benz\nDriving 'round with a smashed front end, let's cash that one in\nGrab another one from out the stable\nThe Monte Carlo, El Camino or the El Dorado\n\nThe hell if I know, do I want leather seats or vinyl?\nDecisions, decisions, garage looks like precision collision\nOr maico, beats quake like Waco\nJust keep the bass low speakers away from your face though\n\nEminem\nSo crack a bottle, let your body waddle\nDon't act like a snobby model, you just hit the lotto\nUh-oh, uh-oh, bitches hoppin' in my Tahoe\nGot one riding shotgun and no not one of them got clothes\n\nNow where's the rubbers? Who's got the rubbers?\nI noticed there's so many of them and there's really not that many of us\nAnd ladies love us, my posse's kicking up dust\nIt's on till the break of dawn and we're starting this party from dusk\n\nAnd I take great pleasure in introducing... 50 Cent!\n\n50 Cent\nIt's bottle after bottle\nThe money ain't a thang when you party with me\nIt's what we into, it's simple\nWe ball out of control like you wouldn't believe\n\nI'm the napalm, the bomb, the Don, I'm King Kong\nGet rolled on, wrapped up and reigned on\nI'm so calm through Vietnam, ring the alarm\nBring the Chandon, burn marajaun do what you want\n\nNigga on and on till the break of what?\nGet the paper man I'm caking you know I don't give a fuck\nI spend it like it don't mean nothing\nBlow it like it's supposed to be blown, Mafucker, I'm grown\n\nI stunt, I style, I flash the shit\nI gets what the fuck I want, so what? I trick\nFat ass, burgundy bags, classy shit\nJimmy Choo shoes, I say, \"Move a-bitch, move\"\n\nEminem\nSo crack a bottle, let your body waddle\nDon't act like a snobby model, you just hit the lotto\nUh-oh, uh-oh, bitches hoppin' in my Tahoe\nGot one riding shotgun and no not one of them got clothes\n\nNow where's the rubbers? Who's got the rubbers?\nI noticed there's so many of them and there's really not that many of us\nAnd ladies love us, my posse's kicking up dust\nIt's on till the break of dawn and we're starting this party from dusk"}