{"song_id":24023,"song_name":"Ain't I","artist_id":431720,"display_artist":"Yung L.A. Featuring Young Dro & T.I.","spotify_id":"6cnufgF6qLJGZT2PRFZBr1","lyrics":"Yung L.A.\nYa got to know the boy futuristic ay\nMy work can make the j's do the jumpman can't it?\nYou got to know this the remix right here\nGrand hustle baby it's the kings right here\nYou got to know we gwappin' pockets extra sloppy\nDon't I love my vegetables extra cheese and broccoli\nDon't Yung LA like to kick it like karate\nDon't I be with j-money servin' everbody\nAin't we up in magic city throwin' up the broccoli\nAin't me and tip takin' off like a rocket\nAin't my ain't my ain't my ain't my ain't my money long\nAin't I ain't I ain't I ain't I still puttin' on\n\nAin't I (x7)\nAin't I smokin' strong,\nAin't I puttin' on, ain't I rockin' yays, ain't my money long\nAin't I (x7)\nAin't I in the ville, ain't I on the hill, ain't I on a pill, ain't I ain't I real\n\nYoung Dro\nOk my rims so big I'm at the tip top ain't I\nChoppers in the trunk will make you do the macarena\nCool to the flo yeah mothafucka ain't I\nAll black coupe I can buy it bitch can't I\nRemix Yung L.A. and T.I. this a banga\nDro you on that thang you don't hear me trick ain't I\nBig roll royces ain't I got 'em nauseous\nWe be in ferraris the cars wit the horses\nAin't I on a pill ridin' down Bentley\nIced 30 below minus the wind chill\nAin't I packing chrome\nAin't I blowin' strong\nAin't I ain't I ain't I ain' got it goin' on\nYoung Droooo\n\nT.I.\nRalph Lauren Purple label\nAin't I fresh as I can be\nMade it through my situation\nAin't I blessed as I can be\nAin't I laughin' at these haters tryna take a shot at me\nThey don't know which way to go I make it easy follow me\nHonestly ain't I insane I think that's the way I gotta be\nAin't I so so supafly boy ain't nobody hot as me\nAin't T.I. all on TV when he wake up and go to sleep\nEverywhere they notice me ay for yourself just go and see\nMy community I'm servin' though they hope I don't succeed\nHear me speak and so intrigued (ain't he snitchin) no indeed\nYou come in with that common folk yo show I have to commandeer\nSince I see you can't take ova I'll just have to volunteer\nAin't I you superior listen here brah you not up here\nI'm so zone 1 tip it ain't funny twice the G that I appear\nRep bankhead so loud and clear\nGon be gone for 'bout a year\nSo paper trail you gotta hear\nBut ain't that ain't I outta here ay"}