{"song_id":24100,"song_name":"Jump","artist_id":302239,"display_artist":"Flo Rida Featuring Nelly Furtado","spotify_id":"4uGucgzv0ydi35DgAlsTQ4","lyrics":"(Intro )\nNa Na Na Na Na Na Na Na Na Na Na Na (x4)\n\n(Chorus )\nWhen I say jump, you say how high\nI ain't never seen nobody, how they get so high\nLike a bird, like a plane, this party got me insane\nThis party got me insane, so jump jump jump jump\n\n(Verse 1 )\nNow I'm gon take it to the roof\nEverybody with me got they own parachute\nYou ain't scared of heights when you sippin on Goose\nParty all night like I'm flyin jet new?\nYou ain't never seen nobody get this loose\nShawty actin' naughty with her body, what it do\nJump to this man, bump to this man\nStomp to this man, crunk to this man\nGot another hit man\nHold up, I wanna go up, don't wanna throw up\nMy clique pour up, and every bad chick know us\nDance, the boy got us all feelin' high\nAsk, the shawty, I'm a astronaut\nHigh rollin' baby like I'm jumpin' on fire\nSuper Bowl pimp good Year on tire\nCan I be a bird, I gotta be fly\nButterfly and spur, and I got a couple words\n\n(Chorus )\nX2\n\n(Verse 2 )\nWhen I run up in the club, jump in, then I gotta be there\nCheck it out, shawty like Nike Air\nUp up and away take it off like mere?\nNBA ballin, I don't care\nNow what do you do when you see you a shawty and she make it bounce in the room?\nHey girl, come on baby, you a fine sexy lady, can I get on your hot air balloon?\nSky high, still clubbin like I'm part of the mile high\nEars poppin', Bubbalicious help me get right\nKeep poppin' in position after midnight\nMoese? fried chicken up in NY\nJigga what, don't it feel good\nHouston? We gonna jump ship, all aboard\nCome around me, and we'll parlay, we're throwed?\nCali is jumpin', hit the switch on the 6 4\n\n\n(Chorus )\n\n(Break down) \nCome on and jump, jump, jump (x3)\n get down, get down, get down\n get down, get down, get down\n jump, jump, jump, jump, jump, jump\n(All the fellas, the ladies, the fellas, the ladies, let me see you)\n\n(Chorus )\nX2\n\n(Break down)\nGet down, get down, get down\nGet down, get down, get down\n\n(Outro )\nNa Na Na Na Na Na Na Na Na Na Na Na (x4)"}