{"song_id":24108,"song_name":"Where I'm From","artist_id":304256,"display_artist":"Jason Michael Carroll","spotify_id":"2ktagyRc8FSLX4yB5tr3TU","lyrics":"On a three hour flight from Memphis to L.A.\nI was silently celebrating my first-class upgrade\nLaughing at my jeans and my boots\nBeside those high dollar shoes and Armani suits\n\nWhen the gentleman next to me said the drinks up here are free\nSo if you'd like the first one can be on me\nHe said I'm heading back from business in New York and Rome\nTell me son, where do you call home?\n\nI said I'm from the front pew of a wooden white church\nA court house clock that still don't work\nWhere a man's word means everything\nWhere moms and dads were high school flames\nGave their children grandmothers' maiden name\nYes it may not sound like much\nBut that's where I'm from\n\nSo we drank that round and then another\nThere wasn't a topic in this world we did not cover\nHe said I headed out west when I was barley nineteen\nJust a kid, chasing my dreams\n\nAnd I said I'm flying out here to pick up my big brother\nHe's been fighting the cancer they discovered\nBut he called last night and said I think this is the end\nSo come take me home to my family an my friends\n\nWhere the quarterback dates the homecoming queen\nThe trucks are ford and the tractors green\nAnd amazing grace is what we'd sing\nWhere there's a county fair every fall\nAnd your friends are there no matter when you call\nYeah it may not sound like much\nBut it's where I'm from\n\nAnd as we stood to claim the bags we checked\nHe said I'll pray for your bother and did I mention\nThat Italian suits haven't always been my style?\nSee I was the quarterback of my high school team\nWe took state back in '63\nAnd my wife well she still my home coming queen\n\n'Cause I'm from the front pew of a wooden white church\nA court house clock that still don't work\nWhere a man's word means everything\nWhere moms and dads were high school flames\nGave their children grandmothers' maiden name\nYes it may not sound like much\nI said it may not sound like much\nBut it's where I'm from\nIt's where I'm from\nIt's where I'm from"}