{"song_id":24120,"song_name":"Maybach Music 2","artist_id":365033,"display_artist":"Rick Ross Featuring Kanye West, T-Pain, Lil' Wayne","spotify_id":"null","lyrics":"Realist shit I ever wrote, chillin' in my Maybach\nWhatever I send out, homie, I'ma make back\nCan you believe that? Woah you gotta see it\n\nI don't plan on goin' broke, put that on my Maybach\n'Cause I'm in it to win now, niggas, can't take that\nListen to my Maybach music, to my Maybach music\n\nMartin Luetta King. Jr, startin'\nAll that stuntin' is gonna ruin ya\nB I was a lie, he probably had a two tone\nWith the gray poupon, anything yay poupon\n\nWe'll explode 'cause I'm am the shit\nAnd this is my commode, uh, oh, there they go\n\nTalkin' about how ya, boy, clothes extra tight\nI just remember that my limelight extra bright\nI hit the strip club and girls get extra hype\nYou hit the strip club and girls turn extra dyke\n\nWe know who not gettin' no sex tonight\nAnd a lap dance will probably be a blessing right\nSo all the shit you talking dead, coffin, light the weed coughin'\nNew crib loughtin'\n\nWhere it's at, Austin? Where's that, Texas?\nWhat's in front, Benzes? What else, Lexus?\nWell, who's Maybach is this, Mr. Westses\n\nRealist shit I ever wrote, chillin' in my Maybach\nWhatever I send out, homie, I'ma make back\nCan you believe that? Woah, you gotta see it\n\nI don't plan on goin' broke, put that on my Maybach\n'Cause I'm in it to win now, niggas, can't take that\nListen to my Maybach music, to my Maybach music\n\nBoss, Kush, my light controlium, grim mean custodians\nShades or no shades, these made erotium\nUse to be the oldsmo, hoes call it oh lo\nNow I got so many horses bitches call me polo\n\n5762, tell me how ya wanna move\nYeah, you know I got them both\nBeat your ass black and blue\n\nI was barely gettin' pretty women\nNow I scoop Emmy winners like kitty litter\nAny winter, Fendi denim like a slender, nigga\nLookin' in the mirror, I can see the real contender\n\nSellin' reefer even Gregory, I'm on my dinner\nSo what the fuck is ya tellin' me other than your gender?\nI'm a boss and I'm ridin' like a small fault\nNiggas, make your wheels and ride till they fall off\nYeah, Ross\n\nRealist shit I ever wrote, chillin' in my Maybach\nWhatever I send out, homie, I'ma make back\nCan you believe that? Woah, you gotta see it\n\nI don't plan on goin' broke, put that on my Maybach\n'Cause I'm in it to win now, niggas, can't take that\nListen to my Maybach music, to my Maybach music\n\nWell, alright\nAll black Maybach, I'm sittin' in the asshole\nClassy as a mother still gutta like a bad bowl\nBenjamin Franklin, no X in the cash row\nThat's right, the mills do like damn close\n\nI eat ya mill too, we don't feel you\nAnd we be strappin' up like the navy seal do\nSweet as banana split, every time I peel through\nFresher than Will Smith and uncle Phil too\n\nWatchin' TV in the Maybach, in traffic\nI'm on my feet like tough actin' tinactin'\nI'm run in this shit, you should try tacklin'\nLil Wayne in one word immaculin'\n\nYou see the Big, you see the Jay\nThe Tupac in him, the Kurt Cobain\nThe Andre three stacks and then I'm back to doin' shit\nLike I do say Maybach music\n\nRealist shit I ever wrote, chillin' in my Maybach\nWhatever I send out, homie, I'ma make back\nCan you believe that? Woah, you gotta see it\n\nI don't plan on goin' broke, put that on my Maybach\n'Cause I'm in it to win now, niggas, can't take that\nListen to my Maybach music, to my Maybach music"}