{"song_id":24172,"song_name":"Walkin' On The Moon","artist_id":419475,"display_artist":"The-Dream Featuring Kanye West","spotify_id":"4oAKz3UL48jTkjFPbnoTnz","lyrics":"Hello \nHello, is there anybody up here?\n(Hello) Welcome 2085!\nTwenty Eighty-five it is (just me up here I guess)\n(Oh! ) The magic of the moon done snuck up on me\nAnd caught me by surprise (Oh! )\nRoamin and I'm lonely man I'm longin\nFor that somethin' in your eyes (Oh! )\n\nAnd I know it's not just the song\n(And I know it's not just the song)\nAnd I know it's not just the drink\n(And I know it's not the drink)\nBut whatever it might be (Whatever it might be)\nJust keep holdin' on to me\n(Ooh!) 'Cause I'll pull down a cloud for you\nI'll circle the stars and bring you one back\nI'll walk through the sun for you\nCause there's somethin' you do\nThat got me walkin' on the moon\n(Uh) There's something you do\nThat got me walkin' on the moon\n(Uh) And I know that it's true baby\nYou got me walkin' on the moon\n\nGirl don't keep me waitin, I'm impatient\nHit my runway, and let's take off and fly\nNow I'm where I wanna be, come co-pilot with me\nLet's burn up the sky (Ooh)\n\nAnd I know it's not just the song\n(And I know it's not just the song)\nAnd I know it's not just the drink\n(And I know it's not the drink)\nBut whatever it might be (Whatever it might be)\nJust keep holdin' on to me\n(Ooh!) 'Cause I'll pull down a cloud for you\n(Pull a cloud for you)\nI'll circle the stars and bring you one back\nI'll walk through the sun for you\nCause there's somethin' you do\n(There's something you do)\nThat got me walkin' on the moon\n(Uh) There's something you do\nThat got me walkin' on the moon (Oh!) (UHH! )\nAnd I know that it's true\nBaby, you got me walkin' on the moon\n\nEveryone out there will know that you are my girl\nAnd my love will go in circles around the world\n(Ay, ay dream I'm too good at this)\nNo matter what I do\nUh, uh, uh, I can't contain it\nNo, no, no I can't restrain it\nThere's a lot of stars in here ain't it\nBut you shine so much they don't seem famous\nWhere'd you come from on this lonely night?\nI swear god musta made lightnin strike\nAnd I bottled it up, we hit the red carpet and modeled it up\nWe hopped in the rari and Pradaed it up\nNow everybody clappin, they bravoed it up\nAll just because it's more than a buzz\nMore than a drink, but I took a few sips\nAnd let it do what it does, now drunk textin\nLike it's all about you, like I can't spend\nAnother minute without you\nYou know the drinks let you say things\nYou ain't allowed to, things interfere\nBut you're way to proud to say out loud\nCause niggaz gonna clown you, put your black baby down\nPeople is around you, I'll put my mag baby down\nI ain't tryin' to hound you, just tryin' to take you\nWhere the stars gonna surround you\n\nAnd Uhmm, maybe ice down you,\nAnd Uhmm, maybe wipe down you\nAnd Uhmm, maybe we should talk about all this\nAfter I pound you, you know I'm just playin' with you,\nI know a lot of people mad 'cause they ain't with you\nWait is it because we on the moon,\nTell 'em say that hey well be home soon\n(Uh were walkin' on the moon)\n\nUh, there's something you do,\nThat got me walkin' on the moon\nUh, and I know that it's true,\nBaby, you got me walkin' on the moon\nEveryone out there will know that you are my girl."}