{"song_id":24267,"song_name":"Number One","artist_id":277270,"display_artist":"R. Kelly Featuring Keri Hilson","spotify_id":"3ESxS1yCFwtYMSjE01hwMS","lyrics":"N-N-Number one, sex that we're having here girl (Ooh)\nThis is number one, sex that we're having here girl (Ooh)\n\nGirl I know you've been waiting for me, yeah yeah yeah.\nAnd I know you been feening for me, yeah yeah yeah.\nBut you ain't gotta wait no more girl I'm coming over.\nJust leave the back door open and ooh ooh girl I'm hoping it's tight.\n'Cause what I'm about to do to you tonight.\nOoh girl, what I'm about to do to you gonna make your toes curl.\nI know you ain't have it before girl but this is number one.\n\nN-N-Number one, sex that we're having here girl (Ooh)\nThis is number one, sex that we're having here girl (Ooh)\nN-N-Number one, sex that we're having here girl (Ooh)\nThis is number one, sex that we're having here girl (Ooh)\n\nThis ain't nothing girl that you ever had in your life.\nThem other lames you been with ain't even ch-ch-chip the ice.\n'Cause what I got up in these draws, you be like Kelly he the boss.\nHe the man, oh my god, he's the pussy champion.\nBabygirl I hope you ready 'cause I'm about to put it down.\nBabygirl show your experience 'cause I'm about to show you mine's.\nLet's do the kamasutros, crouching tiger.\nGirl its raining but I hope it's fire.\n'Cause what I'm about to do to you will make your girls want it.\nI'll be having you screaming 'You the best', now you know it's number one.\n\nN-N-Number one, sex that we're having here girl (Ooh)\nThis is number one, sex that we're having here girl (Ooh)\nN-N-Number one, sex that we're having here girl (Ooh)\nThis is number one, sex that we're having here girl (Ooh)\n\nNow babygirl, I don't want you think this ain't about you.\nCause this right here, right now is about you and only you.\nCan this be love, cause girl you're making me feel.\nSo take my hand, girl I'll be your man.\nGirl it's number one.\n\nN-N-Number one, sex that we're having here girl (Ooh)\nThis is number one, sex that we're having here girl (Ooh)\nN-N-Number one, sex that we're having here girl (Ooh)\nThis is number one, sex that we're having here girl (Ooh)"}