{"song_id":24286,"song_name":"I'm Going In","artist_id":301284,"display_artist":"Drake Featuring Lil Wayne & Young Jeezy","spotify_id":"null","lyrics":"Lil' Wayne:\nYeah\nUh-Huh\nUmmmm Uh-huh\nHello Motherfucker hey hi how you dering?\nIt's Weezy F Baby come to take a shit and urine\nOn these toilet bowl bitches\nPussy ass niggas\nStompin' on this beat like a motherfucking sigma\nBad to the brisle, hat to the rizzle\nI'm so official all I need is a whistle\nBitch named Crystal, let her suck my pistol\nShe opened up her mouth and I blew her brains out\nYou ain't met a nigga like me, you probably never will\nRiders rolling with me like 11 wheels\nFind out where you livin', kill you in the kitchen\nThe Feds trying to clip us\nBut we ain't even tripping\n\nLil' Wayne:\nI'm goin' in\nI'm goin' in\nI'm goin' in\nI'm goin' in\nAnd I'ma go hard\nAnd I'ma go hard\nAnd I'ma go hard\nAnd I'ma go hard\nBitch I'm goin' in\nBitch I'm goin' in\nBitch I'm goin' in\nBitch I'm goin' in\nAnd I'ma go hard\nAnd I'ma go hard\nAnd I'ma go hard\nAnd I'ma go hard\n\nDrake:\nFirst off you know what it is if you heard Drake\nMaking hoes wobble like a bridge in a earthquake\nNever see me out 'cause I live in my workplace\nI get you the business so button up your shirt straight\nLook at where I landed, you would think I planned it\nI'm just doing me and you could never understand it\nChicks get hammered, big dick bandit\nMoney flowing like a slit wrist no bandage\nBlowin' purple clouds, nigga I'm so sky high\n\nI ain't cuttin' anybody slices out of my pie\nOut of this world though, I'm so Sci-Fi\nAnd I don't sit still I keep it movin' like a drive-by\nI just tell the truth so I'm cool in every hood spot\n21 years and I ain't never met a good cop\nMe and Wayne lean like Kareem doin' hookshots\nCover me I'm going in and fuck it when the hook drops\n\nLil' Wayne:\nI'm goin' in\nI'm goin' in\nI'm goin' in\nI'm goin' in\nAnd I'ma go hard\nAnd I'ma go hard\nAnd I'ma go hard\nAnd I'ma go hard\nBitch I'm goin' in\nBitch I'm goin' in\nBitch I'm goin' in\nBitch I'm goin' in\nAnd I'ma go hard\nAnd I'ma go hard\nAnd I'ma go hard\nAnd I'ma go hard\n\nTruth:\nTruth feelin' like freshman who already\nWho already need a letter man, late night with ya girl?\nFuck a boy she spendin' out one more with a better man\nNo my money strech like I got rubber bands?\nNah, ain't gunna loose a bone in me baby\nNumber one to the top with a rocket like Grady\nBitch call me Truth others call her Old Lady\nBarbra car her name she's a pussy you crazy?\nYeah I'm back next swing call me Tiger Woods\nFresh center Hollywood, young still in hood\nNever left the hood\n\nLil' Wayne:\nI'm goin' in\nI'm goin' in\nI'm goin' in\nI'm goin' in\nAnd I'ma go hard\nAnd I'ma go hard\nAnd I'ma go hard\nAnd I'ma go hard\nBitch I'm goin' in\nBitch I'm goin' in\nBitch I'm goin' in\nBitch I'm goin' in\nAnd I'ma go hard\nAnd I'ma go hard\nAnd I'ma go hard\nAnd I'ma go hard"}