{"song_id":24450,"song_name":"Baby","artist_id":305459,"display_artist":"Justin Bieber Featuring Ludacris","spotify_id":"6epn3r7S14KUqlReYr77hA","lyrics":"Justin Bieber\nOh whoa\nOh whoa\nOh whoa\n\nYou know you love me, I know you care\nJust shout whenever, and I'll be there\nYou are my love, you are my heart\nAnd we would never ever ever be apart\n\nAre we an item? Girl, quit playing\nWe're just friends, what are you saying?\nSay there's another and look right in my eyes\nMy first love broke my heart for the first time\nAnd I was like...\n\nBaby, baby, baby ooh\nLike baby, baby, baby no\nLike baby, baby, baby ooh\nI thought you'd always be mine (mine)\n\nBaby, baby, baby ooh\nLike baby, baby, baby no\nLike baby, baby, baby ooh\nI thought you'd always be mine (mine)\n\nOh, for you I would have done whatever\nAnd I just can't believe we ain't together\nAnd I wanna play it cool, but I'm losin' you\nI'll buy you anything, I'll buy you any ring\nAnd I'm in pieces, baby fix me\nAnd just shake me 'til you wake me from this bad dream\nI'm going down, down, down, down\nAnd I just can't believe my first love won't be around\n\nAnd I'm like\nBaby, baby, baby ooh\nLike baby, baby, baby no\nLike baby, baby, baby ooh\nI thought you'd always be mine (mine)\n\nBaby, baby, baby ooh\nLike baby, baby, baby no\nLike baby, baby, baby ooh\nI thought you'd always be mine (mine)\n\nLudacris\nLuda! When I was 13, I had my first love\nThere was nobody that compared to my baby\nAnd nobody came between us or could ever come above\nShe had me going crazy, oh, I was star-struck\nShe woke me up daily, don't need no Starbucks\nShe made my heart pound, it skipped a beat when I see her in the street and\nAt school on the playground but I really wanna see her on the weekend\nShe knows she got me dazing cause she was so amazing\nAnd now my heart is breaking but I just keep on saying...\n\nJustin Bieber\nBaby, baby, baby ooh\nLike baby, baby, baby no\nLike baby, baby, baby ooh\nI thought you'd always be mine (mine)\n\nBaby, baby, baby ooh\nLike baby, baby, baby no\nLike baby, baby, baby ooh\nI thought you'd always be mine (mine)\n\nI'm gone (yeah yeah yeah, yeah yeah yeah)\nNow I'm all gone (yeah yeah yeah, yeah yeah yeah)\nNow I'm all gone (yeah yeah yeah, yeah yeah yeah)\nNow I'm all gone (gone, gone, gone...)\nI'm gone"}