{"song_id":24514,"song_name":"Make A Wave","artist_id":301010,"display_artist":"Disney's Friends For Change","spotify_id":"null","lyrics":"JOE: They say the beat of a butterflies wings\nCan set off a storm a world away.\nDEMI: What if they're right if the smallest of things\nCan power the strongest hurricane?\nJOE: What if it all begins inside\nDEMI: Behold the key that turns the tide.\n\n\nBOTH: Just a pebble in the water\nDEMI: Oh\nDEMI: Can set the sea in motion\nJOE: Oh\nBOTH: A simple act of kindness\nDEMI: Oh\nJOE: Can stir the widest ocean\nBOTH: If we show a little love\nJOE: A little love\nJOE: Heaven knows what we could change\nOh yeah\nBOTH: So throw a pebble in the water\nJOE: Oh yeah\nBOTH: And make a wave\nDEMI: Make a wave.\nJOE: Make a wave, make a wave.\n\nDEMI: The single choice to take a stand\nJOE: You touch your hand to someone in need\nHold somebody\nDEMI: Don't pull yourself and say you can't\nJOE: You never know what can grow for just one sea\nDEMI: Yeah\nDEMI: So come with me and seize the day\nBOTH: This world may never be the same.\n\nBOTH: Just a pebble in the water\nDEMI: Just a pebble in the water\nBOTH: Can set the sea in motion\nJOE: Can set the sea in motion\nBOTH: A simple act of kindness\nDEMI: Oh\nBOTH: Can stir the widest ocean\nJOE: Can stir the widest\nDEMI: Ocean\nBOTH: If we show a little love\nJOE: If we show a little love\nBOTH: Heaven knows what we could change\nDEMI: Heaven knows what we could change\nBOTH: Throw a pebble in the water\nJOE: Throw a pebble in the water\nBOTH: Make a wave\nDEMI: Make a wave\nJOE: Make a wave\nDEMI: Yeah\nYeah\nYeah\nYeah\nJOE: Make a wave, make a wave\nDEMI: Make a wave, yeah\nJOE: Show a little love and make a wave, seize the day, yeah.\nDEMI: Make a wave\nJOE: Make a wave\nDEMI: Heaven knows what we can change\nJOE: Oh\nDEMI: Just show a little love\nYou never know what we could change\nJOE: Just throw a pebble in the water\nDEMI: Mmmmmm\nBOTH: Make a wave, make a wave.\nJOE: Oh\nDEMI: Oh"}