{"song_id":24530,"song_name":"Billionaire","artist_id":430380,"display_artist":"Travie McCoy Featuring Bruno Mars","spotify_id":"2M9ULmQwTaTGmAdXaXpfz5","lyrics":"Bruno Mars\nI wanna be a billionaire so fuckin' bad\nBuy all of the things I never had\nI wanna be on the cover of Forbes magazine\nSmiling next to Oprah and the Queen\n\nOh every time I close my eyes\nI see my name in shining lights, yeah\nA different city every night\nOh, I, I swear the world better prepare\nFor when I'm a billionaire\n\nTravie McCoy\nYeah, I would have a show like Oprah, I would be the host of\nEveryday Christmas, give Travie a wish list\nI'd probably pull an Angelina and Brad Pitt\nAnd adopt a bunch of babies that ain't never had shit\n\nGive away a few Mercedes like, \"Here lady, have this\"\nAnd last, but not, least grant somebody their last wish\nIt's been a couple months that I've been single, so\nYou can call me Travie Claus, minus the ho ho\n\nGet it, I'd probably visit where Katrina hit\nAnd damn sure do a lot more than FEMA did\nYeah, can't forget about me, stupid\nEverywhere I go I'ma have my own theme music\n\nBruno Mars\nOh, every time I close my eyes\nWhat you see? What you see, bro?\nI see my name in shining lights, oh yeah\nUh-huh, uh-huh, and what else?\nA different city every night\nYeah, yeah, yeah\nOh, I, I swear the world better prepare\nFor what?\nFor when I'm a billionaire\nOh ooh oh ooh\nFor when I'm a billionaire\nOh ooh oh ooh\n\nTravie McCoy\nI'll be playing basketball with the President, dunkin' on his delegates\nThen I'll compliment him on his political etiquette\nToss a couple milli in the air just for the heck of it\nBut keep the fives, twentys, tens and Bens completely separate\n\nAnd yeah, I'll be in a whole new tax bracket\nWe in recession, but let me take a crack at it\nI'll probably take whatever's left and just split it up\nSo everybody that I love can have a couple bucks\n\nAnd not a single tummy around me would know what hungry was\nEating good, sleeping soundly\nI know we all have a similar dream\nGo in your pocket pull out your wallet, put it in the air and sing\n\nBruno Mars\nI wanna be a billionaire so fuckin' bad\nSo bad\nBuy all of the things I never had\nBuy everything\nUh, I wanna be on the cover of Forbes magazine\nSmiling next to Oprah and the Queen\nWhat up, Oprah! Ha ha\n\nOh, every time I close my eyes\nWhat you see? What you see, bro?\nI see my name in shining lights, oh yeah\nUh-huh, uh-huh, and what else?\nA different city every night\nYeah, yeah, yeah\nOh, I, I swear the world better prepare\nFor what?\nFor when I'm a billionaire\nOh ooh oh ooh\nFor when I'm a billionaire\nOh ooh oh ooh\n\nI wanna be a billionaire so fuckin' bad"}