{"song_id":24643,"song_name":"9 AM In Dallas","artist_id":301284,"display_artist":"Drake","spotify_id":"null","lyrics":"These are my 1 St. Thomas flows, me, my niggas, and some Madonna ho's\nThat look just like virgins but trust they down to go, yeah\nDiscussin' life and all our common goals\nSmart kids that smoke weed, honor roll\n\nLook how the champagne diamonds flow\nFine dining, pour another glass when the wine is low\n\nI'm in the crib stackin' money from here to the ceilin'\nWhatever it is I got is clearly appealin'\nThese other rappers gettin' that inferior feelin'\nI hope you feel it in your soul, spiritual healin'\n\nTake a look at yourself the mirror's revealin'\nIf you ain't got it you ain't got it, the theory is brilliant\n\nPeople ask how music is goin', I heard it pays\nI just came off makin' two million in thirty days\nDamn, I guess it does is what the message was\nSometimes I feel I be spendin' my money just because\n\nBut Weezy I'm just out here reppin' us\n'Til I get to shake the hand of the man that's blessing us\n\nYeah, I know these niggas miss the mean lyrics\nKush got the room smellin' like teen spirit\nI asked kindly if no one out here would bring their feet up\nUntil I lose, for now I'm the game's single leader\n\nI fly private so no one tells me to bring my seat up\nAnd book a suite where me and your favorite singer meet up\n\nWho you like, tell me who it is\nI'mma make sure that that woman is the next one on my list\nI should call it a night, but fuck it, I can't resist\nThis one is for all the niggas from my city tryin' to diss\n\nWithout a response from me you really fail to exist\nAnd I love to see you fail that feelin' there is the shit\n\nI swear, ah, pussy nigga get your bread up\nEnjoy the seat that the stewardess just forced yo' ass to let up\nWhy yo' scary ass lookin' down? Pick ya head up\nNo one told you your disguise is the most ridiculous get-up\n\nWith nose plugs in now, I can smell a setup\nSo you're just wastin' your time, you only makin' me better\n\nYeah, I try to tell 'em don't judge me because you heard stuff\nChasin' cash, that's my brother from the surf club\nDamn, that nigga always kept it so hood\nBack when we would smoke good at the Oakwoods\n\nAnd have girls fall through like coins in a couch\nNow we just fuckin' all the bitches they warned us about\n\nScared for the first time everything just clicked\nWhat if I don't really do the numbers they predict?\nConsiderin' the fact that I'm the one that they just picked\nTo write a chapter in history, this shit has got me sick\n\nBut if I really do it don't expect to get a split\n'Cause this truly is some shit I don't expect for you all to get\n\nI'm nervous but I'mma kill it 'cause they about to let the realest team in\nThrowin' up in the huddle nigga, Willie Beamen\nBut still throwin' touchdown passes\nIn tortoise frame glasses hopin' that someone catch it\n\nPeople say that old Drake, we started to miss it\nBut they need to be a little more specific\n\nMan is this what y'all want?\nIn my best Chris Tucker impression\nDuckin' your questions, fuck your suggestions\nMoney gets all of my love and affection\n\nCars, all black like the cover of Essence\nI'm allergic to comin' in second, but I never sneeze, Y.M.O.E. nigga, yeah\n\nUh, uh, yeah, that's what y'all want?\nOctober's Very Own, Young Money, ATF\nThank Me Later in this bitch, what's up?\nFree Weezy in this bitch, what's up?\nJune 15th in this bitch what's up?\nNoel, that's it"}