{"song_id":24714,"song_name":"Right Above It","artist_id":307264,"display_artist":"Lil Wayne Featuring Drake","spotify_id":"1kMuU3TNQvHbqvXCWBodmP","lyrics":"Lil Wayne\nNow tell me how you love it\nYou know you at the top when only heaven's right above it\nWe onnnn\n'Cause we onnnn\n\nDrake\nWho else really tryna fuck with Hollywood Cole? I'm with Marley G, bro\nFlying Hollygrove chicks to my Hollywood shows\nAnd I wanna tell you something that you prolly should know\nThis that Slumdog Millionaire Bollywood flow\nAnd uh, my real friends never hearin' from me\nFake friends write the wrong answers on the mirror for me\nThat's why I pick and choose, I don't get shit confused\nI got a small circle, I'm not with different crews\nWe walk the same path, but got on different shoes\nLive in the same building, but we got different views\nI got a couple cars I never get to use\nDon't like my women single, I like my chicks in twos\nAnd these days all the girls is down to roll\nI hit the strip club and all them bitches find a pole\nPlus I been sippin', so this shit is movin' kinda slow\nJust tell my girl to tell her friend that it's time to go\n\nLil Wayne\nNow tell me how you love it\nYou know you at the top when only heaven's right above it\nWe on\nIt's Young Money, motherfucker\nIf you ain't runnin' wit it, run from it, motherfucker, all right\n\nNow somebody show some money in this bitch\nAnd I got my bees with me like some honey in this bitch, ya dig?\nI got my gun in my boo purse\nAnd I don't bust back, because I shoot first\n\nMeet me on the fresh train\nYes, I'm in the building, you just on the list of guest names\nAnd all of my riders do not give a fuck, X Games\nGuns turn you boys into pussies, sex change\nAnd I smoke till I got chest pains\nAnd you niggas know I rep my gang like Jesse James\nWomen are possessive, and they wanna possess Wayne\nI been fly so long I fell asleep on the fuckin' plane\nSkinny pants and some Vans\nCall me Triple A, get my advance in advance, amen\nAs the world spin and dance in my hands\nLife is a beach, I'm just playin' in the sand\nUh, wake up and smell the pussy\nYou niggas can't see me, but never overlook me\nI'm on the paper trail, it ain't no tellin' where it took me\nYeah, and I ain't a killa, but don't push me\n\nNow tell me how you love it\nYou know you at the top when only heaven's right above it\nWe on\nIt's Young Money, motherfucker\nIf you ain't runnin' wit it, run from it, motherfucker, all right\n\nNow somebody show some money in this bitch\nAnd I got my bees with me like some honey in this bitch, ya dig?\nI got my gun in my boo purse\nAnd I don't bust back, because I shoot first\n\nUh, how do he say what's never said?\nBeautiful black woman, I bet that bitch look better red\nLimpin' off tour 'cause I made more off my second leg\nMa'fuckin' Birdman Junior, eleventh grade\nBall on automatic start\nI could hand it to Drake or do a quarterback draw\nWildcat offense, check the paw prints\nWe in the building, you niggas in apartments\nNo-now, c'mon, be my blood donor\nFlo' so nice, you ain't gotta put a rug on her\nDo it big, and let the small fall under that\nDamn, where you stumbled out? From where they make gumbo at\nKane got the fuckin' beat jumpin' like a jumping jack\nBut you know me, I get on this bitch and have a heart attack\nHip-hop, I'm the heart of that, nigga, nothin' short of that\nPresident Carter, Young Money Democrat\n\nNow tell me how you love it\nYou know you at the top when only heaven's right above it\nWe on\nIt's Young Money, motherfucker\nIf you ain't runnin' wit it, run from it, motherfucker, all right\n\nNow somebody show some money in this bitch\nAnd I got my bees with me like some honey in this bitch, ya dig? (So Woo!)\nI got my gun in my boo purse\nAnd I don't bust back, because I shoot first"}