{"song_id":24746,"song_name":"Turn On The Radio","artist_id":364741,"display_artist":"Reba","spotify_id":"6A2hvKTF2FShj0Yma7CP8N","lyrics":"(Oh oh)\n(Oh oh oh)\n\nNo good, two timin', lies comin' outta your mouth\nCheatin', mistreatin' games that you play brought you down\nBroke my heart, tore it apart, look who's got the last laugh now\nDon't you come crawlin' back, begging please on your knees, baby if you're missin' me\n\nWell, you can hear me on the radio (radio)\nYou wanna turn me on, turn on your stereo (stereo)\nYou can sing along, while they're playin' our song. How you done me wrong\nBaby crank it up (crank it up)\nUntil you blow the speakers out your Chevy truck (Chevy truck)\nSo listen Romeo, when you're feelin' kinda lone, let me tell you where to go\nTurn on the radio\n\n(Oh oh)\n(Oh oh oh)\n\nTry to call, twitter me, text until your fingers bleed\nOh, the DJ's the only way you*re ever gonna hear from me\nIf you're reminiscing, and you're missin' me this much, and you really wanna stay in touch\n\nWell, you can hear me on the radio (radio)\nYou wanna turn me on, turn on your stereo (stereo)\nYou can sing along, while they're playin' our song. How you done me wrong\nBaby crank it up (crank it up)\nUntil you blow the speakers out your Chevy truck (Chevy truck)\nSo listen Romeo, when you're feelin' kinda lone, let me tell you where to go\nTurn on the radio\n\n(Turn on the radio)\nWhoa!\nTurn on the radio (Turn on the radio, oh)\nTurn on the radio\nOh, oh, oh, oh\nOh, oh, oh\n\nOh, you can hear me on the radio\nYou wanna turn me on, turn on your stereo\nYou can sing along, while they're playin' my song. How you done me wrong...\nBaby crank it up (crank it up)\nUntil you blow the speakers out your Chevy truck (Chevy truck)\nSo listen Romeo, when you're feelin' kinda lone, let me tell you where to go\nWhen you're feelin' kinda lone, let me tell you where to go\nTurn on the radio\n\nTurn on the radio\nTurn on the radio\nTurn on, Turn on the radio (Turn on the radio, Turn on the radio)\nTurn on the radio (Turn on the radio, oh, oh)\nTurn on the radio, oh oh oh oh oh oh\nTurn on the radio"}