{"song_id":24991,"song_name":"Boom","artist_id":279664,"display_artist":"Snoop Dogg Featuring T-Pain","spotify_id":"7eT08OfoEfetiXGDiYT6uD","lyrics":"(Snoop)\nYeah... Top Dogg... uh...\nGet your money whip your hair\nExecutive branch blowin' smoke like a player\nYeah in the club, yes it cracks\nCute little mama, but they stacked with bags.\nI'm smokin' Grape Purple Urkel\nYou in Doggie world come and join my circle\nI break down herbal till I move like a turtle\nMy money is green and my Porsche is turbo\n(Boom!)\nIn hot pursuit, come rock with Snoop\nBaby's a lawyer, her body's the truth.\n\nI'm in the game for real, it pays to chill\nI walk in the club and they front the bill\nI'm the Big Dogg, best beware\nYou comin' with me, if you stop, they'll stare\nShould be on my team, in my car\nOn the way to the spot, Yes you are\nToastin' up, postin' up\nAnd when we done, we West Coastin' love.\nFo' shendo blowin' endo,\nHow much for the Dogg in the window?\nUh.\n\nOh. what?\n(Boom!)\n(Boom!)\nSay what? say what?\n(Boom!)\n\nTalk to 'em T-pain\n\n(T-pain)\nBaby I'm a Dogg! (I'm a Dogg!), beware! (beware!)\nI do whatever, however I want! (I want!)\nIt's both of y'all (both of y'all), oh yeah! (oh yeah!)\nNow put your hands in the air and whip your hair and go\nLa la la la la\nBoom shakalaka when I drop all my apples, sayin'\nLa la la la la\nOne-hitta quitta (quitta) Shawty know that I ain't playin'\n\n(Snoop)\n(Boom!)\nI'm all about the money, the money I got\nOn the VIP tip, Maserati's in the lot.\nChillin' with the stars where the bottles never stop\nGot a model on my lap, Baby show me what you got\n(Boom!)\nWith a cup of Landy, Tiffany and Sandy\nGirls who like girls, wanna do it to Daddy\nReal talk, the suites is next\nOne more drink gonna lead to sex\nThese girls is bad, the floor is packed\nThey shut the door down when they reach the max.\nWhatchoo tryin' to drink? Clear or yak\nShe got a apple bottom, homie, all I do is mack\nI does it well your game is whack\nI gets to the bidness, no chitchat\nNow where do we go? I beats the gush\n\nShe in love with the gangster, that's what's up\n\nThat's what's up. (Boom!)\nThat's what's up. (Boom!)\nThat's what's up. (Boom!)\n\nSpit to 'em T-pain\n\n(T-pain)\nBaby I'm a Dogg! (I'm a Dogg!), beware! (beware!)\nI do whatever, however I want! (I want!)\nIt's both of y'all (both of y'all), oh yeah! (oh yeah!)\nNow put your hands in the air and whip your hair and go\nLa la la la la\nBoom shakalaka when I drop all my apples, sayin'\nLa la la la la\nOne-hitta quitta (quitta) Shawty know that I ain't playin'\n\n(Snoop)\nBoom shakalaka here comes the chief rocka\nSmoke good with T-pain, and Snoop, the weed doctor\nBig 808 now feel the bass in ya chakra\nAnd watch me smoke like a shotta\nCoke bottle shape light green eyes\nDrunk off of love like a colt 45\nI keep kush in my lungs\nI'mma smoke till I die\nJust bust a bad one from my homie D-Dimes\n(Boom!)\nThey do it for fortune, some for fame\nI've got five different strains,\nYou ever taste Purple Rain?\nTurn up the volume, adjust the gain\nAin't a damn thing changed, still a G-Thang\nLil Momma whip you hair, exhale the chronic\nAs the smoke disappears, I'm ready to ball\nYour girl on my team, is she ready to fall\nAnd if you didn't know, I'm the big Snoop Dogg.\n\n(Boom!)\nSay what? say what?\n(Boom!)\nI don't think they heard me\n(Boom!)\n\nTalk to 'em T-pain\n\n(T-pain)\nBaby I'm a Dogg! (I'm a Dogg!), beware! (beware!)\nI do whatever, however I want! (I want!)\nIt's both of y'all (both of y'all), oh yeah! (oh yeah!)\nNow put your hands in the air and whip your hair and go\nLa la la la la\nBoom shakalaka when I drop all my apples, sayin'\nLa la la la la\nOne-hitta quitta (quitta) Shawty know that I ain't playin'\n\nBoom! Boom!"}