{"song_id":25065,"song_name":"I'm Into You","artist_id":304444,"display_artist":"Jennifer Lopez Featuring Lil Wayne","spotify_id":"2gSuyFyy1khVIwTc7tJ0hN","lyrics":"AHEM!\nHi, I'm Tune.\nThe man on the moon.\nI live on the beach.\n\nGet the sand out your shoes.\nAnd all of that changed since I met you.\nSo we could leave that old shit in the restroom.\nYoung Money!\n\nYou got me and I could not defend it.\nI tried, but I had to surrender.\nYour star got me under the spellbound.\nLeft me no other choice, but to get down.\n\nIt's too late. (Lil Wayne: It's too late.) It's too late. (It's too late.)\nIt's too late. (Uh!) It's too late. (Tell 'em.)\nYou got it. (You got it.) You got it. (You got it.)\nYou got it. (You got it.) You got it. (Uh!)\n\nWhen I look into your eyes, it's over.\nYou got me hooked with your love controller. (Lil Wayne: Yeah!)\nI'm tripping and I could not get over.\nI feel lucky like a four-leaf clover.\n\n'Cause I'm into you. I'm into you.\nI'm into you. Yeah! (C'mon!)\nI'm into you. (I'm into you.) I'm into you. (I'm into you.)\nI'm into you. Yeah! (Uh!)\n\nListen. Now I'm strong. Baby, I bring the fire on.\nSharp shooter. You can call me the zion.\nI'm not the one easy to get to,\nBut all that changed, baby, when I met you.\n\nIt's too late. (Lil Wayne: It's too late.) It's too late. (It's too late.)\nIt's too late. (It's too late.) It's too late. (C'mon.)\nYou got it. (You got it.) You got it. (You got it.)\nYou got it. (You got it.) You got it. (Yeah!)\n\nWhen I look into your eyes, it's over.\nYou got me hooked with your love controller.\nI'm tripping and I could not get over.\nI feel lucky like a four-leaf clover. (Lil Wayne: Why?!)\n\n'Cause I'm into you. (I'm into you.)\nI'm into you. (I'm into you.) I'm into you. Yeah!\nI'm into you. (I'm into you.) I'm into you.\nI'm into you. Yeah!\n\nOkay. Now I'm into you like you never knew.\nI'm falling for you, baby. I need a parachute.\nSo wet, I need a wet suit.\nYou're way too fly, I could be your jet fuel.\n\nNow tell me what you like. I like what you tell me.\nAnd if you understand me, then you can overwhelm me.\nIt's too late. It's too late.\nEvery finish line is the beginning of a new race. HA!\n\nWhen I look into your eyes, (When I look into your eyes!) it's over.\nYou got me hooked (Baby!) with your love controller. (I know!)\nI'm tripping and I could not get over.\nI feel lucky like a four-leaf clover. (Lil Wayne: C'mon.)\n\n'Cause I'm into you. (Jennifer Lopez: I'm into you!) I'm into you. (I'm into you!) I'm into you. (I'm into you, baby! Yeah!) Yeah!\nI'm into you. (I'm into you!) I'm into you. (I'm into you!)\nI'm into you. Yeah! (Lil Wayne: Yeah!)\n\n'Cause I'm into you. (Jennifer Lopez: I'm into you!)\nI'm into you. (I'm into you!) I'm into you. (I'm into you!)\nYeah! (Baby! Yeah!) I'm into you. (I'm into you!)\nI'm into you. (I'm into you!) I'm into you. Yeah!"}