{"song_id":25080,"song_name":"Jack Sparrow","artist_id":418536,"display_artist":"The Lonely Island Featuring Michael Bolton","spotify_id":"3qOMYMHbtqNFhfRjXUBzow","lyrics":"Here we go\nLonely Island\nMichael Bolton (Yeah)\nThe night starts now\nTogether on the track\nThe boys are back\nThe night starts now\nNight starts now, baby roll with us\nChicks snappin' at the neck when we rollin' up (Rollin' up)\nCold flat doors ain't no holdin' up\nBlack card hit the bar like I gives a fuck\n\nFlash in the eye when we walk into the se\nFuck the fellas looking jealous, pay the back and get wet\nThree pound at my waist, shank in my sock\nYou either get cut, get stuffed or get shot\n\nThis is the tale of Captain Jack Sparrow\nPirate so brave, on the seven seas (What?)\nA mystical quest to the Isle of Tortuga\nRaven locks sway on the ocean's breeze\n\nYeah, that was kinda weird but we back in the club\nBuying up the bar so the groupies show us love (Keira Knightley)\nMotherfuckin' iceman, I'm the top gunner\nHeater on blast, I'm the number one stunner (Jack Sparrow)\n\nWatch your girl, 'cause I ain't your Mr. Nice Guy\nMore like the meet ya, take ya home and fuck ya twice guy (Yeah, yeah)\nAll dressed up with nowhere to run\nI know I'll make ya feel crazy with the horn (Now back to the good part)\n\nFrom the day he was born, (Ugh) he yearned for adventure (No) \nOld Captain Jack, (Yeah) givin' them what for\nHe's the pauper of the surf, the jester of Tortuga\nBut in Davy Jones' locker, what lies in store?\n(Yeah, we've seen the movie)\n\nPut your hands in the air and say hell yeah, c'mon\nCaptain Jack (What?)\nJohnny Depp (No)\n\nFrom the front to the back, say we count stacks, c'mon\nDavy Jones (Nope)\nGiant squid (Wrong)\n\nMichael Bolton, we're really gonna need you to focus up\nRoger that, lemme try it with another film (Wait)\nLife is a box of chocolates, and my name is Forrest Gump (Not better)\nThough I'm not the sharpest tool in the shed, I give Jenny all my love (Come on!)\nOkay then, I'm a legal aide, Erin Brockovich is my name (Oh god)\nThen you can call me Scarface, snorting mountains of cocaine (Close enough)\n\nYou cockroaches wanna play rough? Okay! I'm reloaded!\n\nThis is the tale, of Tony Montana (This is the tale)\nCubano flame, with Miami nuts (Take it home)\nGot a basehead wife, her womb is polluted\nThis whole town's a pussy, just waiting to get fucked (Just waitin' to get fucked)\n\nOkay, turns out Michael Bolton is a major cinephile\nYou complete me\nYeah, yeah, okay"}