{"song_id":25101,"song_name":"For Good","artist_id":"null","display_artist":"Glee Cast","spotify_id":"46tWMyBS0MbH8p4EHIJK3O","lyrics":"Rachel\nI'm limited\nJust look at me\nI'm limited\nAnd just look at you:\nYou can do all I couldn't do\nGlinda\nSo now it's up to you\nFor both of us\nNow it's up to you...\n\nKurt\nI've heard it said that people come into our lives for a reason\nBringing something we must learn\nAnd we are led to those who help us most to grow\nIf we let them and we help them in return\nWell, I don't know if I believe that's true\nBut I know I'm who I am today because I knew you\n\nLike a comet pulled from orbit as it passes a sun\nLike a stream that meets a boulder halfway through the wood\nWho can say if I've been changed for the better?\nBecause I knew you, I have been changed for good\n\nRachel\nIt well may be that we will never meet again\nIn this lifetime, so let me say before we part\nSo much of me is made from what I learned from you\nYou'll be with me like a handprint on my heart\nAnd now whatever way our stories end\nI know you have rewritten mine by being my friend...\n\nLike a ship blown from its mooring by a wind off the sea\nLike a seed dropped by a skybird in a distant wood\nWho can say if I've been changed for the better?\nBut because I knew you\nKurt\nBecause I knew you\nBoth\nI have been changed for good\n\nRachel\nAnd just to clear the air, I ask forgiveness\nFor the thing I've done you blame me for\nKurt\nBut then, I guess we know there's blame to share\nBoth\nAnd none of it seems to matter anymore\n\nKurt\nLike a comet pulled from orbit as it passes a sun\nRachel\nLike a ship blown from its mooring by a wind off the sea\nKurt\nLike a stream that meets a boulder halfway through the wood\nRachel\nLike a seed dropped by a bird in the wood\n\nBoth\nWho can say if I've been changed for the better?\nI do believe I have been changed for the better\nKurt\nAnd because I knew you...\nRachel\nBecause I knew you...\nBoth\nBecause I knew you...\nI have been changed for good"}