{"song_id":25135,"song_name":"Stereo Hearts","artist_id":303282,"display_artist":"Gym Class Heroes Featuring Adam Levine","spotify_id":"0qOnSQQF0yzuPWsXrQ9paz","lyrics":"My heart's a stereo\nIt beats for you, so listen close\nHear my thoughts in every no-o-ote\n\nMake me your radio (yeah, a-ha)\nAnd turn me up when you feel low (turn it up a little bit)\nThis melody was meant for you (uh... like that)\nSo sing along to my stereo\n(Gym Class Heroes baby!)\n\nIf I was just another dusty record on the shelf\nWould you blow me off and play me like everybody else?\nIf I ask you to scratch my back, could you manage that?\nLike get Rihanna, chicka, Travie, I can handle that\n\nFurthermore, I apologize for any skipping tracks\nIt's just the last girl that played me left a couple cracks\nI used to, used to, used to, used to, now I'm over that\n'Cause holding grudges over love is ancient artifacts\n\nIf I could only find a note to make you understand\nI'd sing it softly in your ear and grab you by the hand\nKeep me stuck inside your head, like your favorite tune\nAnd know my heart is a stereo that only plays for you\nHeh heh heh\n\nMy heart's a stereo\nIt beats for you, so listen close\nHear my thoughts in every no-o-ote (Yeah, yeah, yeah, come on)\n\nMake me your radio (Uh huh)\nAnd turn me up when you feel low (Turn it up)\nThis melody was meant for you\nSo sing along to my stereo\n\nOh oh oh oh, oh oh oh, to my stereo\nOh oh oh oh, so sing along to my stereo (Let's go)\n\nIf I was an old school fifty-pound boombox ('member them?)\nWould you hold me on your shoulder wherever you walk?\nWould you turn my volume up in front of the cops? (turn it up)\nAnd crank it higher every time they told you to stop?\n\nAnd all I ask is that you don't get mad at me\nWhen you have to purchase mad D batteries\nAppreciate every mixtape your friends make\nYou never know, we come and go like on the interstate\n\nI think finally found a note to make you understand\nIf you can hear this, sing along and take me by the hands\nKeep me stuck inside your head, like your favorite tune\nAnd know my heart is a stereo that only plays for you\n\nMy heart's a stereo\nIt beats for you, so listen close\nHear my thoughts in every note\nO-oh\n\nMake me your radio\nAnd turn me up when you feel low\nThis melody was meant for you\nSo sing along to my stereo\n\nOh oh oh oh oh oh oh, to my stereo\nOh oh oh oh, so sing along to my stereo\n\nI only pray you'll never leave me behind (never leave me)\nBecause good music can be so hard to find (so hard to find)\nI'll take your hand and hold it closer to mine (yeah)\nThought love was dead, but now you're changing my mind (yeah, yeah c'mon!)\n\nMy heart's a stereo\nIt beats for you, so listen close\nHear my thoughts in every no-o-ote (oh, oh)\n\nMake me your radio\nAnd turn me up when you feel low\nThis melody was meant for you\nSo sing along to my stereo\n\nOh oh oh oh oh oh oh, to my stereo\nOh oh oh oh, so sing along to my stereo\n\nIt's ya boy Travie\nGym Class Heroes, baby!\n\nSo sing along to my stereo\n\nYeah!"}