{"song_id":25178,"song_name":"Otis","artist_id":"null","display_artist":"Jay-Z & Kanye West Featuring Otis Redding","spotify_id":"6aGNg25mRJdqd318f9X6Wn","lyrics":"Otis Redding and Jay-Z:\nIt makes it easier, easier to bear\nYou won't regret it, no, no, no\nSome girls, they don't forget it\nLove is their whole happiness\nSquee-squee-squee-squeeze her (Sounds so soulful, don't you agree? Ow)\nDon't tease her, never leave her\n\nJay-Z:\nI invented swag\nPoppin' bottles, putting supermodels in the cab\nProof\nI guess I got my swagger back, truth\nNew watch alert, Hublots\nOr the big face Rollie, I got two of those\nArm out the window through the city, I maneuver slow\nCock back, snap back, see my cut through the holes\n\nKanye West:\nDamn Yeezy and Hov, where the hell ya been?\nNiggas talking real reckless, stuntmen\nI adopted these niggas, Phillip Drummond them\nNow I'm about to make them tuck their whole summer in\nThey say I'm crazy, but I'm about to go dumb again\nThey ain't seen me 'cause I pulled up in my other Benz\nLast week I was in my other other Benz\nThrow your diamonds up 'cause we in this bitch another 'gain\n\nJay-Z:\nPhotoshoot fresh, looking like wealth\nI'm 'bout to call the paparazzi on myself\nUh, live from the Mercer\nRun up on Yeezy the wrong way, I might murk ya\nFlee in the G450 I might surface\nPolitical refugee, asylum can be purchased\nUh, everything's for sale\nGot five passports, I'm never going to jail\n\nKanye West:\nI made Jesus Walks, I'm never going to Hell\nCouture level flow is never going on sale\nLuxury rap, the Hermes of verses\nSophisticated ignorance, write my curses in cursive\nI get it custom, you a customer\nYou ain't accustomed to going through customs, you ain't been nowhere, huh?\nAnd all the ladies in the house got them showing off\nI'm done, I'll hit you up ma&#xF1;ana\n\nJay-Z:\nWelcome to Havana\nSmoking Cubanas with Castro in cabanas\nViva M&#xE9;xico, Cubano\nDominicano, all the plugs that I know\nDriving Benzes with no benefits\nNot bad, huh, for some immigrants?\nBuild your fences, we digging tunnels\nCan't you see we gettin' money up under you?\n\nKanye West and Jay-Z:\nCan't you see the private jets flying over you?\nMaybach bumper sticker reads, \"What would Hova do?\"\nJay is chillin' (Uh), Ye is chillin' (Uh)\nWhat more can I say? We killing 'em\nHold up before we end this campaign\nAs you can see we done bodied the damn lames\nLord please let them accept the things they can't change\nAnd pray that all of their pain be champagne\n\nOtis Redding:\nSqueeze her, don't tease her, never leave her\nSqueeze her, don't tease her, never leave her\nSqueeze her, don't tease her, never leave her"}