{"song_id":25209,"song_name":"Mrs. Right","artist_id":"null","display_artist":"Mindless Behavior Featuring Diggy","spotify_id":"1rEbJTF9w3Kb6y44h3zba6","lyrics":"Where... is Mrs. Right ... I gotta find ... her\n\nWhere is Mrs. Right I gotta see her, travel all across the world just to meet her\nGet me on a flight I gotta see her, travel all across the world just to meet her\nTravel to L.A. and maybe to the Bay, come to Chi-Town, she might be out of state,\nBook a flight to London, book a flight to France, can we go to Switzerland, can we hit Japan\n\nShawty say ya don't but I bet you do, MB on your ringtone, posters in your room, sassy little thing, like like the way you talk, heard you got the goods go ahead show them off, take a picture quick, send it to my phone, dimple in your cheek, white gucci stunnas on, don't know where you've been hiding from me so long, Prodigy, Roc, RayRay and Princton we on so baby come on\n\nWhere is Mrs. Right I gotta see her, travel all across the world just to meet her\nGet me on a flight I gotta see her, travel all across the world just to meet her\nTravel to L.A. and maybe to the Bay, come to Chi-Town, she might be out of state,\nBook a flight to London, book a flight to France, can we go to Switzerland, can we hit Japan\n\nHoppin on a plane, coming straight to ya, in Tokyo we say Konichiwa, is off the wall, London in the spring, Paris in the fall, we don't discriminate girls no we love 'em all my German chicks, let me kiss ya back, open up your Mac Book, put me on your lap, stay sending smiley faces on the chat, met some good girls, yeah they're all over the map, but where she at, where she at\n\nWhere is Mrs. Right I gotta see her, travel all across the world just to meet her\nGet me on a flight I gotta see her, travel all across the world just to meet her\nTravel to L.A. and maybe to the Bay, come to Chi-Town, she might be out of state,\nBook a flight to London, book a flight to France, can we go to Switzerland, can we hit Japan\n\nFlying so high, so high,\nDestination anywhere,\nGotta find a way to get to where you are, you are\n\n(Roc Royal Rap)\nPitch black waves swagger on A.M., P.M.,\nLife saver watch wardrobe European,\nLAX curbside escalade we in,\nSee something you like hit me up on a DM,\nI hit ya back (hit ya back)\nYou need a ride tell me where you at (where you at)\nI'm tryin' to see your pretty face waiting on me backstage,\nBig game hard enough to knock you over make you fall (for me)\n\nWhere is mrs.right I gotta see her, travel all across the world just to meet her\nGet me on a flight I gotta see her, travel all across the world just to meet her\nTravel to L.A. and maybe to the Bay, come to Chi-Town, she might be out of state,\nBook a flight to London, book a flight to France, can we go to Switzerland, can we hit Japan"}