{"song_id":25210,"song_name":"She Will","artist_id":307264,"display_artist":"Lil Wayne Featuring Drake","spotify_id":"08N3wNB4s9maD4EvaLmSd5","lyrics":"(Verse 1: Lil Wayne)\nI tell her \"Now gon' pop that pussy for a real nigga.\"\nI already know that life is deep, but I still dig her\nNiggas is jealous, but really I could care less\nI'm in hell's kitchen with an apron and a hairnet\n\nDevil on my shoulder, the Lord is my witness\nSo on my Libra scale, I'm weighing sins and forgiveness\nWhat goes around comes around like a hoola hoop\nKarma is a bitch? Well just make sure that bitch is beautiful\n\nLife on the edge, I'm dangling my feet\nI tried to pay attention but attention paid me\nHaters can't see me: nose-bleed seats\nAnd today I went shopping and talk is still cheap\n\nI rock to the beat of my drum set\nI been at the top for a while and I ain't jump yet\nBut I'm, Ray Charles to the bullshit\nNow jump up on that dick and do a full split!\n\n(Hook: Drake)\nShe just started to pop it for a nigga and looked back\nTold me \"Baby it's real.\"\nAnd I say I ain't doubt you for a second, I squeeze it, I could tell how it feel\nI wish we could take off and go anywhere but here\nBaby you know the deal\n\n'Cause she bad, so maybe she won't but shit, then again, maybe she will\nDo it for the realest niggas in the fucking game right now, she will\nDo it for the realest niggas in the fucking game right now, she will\nMaybe for the money and the power and fame right now, she will\nDo it for the realest niggas in the fucking game right now, she will\n\n(Verse 2: Lil Wayne)\nAnd I tell her \"Go on! Pop that pussy for me.\"\nHaters can't see me but bitches still looking for me\nAnd you could take it to the bank and deposit that\nPut your two cents in and get a dollar back\nSome people hang you out to dry like a towel rack\nI'm all about \"I\" give the rest of the vowels back\n\nI like my girl thick, not just kinda fine\nEat her till she cry, call that \"wine and dine\"\nTry to check me and imma have 'em checkin' pulses\nThey say \"Choose wisely,\" that's why I was chosen\n\nRocking like the asphalt, it's the cash's fault\nLooked in the face of death and took it's mask off\nNow I like my house big and my grass soft\nI like my girl's face South and her ass North\nBut I'm Ray Charles to that bullshit\nNow hop up on my dick and do a full split!\n\nShe just started to pop it for a nigga and looked back\nTold me \"Baby it's real.\"\nAnd I say I ain't doubt you for a second, I squeeze it, I could tell how it feel\nI wish we could take off and go anywhere but here\nBaby you know the deal\n\n'Cause she bad, so maybe she won't but shit, then again, maybe she will\nDo it for the realest niggas in the fucking game right now, she will\nDo it for the realest niggas in the fucking game right now, she will\nMaybe for the money and the power and fame right now, she will\nDo it for the realest niggas in the fucking game right now, she will"}