{"song_id":25223,"song_name":"That Way","artist_id":277789,"display_artist":"Wale Featuring Jeremih & Rick Ross","spotify_id":"0B6rNAbgEDG13mZ82mh10K","lyrics":"(Chorus: Jeremih)\nI apologize I don't recollect your name\n(Ooh, baby I don't know your name)\nBut lemme tell you that them heels really compliment your frame\n(Look at your body baby)\nGirl lemme get them ooh aahs then I gotta catch my plane\nSay ya miss me and ya wishing for some private time\nGirl how could we get that way?\n\n(Wale - Verse 1)\nLook, another day another dollar\nShe hate me when I leave 'cause when I leave I never call her\nThat's life shit, all right, shit, I could call you right quick\nBut if I call you gone be like \"Boo why we haven't skyped yet?\"\nAnd I skype, bet you say \"Lay where my flight at\"\nIf I decline then you inquire on where I spend my nights at\nShit this life gets overwhelming and more then hectic\nBut a woman worth some anger is certainly worth some effort\nJust look closer my life is quite deceptive\nWomen'll sell they soul just to buy some attention\nI need something to hold fuck that passive aggression\nAnd when I'm back from off that road don't ask me no questions\nPlease... fear watchu don't know\n\n(Chorus: Jeremih)\nI apologize I don't recollect your name\nBut lemme tell you that them heels really compliment your frame\nGirl lemme get them ooh aahs then I gotta catch my plane\nSay ya miss me and ya wishing for some private time\nGirl how could we get that way?\n\n(Wale - Verse 2)\nDon't remember how I met her but I know I won't forget her\nIf loving her is wrong then I just know I won't see heaven\nShe say she from Seattle, she twenty and some change\nBefore I get to T.I.A. I'm sure to make her rain\nThen I'm back up on my plane Chi town O'Hare\nWe spend some time and get some wine have some miles from?\nI told her this here's overrated but I love your city baby\nGotta get back to the D you know we finally famous\nDriver drop me off in Dulles I'm headed to some money\nTSA be laughing all them rubbers in your luggage\nI know Ima always leave 'em but I swear I'll always love em\nTell her you'll probably find someone but you'll never find another\n\n(Jeremih - Chorus)\nI apologize I don't recollect your name\nBut lemme tell you that them heels really compliment your frame\nGirl lemme get them ooh aahs then I gotta catch my plane\nSay ya miss me and ya wishing for some private time\nGirl how could we get that way?\n\n(Rick Ross - Verse 3)\nGot on my suede shoes, I'm in a great mood\nThat baggage claim awaiting miss thang outta St. Louis\nKnow she shining bright, got on my cartier, she my billie jean we minaj with mary jane\nSee we city hop, Vegas to LA, brings alotta joy Buggati boy that's Laina Lane\nOur faucets used to drip, I used to ride the bench, but it was written in cursive for this king to exist\nPacked her bags now she live amongst entrepreneurs\nMarc Jacob the makeup Gi-Givenchy consumer Gianni Versace connoisseur a carnivore\nAccountable for half a million uncounted for\n\n(Chorus: Jeremih)\nI apologize I don't recollect your name\nBut lemme tell you that them heels really complement your frame\nGirl lemme get them ooh aahs then I gotta catch my plane\nSay ya miss me and ya wishing for some private time girl how could we get that way?\n\nProps: Lyrics submitted by Adam D."}