{"song_id":25226,"song_name":"Love On Top","artist_id":281569,"display_artist":"Beyonce","spotify_id":"3xjr8NSgMbkcAEdVZgdui0","lyrics":"Ba-ba-ba-da, ba-ba-ba-da, ba-ba-ba-da, ba-ba-ba-da, \nBa-ba-ba-da, ba-ba-ba... ba-ba-ba... Bring the beat in!\n\nHoney, honey, I can see the stars all the way from here;\nCan't you see the glow on the windowpane?\nI can feel the sun whenever you're near;\nEvery time you touch me, I just melt away...\n\nNow everybody asks me why I'm smiling out from ear to ear;\n(People say \"Love hurts,\") but I know (it's gonna take a little work...) Whoa-oh!\nNothing's perfect, but it's worth it after fightin' through my tears,\nAnd finally, you put me first!\n\nBaby, it's you! \nYou're the one I love (one I love), you're the one I need! (I need...)\nYou're the only one I see!\nCome on, baby, it's you! (It's you...)\nYou're the one that gives your all! You're the one I can always call! (Always call...)\nWhen I need you, make everything stop - Finally, you put my love on top!\nOoh! Come on, baby! \nYou put my love on top, top, top, top, top...\nYou put my love on top!\nOoh-ooh! Come on, baby!\nYou put my love on top, top, top, top, top, put my love on top, my love on top...\n\nBaby, baby, I can hear the wind whipping past my face,\nAs we dance the night away...\nAnd boy, your lips taste like a night of champagne, \nAs I kiss you again, and again, and again, and again...\n\nNow everybody asks me why I'm smiling out from ear to ear;\n(People say \"Love hurts,\") but I know (that's it's gonna take a little work...) Oh-whoa, oh...\nNothin's perfect, but it's worth it after fightin' through my tears,\nAnd finally, you put me first!\n\nBaby, it's you! \nYou're the one I love (one I love), you're the one I need! (I need...)\nYou're the only one I see!\nCome on, baby, it's you! (It's you...) \nYou're the one that gives your all! You're the one I can always call! (Always call...)\nWhen I need you, make everything stop - Finally, you put my love on top!\nOoh! Baby! \nYou put my love on top, top, top, top, top...\nYou put my love on top!\nOoh-ooh! Come on, baby!\nYou put my love on top, top, top, top, top, put my love on top, my love on top...\n\nBaby, it's you! \nYou're the one I love (one I love), you're the one I need! (I need...)\nYou're the only thing I see!\nCome on, baby, it's you! (It's you...) \nYou're the one that gives your all! You're the one that always calls! (Always call...)\nWhen I need you, baby, everything stops - Finally, you put my love on top!\n\nBaby! You're the one that I love! Baby, you're all I need!\nYou're the only one I see!\nCome on, baby, it's you! \nYou're the one that gives your all! You're the one I always call! (Calls...)\nWhen I need you, everything stops - Finally, (you put my) love on top!\n\nBaby, 'cause you're the one that I love! Baby, you're the one that I need!\nYou're the only man I see...\nOh, baby, baby, it's you! \nYou're the one that gives your all! You're the one that always calls... (Calls...)\nWhen I need you, everything stops - Finally, you put my love on top!\n\nBaby, 'cause you're the one that I love! (Love!) Baby, you're the one that I need! (Need!)\nYou're the only one I see... (See...)\nOh, baby, baby, it's you! \nYou're the one that gives your all! You're the one that always calls! (Call...)\nWhen I need you, everything stops - Finally, you put my love on top!"}