{"song_id":25232,"song_name":"MegaMan","artist_id":307264,"display_artist":"Lil Wayne","spotify_id":"00NUqFMIpCsrYPbM9YpVHQ","lyrics":"Faded off the kush I'm gone\nOnly 2 years old when daddy used to bring them hookers home\nLooking like my Grammo, my niggas got that ammo\nWe jack son then light up that L, Samuel\nTunechi in this bitch nigga, y'all niggas bitch niggas\nRats gone rat and snakes gone hiss nigga\nBaseball rich nigga, do this shit for all my homies\nWhere them bad bitches at? Come and put that pussy on me\nTunechi you a murderer, boy you just be killing shit\nYeah you know that money talk, I am the ventriloquist\nTranquilizer in the trunk, put your ass to sleep man\nBirdman Jr. got the world in my wingspan\nHow you niggas want it? Have it your way, Burger King\nI get deep in that pussy, dig her out, surgery\nFucking with a real nigga, fucking right, certainly\nBreak in your fucking home, take your life, burglary\nWhoa nigga, die slow nigga\nFor dear life your holding on En Vogue nigga\nUnload nigga, reload nigga\nTools on deck, Home Depot nigga\nWell if life is a bitch, then mine a gold digger\nAnd all my bitches nasty like a cold dinner\nEveryday I go so hard and work my ass off\nI'm good, I'm 100 like a fastball, it's Carter IV!\n\nI'm going back in man\n\nYeah, we get fuck y'all money, how you want to play it?\nThat AK sleep on the side of my bed\nThat's one eye closed, one eye open\nYour cap get peeled like ibuprofen\nI'm sick, I'm ill, I ain't the nigga to fuck with\nThis a crazy world and life is shorter than Bushwick\nYoung Money man we got this shit by a land slide\nBoy I send them bloods at your ass like a tampon\nUptown shit, wet the whole party\nWeezy gone ball, ball like Steve Harvey\nThe heater I'm a tuck her, tuck her like Dolores\nThat's my word like, word like the-saurus\nI don't see no future in your fronting, I be stunting hard\nRap game dependent on me like a bungee cord\nFear nobody but God almighty\nShoot that motherfucker till I get arthritis\nI'm a beast, I'm a ass, I'm ahead of my class\nI'm a diamond in the rough like a baby in the trash\nI don't talk it, I live it, I paint a picture vivid\nAnd them pistols popping like they sitting in a skillet\nI go so hard, I go so mean, I'm so New Orleans\nTold the judge I couldn't budge, it was him or me\nForget the bullshit and remember me"}