{"song_id":25257,"song_name":"Y.U. MAD","artist_id":286105,"display_artist":"Birdman Featuring Nicki Minaj & Lil Wayne","spotify_id":"2STxkZwoTQeZ5jxtgXsy9y","lyrics":"- Nicki Minaj -\nI told stunna I said, you know\nThey on that regular degular\nI said me, I'm on that 1.5 on a skinny top\n\nI am the female Weezy, this shit is easy\nPull up in that new-new, bitch get a squeegee\nYeah my flow sick, yeah my flow queasy\nHaha, they was sleepin' on me, z-ZZ-ZZ\n\nThis pussy clean, this pussy squeaky\nThat pussy old, that pussy creaky\nWhen I'm out the country, niggas call me Nicki\nHi, how are you? yes, it's nice to meet me\n\nDamn, billboard, haha!\nI mean I'm winning but I'm still bored\nYeah we shine, gold cluster\nAs for your career, dead, ghostbusta\n\nThat's y u mad, that's y u, y u mad mad\nThat's y u mad, that's y u, y u mad mad\n\n- Birdman -\nYeah, bigger than life, c 4, we da business\n\nMan, fuck y'all niggas, get down on the lay down\nShoot up anything except a school or a playground\nTriple O.G. nigga, these hos know me\nShining AK blood just like a trophy\n\nI'm old school and I'll smack a bitch\nGettin' money like a motherfuckin' cracker bitch\nWhatcha know about it, take notes nigga\nYMCMB, head coach nigga\n\nYeah, stuntman, stuntman\nStreet sweeper in my hand, get the dustpan\nYeah, we done took off nigga\nGot the game on lock like football, nigga\n\nThat's y u mad, that's y u, y u mad mad\nThat's y u mad, that's y u, y u mad mad\n\n- Lil Wayne -\nUh, I got the world in my wallet\nSwisher full of violet\nNiggas think they fly, make me check your flight mileage\nThat P on my hat is for piru, not pirates\nI bet I could turn her pussy to a fuckin' fire hydrant\n\nAnd I do it for my niggas, my motherfuckin' niggas\n'Cause these hoes so thirsty like they got the fuckin' hiccups\nI'm a bizz ho to say the least, ho\nNo cut on the coke, that's coke zero\n\nYeah, tonight I'll probably fuck another nigga' girl\nParty time, excellent, Wayne's world, haha\nIt's Cash Money, nigga eat a dick\nBeen had it on lock, gave the key to Nick'\n\nThat's y u mad, that's y u, y u mad mad\nThat's y u mad, that's y u, y u mad mad\n\n- Birdman -\nYeah, Barbie you the flyest baby\nWhat it do one-hundred\nYMCMB business, bigger than life!"}