{"song_id":25263,"song_name":"Strange Clouds","artist_id":275499,"display_artist":"B.o.B Featuring Lil Wayne","spotify_id":"4cgZ2dCVqZyMWo0zubW6Vb","lyrics":"Yeah, ha ha\nOh you already know what we gon' do\nHey\n\nVerse 1: B.o.B\nWell if you guessin' it's me, you guessed correctly\nI just stay with a stallion, you would swear I was an equestrian\nAnd um, imma hit her with that pipe, call that Nancy Kerrigan\nStay on the greenest greens, call us vegetarians\n\nYou be on that minor league, but we smoke professionally\nI do my job exceptionally, on point like a decimal is\nThe way I ride on the beat man\nI beat every street, it's done so effortlessly\n\nYeah, so these niggas can't sleep on me, there's no Inception in this bitch\nI'm top chef, you top ramen, I'm top shelf\nNo last call, to the bartender, what you got left?\nPour it up, don't stop there, hold your cup, take a shot, yeah\nAll night we celebrate, 'cause we everywhere and you not there\n\nAll we do is pour it up all night, drinks out\n(That's how we do it)\nAnd all we do is light it up\nAll night, all you see is strange clouds\nStrange clouds\n\nAll we do is pour it up all night, drinks out\n(That's how we do it)\nAnd all we do is light it up\nAll night, all you see is strange clouds\nStrange clouds\n\nVerse 2: Lil Wayne\nUh, blue jeans, I'm faded, mindin' my own data\nSmokin' on that strong, that Arnold Schwarzenegger\nIt's Tunechi Lee, you bitch you, you hot as an igloo\nKick back on that glock, call that Jiu Jitsu\n\nHello world, I'm with a yellow girl, number two pencil\nThese rappers is washed up, spin cycle, rinse you\nMy nigga, all day, all night, half-pipe\nI dive in that pussy, ya I belly flop, I jack knife\n\nAnd shit, tell my homies that I say it's a party\nYeah, got that tech for technical difficulties\nI'm top dog, you top ramen, I'm top dog\nPiru, gangsters, outlaws!\n\nAll we do is pour it up all night, drinks out\n(That's how we do it)\nAnd all we do is light it up\nAll night, all you see is strange clouds\nStrange clouds\n\nAll we do is pour it up all night, drinks out\n(That's how we do it)\nAnd all we do is light it up\nAll night, all you see is strange clouds\nStrange clouds\n\nYoung Moola baby\nB.o.B, fuck with me!\n\nVerse 3: B.o.B\nWell ain't no question, yes, it's B.o.B, yes definitely\nUp in the studio, I got all my necessities\nLook, if you want that real shit, you made the right selection\nI'm Decatur till I die, yes I rep that definitely\nThey say I'm a celebrity, what the fuck's a celebrity?\n\nI guess I must invest in the proper form of protection\nAnd I say it's a curse, but it's been mostly a blessin'\nTo a nigga from the hood\nTryin' to aim for the top, I didn't even need no directions\n\nI just wake up then I roll up the purp\nBut these niggas wake up on my dick, at least have some breakfast first\nNigga keep your nourishment first, and your mind on my lyrics\n'Cause what you hopin' to accomplish, I already did it bitch!\n\nAll we do is pour it up all night, drinks out\n(That's how we do it)\nAnd all we do is light it up\nAll night, all you see is strange clouds\nStrange clouds"}