{"song_id":25275,"song_name":"I Like It Like That","artist_id":303616,"display_artist":"Hot Chelle Rae Featuring New Boyz","spotify_id":"6eFahAdQgABBj1XOM99cBG","lyrics":"Hot Chelle Rae:\nLet's get it on, yeah, y'all can come along\nEverybody drinks on me, buy out the bar\nJust to feel like I'm a star, now I'm thanking the academy\nMissed my ride home, lost my iPhone\nI wouldn't have it any other way\nIf you're with me let me hear you say\n\nI like it like that!\nHey windows down, chillin' with the radio on\nI like it like that!\nDamn, sun's so hot, make the girls take it all off\nI like it like that!\nYeah, one more time, I can never get enough of everybody\nSing it right back, I like it like that!\n(I like it like that, I like it like that)\n\nTill the break of the dawn, yeah, party on my lawn\nWhistle as the girls walk by if the cops roll up (so what?)\nPour the cops a cup cause everybody's here tonight\nCall a taxi, pack the back seat\nI wouldn't have it any other way\nIf you're with me let me hear you say\n\nI like it like that!\nHey windows down, chillin' with the radio on\nI like it like that!\nDamn, sun's so hot, make the girls take it all off\nI like it like that!\nYeah, one more time, I can never get enough of everybody\nSing it right back, I like it like that!\n\nOh oh oh oh, like that\nOh oh oh oh, like that\nOh oh oh oh, sing it right back, I like it like that\n\nNew Boyz:\nOh my homie got the booze, I like it like that\n'Cause the girls playin' beer pong in the back\nWe havin' fun partying till the break of dawn\nGo grab a cup I dunno what people waitin' on\n\nAnd I'm gonna want a girl that I know I can take home\nIn the zone, where I think that I lost my phone\nYou can tell by looking in, the party's plain crack\nAnd don't worry 'bout it girls 'cause I like it like\n\nCome back stay here at my grandma's house\nAnd leave your clothes over there, that's grandma couch\nI be filmin' her friends too, hit 'em back on that\nDouble D chicks huggin', I got racks on racks\n\nLie, I know there's a reason for superstar\nI'm just tryin' to chill with Miley at the hookah bar\nYou like cartoons? I'll make your heart melt\nWith this sick tune, play it in the car\n\nHot Chelle Rae:\nI like it like that!\nHey windows down, chillin' with the radio on\nI like it like that!\nDamn, sun's so hot, make the girls take it all off\nI like it like that!\nYeah, one more time, I can never get enough, oh everybody\nSing it right back, I like it like that!\n\nHey windows down, chillin' with the radio on\nI like it like that!\nDamn, sun's so hot, make the girls take it all off\nI like it like that!\nYeah, one more time, I can never get enough, oh everybody\nSing it right back, I like it like that!\n\nOh oh oh oh like that\nOh oh oh oh like that\nOh oh oh oh everybody, sing it right back, I like it like that\nI like it like that"}