{"song_id":25298,"song_name":"Focused","artist_id":277789,"display_artist":"Wale Featuring Kid Cudi","spotify_id":"4w27lZ9zcceZp6rumzGCBx","lyrics":"(Kid Cudi)\nShorty, no jokin'\nAnd I'm hopin', I'm not slowin'\nGot to just keep on rollin'\n\nI'm joking (young boy movin' fast)\nAnd I'm hopin' (pray that I don't crash)\n(All I know is) I'm not slowin'\nGotta just keep on rollin'\nGotta keep at it, gotta stay focused\n\nYoung boy moving fast\nAnd I'm hoping, pray that I don't crash\nAll I know is I'm not slowin'\nGotta just keep on rollin'\nGotta keep at it, gotta stay focused\n\n(Verse 1 - Wale)\nPull in once, I'mma lit mine up\nFill up the plug, let me light my blunt\nAnd I don't really know what the fucks in my cup\nBut a couple shots of it got a nigga unstuck\nI'm just here to have a good time\nA lil white chick, a lil white wine\nOutta town, spent a couple nights at Chows\nSmoking weed in the suites, till we out of towels\nAnd don't bother me, high shit for my broccoli\nFly shit for no goddamn reason and y'all aight but y'all not like me\nIt's MMG and that's my clique\nThat's BOA see that's my set\nMy CDG shit'll match my kicks\nAn apostrophe I'm behind that S\nOr that black Beamer, black to pick me up\nBack wood, the tree I'm ashing out. See, I been kickin my raps good\nWith or without sales I'm killing these blackheads my rap is Noxzema\nHaha, light it up for a nigga, one or two hoes ain't enough for a nigga\nOne or two bottles ain't enough for a nigga\nRedberry everywhere got Puff gettin' jealous\n\n(Kid Cudi - Chorus)\n\n(Verse 2 - Wale)\nOne night love, I'mma need that\nHe could own that, shawty, I'mma lease that\nI'mma put you in the game where your kicks at\nI'mma sign that work then release that\nI don't be where the crowds or police at\nI just be where the cash and the freaks at\nSmoking Green Bay nigga, I'm a cheese head\nIn a Lambo, see me with the G's at\n$10K in my camos, word. 10 Js and I can't move\nShades LV was a little dough\nGoing hard for the days I was piss poor\nAnd go hard 'cause I feel it's only right to\nMaybach. G.O.O.D music, the right move\nGirls say everything that I write smooth\nFuck rap, I'm getting pussy off of Haiku\nOne time for the girls with the right shoes\nFuckin' with a dude probably the right move\nTwo times for the chicks with the right back\nIf it's right tonight, I might bite that\n3 times, show me your peace sign\nNot with your hand girl, open your knees out\nLook, money will leap out, stuntin when we out\nDouble MG, OUT!\n\n(Kid Cudi - Chorus)"}