{"song_id":25305,"song_name":"Lotus Flower Bomb","artist_id":277789,"display_artist":"Wale Featuring Miguel","spotify_id":"3MAgQuClHcAV8E9CbeBS6f","lyrics":"(Wale)\nImma rap to you real quick.\nI wanna enjoy the luxury of like, not knowing each other for real. Hol' up\n\n(Intro: Miguel)\nLotus flower bomb, firefly\nWhen I'm low, she take me high\nI can teach you all the sounds of love\n\n(Verse 1: Wale)\nFlower bomb, let me guess your favorite fragrance\nAnd you got that bomb, huh, I'm tryna detonate you\nNo disrespecting baby, just tryna make you smile\nTry to keep my spirits up, that's why I lays it down\n\nTry to keep your spirits up, lil' vodka whatever\nTook you forever to get dressed, I acknowledge your effort\nSo I clap for her, she deserves an applause\nShawty working so hard, she deserve that Vuitton\n\nShawty where your baton, racing through my mind like\nShe heard that I got that work, I heard that she been on strike\nCare to tell, I read your mind, she been on them dollars first\nCaramel macchiatos when shawty get into work\n\nI can be your boyfriend be your nigga or a friend with perks\nI'm just tryna work that huh, they just tryna work your nerves\nI'm just tryna read your mind, I'm just tryna feed you mine\nI'm just tryna give you light, they just tryna leave you blind\n\n(Hook: Miguel)\nWe're living in a fantasy\nI feel it when you dance with me\nIt's feeling like you need to be\nMy lady, my baby, yeah\nCan't you see?\nI'm talking about eternity\nTell me would you care to be\nMy lady, my baby?\n\n(Verse 2: Wale)\nFlower bomb, can I blow up on your mind\nThis is not no Sandra Bull, but you're Potion #9\nNavigating through her eyes, destination to her thighs\nAnd I hate to tell you too much, 'cause I stay with too much pride\n\nAnd we way too young to know love, maybe not but we don't need no rush\nDon't believe in love at first sight, but I believe in love at first huh\nCan I be with you just one night? I could wear you out inside\nI could tell you like persistence, but I make you come in tri's\n\nI just think we need one night, can't decide if I came right\nEasy baby my thing tight, but that lotus flower just ain't right\nI ain't thinking I ain't right, can't decide but I can't fight\nEasy baby you the bomb and all, but I be damned if I do not land mine\n\nOr at least try, can I speak up? Was it peace out? Can we eat lunch?\nCan we take shots with your flavor, flat drinks we call A cups?\nI just think I need one night, slightly more if it's done right\nWith that gorgeous face, I don't know your name, it ain't important babe 'cause imma call you Mine\n\n(Hook: Miguel)\nWe're living in a fantasy\nI feel it when you dance with me\nIt's feeling like you need to be\nMy lady, my baby, yeah\nCan't you see?\nI'm talking about eternity\nTell me would you care to be\nMy lady, my baby?\n\n(Bridge: Miguel)\n'Cause you don't know who, you don't know when\nIf I keep stickin' baby, what's it gonna be\nYou don't know who, you don't know when\nLet me teach you all the sounds of love\n\n(Outro: Miguel)\nAh, ay, eeeeee, ah oh ooh\nBaby this was for you, lotus"}