{"song_id":25310,"song_name":"Party On Fifth Ave.","artist_id":276901,"display_artist":"Mac Miller","spotify_id":"2i0RvY0gh7Bor0fGj04IVz","lyrics":"I think I see where you're goin' with this one E\n\nHey, hey, been around the world and back, yeah I did that\nStill kick raps in cars and packs, so where's my kids at?\nAnd everybody hatin' sounded funnier than Sinbad\nI'm ill as the pills that they give you when you collapse\nThis, that, the other, kiss your mother with that mouth?\nWe the kids that she warned you about\nWe just storm in your house open doors through a cloud\nGot an assortment of styles, just be sure that it's wild\n6:30 in the mornin' and there still ain't signs of slowin' down\nTwin sisters gettin' wasted so they both are down\nIt's goin' down, I thought I told you mane\nIf you tryna to party let me see you raise your hand\n\nThere's a party on 5th ave (a party on 5th ave)\nHit me if you tryna go (hit me if you tryna go)\nI can be there in like 20\nI'mma hump it and come runnin', 'cause we gotta hit the road\nMake you sure you gotta\nClean shirt, clean pants, new shoes\nWe're just about there you choose\nWe're at the party on 5th ave tonight\nAnd that's what I'm tryna do\n\nHey, what's the difference between me and you?\nWhen no one believe in you, I'm flyer than beetle juice\n\"DJ Enuff\", But still I might eat your food\nI party and sleep till noon, what every day people do\nGive me a week or two\nSee when you read the news my bitch\nMy rhyme time is why, my album is fly\nYour favorite record, you gonna put it aside\nThis that old school shit soundin' good in the ride\nAnd I'm only countin' to nine\nSaid this that old school shit, soundin' good in the ride\nSaid let's head out to the party I'll drive\n\nThere's a party on 5th ave (a party on 5th ave)\nHit me if you tryna go (hit me if you tryna go)\nI can be there in like 20\nI'mma hump it and come runnin', 'cause we gotta hit the road\nMake you sure you gotta\nClean shirt, clean pants, new shoes\nWe're just about there you choose\nWe're at the party on 5th ave tonight\nAnd that's what I'm tryna do\n\nWhat's goin' on? There's a party\nHope the neighbors don't mind us gettin' loud\nHomies to the left, all the ladies to the right\nWe came to get down, we gonna do that now\n\nMy light up shoes on, my light up shoes on\nMy light up shoes on\nThey love the way my kicks flash\nThis ain't a time to just sit back\nCause, there's a party on 5th ave\n\nThere's a party on 5th ave (a party on 5th ave)\nHit me if you tryna go (hit me if you tryna go)\nI can be there in like 20\nI'mma hump it and come runnin', 'cause we gotta hit the road\nMake you sure you gotta\nClean shirt, clean pants, new shoes\nWe're just about there you choose\nWe're at the party on 5th ave tonight\nAnd that's what I'm tryna do"}