{"song_id":25359,"song_name":"Bang Bang Pow Pow","artist_id":277474,"display_artist":"T-Pain Featuring Lil Wayne","spotify_id":"5974upRH7uHuhRkstgEhHu","lyrics":"My money right, my money money very good (good, good)\nShawty fuckin', wassup girl? that head good!\nBang bang pow pow\nI do my thang thang\nLook at me now now\n\nMy money right, my money money cash up\nUp up and away, face down, ass up\nI rep my town town, that's where I'm from\nSo nigga pow pow, bom bom\n\nMoney to blow, I'm living off tour\nBoatload of cash, bitch I'm overboard\nI got money for these whores if you open up the door\nThe accounts and they all wanna?\nReal talk, I don't speak, even if it's \"hi hater\"\nI'm on top and nothing like the elevator\nAll these bitches say I'm fly and I can never touch the ground\nI'm not tryna be in your circle 'cause I don't fuck around\n\nI get that money, that money (money)\nI live it, I want it, Drop the top on that Ferrari\nNow I'm in California\nI let the hard top down and the wind blow through\nAll I do is win, what the fuck you gon do\nGood, good, good\nI do this for my hood, hood, hood\nYeah, and ain't nobody gonna stop me I doing it right now\nSo bang bang pow pow and everybody say\n\nMy money right, my money money very good (good, good)\nShawty fuckin', wassup girl? that head good!\nBang bang pow pow\nI do my thang thang\n\nLook at me now now\n\nMy money right, my money money cash up\nUp up and away, face down, ass up\nI rep my town town, that's where I'm from\nSo nigga pow pow, bom bom\n\nI go so hard they call me go so hard\nYou ain't a king, you a joker card\nFuckin' up the Church money like an alter boy\nI got them yellow\nI go bonkers boy, I put that on my mom and 'em\nThe hoes are all alike, they put the hoe in\nI think all these niggas sound like me, That's a compliment\nI told a midget bitch, I do it big hippopotamus\nPut that on my Slime and 'em\nNo B-ball; we stop and pop\nNo b-boy we got shit locked\nSwagger ill, wassup doc\nMake that pussy pop like the gun I went to jail for\nShoot the doors off that jeep, that bitch look like a mail trunk\nYa pussy keep ya tail tucked, real niggas in this bitch\nGet that pussy wet, fuck her than I jet: Kenny Smith\nT-pain voice, all I do is win and shit\nYoung money in here ya muthafuckin' face\n\nMy money right, my money money very good (good, good)\nShawty fuckin', wassup girl? that head good!\nBang bang pow pow\nI do my thang thang\nLook at me now now\n\nMy money right, my money money cash up\nUp up and away, face down, ass up\nI rep my town town, that's where I'm from\nSo nigga pow pow, bom bom"}