{"song_id":25353,"song_name":"Can't Get Enough","artist_id":276541,"display_artist":"J. Cole Featuring Trey Songz","spotify_id":"20wR5XQpaL1uvVY8gmc4uY","lyrics":"(I need that) Cole World\n(I need that) South Side\nCan't get enough, can't get enough\n(I need that) East Side, West Side, worldwide\nRide out\n\nNow I ain't got no kids yet, but this right here's for practice\nI hate to get the seats in the Benz wet, but that's how good yo' ass is\nMake an old man get his glasses, make Wesley pay his taxes\nThen follow yo' moves all week on twitter, probably make a gay nigga reconsider\n\nYou now rockin' with the best, mayne, dress game down to the sex game\nWon't brag, but the boy been blessed, mayne, let you play with the stick, Ovechkayne\nShe calling, she texting, she's falling, but lemme explain\nGotta tell your old boyfriend skate, girl, 'cause a nigga don't play them ex games\n\nNo! Straight sexing, no handcuff or arresting\nAnd I ain't comin' off of my last name, 'cause I really can't take no stressing\n'Bout where I done been, who I done hit, your home girl sayin', \"He a bad boy.\"\nBut I'm signed to the Roc, no time for the gossip, bitch, put down them tabloids\n\nTrey Songz:\nShe said \"I heard you got a main chick\nA mistress and some hoes\nYou be up to no good\nAnd everybody knows\n\nMy home girls tried to warn me\nThey tried to let me know\nBut what you got, I need a lot\nSo I can't let you go.\"\n\nJ. Cole:\nShe said\n\"I, can't get enough, can't get enough\"\n(I need that)\n\"I, can't get enough, can't get enough\"\n(I need that)\n\n\"I can't get enough of what you got\nGood god, you hit the spot\nTried to let go but I just could not\nSo don't you stop, I need that\"\n\nHey, Globetrotter, Cole hotter, either way, out in London town\nHoes holla 'cause they love my sound, and I got love for the underground\nKweli, Pimp C, H-Town where Bun get down\nMet a bad bitch that'll cut all night, that'll suck all night, you just cut off lights\n\nAlmost missed my flight, tryna give my last girl a nut, all right?\nShe be down for whatever, whenever I wanna get up in the guts, all right?\nNever fuss or fight, on the grind tryna find this lettuce\nI love it when you give me head, I hate it when you give me headaches\n\nTrey Songz:\nShe said \"I heard you got a main chick\nA mistress and some hoes\nYou be up to no good\nAnd everybody knows\n\nMy home girls tried to warn\nThey tried to let me know\nBut what you got, I need a lot\nSo I can't let you go.\"\n\nShe said\n\"I, can't get enough, can't get enough\"\n(I need that)\n\"I, can't get enough, can't get enough\"\n(I need that)\n\n\"I can't get enough of what you got\nGood god, you hit the spot\nTried to let go but I just could not\nSo don't you stop, I need that.\"\n\nHey, Cole World, baby, ain't nothin' sunny\nI see 'em hatin', but it ain't nuttin' to me\nI'm from the Ville, where they bang for the money\nAnd carry fo'-fives like change for a twenty\n\nSo what I look like scarred?\nThem niggas over there look like nerds\nNever mind that, girl, let's make a track\nI'll beat the pussy up, that's the hook right thurr\n\nThat's the hook, right there\nThere's the hook, right there\nNever mind that, girl, let's make a track\nI'll beat the pussy up, that's the hook right thurr\n\nTrey Songz:\nShe said \"I heard you got a main chick\nA mistress and some hoes\nYou be up to no good\nAnd everybody knows\n\nMy home girls tried to warn\nThey tried to let me know\nBut what you got, I need a lot\nSo I can't let you go.\"\n\nShe said\n\"I, can't get enough, can't get enough\"\n(I need that)\n\"I, can't get enough, can't get enough\"\n(I need that)\n\n\"I can't get enough of what you got\nGood god, you hit the spot\nTried to let go but I just could not\nSo don't you stop, I need that.\""}