{"song_id":25385,"song_name":"Play The Guitar","artist_id":275499,"display_artist":"B.o.B Featuring Andre 3000","spotify_id":"4QTbvU8LSI5p43PEcpP3fe","lyrics":"B.o.B, play the guitar!\nB.o.B, B.o.B, B.o.B, play the guitar\nB.o.B, play the guitar\nB.o.B, B.o.B, B.o.B, play the guitar\n\n(B.o.B)\nWell it's B.o.B, flyer than a stewardess\nFresh to death like I'm dressed for a eulogy\nMy outfit's retarded, my flow is the stupidest, dumb\nI'll probably need to after school tutor it\n\nBallin' on beats got hops like breweries\nSideline haters need to chill where the cooler is\nDr. J flow, you can call me Julius\nY'all take shots, I direct, movie shit\n\nGrand Hustle champion, all I do is ball 'em up\nNiggas startin' conversations just so they can talk us up\nIf you ain't runnin' shit you can't even walk with us\nStill I'm chill blunt wider than a coffee cup\n\nYou know it's B.o, I do this for the people\nStackin' C-notes, pockets on Cee-Lo\nUhm, I'm killin' 'em mama, I'm talkin' hockey mask\nI do it to death, swag on body bag\n\nThis beat is out of here, it's gone\nFarewell, so long, so long\nI'm sayonara, the way I'm gone\nSo far away there ain't no signal on my phone\n\n'Cause I'm a star, so when I hit the bar it's like Cheers\nEverybody knows who you are\nWho would've thought I would've took it this far\nPlay the guitar\n\nB.o.B, B.o.B, B.o.B, play the guitar\nPlay the guitar, play the guitar, play the guitar\nB.o.B, B.o.B, B.o.B, play the guitar\n(3000) Play the guitar, (3000) play the guitar\n(3000) Play the guitar\n\n(Andr&#xE9; 3000)\nMan, I keep havin' this re-occurring image where I'm\nStanding on top of Church's Chicken playing guitar\nLooked over and I see B.o.B with this strange cigar\nHe's standing on top of Dunkin' Donuts, it's like he own it\n\nWe at the corner of give it to 'em and they don't want it\nWe out somewhere and me in Europe, they out here yawnin'\nMy niggas threw out way too much jewelry, my chain lonely\nBut they don't know about black pearls, but I will show them\n\n\"Why the world sleepin' on black girls?\" Hey I don't know, man\nSilverback Stacks, jumpin' out the jungle\nBlowin' tiger stripe bubbles with \"Go to Hell\" bubble gum\nWhen I was younger space shuttle got hung in front of everyone\n\nAnd grandmum tells me to stay humble but do not un-der-stand\nWhen they leave mumbles to make 'em throw up they arms and hands\nNow stumble and they will know I put on my pants\nOne leg at a time, like they do pay us no mind\n\nBut everybody look at why we do it, it takes us more time\nExcuse me if I'm no exhibitionist accordin' to the internet\n3000 got a big old dic-tionary full of words\nHe must know how to use 'em\n\nIt also says I play the violin and that ain't true but\nYou give me six strings and a pick\nAnd I will make a guitar talk, why, I ain't gotta say shit\nAnd I encourage any child to pick up some instrument\n\n'Cause if you're mad at your dad or mum, you can grab it and strum\nEat your cabbage and corn, by the time you're done\nYou will finally realize that they meant you no harm\nThey was tryin' to save your crazy ass from what's to come\n3000 muthafucka Mr. Tell-Me-Somethin'\n\nMy partner say I should practice more, I know\nThey be saying I sound like I'm out of tune\nI ask them, do you cry in tune nigga? Do you laugh in tune?\n\n(3000) Play the guitar, (3000) play the guitar, (3000) play the guitar\nB.o.B, B.o.B, B.o.B, play the guitar\nB.o.B, play the guitar, B.o.B, play the guitar\nB.o.B, play the guitar\n\nB.o.B, B.o.B, B.o.B, play the guitar\nB.o.B, play the guitar, (3000) play the guitar\nB.o.B, play the guitar\nB.o.B, B.o.B, B.o.B, play the guitar"}