{"song_id":25399,"song_name":"Wild Boy","artist_id":276871,"display_artist":"MGK Featuring Waka Flocka Flame","spotify_id":"6vO90gbxZCq7fw2e0pSRkw","lyrics":"Yeah Bitch, Yeah Bitch, call me Steve-O,\nI'm a wild boy, fuck an eighth I need o's\nYeah Bitch, Yeah Bitch, call me Steve-O,\nYeah Bitch, Yeah Bitch, call me Steve-O,\nI'm a wild boy, I'ma I'ma wild boy\nI'm a wild boy, fuck an eighth I need o's\nYeah Bitch, Yeah Bitch, call me Steve-O,\nYeah Bitch, Yeah Bitch, call me Steve-O,\nI'm a wild boy, I'ma I'ma wild boy\nI'm a wild boy, fuck an eighth I need o's\n\nKells\nI'm an East side Cleveland wild boy, East side Cleveland wild boy\nWe got baseball bats like the Indians and my team pop off like cowboys.\nYou're a white flag, throw that towel boy\nI'm a jump right in that crowd boy\nI don't give a Shhh! keep it down boy\nAnd I'm a fuck you blow that loud boy\nAll I know is how to kill everyone and my cells\nAll they know is they can kill anybody but Kells\nI am untouchable, you would think I was in jail\nBut I'm in Mexico getting marijuana from Miguel.\nBring it back into the states, put in on the scale,\nMeasure out half an 8th put it in a shell.\nSplit it then I roll it then light it up like it's Independence Day.\nI got a bottle rocket put it in the air\nSnapback with my city on it, text back with your titties on it.\nLevi's put your kitty on it, start Grindin' like the Clipse is on it.\nDrank until I get pissy bitch, smoke until I get dizzy bitch\nLose control like Missy, but I'm a bad boy 'cause I'm with Diddy biiiiiitch\n\nThere he go that's John Doe \nNever mind that's just Kells with that heat, no LeBron though\n\nYeah Bitch, Yeah Bitch, call me Steve-O,\nYeah Bitch, Yeah Bitch, call me Steve-O,\nI'm a wild boy, I'ma I'ma wild boy,\nI'm a wild boy, Fuck an eighth I need o's\nYeah Bitch, Yeah Bitch, call me Steve-O,\nYeah Bitch, Yeah Bitch, call me Steve-O,\nI'm a wild boy, I'ma I'ma wild boy,\nI'm a wild boy, Fuck an eighth I need o's\n\n(Flocka)\n(Bricksquad!) Uh-Oh! Here come that bullshit, beat a nigga ass till the DJ stop the music\nThey say they want that wild shit, mosh pit, jump up in the crowd bitch, I'm so mother fuckin' violent.\n(Yeah Bitch) Yeah Bitch I'm with Steve-O, we busting bottles with bad bitches blowin' weed smoke.\nYeah Bitch, Yeah Bitch I'm with Steve-O, Royal Rumble in the club John Cen-o\nI'm screaming Riverdale everywhere I go. I throw them bands hoe, drop it low\nFuck 5-0, I make my own rules, Suck my dragon balls bitch, call me Goku\n(Yeah!) This liquor got the best of me, (Yeah!) This liquor got the best of me.\nMachine Gun Kelly, Flocka that's the recipe. You gon' need King Kong if you step to me\n\n(Yeah) Cobain's back, (Yeah) Cobain's back, got these crazy white boys yellin' Cobain's back.\nI call my weed Nirvana, smells like teen spirit\nAnd my packs so fucking loud you can't hear it. Ah\n\nYeah Bitch, Yeah Bitch, call me Steve-O,\nYeah Bitch, Yeah Bitch, call me Steve-O,\nI'm a wild boy, I'ma I'ma wild boy,\nI'm a wild boy, Fuck an eighth I need o's\nYeah Bitch, Yeah Bitch, call me Steve-O,\nYeah Bitch, Yeah Bitch, call me Steve-O,\nI'm a wild boy, I'ma I'ma wild boy,\nI'm a wild boy, Fuck an eighth I need o's\nI'm a wild boy, I'ma I'ma wild boy,\nI'm a wild boy, I'ma I'ma wild boy,\nI'm a wild boy, I'ma I'ma wild boy,\nI'm a wild boy, I'ma I'ma wild boy!"}