{"song_id":25446,"song_name":"Mutha***** Up","artist_id":430631,"display_artist":"Tyga Featuring Nicki Minaj","spotify_id":"673AitlQq6SZOpamDTzlPV","lyrics":"(Tyga)\nYMCMB, rawest niggas doing it\nSchool for the blind, I don't see these niggas doing it\nI'm doing it and doing it and doing it well\nNiggas wanna test me boy, who wanna fail?\nHit you like a bully bitch, yeah saved by the bell\nIf you scared, go to church I'll see you in hell\nAnd your girl, she a flip, give me heads or tails\nEverybody fake so I got real for sale\nGunpowder fill the air\nRappers shittin' on theyself, you could smell the fear\nAnd these bitches laying flowers cause the king is near\nT-Raw this is the new flavour in ya ear\nNiggas softer than baby hair\nWhy you acting tough, heard you work at Build-a-bear\nI'ma a dealer all my girls come in deuce and pairs\nI'm in the building I construct so light this muthafucker up\nWhat the funk you beezy's want\nI'm ready to hump the car I call it ele-phunk\nTrunk in the front\nMan she give me good brain 'cause she feel dumb\nI just keep going like the bunny till I feel numb\nYeah these bitches want it\nI put my man's on it\nThat 110 Sup', that Ferrari Caliornia\nNiggas want beef, call me Tony Romo\nYou potatoes on the sofa\nLazy muthafuckas why you ain't even trying\nRich or die trying, why you niggas ain't died yet?\nWings tattoo yeah forever on some fly shit\nAnd I'm with the business skip peon with a ty clip\nStay on the flight yeah I'ma trip\nProbably up in Paradise chillin' like Parliaments\nFlow got a boner, you could say I'm on some harder shit\nBout to make the speaker buss'\n\n(Mic this muthafucka up)\n\n(Nicki Minaj)\nOkay, really I get money\nI get money like a bitch\nShe ain't gon' win the war but swear that bitch a trip\nYou see how the diamonds get to dancing\nYeah, ya money short, get some pants and shit\nI be with a nigga with a big ol' dick\nYeah I like them balls you be shooting them bricks\nFuck you in the game for?\nBitch we up three sippin' this game four\nTell 'em listen, couple bad bitches's\nOut in Kingston kicking up bricks and shit\nIntervention bitch I pay ya pension\nOh you say what? I don't pay attention\nYeah these niggas want it\nI put my bitches on it\nYou know the tattoo's got Nicki initials on it\nI put the pussy on 'em, cook 'em a pot roast\nThen pull off in the Ghost\nBitch I do the most\n\n(Tyga)\nWhat the funk you beezy's want?\nIt ain't your turn, better have my money\nFriday like Big worm\nCan't see you niggas, you like a little germ\nBitches know I'm excellent like Mr Burns\nSee my dick like Butter churn\nBaby churn and ya girl with me fo'shure\nThat ain't your concern\nShe forgot about her other man, she will never learn\nOn a mic till I die, RIP chick huh\nYessir, colder than the Pittsburgh?\nWinter fresher than a Will Smith T-Shirt\nThese spurts coming through Last King and a hearse\nAsk later, shoot first, got shooters like dirt\nWhen it hurts leave you losers bruised up\nBruce Lee nunchucks\nToe from the floor up though\nDuck, rubber duck now you like oh shucks\nTell the neighbours I don't give a fuck"}