{"song_id":25455,"song_name":"Ayy Ladies","artist_id":430388,"display_artist":"Travis Porter Featuring Tyga","spotify_id":"163ExVYtJrtdE86Qd5Fw2N","lyrics":"Ha! Ha! Ha!\n\n(Chorus: Travis Porter)\nOkay now ladies... (Yeah?) If you know you bad (Yeah?)\nDon't need no man, got yo' own bands, put up yo' hands\nIf you a top notch bitch (Woo!), lemme hear you holla (Woo!)\nBend it over, touch ya toes\nWhip it out, show the hoes you Bankrollin'\nSling ya hair, hit a broke hoe wit' it\nPoke it out, damn shawty you can get it!\n\n(Strap)\nIf you got some good pussy say (Yeah?)\nIf you got some good head on ya shouldeeeeers\nIf you got some good pussy say (Yeah?)\nIf you never let a hoe fuck you oveeeer\nIf you 'bout yo' check, drank Moet\nKnow the pussy stay wet, I need all dat\nTattoos on the back, I see all dat\nYou already got a man, I ain't tryna be all dat\n\n(Ali)\nI'm just tryna hit it by the end of the night\nLil' mama so bad and her booty so tight\nWhen I hit it from the back, don't fuss, don't fight\nWhen I put it in ya mouth, don't scratch, don't bite\nI'm showin up, money I'm throwin' up\nLiquor I'm pourin up, go get you another cup\nI told a shorty wassup, told her I'm tryna cut\nAnd then I slapped her dead on the butt\n\n(Tyga)\nAh! One, two, three, fo', give the booty five\nI like my bitches real thick, lil' mo' thighs\nRicher than ya own head, nigga no lie\nStacks in the pussy hole, call that the G-spot\nHAH! Real gentleman, fuck and never call again\nI'm hot, fresh up out the water I ain't even swim\nHeard she got a nigga, well he could be her man\nMan, I wouldn't shake his hand with a broke hand\nI don't fear naan nigga, boy cold, man\nMake a bitch strip butt naked like she pole dance\nStandin in the club, on her on the couch, shit\nGrab the mic then announced it\n\n(Quez)\nLook, really I'm just tryna break the headboard\nBaby girl, yee ain't gotta ask or beg for it\n(Aw!) Hell naw! Girl I ain't scared of it\nTold her I was 'bout to go nuts with my hands up\nFirst time I met the girl, she was in the club (Yuuup)\nBooty like a dice game, just shake it up\nShake shake shake shake like a tamberine\nBreak 'er down, put her in a blunt like a bag of green\nLadies (ladies) and you know you bad (bad)\nThen put yo' hands in the air (What they call her?)\nBig Booty Judy, love the way she shake it\nDrop it to the flo', gon' earthquake it"}