{"song_id":25494,"song_name":"Love This Life","artist_id":277486,"display_artist":"T.I.","spotify_id":"3tuoGlPsvRp1GyrcXkop63","lyrics":"I know it can get kinda tough sometimes you know\nI know you can kinda get carried away with yourself\nBut err, why don't you be real with me and be real with you at the same time\nYou can't get what you get here nowhere else ma\nKeep it real now\n\nYou know, You know (you know you love this)\nYou know you love this life\nDon't nobody do you like me\nYou know, you love\nYou-you know you love this life\nDon't nobody do you like me\nYou know\n\nCavalli dress and high heels\nAnd drop tops on hot wheels\nWe live how we wanna live 'cause we got mills\nThem other barely barely buy a hot meal\n\nIn VIP dem bottle poppin' do it B.I.G.\nCome get with T.I.P. be ballin' till you D-I-E\nInvisible set bracelet, see clearly\nTake away your stress mean that sincerely\n\nProblem solve 'em, nevermind that\nGirlfriend see your bag, be like \"Where you find that?\"\nPlus, what's a what's a pre-nup you ain't got to sign that\nYou up take half, imma make it right back\n\nI'm a hustla hustla to the heart\nWhat's the sense in leaving me and be back with them with-them busters\nBentley for your birthday, Goyard Purse day\nDeal with them stacks know you gotta love that\n\nMan of Respect on a big jet\nWith a big big and a big check\nI pop big shit, how good does it get\nYa leave me, where else you think you could get this?\n\nYeah, you could get another guy to beat that beat that for ya\nThem busters cowards though, and I'll take a bullet for you\nMansions, jewelry all I need is for you and me to have some understanding\nHave a couple candid conversations\n\nYour frustrations I take in consideration\nI'm rough around the edges, don't bat with me and be patient\nAnd you're sadly mistaken if you think I'm into chasing\nMy heart is RSVP I've extended an invitation\n\nAnd don't go wasting your time with what they saying online\nYour positions divine, don't believe look around\nI got a strong mind and kind heart\nWith a soft kiss but I love hard\n\nDon't you love this life like I love you\nAnything you could ask, do it for you\nDrop Jags, Berkin bags, Louboutin heels\nSummer homes in Miami, Hollywood hills\nVacation in Monaco, Ibiza\nOn the French Riviera with our feet up\nOur lifestyles so rare, you know you ain't going nowhere"}