{"song_id":25594,"song_name":"Go Get It","artist_id":277486,"display_artist":"T.I.","spotify_id":"7ezdJlanRMlE429QOud5x5","lyrics":"I gotta grind, won't stop\nHustle won't quit\nShine like no other, I be on some other shit\nI got a high price lifestyle super bad bitch\nIf I want it, then I got it\nIf I don't then all I gotta do is\nGo, get it, stay about my bidness\nBall till I fall, floss until I finish\nI can go, get it, stay about my bidness\nI'm living just to kill it, stacking million to the ceiling\n\nEveryday I ball brown, all I wanna do is ball\nPut my money over bitches, put my hustle over all\nLouie down to the drawers, Luis Vuitton kicks\nGot a man, how to swagger, bitch I'm stupid dumb sick\nWith a group of young bitches and they stupid dumb thick\nI'm the marathon man, all I do is run shit\nA sophisticated convict, superficial, still official\nMultimillion dollar shit\nMoney is the object, hot shit\nBitch I got a sawnoff on my arm\nSee bigger with no diamond\nThey just talk about they got it,\nI'm the upper echelon, though\nBitch I'm bout that action, you could go on with that convo\nI have done more than you dream bout\nGet your dream bitch and your dream house\nOn lean passing them beans out\nWith a bad crew, the whole team high\nGo on boy, get seen by, bro you know me, you know I be\nStacking that dough, that's all I see\nI g.o. g.e.t. i.t.\n\nI live life, up late night\nGet shit fake when I take flight\nI get paid, no sick days\nMy outfit's so switch blade\nDon't sniff yay, but I blow dro\nBank roll on loco\nStill ride with that 44\nDon't let my P-O know\nBad white bitch super thick\nI'm Ice T, she Coco\nShe got another bitch, other bitches\nHer ass fat, face so-so, no paper triail\nNo phone call, no emails, no photos\nJust backshot, with that fat butt\nAnd low blow headbutts in slow-mo\nPurple label polo and a crew that's what I do\nMan I strive and roll my denim in my new Margiella shoes\nMan, we be cool if we just parle\nOn Margharita Molly and the strong?\nWe menagin' for a hobby\nWe kick it how we kick it\nKnow you envy how I'm living\nJust can't resist the\nGet the million bout my business\nBro you know me, you know I be\nStacking that dough that's all I see\nI g.o. g.e.t. i.t."}