{"song_id":25615,"song_name":"Yuck!","artist_id":431852,"display_artist":"2 Chainz Featuring Lil Wayne","spotify_id":"0332p5aiaQ6vyomilcGSy4","lyrics":"Yuck Daddy! Yuck!\nYuck Daddy! Yuck!\n\nUh, cut the top off, call it Amber Rose\nJust bought a big body, time to paint the toes\nKnown to act a donkey on the camel-toe\nThen take the camel-toe and turn it into casserole\n2 Chainz talkin' on the flake's phone\nPoof! Just like that the whole check gone\nFormer posturepedic I was slept on\nSo many chains on it look like my neck gone\nMy girl came through and brought an extra body\nNow that's an after party for the after party\nTwo-gun game, all black Ferrari\nHis and her Armani, put it in a tonic\nAnd yeah, the bread good if the head good\nBefore benihana's it was canned goods\nBefore canned goods it was similac\nI'm from where they send sharks then we send 'em back\nA half a million dollars worth of crack money\nWrap your parents up, now you got a black mommy\nYeah I did it, true to my religion\nTwo guns on me, both with extensions\nIf you on the pole, play your position\nI got enough dough to pay your tuition\nCorduroy trues, with the skull cap\nI just woke up, tell me where the drugs at\nAnd after the drugs, where the girls at\nAnd after the guns, where the love at\nAnd if it ain't no love, I'm like fuck that\nNigga I'm so dope, you could catch a fuckin' contact\n\nGood weed, bad bitch\nGot these hoes on my dick like Brad Pitt\nWhoa, I seen it all before\nThe bitch got a man, but she schemin' on the low\nHow it go? It go, fuck them other niggas 'cause I'm down for my niggas\nMy homies got the blickers, automatics no clickers\nHuh? Codeine, no liquor\nMan, life is a bitch, mine is a gold digger\nI'm fucked, let's fuck\nShe said she on her period, I said, \"Yuck\"\nI called another bopper, I beat it like a copper\nTwo big chain, one big chopper, bitch\n\nI got the chopper for the correspondence\nThe codeine got me standin' horizontal\nI had enough of the broken promises\nSo I'm in a room full of Pocahontas-es\nAnd this shit is of the meat rack\nWeed sack, big car, layin' with my seat back\nWe next, weed never left, holla, we back\nAll this ice on my and my niggas playing freeze tag\nLord forgive me, this my fourth foreign\nIf you baby daddy lame, you should forewarn him\nI come through with the yapper on\nTurn that nigga into hot bologna\nI'm the type of nigga cop a Rollie, cop a benz, cop a two\nThen wear it all to Church, nigga Hallelu'\nUh, I'm from the trap where the block'll pay you\nMe and my nigga pass your ho like a hot potato\nI be like you could get her, he be like you could get her\nI be like you could have her, he be like you could have her\nHe be like, it don't matter, I be like, me neither\nUh, my old school got twenty-sixes on it\nAnd I got you girl kissin' on me\n\nGood weed, bad bitch\nGot these hoes on my dick like Brad Pitt\nWhoa, I seen it all before\nThe bitch got a man, but she schemin' on the low\nHow it go? It go, fuck them other niggas 'cause I'm down for my niggas\nMy homies got the blickers, automatics no clickers\nHuh? Codeine, no liquor\nMan, life is a bitch, mine is a gold digger\nI'm fucked, let's fuck\nShe said she on her period, I said, \"Yuck\"\nI called another bopper, I beat it like a copper\nTwo big chain, one big chopper, bitch\n\nYuck Daddy! Yuck!\nYuck Daddy! Yuck!\nYuck-yuck-yuck Daddy!\nTwo big chain, one big chopper\nTwo big chain, one big chopper\nTwo big chain, one big chopper\nTwo big chain, one big chopper, bitch"}