{"song_id":25630,"song_name":"Thrift Shop","artist_id":1490130,"display_artist":"Macklemore & Ryan Lewis Featuring Wanz","spotify_id":"1CmUZGtH29Kx36C1Hleqlz","lyrics":"Hey, Macklemore, can we go thrift shopping?\n\nWhat? What? What? What?\nWhat? What? What? What?\nWhat? What? What? What?\nWhat? What? What? What?\nWhat? What? What? What?\nWhat? What? What? What?\nWhat? What? What? What?\nWhat? What? What? What?\n\nOw, ow, ow\n\nI'm gonna pop some tags\nOnly got twenty dollars in my pocket\nI'm, I'm, I'm hunting, looking for a come up\nThis is fucking awesome\n\nNow, walk into the club like \"What up? I got a big cock!\"\nNah, I'm just pumped, bought some shit from a thrift shop (Ho!)\nIce on the fringe is so damn frosty\nThe people like \"Damn, that's a cold-ass honky!\"\n\nRolling in hella deep, headed to the mezzanine\nDressed in all pink except my gator shoes, those are green (Ho!)\nDraped in a leopard mink, girl standing next to me\nProbably shoulda washed this, smells like R. Kelly's sheets (Piss)\nBut shit, it was ninety-nine cents!\n\nBag it, copping it, washing it, 'bout to go and get some compliments\nPassing up on those moccasins someone else been has walking in\nBummy and grudgy, fucking it, I am stunting and flossing and\nSaving my money and I'm hella happy, that's a bargain, bitch\n\nImma take your grandpa's style\nImma take your grandpa's style\nNo for real, ask your grandpa\nCan I have his hand-me-downs? (Thank you!)\n\nVelour jumpsuit and some house slippers\nDookie brown leather jacket that I found, dig it\nThey had a broken keyboard, I bought a broken keyboard\nI bought a skeet blanket, then I bought a knee board (Ho!)\n\nHello, hello, my ace man, my Mello\nJohn Wayne ain't got nothing on my fringe game, hell no\nI could take some Pro Wings, make them cool, sell those\nThe sneaker heads would be like \"Ah, he got the Velcros!\" (Ho!)\n\nI'm gonna pop some tags\nOnly got twenty dollars in my pocket (Ho!)\nI'm, I'm, I'm hunting, looking for a come up\nThis is fucking awesome\n\nOw, ow\nI'm gonna pop some tags\nOnly got twenty dollars in my pocket (Ho!)\nI'm, I'm, I'm hunting, looking for a come up\nThis is fucking awesome\n\nWhat you know about rocking a wolf on your noggin?\nWhat you knowing about wearing a fur fox skin? (Ho!)\nI'm digging, I'm digging, I'm searching right through that luggage\nOne man's trash, that's another man's come up (Ho!)\n\nThank your granddad for donating that plaid button-\nUp shirt, 'cause right now, I'm up in here stuntin'\nI'm at the Goodwill, you can find me in the (Uptons)\nI'm that, I'm that sucker searching in this section (Uptons)\n\nYour grammy, your aunty, your momma, your mammy\nI'll take those flannel zebra jammies, secondhand and rock that motherfucker\nThe built-in onesie with the socks on that motherfucker\nI hit the party and they stop in that motherfucker (Ho!)\n\nThey be like \"Oh that Gucci, that's hella tight!\"\nI'm like \"Yo, that's fifty dollars for a t-shirt!\"\nLimited edition, let's do some simple addition\nFifty dollars for a t-shirt, that's just some ignorant bitch shit\nI call that getting swindled and pimped, shit\nI call that getting tricked by a business (Ho!)\nThat shirt's hella dough\nAnd having the same one as six other people in this club is a hella don't (Ho!)\nPeep game, come take a look through my telescope\nTrying to get girls from a brand, man, you hella won't (Ho!)\nMan, you hella won't\n\nHo!\n\n(Goodwill... poppin' tags... yeah)\n\nOw, ow\n\nI'm gonna pop some tags\nOnly got twenty dollars in my pocket (Ho!)\nI'm, I'm, I'm hunting, looking for a come up\nThis is fucking awesome (Ho!)\n\nI'll wear your granddad's clothes\nI look incredible\nI'm in this big ass coat \nFrom that thrift shop down the road\n\nI wear your granddad's clothes (damn right)\nI look incredible (Now, c'mon, man)\nI'm in this big ass coat (big ass coat)\nFrom that thrift shop down the road (let's go)\n\nI'm gonna pop some tags\nOnly got twenty dollars in my pocket (Ho!)\nI'm, I'm, I'm hunting, looking for a come up\nThis is fucking awesome (Ho!)\n\nHa, ha, ha\nIs that your grandma's coat?"}