{"song_id":25771,"song_name":"Bad Ass","artist_id":"null","display_artist":"Kid Ink Featuring Meek Mill & Wale","spotify_id":"4RtkMgnsyyei3UKEGQ82JO","lyrics":"I'm feeling like the man of the hour, tear down that house\nI'm throwin' this money, like it's no runnin' out\nOkay, but I wanna know, can you get in the aisle\nAnd drop it down the pole, like it's a fire?\nNow let me see just what you doin' with your bad ass\nI can't help but watch you movin' with your bad ass\nLet me see just what you doin' with your bad ass\nI can't help but watch you movin' with your bad ass\n\nI'm feeling like a man of the hour, host of the evening,\nBut girl, it's your show, now bring it back, rerun\nI got pockets of hundreds, they say that change is irrelevant\nLookin' up in the sky, I said I love watching you elevate\nHigh as you ever been, we're gettin' hella bent\nBall so hard, I deserve me a Leatherman\nMan, let me see that cake, cake, cake, like Edmund's\nAss up, gon' take it down like a sedative\nThat's a negative, ain't nobody wetter than her\nBetter get familiar like a motherfuckerin' relative\nThough you see the fireworks, you lookin' where my section is\nAll this money fallin' in the air like it's confetti, bitch\n\nI'm feeling like the man of the hour, tear down that house\nI'm throwin' this money, like it's no runnin' out\nOkay, but I wanna know, can you get in the aisle\nAnd drop it down the pole, like it's a fire?\nNow let me see just what you doin' with your bad ass\nI can't help but watch you movin' with your bad ass\nLet me see just what you doin' with your bad ass\nI can't help but watch you movin' with your bad ass\n\nI'm the man of the hour, money and power\nAnd I'm on my Lafitte, so I let got that Geechee shit out me\nAnd the city is ours, where the killers devour\nWhere the niggas lift slippers, and the victims left a few flowers\nOkay?\nWhere the c-dog, know what I mean now, cool?\nBetter be loud when I leave that room\nKnowin' how you move, how you got good shoes\nWhen the heat on niggas be like \"whew...\"\nYoung nigga with some old riches\nIn the coldest swimming I be with, we on the cold bitches\nThe broad left me, I swear that I'm like p-noid, you get me? Dough -\nAnd of course she got them cakes but I'm tryin' to see that throat\n35-O-O my code\nWe high, chuggin' on that dope\nTurn around, girl let a nigga know\nDouble M, young Olu, go!\n\nI'm feeling like the man of the hour, tear down that house\nI'm throwin' this money, like it's no runnin' out\nOkay, but I wanna know, can you get in the aisle\nAnd drop it down the pole, like it's a fire?\nNow let me see just what you doin' with your bad ass\nI can't help but watch you movin' with your bad ass\nLet me see just what you doin' with your bad ass\nI can't help but watch you movin' with your bad ass\n\nI'm feelin' like the man of the hour, host of the evening\nThese niggas is haters, they know that we eatin'\nI got a bitch in Jamaica, find it tough when we speakin'\nI get your chick and I take her, talkin', got a boat for the weekend\nI'm just a young nigga out there ballin'\nAll these bad bitches callin'\nRollie off like a new obelisk\nIn the big Rolls Royce, can't park it\nGot gold rims on my Aston Martin\nNow I'm rollin' up in that foreign\nI said all my bitches bad, foreign\nAnd you can rent our last Aston Martin\nHold up -\nI flex hard on Instagram, post your bitch on InstaHam\nPyrex pots that's instant grams, drop that work that's instant bands\nAnd I'm sittin' man, on a couple mil'\nSwear my life's so fuckin' real\nBack to the wall like \"fuck the world\"\nAnd niggas say fuck me, I'm a fuck their girl\n\nI'm feeling like the man of the hour, tear down that house\nI'm throwin' this money, like it's no runnin' out\nOkay, but I wanna know, can you get in the aisle\nAnd drop it down the pole, like it's a fire?\nNow let me see just what you doin' with your bad ass\nI can't help but watch you movin' with your bad ass\nLet me see just what you doin' with your bad ass\nI can't help but watch you movin' with your bad ass\n\nNow go ahead with that bad ass, and fast cash, right, dash past\nThem silicones, that bad ass, got cheese out, the rat trap\nReal late night, no cat naps, you so acrobatic\nJust move it to the bass slap, the bass slap like the mackest\nNo question we turnt up, workin' on my fourth cup\nBeen throwin' all this money like the ass is for purchase\nVery important person, don't take it too personal\nGot more bottles than homies, it's a movie, ready for the show!\n\nShow off...\nShow off...\nShow off..."}