{"song_id":25790,"song_name":"R.I.P.","artist_id":431677,"display_artist":"Young Jeezy Featuring 2 Chainz","spotify_id":"2JJ5h2I1S0UR4tyD0U1I7K","lyrics":"Ya, what's up?\nThat's what I'm saying though,\nWe gotta hurry up so we can go to the club nigga, (2 Chainz)\n\nRIP We just killed the club,\nDrink patron out the bottle almost killed a thug\nWhen I'm so high, I can't feel the drugs\nToo many haters in here, I don't feel the love\n\nRIP, RIP, RIP (yeah) RIP (What)\nRIP, We just killed the club,\nDrink patron to the head, almost killed a thug (Let's go)\n\nI'm in a brand new dropped top 'rari with three bitches\nTired of being in middle trial with three snitches\nAnd I hit up every club in your city where niggas at?\nI be in every club in the hood, where niggas at?\nPulled up, jumped out stuntin like I was Baby\nI'm on my cocaine cowboy shit, like in the 80's\nWho a nigga think he is? Slick Rick or Danny Dane\nThink he Rakim or something, look at his chain\nWhy self from head to toe, I'm Dougie Fresh\nLookin' like I came to play Mitchell and Ness\nAny nigga with a watch like that he need attention\nYour man don't ball out like that, you need to bench him\n\nRIP, RIP, RIP (yeah) RIP (What)\nRIP, We just killed the club,\nDrink patron to the head, almost killed a thug (Let's go)\nRIP, RIP, RIP (yeah) RIP (What)\nRIP, We just killed the club,\nDrink patron to the head, almost killed a thug (Let's go)\n\nI'm gone, don't know where I'm going\nPockets on extra big, they on Somalian\nGot some bad bitches off in my section, just let some more in\nAnd every nigga that came here with me, kick your door in\nRoll up, pass it around like we Jamaican\nWhole pounds strapped up in this bitch like we so Haitian\nShe got good head, good brains, good education\nI'm drunker than a mother fucker heres the situation\n1: 45 AM the nine broken, by the time a nigga get to the crib the mall open\nMan the nerve of this hot ass bitch, she on the molly\nShe said she want me to call her Ms. Berry, she think she Halle\n\nRIP, RIP, RIP (yeah) RIP (What)\nRIP, We just killed the club,\nDrink patron to the head, almost killed a thug (Let's go)\nRIP, RIP, RIP (yeah) RIP (What)\nRIP, We just killed the club,\nDrink patron to the head, almost killed a thug (Let's go)\n\n(2 Chainz) Got a pocket full of dead bread\nAttached to your girl like a jpeg\nParty scene turn to a murder scene\nKeep shittin on niggas, need potty train\nTurn up, colligreen\nI'm on gasoline and I'm on that promethayzine\nLife ain't nothin' but a G thang, switch lane, get brain\nHand down her g-string\nI'm the type nigga that's built to last\nYou fuck with me, I put my foot in your ass\nI got a million in stash, I stack my money so tall\nThat you might need a giraffe, when you was counting this cash, nigga\n\nRIP, RIP, RIP (yeah) RIP (What)\nRIP, We just killed the club,\nDrink patron to the head, almost killed a thug (Let's go)\nRIP, RIP, RIP (yeah) RIP (What)\nRIP, We just killed the club,\nDrink patron to the head, almost killed a thug (Let's go)"}