{"song_id":25798,"song_name":"Power Trip","artist_id":276541,"display_artist":"J. Cole Featuring Miguel","spotify_id":"1EbWiEra7ovNsMq3DeLSDy","lyrics":"Got me up all night, all I'm singin' is love songs\nShe got me up all night, constant drinkin' and love songs\nShe got me up all night, down and out with these love songs\nShe got me up all night, drownin' out with these love songs\nShe got me up all night, all I'm singin' is love songs\nShe got me up all night, constant drinkin' and love songs\nShe got me up all night, down and out with these love songs\nShe got me open all night, got me open all night\n\nOkay, back when I was sleepin' in my mama's crib\nEven back then when I was up there in Mohammed crib\nPayin' seventeen-hundred for the rent, money well spent\nNo heater, but a nigga made heat, may I vent\nHad a thing for you, even wrote the song dreams for you\n'Cause I had dreams for you, thoughts of a ring for you\nChildish shit, you know childish shit\nAnonymous flowers sent, you know coward shit\nNow a nigga signed to Hov, took a power trip\nBack home I'm grown now and this city's my throne now\nThe same clubs I used to get tossed out\nLife got crisscrossed, totally crossed out\nCause now I'm in this bitch and I'm totally bossed out\nOld chicks cryin' 'cause they know that they lost out\nBut I'm still on you, I'm still on you\nMy drink spilled on me, while I feel on you\nI'm saying...\n\nWould you believe me if I said I'm in love?\nBaby, I want you to want me\nWould you believe me if I said I'm in love?\nBaby, I want ya\n\nAnd we are we are we are\nGot me up all night\nAnd we are we are we are\nAll I'm singin' is love songs\nAnd we are we are we are\nGot me up all night\nAnd we are we are we are\nShe got me\nAnd we are we are we are\nShe got me\n\nWell this has gotta be the longest crush ever\nIf I ever get to fuck it'd be the longest bust ever\nLove is a drug, like the strongest stuff ever\nAnd, fuck it I'm on one, you feel me?\nShe on a power trip, she got me where she want a nigga\nWifin' in the club, man my homies' gon' disown a nigga\nLike, give me 20 dolla, dolla\nAss stupid, how you get to college, college\nI'm in your city and I'm wonderin' if you're home now\nWent and found a man, but I'm hopin' you alone now\nCan't help but feelin' like I dropped the ball, cliche\nI used to pop up on you at the mall each day\nNow typically I kick game like Eastbay\nBut you got a nigga freeze-framed yellin', \"Please play!\"\nFor pete's sake, homie pull it together\nJust fuck her one time and be through it forever\nBut...\n\nWould you believe me if I said I'm in love?\nBaby, I want you to want me\nWould you believe me if I said I'm in love?\nBaby, I want ya\n\nGot me up all night, all I'm singin' is love songs\nShe got me up all night, constant drinkin' and love songs\nShe got me up all night, down and out with these love songs\nShe got me up all night, drownin' out with these love songs\nShe got me up all night, all I'm singin' is love songs\nShe got me up all night, constant drinkin' and love songs\nShe got me up all night, down and out with these love songs\nShe got me open all night, got me open all night"}