{"song_id":25848,"song_name":"Ready","artist_id":276136,"display_artist":"Fabolous Featuring Chris Brown","spotify_id":"3dTwLV3pAQ3OhEKPVG42fx","lyrics":"And baby we don't need a bed, no\nDon't need a master room, don't need to set the mood\nShe like, \"Yeah, yeah\"\nOne touch one touch, she gon' give me all the love\nShe's ready, so ready\nShe ready, so I'm ready\nI feel it comin' on strong, you're so heavy\nShe ready, I'm ready\n\nI hear if you stay ready, you ain't gotta get ready\nCall you when I get there, you just get your shit wetty\nOops I mean your shit ready, can't believe I said that\nLeast you know where my head at, now shorty where your head at\nShe gon' dive in head first, school me like the board of ed\nShe do it then we do it so she can say she thought ahead\nLaid up in that all day, can't get out that waterbed\nTalk nasty for ya boy, silent treatment for the feds\nNo cup for the thirsty, she bad as controversy\nSkin-tone like Hershey, body Lord have mercy\nYeah if this thing were a car, it'd be a Lamborghini Mercy\nMaybe I'm too fast, girl say she\n\nAnd baby we don't need a bed, no\nDon't need a master room, don't need to set the mood\nShe like, \"Yeah, yeah\"\nOne touch one touch, she gon' give me all the love\nShe's ready, so ready\nShe ready, so I'm ready\nI feel it comin' on strong, you're so heavy\nShe ready, I'm ready\n\nTalkin' 'bout you born ready, talkin' 'bout it's on deck\nTalk a good one on text, you say you 'bout it I'm gon' check\nI put some kisses on neck, let me warm that engine up\nRelax when the tension's up, girl you just call your nigga up\nAnd I pop up in that all black and kill that\nSee I'm dressed appropriate, you got to feel that\nFeel that? (I feel that)\nThat's that love comin' down\nFor the brain, I'm dumbin' down, we on swole when she come around\nNeed ice to numb it down, night stick to beat it up\nRodney King that teen girl, can't we all just get along?\nYou could get along, you already know, but is you ready though?\n\nAnd baby we don't need a bed, no\nDon't need a master room, don't need to set the mood\nShe like, \"Yeah, yeah\"\nOne touch one touch, she gon' give me all the love\nShe's ready, so ready\nShe ready, so I'm ready\nI feel it comin' on strong, you're so heavy\nShe ready, I'm ready\n\nIf you are a bad one, be ready (Be ready)\nTwo times for my niggas, we ready (We so ready)\nThree ladies in the V.I. and they ready (They so ready)\nI'm feelin' good, chillin' good, I'm ready (I'm ready, yo)\nLeft a girl in the back, she ready (She so ready)\nWe don't know how to act, we ready ('Cause we're ready)\nAnd we can't wait to get home (If you're ready, come on)\n\nAnd baby we don't need a bed, no\nDon't need a master room, don't need to set the mood\nShe like, \"Yeah, yeah\"\nOne touch one touch, she gon' give me all the love\nShe's ready, so ready\nShe ready, so I'm ready\nI feel it comin' on strong, you're so heavy\nShe ready, I'm ready"}