{"song_id":25890,"song_name":"Work","artist_id":5679878,"display_artist":"A$AP Ferg","spotify_id":"54oACFHRfeOa7VD0FTQSkJ","lyrics":"A$AP Ferg:\nI gotta close the window before I record\n'Cause New York don't know how to be quiet\nStand up! Ferg...\n\nCoogi, down, to the, socks, like I'm, Biggie poppa (Baby!)\nKeep your girl hit in my Tommy boxers\nBut really though, she a silly ho, 'cause you know the Fergenstein getting plenty dough\nShe don't get nothin' from a nigga though; all she get is hard dick and some Cheerios\nKinda silly though, but I'm lyrical, bet I put him in the dirt with the penny loafs\nNo tint though, on my window, so you see a nigga shining in the Benzo\nBallin'! Got me feelin' like Jim Jones\nI'm a pimp though, no limp though, couldn't copy my style in Kinkos\nPut in work, run up on a killer then I put him in the dirt\nRun up in the buildin', semi gon' squirt, that's what a nigga get when they gettin' on my nerves\nI ain't lyin' - lay 'em on the curb, ridin' on a killer who be coming at Ferg!\n(Damn!) Girl you twerk, twerk that kitty girl make it purr\nPut in work, Flacko put 'em in the dirt\nFrench got the shovel he gon' put him in the earth, Trinidad maniac with a all gold hearse\nYeah, uh, put in work, Schoolboy Q with a pound of the purp\nSo much work he'll smoke up the Earth - Polo Ground, A$AP World\n\nFrench Montana:\nThat ain't Kanye\nThat's Montana - loose cannon\nHe shot me so I had to do it\nPut him in the dirt, put him in it first\nI just sold a swammy with ten homies on it\nHer ass fat, you could park ten Tahoes on it\nWhen they mask up, comin' for your ice\nWhen they bare-faced, they comin' for your life\nBaby don't pray for me pray for the weak\nI'm drinkin' lean, it help me sleep\nIlluminati? I'm from the streets\nNever sold my body, we takin' bodies\n\nA$AP Ferg:\nPut in work, put in work\nPut in work, put 'em in the dirt\n\nTrinidad James:\nShout out that motherland, 12 years old with guns in hand\nThey don't ask no questions, nigga, all they do is BANG!\nBANG! BANG! They don't ask no questions\nAll they do is BANG! BANG!\nI said I do this for them shottas, Trinidad I love ya\nI do this for them shottas, Jamaica I'm your brother\nI know a bitch from VI, yeah yeah yeah that's my partner\nYou got a problem with it, then, then, then, then that's your problem\nI fuck with Asian niggas, and I fuck with Migos\nI fuck with Haitian niggas, all they speak is Creole\nI said all I speak is real, y'all niggas might hate me but\nThat don't get no deal, I said no that don't get no deal\nI just now got my deal, but I been gettin' this money\nNo green card in this struggle, immigration give you nothing\nBut, work... work... work\n\nA$AP Ferg:\nPut in work, put in work\nPut in work\n\nScHoolboy Q:\nYawk! yawk! yawk! yawk!\nA lotta niggas died, should've been from Hoover Street\nNo I do not have a car, but I could buy one every week\nPimpin' like I'm 33, move keys like I'm 36\nShip O's like I'm 28, Tacoma know I'm pushin' weight\nO-X-Y I'm in your state, eatin' off your dinner plate\nMy heart live where Santa stay, super fly, I need a cape\nBitches throwin' pussy back and forth, they on my dick\nPassion drippin' off her lip, she say she never had a crip\nUh, put in work, all big booties make ya twerk\nAll big titties lift your shirt, show a player what you're worth\nYeah, put in work, spray his ass in front the Church\nDeacon said I did my shit, the pastor said, \"That nigga turnt\"\nPop my collar on my shirt, make these bitches go berserk\nShippin' units, Captain Kirk, takin' xannies poppin' percs\nMight not last, I'll bomb ya first, turn your backseat to a hearse\nBack to the lab with mother Earth, had to give Young Ferg a verse\n\nA$AP Rocky:\nA lot of homies cried, due to crimes, homicide\nDrivin' by, poppin' nines, Pakistan, Columbine\nOut of line, pistols barkin' \"Ar! Ar!\" ride or die\nWrite a script, design a line, all I see is dollar signs\nYou want that pretty Flacko? Ratchets, designer jackets\nThe same niggas who jack it be the first who claim we faggots\nMy bitch is a movie actress, side bitch won a beauty pageant\nGot a chick that worked at Magic, but I'm so damn fine make a bitch look average\nSee my daddy in heaven, right next to Ferg's\nYou know what's up I'm throwin' bucks, Loaded Lux (Put in work!)"}