{"song_id":25914,"song_name":"Crooked Smile","artist_id":276541,"display_artist":"J. Cole Featuring TLC","spotify_id":"6JG0qhINKVwiHxqN85j7RG","lyrics":"I'm on my way, on my way, on my way down\nI'm on my way, on my way, on my way down\nYou're the one that was trying to keep me way down\nBut like the sun know you know I found my way back round\n\nLook\nThey tell me I should fix my grill 'cause I got money now\nI ain't gon' sit around and front like I ain't thought about it\nA perfect smile is more appealing but it's funny how\nMy shit is crooked look at how far I done got without it\nI keep my twisted grill, just to show them kids it's real\nWe ain't picture perfect but we worth the picture still\nI got smart, I got rich, and I got bitches still\nAnd they all look like my eyebrows: thick as hell\nLove yourself, girl, or nobody will\nOh, you a woman? I don't know how you deal\nWith all the pressure to look impressive and go out in heels\nI feel for you\nKilling yourself to find a man that'll kill for you\nYou wake up, put makeup on\nStare in the mirror but its clear that you can't face what's wrong\nNo need to fix what God already put his paint brush on\nYour roommate yelling, \"Why you gotta take so long?\"\nWhat it's like to have a crooked smile\nThis crooked smile\n\nI'm on my way, on my way, on my way down\nI'm on my way, on my way, on my way down\nYou're the one that was trying to keep me way down\nBut like the sun know you know I found my way back round\n\nTo all the women with the flaws, know it's hard my darling\nYou wonder why you're lonely and your man's not calling\nYou keep falling victim 'cause you're insecure\nAnd when I tell you that you're beautiful you can't be sure\nCause you see that no one wants you back and it got you asking\nSo all you see is what you lacking, not what you packing\nTake it from a man that loves what you got\nAnd baby girl you're a star, don't let 'em tell you you're not\nNow is it real? Eyebrows, fingernails, hair\nIs it real? if it's not, girl you don't care\n'Cause what's real is something that the eyes can't see\nThat the hands can't touch, that them broads can't be, and that's you\nNever let 'em see you frown\nAnd if you need a friend to pick you up, I'll be around\nAnd we can ride with the windows down, the music loud\nI can tell you ain't laughed in a while\nBut I wanna see that crooked smile\n\nI'm on my way, on my way, on my way down\nI'm on my way, on my way, on my way down\nYou're the one that was trying to keep me way down\nBut like the sun know you know I found my way back round\n\nCrooked smile, we could style on 'em (back 'round)\nCrooked smile, we could style on 'em (back 'round)\n(You're the one that was trying to keep me way down.\nLike the sun, I know you know I found my way back round..)\n\nWe don't look nothing like the people on the screen\nYou know them movie stars, picture perfect beauty queens\nBut we got dreams and we got the right to chase 'em\nLook at the nation, that's a crooked smile braces couldn't even straighten\nSeem like half the race is either on probation, or in jail\nWonder why we inhale, 'cause we in hell already\nI asked if my skin pale, would I then sell like Eminem or Adele?\nYo one more time for the 'Ville\nAnd fuck all of that beef shit, nigga let's make a mil\nHey officer man, we don't want nobody getting killed\nJust open up that cell, let my brother out of jail\nI got money for the bail now, well now\nIf you asking will I tell now? Hell naw\nI ain't snitching cause\nMan, they get them niggas stitches now\nIf you was around, then you wouldn't need a witness now\nHow you like this crooked smile?\n\nI'm on my way, on my way, on my way down\nI'm on my way, on my way, on my way down\nYou're the one that was trying to keep me way down\nBut like the sun know you know I found my way back round\n\nCrooked smile, we could style on 'em (back 'round)\nCrooked smile, we could style on 'em (back 'round)\n(You're the one that was trying to keep me way down.\nLike the sun, I know you know I found my way back round..)"}