{"song_id":25931,"song_name":"Feds Watching","artist_id":431852,"display_artist":"2 Chainz Featuring Pharrell","spotify_id":"2KeqHxbFQt1ZyzWeqQZSlt","lyrics":"Tomorrow, tomorrow\nTomorrow, tomorrow\nAin't no such thing as tomorrow\nThe way we living today\nDreads hang on the side\nNow everything Mr. Comme des Gar&#xE7;ons, Mr. Alexander Wang\nMr. Chain, pinky ring, flow insane, ho insane\nMan, these shoes I got on these are hardest I've done seen\nIt look clean where you pour I remix it make it dirty\nIf she got good head and text me I text back and tell her \"hurry\"\nIt's that category 5 when I walk up in the strip club\nThrow it high, make you and George Washington head butt\nOG's never fed us, now young niggas fed up\nBallin' so hard I deserve a and one\nBaking Soda marketing, I'm getting it ain't I? Obviously.\nYou a bitch, you a ho, that's just my philosophy\nAnd I'm known to kick it like the captain of a soccer team\nBillie Jean red leather same color red lobster\nAnd she brain wash ya \nI be fresh as hell if the Feds watching\n\nI'mma be fresh as hell if the Feds watching\nI'mma be fresh as hell if the Feds watching\nI'mma be fresh as hell if the Feds watching\nDrop top, head bobbing\n\nI'mma be fresh as hell if the Feds watching\nI'mma be fresh as hell if the Feds watching\nI'mma be fresh as hell if the Feds watching\nDrop top, head bobbing\n\nGrams to Grammy's, two guns Yosemite\nNiggas put their Glock on your ass, fuck that Heather B\nPumping that amphetamine, all this D I'm peddling\nI be somewhere settling, somewhere that you have never been\nTo the top you never been, you might need a respirator\nMoney on the rise like I'm counting on a elevator\nYou gon' need a detonator swimming with them barracudas\nPut the rocket on that ma'fucka prosecutor\nThis Armani, this Givenchy, I parachute you\nI'm so fly I jumped out the Air Wang Gucci (Tell 'em!)\nI'm raw, talking California Rolls\nSmoking California weed with California hoes (Truu!)\nSending flicks to my partners in the state pen\nI just got some pants made out off snake skin\nSee them shades you got on call Ray-Bans\nAnd the shade I got on cost eight bands\n\nI'mma be fresh as hell if the Feds watching\nI'mma be fresh as hell if the Feds watching\nI'mma be fresh as hell if the Feds watching\nDrop top, head bobbing"}