{"song_id":25930,"song_name":"I'm Out","artist_id":299324,"display_artist":"Ciara Featuring Nicki Minaj","spotify_id":"3c7MNgwEBQTnrOWLjU1DHq","lyrics":"Ciara:\nLadies, this your song, so as soon as this come on,\nYou should get out on the floor, gon' and get your sexy on...\nIf you know that you're better then the new girl that he on,\nGo 'head and tell him now, \"You gon' miss me when I'm gone...\"\n\nNicki Minaj:\nAyo, CiCi;\nLet me show you how to do a singing bitch greasy...\nYou was by Lenox, yeah, the one on Peachtree;\nI was with Dimitri - seen you on your Love and Hip Hop - Mendecees...\n\"F-f-f-f-fuck these petty niggas\" is a bitch motto;\nIf I say it on wax, every bitch follow...\nIf I'm sipping in the club, Myx Moscato;\nI got a big fat ass, big dicks follow...\nHit them with the back shots, hit them with the ass shots,\nTake them to the bank, then I hit them with the cash drops...\nI do it big, I hit them with the caps lock;\nI'm gonna ball, I hit them with the mascot...\nNo, I never been there, but I like to Bangkok;\nBig fat titties when they hanging out my tank top...\nYou gon' play me? On Instagram, nigga, trying to shade me?\nBut your bitch at home trying to play me? I'm Nicki M., Weezy F., baby;\nMan, fuck you and your lady! Gun butt you, 'cause you shady!\nNow which bitch want it? 'Cause that bitch get it;\nI gave him to you, bitch, don't fuckin' forget it...\n\nCiara:\nI just went through a break-up, (Ooh, yeah-yeah-yeah...)\nBut it's okay, I got my cake up... (Ooh, yeah-yeah-yeah...)\nDo my hair, put on some makeup; (Ooh, yeah-yeah-yeah...)\nTrying to see where tonight gon' take us... (Ooh, yeah-yeah-yeah...)\nI put some pics up looking sexy; (Ooh, yeah-yeah-yeah...)\nNow this nigga wan' text me... (Ooh, yeah-yeah-yeah...)\nHow much you wan' bet me (Ooh, yeah-yeah-yeah...)\nHe gonna regret the day he left me? (Ooh, yeah-yeah-yeah... ooh, yeah-yeah-yeah...)\n\nCelebratin' our breakin' up, oh, oh;\nBartender, go 'head and pour me a little more...\nTonight, we gon' have us a good time;\nLet's have a toast to our goodbyes... Oh, oh...\n\nLadies, this your song, so as soon as this come on,\nYou should get out on the floor, gon' and get your sexy on...\nIf you know that you're better then the new girl that he on,\nGo 'head and tell him now, \"You gon' miss me when I'm gone...\"\n\nI'm out...\nI'm out... (M-m-m-miss me when I'm gone...)\nI'm out...\nI'm out...\n\nNow tell me, do my ladies run this? (Ooh, yeah-yeah-yeah...)\nNot even Hammer can touch this... (Ooh, yeah-yeah-yeah...)\nWe standin' up on all the couches; (Ooh, yeah-yeah-yeah...)\nTomorrow, you gon' hear about this... (Ooh, yeah-yeah-yeah...)\n\nThis is what you hearin' through your speakers; (Ooh, yeah-yeah-yeah...)\nThat's why we dancin' till our feet hurt... (Ooh, yeah-yeah-yeah...)\nSee, I found out he was my problem; (Ooh, yeah-yeah-yeah...)\nTonight, I came out here to solve him... (Ooh, yeah-yeah-yeah... ooh, yeah-yeah-yeah...)\nYeah, yeah!\n\nCelebratin' our breakin' up, oh, oh;\nBartender, go 'head and pour me a little more...\nTonight, we gon' have us a good time;\nLet's have a toast to our goodbyes... Oh, oh...\n\nLadies, this your song, so as soon as this come on,\nYou should get out on the floor, gon' and get your sexy on...\nIf you know that you're better then the new girl that he on,\nGo 'head and tell him now, \"You gon' miss me when I'm gone...\"\n\nThe way I put it on you got you goin' trippy, trippy;\nYou wanna come back for it, wishin' you could get it, get it...\nNo-oh, oh-oh, oh-oh, oh...\nNo-oh, oh-oh, oh-oh, oh-oh!\nI got you hot - make you stop when you see me, see me;\nYou got your hand out, talking 'bout, \"Gimme, gimme!\"\nNo-oh, oh-oh, oh-oh, oh...\nNo-oh, oh-oh, oh-oh, oh-oh!\n\nNicki Minaj (& Ciara):\n(Ladies, this your song, so as soon as this come on,)\nSay \"fuck these petty niggas\", if these niggas did you wrong...\nIf he got a new bitch, then tell that bitch meet you outside,\nAnd pop her like a molly till them bitches recognize! (I'm out...)\nGrinning... (I'm out...)\nI'm winning - the end and the beginning,\nI send them on an errand, then I son them like my children;\nYou couldn't get a fan if it was hanging from the ceiling. (I'm out...)"}