{"song_id":25988,"song_name":"Helluva Night","artist_id":308504,"display_artist":"Ludacris","spotify_id":"0flKDWZq11997Fb2ptkQvu","lyrics":"It's about to be a hell of a night\nIt's about to be a hell of a night\nIt's about to be a hell of a night\nMustard on the beat, ho\nLuda!\n\nRollin' down the highway\nNothing for me to do but smoke, it's habitual Friday\nBreak it down, spread it out, nigga roll up\nAnd let's see what they about, call them hoes up\nLudacris, man these bitches want my last name\nSippin slow but I'm drivin' all in the fast lane\nGet the fuck up out my way, man, move bitch\nAnd hoodie yappin if you never wanna do shit\nI'm all about it, get yo mind right\nBeen making money since before I was in the lime light\nGrind like - bitch, wussup!\nTop down but I feel like getting fucked up\nI get high but the bass low\nA real nigga, watch a woman wanna shake fo\nWhen you shake it for a baller better shake it right\n'Cause it's about to be a hell of a night\n\nIt's about to be a hell of a night\nIt's about to be a hell of a night\nIt's about to be a hell of a night\nIt's about to be a hell of a night\n\nI'm fucked up - I'm fucked up\nI'm fucked up - I'm fucked up\nI'm high as hell - I'm high as hell\nI'm high as hell - I'm high as hell\n(It's about to be a hell of a night)\n\nClub packed and one nigga and they drink on\nJust lookin' for a reason to get they freak on\nCatch me up in the VIP and it's roaped off\nTo keep raggedy ass hoes off\nThen I'm bout to have a smoke off\nRich nigga but I'm tryna get broke up\nTurn it up as I make the beat break down\nAss up, face down\nYeah, that's still the best way to get it\nDown the middle, that's the best way to split it\nI'm talkin' money, disturbin the peace, racked up\nOne too many American black cards stacked up\nBacked up and it's on\nDon't get beat down till it's on\nI feel these hatin' ass niggas wanna fire\nWhat?\nIt's about to be a hell of a night\n\nIt's about to be a hell of a night\nIt's about to be a hell of a night\nIt's about to be a hell of a night\nIt's about to be a hell of a night\n\nI'm fucked up - I'm fucked up\nI'm fucked up - I'm fucked up\nI'm high as hell - I'm high as hell\nI'm high as hell - I'm high as hell\n(It's about to be a hell of a night)\n\nI'm always looking for trouble to get into\nTake your girlfriend's friends, bring friends too\nWhat you drinkin'? I got it all, pour it all up\nSo stay, my partners - they throw it all up\nI don't want a m&#xE9;nage so bitch let go\nI'm tryna get 3 women, play connect 4\nCongratulations, you made it into the top 5\nYour mouth help me, push the Bentley into Mach 5\nShe got me speedin in the red zone\nAlways Luda like they callin this the head zone\nHands up, I bread win and the bread's up\nSo make a peace sign, baby put yo legs up\nIs it really that good to ya?\nDo you like it when a nigga talk hood to ya?\nDo you like a little scratch, a little bite?\nWell, It's about to be a hell of a night\n\nIt's about to be a hell of a night\nIt's about to be a hell of a night\nIt's about to be a hell of a night\nIt's about to be a hell of a night\n\nI'm fucked up - I'm fucked up\nI'm fucked up - I'm fucked up\nI'm high as hell - I'm high as hell\nI'm high as hell - I'm high as hell\n(It's about to be a hell of a night)"}