{"song_id":26028,"song_name":"All Me","artist_id":301284,"display_artist":"Drake Featuring 2 Chainz & Big Sean","spotify_id":"5ngydCLbzCEdtu8SEOXhPU","lyrics":"I'm really stepping up my game\nThese bitches gotta start paying me for this\nCan't get no more free Randy\n\nGot everything, I got everything\nI cannot complain, I cannot\nI don't even know how much I really made, I forgot\nIt's a lot, fuck that, nevermind what I got\nNigga don't watch that 'cause I\nCame up, that's all me\nStay true, that's all me\nNo help, that's all me\nAll me forreal\nCame up, that's all me\nStay true, that's all me\nNo help, that's all me\nAll me forreal\n\nMoney on my mind, you should think the same\nJ's on, pinky ring\nDogging these hoes, I need quarantine\nIn the same league, but we don't ball the same\nShe want all the fame\nI hear that shit all the time\nShe said she love me\nI said, \"Baby girl, fall in line,\" ok\nMade a million, off of denim\nFuck, watch me switch it up\nWalked in, \"Ill nigga alert! Ill nigga alert!\"\nYou need that work, I got that work, got bitches in my condo\nJust bought a shirt that cost a Mercedes-Benz car note\nFrom the A to Toronto, we let the metal go off\nAnd my dick so hard it make the metal detector go off\nThis that sauce, this that dressing\nGivenchy, nigga God bless you\nIf having a bad bitch was a crime\nI'd be arrested (True)\n\nGot everything, I got everything\nI cannot complain, I cannot\nI don't even know how much I really made, I forgot\nIt's a lot, fuck that, nevermind what I got\nNigga don't watch that 'cause I\nCame up, that's all me\nStay true, that's all me\nNo help, that's all me\nAll me forreal\nCame up, that's all me\nStay true, that's all me\nNo help, that's all me\nAll me forreal\n\nI touched down at '86\nKnew I was a man by the age of 6\nI even fucked girls that used to babysit\nBut that's was years later on some crazy shit\nI heard your new shit, nigga hated it\nDamon Wayans told me don't play that shit\nI get paid a lot, you get paid a bit\nAnd my latest shit is like a greatest hits\nGod damn\nAin't no wishing over on this side\nY'all don't fuck wit' us and we don't fuck wit' y'all, it's no different over on this side\nGod damn\nShould I listen to everybody or myself?\nCause myself just told myself, \"You the motherfuckin' man, you don't need no help\"\nCashin' checks and I'm bigging up my chest,\nY'all keep talking 'bout who next,\nBut I'm about how big as it gets,\nI swear y'all just wastin' y'all breath,\nI'm the light skinned Keith Sweat,\nI'mma make it last forever,\nIt's not your turn 'cause I ain't done yet,\nLook, just understand that I'm on a roll like Cottonelle,\nI was made for all of this shit,\nAnd I'm on the road box office sales,\nI'm getting paid for all of this shit,\nAsk you to please excuse my table manners,\nI was making room for the table dancers,\n'Cause if we judging off your advances,\nI just got paid like eight advances, God damn!\n\nGot everything, I got everything\nI cannot complain, I cannot\nI don't even know how much I really made, I forgot\nIt's a lot, fuck that, nevermind what I got\nNigga don't watch that 'cause I\nCame up, that's all me\nStay true, that's all me\nNo help, that's all me\nAll me forreal\nCame up, that's all me\nStay true, that's all me\nNo help, that's all me\nAll me forreal\n\nHoe, shut the fuck up\nI got way too much on my mental\nI learn from what I've been through\nI'm finna do what I didn't do\nAnd still waking up like the rest do\nNot complicated, it's simple\nI got sexy ladies, a whole Benz-full\nAnd to them hoes I'm everythang\nEverything but gentle\nBut I still take my time\nMan I guess I'm just old fashioned\nWearing retro shit, that's old fashioned\nNigga, see what I'm saying, no closed caption\nI paint pics, see the shit\nGood sex, need to hit\nKeep a bra on the floor\nYear round like season tickets\nI plead the fifth\nDrink a fifth\nLoad the nine\nLeave you split, in the half\nSmoke a half, needles it\nMy new girl is on Glee and shit\nProbably making more money than me and shit\nI swear to God I got 99 Problems but a bitch ain't one\nI got 99 problems, getting rich ain't one\nLike I got trust issues\nI'm sorry for the people I've pushed out\nI'm the type to have a bullet-proof condom\nAnd still gotta pull out\nBut that's just me\nAnd I ain't perfect\nI ain't a saint but I am worth it\nIf it's one thing, I am worth it\nNiggas still hating but it ain't workin'\nLil' bitch\n\nAll Me. All Me. Oh my. I think I done fucked too many women from the 305\nBefore the end of this year, I'll do King of Diamonds, three more times,\nSmoking all that kush all in our section like its legalized\nGirl, you can't always have your way, sometimes it be like that\nThey don't really fuck with you like that, they ain't never did me like that\nI just took my time, you got your shine, I let you eat like that\nI been taught never to loan somebody what you need right back\nAnd I need that shit right back (no more free Randy)\nI'm less than a motherfucker,\nNiggas been stressed than a motherfucker\nNiggas gettin' nervous, touching they chests like a motherfucker,\nDamn that's a motherfucker\nTell the truth, I don't listen to ya,\n'Cause I don't like being lied to\nAnd that ship won't sail,\nAnd that wind won't guide you\nDaddy was in jail we was talkin' through the window,\nLike a motherfucking drive-through\nThat was back then man,\nNow my niggas rich enough to do whatever I do."}