{"song_id":26034,"song_name":"Own It","artist_id":301284,"display_artist":"Drake","spotify_id":"3EJ9ZuqkL1kwgouugqsLu8","lyrics":"Own it\nIt's yours\nIt's yours\n\nYours\nYou're still the one that I adore\nAin't much out there to have feelings for\nGuess who's it is? Guess who's it is?\nGuess who's it is? Guess who's it is?\nYours\nA few bottles on the table, a few waters\nIt ain't a secret, baby, everybody saw us\nGuess who's it is? Guess who's it is?\nGuess who's it is?\nIt's yours\n\nNext time we fuck, I don't want to fuck, I want to make love\nNext time we talk, I don't want to just talk, I want to trust\nNext time I stand tall I want to be standing for you\nAnd next time I spend I want it all to be with you\nPeaking, I'm peaking, wake up with me this weekend, weekend\nGuess who's it is?\nGuess who's it is? Guess who's it is?\nIt's yours\n\nOwn it, own it, own it, own it\nOwn it, own it, own it, own it\nOwn it, own it, own it, own it\nOwn it, own it, own it, own it\nI said go own that shit\nOwn that shit, own that shit\nOwn that shit, go own that shit\nOwn that shit, own that shit\nOwn that shit, own that shit\nGo own that shit\n\nOwn it, own it, own it, own it\nOwn it, own it, own it, own it\nOwn it, own it, own it, own it\nOwn it, own it, own it, own it\nI said go own that shit\nOwn that shit, own that shit\nOwn that shit, go own that shit\nOwn that shit, own that shit\nOwn that shit, own that shit\nGo own that shit\n\nNiggas talk more than bitches these days\nJust let that shit sink in\nNiggas talk more than bitches these days\nWho could get the pussy quicker these days\nStill straight with the weed and the liquor these days\nCause the new drugs got the kids trippin' these days\nBunch of journalists been searchin' for a story\nMy ex-girl been searchin' for a \"sorry\"\nCouple bitches tryin' to have me on the Maury like nigga it's yours\nYou should be supportin' but where you been at? On tour, gettin' money\nY'all don't even really check for me\nYou ain't even hit me when that nigga had threats for me\nGirl, you don't love me, you just say that shit to get to me\nGirl, cause you got the Batphone in my workline\nYou should call it\nWhen the last time you did something for the first time?\nYou have done it all, swear to God\nNiggas talk more than bitches these days\nGot you thinkin' I'm different these days\nBroken telephone for every single conversation\nBy the time it gets to you, shit switches these days\nIt's yours, it's your, it's yours, it's always gonna be yours\n\nOwn it, own it, own it, own it\nOwn it, own it, own it, own it\nOwn it, own it, own it, own it\nOwn it, own it, own it, own it, own it\nIt's yours, yeah\nIt's yours, own it\nOwn It\nOwn It\nOwn It\nOwn It\nBaby, own it\nIt's yours\nOwn that shit, own that shit\nOwn that shit"}