{"song_id":26032,"song_name":"Pound Cake / Paris Morton Music 2","artist_id":301284,"display_artist":"Drake Featuring Jay Z","spotify_id":"1HDaPtZuixue2q6VGNRdVO","lyrics":"\"Good God Almighty. Like back in the old days. You know, years ago they had the A&R men to tell you what to play, how to play it and you know whether it's disco and rock but we just went in the studio and we did it. We had champagne in the studio, of course, you know, compliments of the company, and we just laid back and did it. So we hope you enjoy listening to this album half as much as we enjoyed playing it for you. Because we had a ball. Only real music is gonna last, all the other bullshit is here today and gone tomorrow...\"\n\nCash rules everything around me\nC.R.E.A.M. get the money\nDolla dolla bill y'all\n\nAfter hours of Il Mulino\nOr Sotto Sotto, just talkin' about women and vino\nThe contract like '91 Dan Marino\nI swear this got Michael Rapino boostin' my ego\nOverly focused, it's far from the time to rest now\nDebates growin' 'bout who they think is the best now\nTook a while, got the jokers out of the deck now\nHoldin' all the cards and niggas wanna play chess now\nI hear you talkin', say it twice so I know you meant it\nFuck it, I don't even tint it, they should know who's in it\nI'm authentic, real name, no gimmicks\nNo game, no scrimmage, I ain't playin' with you niggas at all\nMy classmates, they went on to be chartered accountants\nOr work with their parents, but thinkin' back on how they treated me\nMy high school reunion might be worth an appearance\nMake everybody have to go through security clearance\nTables turn, bridges burn, you live and learn\nWith the ink, I could murder word to my nigga Irv\nYeah, I swear shit just started clickin' dog\nYou know it's real when you are who you think you are\n\nCash rules everything around me\nC.R.E.A.M. get the money\nDolla dolla bill y'all\n\nI had Benzes 'fore you had braces\nThe all black Maybach but I'm not a racist\nInside's whiter than Katy Perry's face is\nYellow diamonds in my Jes&#xFA;s\nI just might learn to speak Mandarin\nJapanese for the yen that I'm handlin'\nInternational Hov, that's my handle\nMy saint's Sean Don, light a candle\nEl Gran Santo on the mantle\n'Case y'all didn't know, I speak Spanish too\nShoutout to Worldwide Wes\nEverywhere we go we leave a worldwide mess\nYes, still Roc La Familia\nSays a lot about you if you not feelin' us\nThe homie said \"Hov, there ain't many of us\"\nI told him less is more, nigga it's plenty of us\n\nCash rules everything around me\nC.R.E.A.M. get the money\nDolla dolla bill y'all\n\nCake, cake cake cake cake cake\n500 million, I got a pound cake\nNiggas is frontin', that's upside-down cake\nGet 'em a red nose, they clown cakes\nThey shoulda' never let you 'round cake\nLook at my neck, I got a carrot cake\nNow here's the icing on the cake\nCake, cake cake cake cake\nI'm just gettin' started, oh yeah we got it bitch\nI've done made more millionaires than the lotto did\nDame made millions, Bigg made millions\nYe made millions, Just made millions\nLyor made millions, Cam made millions\nBeans tell you if he wasn't in his feelings\nI'm back in my bag\nMy eyes bloodshot but my jet don't lag\nA pair of Jordan 3's tryna chase this cash\nGucci air bag just in case we crash\nUh, last night was mad trill\nFresh out of Advil, Jesus grab the wheel\n\nFuck all that happy to be here shit that y'all warned me on\nI'm the big homie, they still tryna lil bro me dog\nLike I should fall in line, like I should alert niggas\nWhen I'm 'bout to drop somethin' crazy and I say I'm the greatest of my generation\nLike I should be dressin' different\nLike I should be less aggressive and pessimistic\nLike I should be way more nervous and less dismissive\nLike I should be on my best behavior\nAnd not talk my shit and do it major like the niggas who paved the way for us\nLike I didn't study the game to the letter\nAnd understand that I'm not doin' it the same, man, I'm doin' it better\nLike I didn't make that clearer this year\nLike I should feel, I don't know, guilty for saying that\nThey should more mirrors in here so I can stare at myself\nThese are usually just thoughts that I share with myself\nBut I thought Fuck It its worth it to share it with someone else more than Paris for once"}