{"song_id":26033,"song_name":"From Time","artist_id":301284,"display_artist":"Drake","spotify_id":"10VBBaul4zVD0reteuIHM2","lyrics":"What's up? Been a minute since we kicked it\nYou've been caught up with them bitches\nI don't get it, you're a star love\nYou shouldn't have to deal with that\nI'll never make you feel like that\n\n'Cause I love me, I love me enough for the both of us\nThat's why you trust me, I know you been through more than most of us\nSo what are you, what are you, what are you so afraid of?\nDarling you, you give but you cannot take love\n\nI needed to hear that shit, I hate when you're submissive\nPassive aggressive when we're texting, I feel the distance\nI look around the peers that surround me, these niggas tripping\nI like when money makes a difference but don't make you different\nStarted realizing a couple places I can take it\nI want to get back to when I was that kid in the basement\nI want to take it deeper than money, pussy, vacation\nAnd influence a generation that's lacking in patience\nI've been dealing with my dad, speaking a lack of patience\nJust me and my old man getting back to basics\nWe've been talking 'bout the future and time that we wasted\nWhen he put that bottle down, girl that nigga's amazing\nWell, fuck it, we had a couple Coronas\nWe might have rolled a white paper, just something to hold us\nWe even talked about you and our couple of moments\nHe said we should hash it out like a couple of grown ups\nYou a flower child, beautiful child, I'm in your zone\nLooking like you came from the 70's on your own\nMy mother is 66 and her favorite line to hit me with is\nWho the fuck wants to be 70 and alone?\nY'all don't even know what you want from love anymore\nI search for something I'm missing and disappear when I'm bored\nBut girl, what qualities was I looking for before?\nWho you settling for? Who better for you than the boy, hah?\n\n'Cause I love me, I love me enough for the both of us\nThat's why you trust me, I know you been through more than most of us\nSo what are you, what are you, what are you so afraid of?\nDarling you, you give but you cannot take love\n\nThinkin' about Texas back when Porsche used to work at Treasures\nOr further back then that, before I had the Houston leverage\nWhen I got Summer a Michael Kors with my momma's debit\nA weak attempt at flexing, I'll never forget it\nCause that night I played her three songs\nThen we talked about something we disagreed on\nThen she started telling me how I'll never be as big as Trey Songz\nBoy was she wrong, that was just negative energy for me to feed off\nNow it's therapeutic blowing money in a galleria\nOr Beverly Center Macy's where I discovered Bria\nLandmarks to the 'muses that inspired the music\nWhen I could tell it was sincere without trying to prove it\nThe one that I needed was Kourtney from Hooters on P Street\nI've always been feeling like she was the piece to complete me\nNow she engaged to be married, what's the rush on commitment?\nKnow we were going through some shit, name a couple that isn't\nRemember our talk in the parking lot at the Ritz\nGirl I felt we had it all planned out, guess I fucked up the vision\nLearning the true consequences of my selfish decisions\nWhen you find out how I'm living I just hope I'm forgiven\nIt seems like you don't want this love anymore\nI'm acting out in the open it's hard for you to ignore\nBut girl, what qualities was I looking for before?\nWho you settling for, who better for you than the boy, huh?\n\n'Cause I love me, I love me enough for the both of us\nThat's why you trust me, I know you been through more than most of us\nSo what are you, what are you, what are you so afraid of?\nDarling you, you give but you cannot take love"}