{"song_id":26040,"song_name":"Gone","artist_id":276709,"display_artist":"Kanye West Featuring Cam'ron & Consequence","spotify_id":"5RjbFGeWVsCpw8EcE8OrvZ","lyrics":"Otis Redding and Kanye West:\nWished I had told\nOoh was the only one (Uh oh)\nBut it's too late\nIt's too late, he's gone\n\nKanye West:\nYou sweat her and I ain't talkin' 'bout a Coogi\nYou a Big L and I ain't talkin' 'bout Cool J\nSee me at the airport, at least twenty Louis\nTreat me like the Prince and this my sweet brother Numpsay\n(Brother Numpsay) Groupies say I'm too choosy\nTake 'em to the show and talk all through the movies\nSays she want diamonds, I took her to Ruby Tuesdays\nIf we up in Fridays, I still have it my way\n\nOtis Redding, Cam'ron, and Kanye West:\n(Gone) We striving home\n(Gone) (I ride on chrome), it's too late\n\nKanye West:\nY'all don't want no prob' from me\nWhat you rappers could get is a job from me\nMaybe you could be my intern\nAnd in turn, I'll show you how I cook up summer in the winter\nAaron love the raw dog, when will he learn?\nCaught something on the Usher tour, he had to let it burn\nPlus he already got three children\nArguin' over babysitters like, \"Bitch it's yo' turn\"\n\"Damn Ye it'd be stupid to diss you\nEven your superficial raps is super-official\"\nRoc pastel with Gucci on\nWith TV's in the ride, throw a movie on\nSaid he couldn't rap, now he at the top with Doobie Long\n'Cause I dookied on any song that they threw me on, gone\n\nCam'ron and Otis Redding:\nWe striving home, gone\n(I ride on chrome), gone\nWe striving home, gone\n(Killa, I ride on chrome)\n\nKnock knock, who's there? Killa Cam, Killa who?\nKilla Cam, hustler, grinder, guerilla true\nOh my chinchilla blue, blue you ever dealt with a dealer\nWell here's the deal, ma we going to the dealer, woo\nNo concealing, no ceiling I don't need a roof\nAct up, get out, I don't need you poof\nPoof be gone, damn tough luck dag\nDag, niggas still doing puff-puff-pass\nPull the truck up fast and I tell em\nHey back in a touched up Jag shit\nY'all niggas wanna get in Cam's cerebellum\nAn old man just gon' tell em, \"Too late, he's gone\"\nThen I see how y'all gonna react when I'm gone\nMy last girl want me back then I'm on\nFine stay, you got the grind hey\nCame back, read what the sign say, \"Too late, he's gone)\nYes I know you wanna see my demise\nYeah you church boy, acting like a thief in disguise\nAin't even my size, see the greed in my eyes\nAsk Abby, I hustle, brought weed to the Chi, shit\nAnd that ain't even a lie, please believe me\nGave Weezie a piece of the pie and\nYou can ask George or Regina\nThe whole West Side I explore with the Bimmer now\n\nWe striving home\nI ride on chrome\nListen, homeboy, move on\nThat's your best bet, why's that, Cons?\n\nConsequence:\nI been pouring out some liquor for the fact that my pal's gone\nAnd trying to help his mama with the fact that her child gone\nAnd since we used to bubble like a tub full of Calgon\nGuess it's only right that I should help her from now on\nBut since they got afoul on, what could've gone wrong?\nNow they asking Cons, \"How long has this gone on?\"\nAnd maybe all this money might have gone to my head\n'Cause they got me thinking money might have gone to the Feds\nSo I had gone to the dread, but he had gone up to bed\nAnd when I came the next morning he was gone with my bread\nAnd with that being said I had gone on my instincts\nAnd gone to the spots where they go to get mixed drinks\nBut looking back now, I should've gone to the crib\nAnd rented Gone With the Wind 'cause I'd a-gone in by ten\nBut I had gone with my friend, and we had gone to the bar\nAnd heard a nigga talking shit so I had gone to the car\nAnd now the judge is telling me that I had gone too far\nAnd now we gone for twenty years doing time behind bars\nAnd since I gone to a cell for some petty crimes\nI guess I gone to the well one too many times 'cause I'm gone\n\nKanye West:\nI'm ahead of my time, sometimes years out\nSo the powers that be won't let me get my ideas out\nAnd that make me wanna get my advance out\nAnd move to Oklahoma and just live at my aunt's house\nYeah, I romance the thought of leaving it all behind\nKanye step away from the lime\nLight like when I was on the grind in the 1999\nBefore model chicks was bending over\nOr dealerships asked me, \"Benz or Rover\"\nMan, if I could just get one beat on Hova\nWe could get up off this cheap-ass sofa\nWhat the summer of the Chi got to offer an eighteen-year-old\nSell drugs or get a job, you gotta play your role\nMy dog worked at Taco Bell, hooked us up plural\nFired a week later, the manager count the churros\nSometimes I can't believe it when I look up in the mirro'\nHow we out in Europe, spending Euros\nThey claim you never know what you got till it's gone\nI know I got it, I don't know what y'all on\nI'mma open up a store for aspiring emcees\nWon't sell 'em no dream, but the inspiration is free\nBut if they ever flip sides like Anakin\nYou'll sell everything including the mannequin\nThey got a new bitch, now you Jennifer Aniston\nHold on, I'll handle it, don't start panickin', stay calm\nShorties at the door 'cause they need more\nInspiration for they life, they souls, and they songs\nThey said, \"Sorry, Mr. West is gone\""}