{"song_id":26054,"song_name":"V.S.O.P.","artist_id":276636,"display_artist":"K. Michelle","spotify_id":"4fOjmiTtXM59fg02zAoYnD","lyrics":"Hit the lights - can't let no one see me get down;\nIt's alright, I know they think I get around...\nYou and I got something they can't know about;\nReally, only heaven knows my heart...\n\nYou know this ain't an ordinary love;\nWe got so much history in the stories about us,\nSo come on over, baby...\n\nWe gon' light some candles tonight - very special...\nWe gon' do whatever you like - very special...\nGot some Henny chillin' on ice - very special...\nHope you make the rest of my life very special...\n(Ooh, oh...) Very special...\n(Ooh, oh...) All night...\n\nWarm my bed - it's a little cold on your shoulder;\nMama said I would understand when I'm older...\nIn my head, even if you tell me it's over,\nI'll pretend you told me I'm your all...\n\n'Cause you know this ain't an ordinary love;\nWe got so much history in the stories about us,\nSo come on over, baby...\n\nWe gon' light some candles tonight - very special...\nWe gon' do whatever you like - very special...\nGot yo' Henny chillin' on ice - very special...\nHope you make the rest of my life very special...\n(Ooh, oh...) Very special...\n(Ooh, oh...) All night...\n\n\"He ain't supposed to be with you,\" that's what everybody gon' tell me;\nBut I can't really count on what everybody gon' tell me...\nShe ain't seen her baby in a couple days,\nAnd I'm looking my baby right up in his face...\nFlowers and gifts, restaurants - I swear he buy me anything I want;\nThat's why I'm so quick to put that music on for him - listen to it, baby, yeah!\n\nWe gon' light some candles tonight - very special... (We gon' light some candles...)\nWe gon' do whatever you like (Whatever you like...) - very special...\nGot some Henny chillin' on ice - very special... (Got some Henny chillin' on ice for you, baby...)\nHope you make the rest of my life very special... (I hope you make the rest of my night - oh, oh, oh, oh...)\n(Ooh, oh...) Very special...\nOoh, oh - very special!\n(Ooh, oh - very special...) Oh, oh...\n(Ooh, oh...) All night...\n\nWe drinkin'... (Ooh, oh - very special...)\nOh, we buyin'... (Ooh, oh - very special...)\nOh, and pourin', yeah... (Ooh, oh - very special...)\n(Ooh, oh...) All night..."}