{"song_id":26102,"song_name":"PYD","artist_id":305459,"display_artist":"Justin Bieber Featuring R. Kelly","spotify_id":"1FWpaiAz7ZVrfzkYlnY6W0","lyrics":"Justin Bieber\nPYD PYD PYD (PYD)\nPYD PYD PYD\nI'mma put you down\nPYD PYD PYD\nPYD PYD PYD\nI'mma put you down\nPYD PYD PYD\nAll the way down\n\nFrom the door to the wall\nCoffee table, girl get ready\nI'mma put you down (PYD PYD PYD)\nAll the way down (PYD PYD PYD)\nFrom the stove to the countertop dining room table, are you ready?\nI'mma put you down (PYD PYD PYD, PYD PYD PYD)\nUp the stairs to my bedroom, light a few candles, prepare yourself\nI'mma put you down (PYD PYD PYD)\nAll the way down (PYD PYD PYD)\nOn a plane, a train, an automobile doesn't matter\nI'mma put you down (PYD PYD PYD)\nAll the way down (PYD PYD PYD)\nAnd it don't make no sense to be that bad\nI'mma take it out on you babe (PYD PYD PYD)\nPut you down\nThis will show you how much I love you, form of appreciation\nI'mma put you down (PYD PYD PYD)\nOoh 'cause you deserve the best and nothing but the best so I'll give you the best you ever had\nI&#x2019;mma put you down (PYD PYD PYD, PYD PYD PYD)\nI&#x2019;mma put you down\n\nR. Kelly\nOn the roof, balcony, we don't care who sees\nGirl, I'mma put you down (PYD PYD PYD)\nAll the way down, down, down (PYD PYD PYD)\nAfter the club, in the parking lot\nI don't care anywhere, you could pick the spot, whatever\nI'mma put you down yeah (PYD PYD PYD)\nAll the way down yeah (PYD PYD PYD)\n'Cause I been doin' forensics on your body in this club\nAnd I could tell the way you walk your body ain't been touched the right way\nIt seems your man been treating you like a step-child\nSub him out, sub me in\nAnd I'mma get on the floor and shut the whole game down (yeah)\nUntil I hear you cheering babe (PYD PYD PYD)\nHave you spellin' out my name babe\nSee I wanna give my love\nBe your dope man in the bedroom\nYou can make me your drug babe\nAnd it don't make no sense to be that bad, oh no baby (PYD PYD PYD)\nI'm gunna put you down\nGonna show you how much I love you, form of appreciation, yeah no ooh\n(PYD PYD PYD)\nOoh 'cause you deserve the best and nothing but the best so I'll give you the best you&#x2019;ve ever had\nI&#x2019;m gonna put you down (PYD PYD PYD)\nI&#x2019;m gonna put you down, all the way down\n\nJustin Bieber and R. Kelly\nOoh 'cause you deserve the best and nothing but the best so I'll give you the best you&#x2019;ve ever had\nI&#x2019;mma put you down (I&#x2019;mma put you down)\nI&#x2019;mma put you down\nI&#x2019;mma put you down\nI&#x2019;mma put you down yeah\n\nI'mma put you down\nPut you down, put you down, put you down, put you down, PYD PYD\nPut you down, put you down, put you down, put you down, PYD PYD\nI'mma put you down, put you down, put you down, put you down, PYD PYD\nAll the way down\nPut you down, put you down, put you down, put you down, PYD PYD\nPYD, PYD, PYD\nPYD PYD PYD\nI'mma put you down\nPYD PYD PYD"}