{"song_id":26134,"song_name":"Drunk In Love","artist_id":281569,"display_artist":"Beyonce Featuring Jay-Z","spotify_id":"5EmCpD8tUj78VW3kgaEjME","lyrics":"Beyonc&#xE9;\nI've been drinking, I've been drinking\nI get filthy when that liquor gets into me\nI've been thinking, I've been thinking\nWhy can't I keep my fingers off it, baby?\nI want you, na na\nWhy can't I keep my fingers off it, baby?\nI want you, na na\n\nCigars on ice, cigars on ice\nFeeling like an animal with these cameras all in my grill\nFlashing lights, flashing lights\nYou got me faded, faded, faded\n\nBaby, I want you, na na\nCan't keep your eyes off my fatty\nDaddy, I want you, na na\nDrunk in love, I want you\n\nWe woke up in the kitchen saying\n\"How the hell did this shit happen?\", oh baby\nDrunk in love, we be all night\nLast thing I remember is our\nBeautiful bodies grinding off in that club\nDrunk in love\n\nWe be all night, love, love\nWe be all night, love, love\n\nWe be all night, and everything alright\nNo complaints with my body, so fluorescent under these lights\nBoy, I'm drinking, park it in my lot, 7 Eleven\nI'm rubbing on it, rub-rubbing on it\nIf you scared, call that reverend\n\nBoy, I'm drinking, get my brain right\nArmand de Brignac, gangster wife\nNew sheets, he sweat it out like wash rags, he wet it up\nBoy, I'm drinking, I'm singing on the mic till my voice hoarse\n\nThen I fill the tub up halfway then ride it with my surfboard\nSurfboard, surfboard\nGraining on that wood, graining, graining on that wood\nI'm swerving on that, swerving, swerving on that big body Benz\nServing all this, swerve, surfing all of this good, good\n\nWe woke up in the kitchen saying\n\"How the hell did this shit happen?\", oh baby\nDrunk in love, we be all night\nLast thing I remember is our\nBeautiful bodies grinding off in that club\nDrunk in love\n\nWe be all night, love, love\nWe be all night, love, love\n\nJay-Z\nHold up\nThat D'uss&#xE9; is the shit if I do say so myself\nIf I do say so myself, if I do say so myself\nHold up, stumble all in the house time back up all that mouth\nThat you had all in the car, talking 'bout you the baddest bitch thus far\nTalking 'bout you be repping that Third, wanna see all that shit I heard\n\nKnow I sling Clint Eastwood, hope you can handle this curve, uh\nForeplay in the foyer, fucked up my Warhol\nSlid the panties right to the side\nAin't got the time to take drawers off, on sight\n\nCatch a charge I might, beat the box up like Mike\nIn '97 I bite, I'm Ike Turner, turn up\nBaby no I don't play, now eat the cake, Anna Mae\nSaid, \"Eat the cake, Anna Mae!\"\n\nI'm nice, for y'all to reach these heights, you gon' need G3\n4, 5, 6 flights, sleep tight\nWe sex again in the morning, your breasteses is my breakfast\nWe going in, we be all night\n\nBeyonc&#xE9;\nWe be all night, love, love\nWe be all night, love, love\n\nNever tired, never tired\nI been sippin', that's the only thing\nThat's keeping me on fire, me on fire\nDidn't mean to spill that liquor all on my attire\n\nI've been drinking watermelon\n(I want your body right here, daddy I want you, right now)\nCan't keep ya eyes off my fatty\nDaddy I want you\n\nWe be all night, love, love\nWe be all night, love, love"}