{"song_id":26206,"song_name":"Fancy","artist_id":5694588,"display_artist":"Iggy Azalea Featuring Charli XCX","spotify_id":"2OR6U0ofkWeQgNCyaHxwoc","lyrics":"Iggy\nFirst things first, I'm the realest (realest)\nDrop this and let the whole world feel it (let 'em feel it)\nAnd I'm still in the Murda Bizness\nI can hold you down like I'm givin' lessons in physics (right, right)\n\nYou should want a bad bitch like this (ha)\nDrop it low and pick it up just like this (yeah)\nCup of Ace, cup of Goose, cup of Cris\nHigh heels, somethin' worth a half a ticket on my wrist (on my wrist)\n\nTakin' all the liquor straight, never chase that (never)\nRooftop like we bringin' '88 back (What?)\nBring the hooks in, where the bass at?\nChampagne spillin', you should taste that\n\nCharli\nI'm so fancy, you already know\nI'm in the fast lane from L.A. to Tokyo\nI'm so fancy, can't you taste this gold?\nRemember my name, 'bout to blow\n\nIggy\nI said baby, I do this, I thought that you knew this\nCan't stand no haters and honest, the truth is\nAnd my flow retarded, they speak it, depart it\nSwagger on super, I can't shop at no department\n\nBetter get my money on time, if they not money, decline\nAnd swear I meant that there so much that they give that line a rewind\nSo get my money on time, if they not money, decline\nI just can't worry 'bout no haters, gotta stay on my grind\n\nNow tell me, who that, who that? That do that, do that?\nPut that paper over all, I thought you knew that, knew that\nI be that I-G-G-Y, put my name in bold\nI been working, I'm up in here with some change to throw\n\nCharli\nI'm so fancy, you already know\nI'm in the fast lane from L.A. to Tokyo\nI'm so fancy, can't you taste this gold?\nRemember my name, 'bout to blow\n\nTrash the hotel\nLet's get drunk on the mini bar\nMake the phone call\nFeels so good getting what I want\n\nYeah, keep on turning it up\nChandelier swinging, we don't give a fuck\nFilm star, yeah I&#x2019;m deluxe\nClassic, expensive, you don't get to touch, ow!\n\nIggy\nStill stunting, how you love that?\nGot the whole world asking how I does that\nHot girl, hands off, don't touch that\nLook at that I bet you wishing you could clutch that\n\nThat's just the way you like it, huh?\nYou're so good, he's just wishing he could bite it, huh?\nNever turn down money\nSlaying these hoes gold trigger on a gun like\n\nCharli\nI'm so fancy, you already know\nI'm in the fast lane from L.A. to Tokyo\nI'm so fancy, can't you taste this gold?\nRemember my name, 'bout to blow\n\nIggy and Charli\nWho that, who that? I-G-G-Y\nThat do that, do that? I-G-G-Y\nWow, who that, who that? I-G-G-Y\n(Blow...)\n\nWho that, who that? I-G-G-Y\nThat do that, do that? I-G-G-Y\nWow, who that, who that? I-G-G-Y\n(Blow...)"}