{"song_id":26205,"song_name":"The Devil Is A Lie","artist_id":365033,"display_artist":"Rick Ross Featuring JAY Z","spotify_id":"3tyMU1dWR7s7IC4tnNG1R5","lyrics":"Masterminds! We gon' get this forever\nYou know whenever we link up, my nigga\nThey think this shit comes from outer space or something\nNigga, let's get this money nigga\nMasterminds, R-O-C, double M-G!\nJay, I got it, I got it\n\nFour stacks for the heels on my bitch feet\nCar seats still smelling like 10 ki's\nTell a plug that I'm lookin' for increase\nWingstop, fat boy need a 10 piece\nSay a nigga name and the car start\nNigga switching lane to lane like WalMart\nSippin Bordeaux out in Bordeaux\nHazard lights flashing on the four-door\nSwitch the Benzo for the Enzo\nBack to the Benzo when the ends low\nSwitch my old bitch for my new bitch\nCause my new bitch something like a nympho\nFuck the game raw when I came in it\nGetting money ever since I came in it\nYou couldn't stop me if you tried\nMotherfucker cause the devil is a lie\n\nBig guns and big whips\nRich nigga talkin' big shit\nDouble cup, gold wrist\nDouble up on that blow, bitch!\nTwo mil on that I-95\nBow your head 'cause it's time to pay tithes\nOpposition want me dead or alive\nMotherfucker but the devil is a lie\nThe devil is a lie, bitch I'm the truth\nThe devil is a lie, bitch I'm the proof\nThe devil is a lie, the devil is a lie\nBitch I'm alive, the devil is a lie\n\nTwo kings on the big screen\nNiggas seen a 36 at 16\n100k for the 16\nNigga's stick dirty but his dick clean\nMy money goin' on the deep end\nTalkin' half a milli for the weekend\nContract like a nigga play defense\nCurtains in the Maybach bitch peek in\nNow the bitches wanna car hop\n6 cribs for the cars in the car lot\nDope boys on the goal nigga\nWent gold 6 times for a goal nigga\nBlack bottle and a bad bitch\nClub all money where the cash is\nDubai I can do it like a sheikh\nTop floor nigga Burj Khalifa\n\nBig guns and big whips\nRich nigga talkin' big shit\nDouble cup, gold wrist\nDouble up on that blow, bitch!\nTwo mil on that I-95\nBow your head 'cause it's time to pay tithes\nOpposition want me dead or alive\nMotherfucker but the devil is a lie\nThe devil is a lie, bitch I'm the truth\nThe devil is a lie, bitch I'm the proof\nThe devil is a lie, the devil is a lie\nBitch I'm alive, the devil is a lie\n\nIs it truth or it's fiction, is it truth or it's fiction\nIs Hova atheist? I never fuck with True Religion\nAm I down with the devil 'cause my roof come up missin'\nIs that Lucifer juice in that two cup he sippin'\nThat's D'usse baby welcome to the dark side\nCoulda got black list for the crack shit\nWhite Jesus in my crock pot\nI mix the shit with some soda\nNow I'm black Jesus turn water to wine\nAnd all I had to do was turn the stove up\nEast Coast, winnin' at life, nigga, cheat code\nThe hatin' is flagrant, hit your free throws\nThe devil try to hit me with the RICO, them black people\nDevil want these niggas hate they own kind\nGotta be illuminati if a nigga shine\nOh we can't be a nigga if a nigga rich?\nOh we gotta be the devil that's some nigga shit\nYou seen what I did to the stop and frisk\nBrooklyn on the Barney's like we own the bitch\nGive the money to the hood, now we all win\nGot that Barney's floor lookin' like a VIM\nBlack hoodie, black skully\nBravado like Mavado, boy I'm that gully\nGettin' white money but I'm still black\nAll these niggas claiming king but I'm still that\nKing Hova, Mansa Musa\nTold my lot, the devil is a lie, I'm the truth ya\n\nBig guns and big whips\nRich nigga talkin' big shit\nDouble cup, gold wrist\nDouble up on that blow, bitch!\nTwo mil on that I-95\nBow your head 'cause it's time to pay tithes\nOpposition want me dead or alive\nMotherfucker but the devil is a lie\nThe devil is a lie, bitch I'm the truth\nThe devil is a lie, bitch I'm the proof\nThe devil is a lie, the devil is a lie\nBitch I'm alive, the devil is a lie"}