{"song_id":26332,"song_name":"Calm Down","artist_id":298558,"display_artist":"Busta Rhymes Featuring Eminem","spotify_id":"72DuDVv06ZtKDceAlq40f2","lyrics":"Turn my mic up\nTurn my mic up\n\n(Steady on the right) Ayo, calm down nigga\n(Steady on the left) Ayo, calm down nigga\n(Steady on the right) Ayo, calm down nigga\n(Steady on the left) Fuck it, blackout niggas!\nOh my Lord\n\nKnow when the cats get down\nSprinkle the ash, you'll get your ass kicked, pow!\nFrown while I shit on your crown\nSkip town grounds will appear on the king cash cow\nDo I make 'em say 'Wow!', strip, ow, bow\nI sit with the pound, click, pow\nBlow, click, click, pow, click pow\nStop traffic dropping them classics, flip now\nBitches I'm making them skip with thou\nArt, you don't really want that when I growl\nLet me come (rawr, rawr, rawr) let me come and mop up the knock offs\nWhen I pop off I never stop, cause\nWhat we do? Come through, you better lock doors (PAUSE)\nThe wolves wanna eat, be by they lockjaws\nNo need to cook up the coke, you see me chop raw\nAnd if you ain't have enough\nWhat in the fat fishes of a phenomenal Fahrvergn&#xFC;gen\nFuck is going on? Back with the beat and the raps is callous\nBang on another song, I'mma have these niggas nervous\nAnd clipping they nails and dribbling in wetness\nAnd nibble them like sunflower seed shell, so\nSee these skills got my weight up heavy like three whales\nAnd I shit on Ishamels till the speakers fell into the weed smell\nNigga your tree fell, see how they Twitter, Facebook, and Instagramming, on email\nTalking, I'm sick and I got them shook banging on retail until they cripple\nSee I cook like I'm slanging a weed sale\nAnd I triple gram and whoop 'em and drag 'em like females (gasp)\nOh see well, these niggas already know the way that I fuck shit up, minus the details\nThe case is shut, your bitch remind me of my replacement but kind of an ancient slut\nHer stomach down like she was a basement fuck\nSwell up this shit like I'm sticking sticks in their gut\nSo graciously, ungraciously, I painfully wake niggas up\nRagdolling these niggas and attack them like apes in the cut\nI'm waiting for the taking while I break niggas neck like a bracelet, fuck\nIt's kinda like me having a case in the truck and drinking till I'm blasted\nAll ratchet and racing (crunk) keeping over 'em blacking\nUntil I'm leaving 'em stuck\nI got 'em happier than a child in a park chasing a duck\nWhen I'm chasing a buck it's funny, niggas be chasing they luck\nI be lacing them up like boots when I'm pushing they face in the mud (ah)\nMissiles I fling while I spit live wire, till this shit circling back around\nWith more fire for me to melt the brake's surface, and back the sound\nWhile I light up shit that I toss\nI quit worshiping Gods, look around\nIt's certain this shit splatters click paint that'll make 'em scatter\nShameful the way I shatter, split shit apart it doesn't matter (rip)\nYour head up off your shoulders, bullets bigger than a boulder\nBreak 'em and they know that it's a classic\nAnd the way it's going you could easily get your ass kicked\nSee, me and Shady together we're crazy\nLike baking a bomb and a rabies cake like a pastry bitch (you're that sick?)\n'Cause I'm from Haiti, I'm suggesting you pay me, don't make me wanna spazz (lalalala)\nLike I'm a crazy Israeli, bastards\nWhile I bite the beat up put the sparker in a heater\nI'm chopping your foot off now it's mine and I'm putting my feet up\nBack to the hood and off to the whylin' I'm hoping you protect your child\nAnd I been blacking out so long niggas is asking if the hook has died, naw\n\n(Steady on the right) Ayo, calm down nigga\n(Steady on the left) Ayo, calm down nigga\n(Steady on the right) Ayo, calm down nigga\n(Steady on the left) Fuck it, blackout niggas!\nOh my Lord\n\nThere's a light contagiousness to this tirade\nIt just might make you sick\nSo irate with this my brain is just like a fucking fried egg\nIs my mind scrambled? (I'm lit) Yes, narrow minded\nBut go through such a wide range of this emotion\nThat my rage has gotta squeeze through it sideways\nI just pulled up in Clive Davis' driveway\nWith his personal memoir saying he's bi\nWaving a nine, a picket sign, yanking his ride, making him cry \"rape\" then arrive naked\nAnd drive straight through the gay pride parade Yippee-Ki-Yay\nCause here I- wait, did the world just pee on my leg?\nAnd should I take it as a sign? Maybe I'll take 'em back in the times (Shady)\nStuck out like a sore thumb, so I gave 'em the finger\nTo take the attention away from my stinking face it was bringing\nChanged the whole complexion of the game, but just in case you was thinking\nAn inkling of replacing the kingpin, you're crazy, you're wasting your ink then\nSo if this is any indication of what you may be facing\nYou better make a distinction cause you fake imitations\nAre leaving a bad taste, fuck making a bad impression\nThat's the worst impersonation I've ever seen and\nWho raps nasally, eyes hazily, rhymes crazily\nBut sounds like he may need some FLO, nasally speaking?\nWhat kind of stupid question is that?\nHey Mrs. Abraham Lincoln\nOther than your husband's fucking brains that were leaking, how'd you think that play was this weekend?\nYou ain't the real Slim Shady, sit your ass down faggot\nSee me on a ballot? I'm running for class clown\nRich democrat, bitch, so I'm just a candidate\nTo come fuck up the whole party, me and Flipmode starting a campaign\nTo have every campus on a fucking rampage\nAct my goddamn age? I am eight, so let's get smashed\nAnd wake up the next day with the room trashed, covered in Band-Aids\nGlass ashtray smashed, champagne splashed on the lampshades\nBut this ain't up for debate, this is undebatable\nShady for president, ho, don't make me go take it back to the days of old\nWhere Sway and Tech radio when I was taking so much NoDoz and LSD\nI almost fell asleep on the wake up show\nFuck you telling me, fools? I was living shock\nRaising hell up in shoes when Penelope Cruz was still developing boobs\nMe and Bus put it down like a sick pet\nYou're fucking with vets dawg, fucking internet bloggers\n\"I sit in front of my computer all day and comment on\nEverything, I'm an expert on everything, everything sucks, play the next song\"\nGuess if I hopped out your freaking laptop, you idiot prick\nWith Biggie and kicked the living shit out of you, I'd be dead wrong\nSon of God I'm not soft like a wet log, force never gets clogged\nI'm so full of self-esteem that I sweat fog\nYes, yes y'all, steady on the left, y'all\nStep off of it or you get stepped on soft\nBout as commercial as my fucking leo jet\nJealously'll get you as green as a Geopet\nI can see that you're visibly upset, dawg\nAlert, alert, girl, alert\nOnce you went into the house of pain hearing a world of hurt so\nJump around, jump, jump, get that ass shaking\nJump around, jump, jump, came to hit you with a fan favorite\nBut if you too fly for coach better get them get them arms and freaking hands flailing\nJump like Van Halen, and pray for a damn tailwind\nMore afraid of success than I am of failure\nSo what does that tell ya?\nThat on a grand scale I don't give a fuck about nothing like Stan mailing\nHis last piece of fan mail before he ran straight into the damn railing\n\nChill, man, chill"}