{"song_id":26367,"song_name":"Best Mistake","artist_id":304565,"display_artist":"Ariana Grande Featuring Big Sean","spotify_id":"null","lyrics":"Ariana Grande:\nHow soon do we forget how we felt?\nDealing with emotions, that never left,\nPlaying with the hand that we were dealt in this game.\n\nMaybe I'm the sinner, and you're the saint,\nGotta stop pretending what we ain't.\nWhy we pointing fingers, anyway, when we're the same?\n\nBreak up, make up, total waste of time,\nCan we please make up our minds,\nAnd stop acting like we're blind\n\n'Cause if the water dries up, and the moon stops shining,\nStars fall, and the world goes blind, boy,\nYou know, I'll be savin' my love for you, for you.\n\n'Cause you're the best mistake I've ever made,\nBut we hold on, hm, hold on.\nThere's no pot of gold in the rainbows we chase,\nBut we hold on, hm, hold on, yeah.\n\nBig Sean:\nI guess time's wasting, tick tocking, lip locking,\nHow can we keep the feelings fresh? How do we Ziploc it?\nWear your heart up on your sleeve, so watch out for pickpockets.\nI guess to go the distance, we might need to pit stop it.\nHold up - I know love could be a beach with no shore,\nI done count to ten, lost my temper, and went back to four.\nI know sometimes it's hard to realize I'm the man that you need,\nI had a dream we branched out, started a family tree, huh.\nAnd I feel like that everything we do is overdue,\nYou ask why I love your mom so much? 'Cause she's a older you.\nI wish that you were happy, I guess that's the one thing I should be providing;\nAin't no number twos, we both ones of ones, and we the oddest,\nCouple only humans 'cept you, you a goddess;\nOnly lying to you when I lie you down, just being honest.\nWhen you start as friends it's hard to say you're never going back;\nIf I'm not the one, then I'm the best mistake you ever had.\n\nAriana:\nBreak up, make up, total waste of time;\nCan we please make up our minds\nAnd stop acting like we're blind\n\n'Cause if the water dries up, and the moon stops shining,\nStars fall, and the world goes blind, boy,\nYou know, I'll be savin' my love for you, for you.\n\n'Cause you're the best mistake I've ever made,\nBut we hold on, hmm, hold on.\nThere's no pot of gold in the rainbows we chase,\nBut we hold on, hmm, hold on, yeah.\n\n(Sean:)\nYou're, you're, you're, you're,\nMmm, I'll be savin' my love for you, for you.\n\nYou're, you're, you're, you're,\n(Be-be-be-best mistake you ever had)\n(Be-be-be-best mistake you ever had)\nMmm, I'll be savin' my love for you, for you.\n(Be-be-be-best mistake you ever had)\n(Be-be-be-best)"}