{"song_id":26378,"song_name":"Walk Thru","artist_id":5245566,"display_artist":"Rich Homie Quan Featuring Problem","spotify_id":"2ppKIytnAyI8GRiRv8VpP6","lyrics":"Baby yeah\nHey man where my real niggas at in this muh' fucker man?\nYou feel me?\nTo the real nigga walk through for me hey\n\nI be feeling like the man when I walk through\nAin't stunting what you saying when I walk through\nI got all these hoes staring when I walk through\nI done made a few bands when I walk through\nWatch me, watch me, hey, watch me walk through\nWatch me, watch me, hey, watch me walk through\nWatch me, watch me, hey, watch me walk through\nI done made a few bands when I walk through\n\nI done made a few bands when I walk through (just feel me)\nPeople I don't know naw I don't talk to (nah)\nMe and Problem in this bitch, he a boss too (problem)\nSitting at the round table making boss moves (get money)\nI done walk through with Gucci on my feet (Gucci?)\nWho got more money, you or me? (Me)\nI'mma walk through usually (huh)\nWith my nigga best believe that I got the tool on me\nI done snuck passed security\nWhat the fuck, do you need glasses just to see\nMe when I'm coming full speed, got that V12 running\nAnd I'mma jump the fence if I see 12 coming\nEven if I were blind, I could still smell money\nI can't trust no outside niggas, they could tell on me\nI'm the alphabet boy 'cause I keep an L on me\nI smoke good, throwing up my set in your hood, nigga\n\nI be feeling like the man when I walk through\nAin't stunting what you saying when I walk through\nI got all these hoes staring when I walk through\nI done made a few bands when I walk through\nWatch me, watch me, hey, watch me walk through\nWatch me, watch me, hey, watch me walk through\nWatch me, watch me, hey, watch me walk through\nI done made a few bands when I walk through\n\nYeah, it's money over here, what you thought, clown?\nPlay crazy while you high, have you knocked down\nNo frowns around here, bruh, we all smiles\nGiuseppe just dropped, got all styles\n(Mom set the boy out when I walk through\nScarface before he died this part 2)\nHave your peoples tell promoters that I'm coming\nPark me in the front, leave the shit running, here's 100, what up?\nFlip your bitch like a coin, better call it, nigga\nShe got a thing for us big dick balling niggas\nShe bout to rock the boy mic, till it feedback\nThe realest nigga out my city and I mean that\n\nI be feeling like the man when I walk through\nAin't stunting what you saying when I walk through\nI got all these hoes staring when I walk through\nI done made a few bands when I walk through\nWatch me, watch me, hey, watch me walk through\nWatch me, watch me, hey, watch me walk through\nWatch me, watch me, hey, watch me walk through\nI done made a few bands when I walk through\n\nMoney Music!\nWalk through, prices go up after this (oh shit)\nRich Homie Quan"}