{"song_id":26379,"song_name":"Guts Over Fear","artist_id":301722,"display_artist":"Eminem Featuring Sia","spotify_id":"4Yv6T3BqrdDqaklemAWgfl","lyrics":"Eminem\nFeels like a close, it's coming to\nFuck am I gonna do?\nIt's too late to start over\nThis is the only thing I, thing I know\n\nSometimes I feel like all I ever do is\nFind different ways to word the same old song\nEver since I came along\nFrom the day the song called \"Hi! My Name Is\" dropped\nStarted thinkin' my name was Fault\n'Cause anytime things went wrong\nI was the one who they would blame it on\n\nThe media made me the equivalent of a modern-day Genghis Khan\nTried to argue it was only entertainment, dog\nGangsta? Nah, courageous balls\nHad to change my style, they said I'm way too soft\nAnd I sound like AZ and Nas, out came the claws\nAnd the fangs been out since then\nBut up until the instant that I went against it\n\nIt was ingrained in me\nThat I wouldn't amount to a shit stain I thought\nNo wonder I had to unlearn everything my brain was taught\nDo I really belong in this game? I pondered\nI just wanna play my part\nShould I make waves or not?\nSo back and forth in my brain the tug of war wages on\n\nAnd I don't wanna seem ungrateful\nOr disrespect the art form I was raised upon\nBut sometimes you gotta take a loss and have people rub it in your face\nBefore you get made pissed off\nAnd keep pluggin', it's your only outlet, and your only outfit\nSo you know they gonna talk about it\nBetter find a way to counter it, quick and make it, ah\n\nFeel like I've already said this a kabillion eighty times\nHow many times can I say the same thing different ways that rhyme?\nWhat I really wanna say is, if there's anyone else that can relate to my story?\nBet you feel the same way I felt when I was in the same place you are\nWhen I was afraid to...\n\nSia\nI was a-afraid to make a single sound\nAfraid I would never find a way ou-ou-out\nAfraid I'd never be found\nI don't wanna go another round\n\nAn angry man's power will shut you up\nTripwires fill this house with tiptoed love\nRun out of excuses for everyone\nSo here I am and I will not run\n\nGuts over fear  (The time is near)\nGuts over fear (I shed a tear)\nFor all the times I let you push me around, I let you keep me down\n(But now I got) Guts over fear, guts over fear\n\nEminem\nFeels like a close, it's coming to\nFuck am I gonna do?\nIt's too late to start over\nThis is the only thing I, thing I know\n\nI know what it's like I was there once\nSingle parents, hate your appearance\nDid you struggle to find your place in this world?\nAnd the pain spawns all the anger on\nBut it wasn't until I put the pain in song\nLearned who to aim it on that I made a spark\nStarted to spit hard as shit\nLearned how to harness it while the reins were off\n\nAnd there was a lot of bizarre shit, but the crazy part\nWas soon as I stopped saying \"I gave a fuck\"\nHaters started to appreciate my art\nAnd it just breaks my heart to look at all the pain I caused\nBut what am I gonna do when the rage is gone\nAnd the lights go out in that trailer park?\n\nAnd the window is closin' and there's nowhere else that I can go\nWith flows and I'm frozen\n'Cause there's no more emotion for me to pull from\nJust a bunch of playful songs that I made for fun\nSo to the break of dawn here I go recycling the same old song\nBut I'd rather make \"Not Afraid 2\"\nThan make another motherfuckin' \"We Made You\", uh\n\nAnd I don't wanna seem indulgent\nWhen I discuss my lows and my highs\nMy demise and my uprise, pray to God\nI just open enough eyes later on\nGave you the supplies and the tools\nTo hopefully use that'll make you strong\nEnough to lift yourself up, when you feel like I felt\n'Cause I can't explain to y'all\n\nHow dang exhausted my legs felt\nJust having to balance my dang self\nWhen on eggshells I was made to walk\nBut thank you Ma, 'cause that gave me the\nStrength to 'cause Shady-mania\nSo when they empty that stadium\n'Least I made it out of that house\nAnd found a place in this world when the day was done\n\nSo this is for every kid who all's they ever did\nWas dreamt of one day just gettin' accepted\nI represent him or her, anyone similar\nYou are the reason that I made this song\nAnd everything you're scared to say\nDon't be afraid to say no more\nFrom this day forward just let them a-holes talk\nTake it with a grain of salt\nAnd eat their fuckin' faces off\n\nThe legend of the angry blonde lives on\nThrough you when I'm gone\nAnd to think I was a\n\nSia\nI was a-afraid to make a single sound\nAfraid I would never find a way ou-ou-out\nAfraid I'd never be found\nI don't wanna go another round\n\nAn angry man's power will shut you up\nTripwires fill this house with tiptoed love\nRun out of excuses for everyone\nSo here I am and I will not run\n\nGuts over fear  (The time is near)\nGuts over fear (I shed a tear)\nFor all the times I let you push me around, I let you keep me down\n(But now I got) Guts over fear, guts over fear"}