{"song_id":26387,"song_name":"Touchin, Lovin","artist_id":430421,"display_artist":"Trey Songz Featuring Nicki Minaj","spotify_id":"0wy44jzofTRXBPwjl7KtBP","lyrics":"(Intro: Nicki Minaj)\nWoo\nYeah, Young Money\nTrigga Trey\nLet's get it\nBurrr\n\n(Verse 1: Trey Songz)\nNo, I ain't tryna flex, no ceilings you can see who's in it\nIf we're talking about sex, girl, you know that I invented that\nAnd I'm onto the next, that's unless you bring a friend who with it\n\nOh, I'm sorry, oh, you mad that I came to the party?\nLike, no no no\nYou took your girl to the club and now she gone, gone, gone\nNow she asking me when I'm taking her home, home, home\nI tell her \"let's go\" long as you know\n'Cause I know when we get alone\n\n(Chorus 1: Trey Songz)\nI'm touchin' you tonight, I'm lovin' you tonight (Wait nope)\nI'm fuckin' you, girl, you must be used to spendin', putting in that time\nTouchin', lovin', fuckin', can't make up my mind\nI'm lovin' you. (Wait nope) I'm fuckin' you tonight\n\n(Verse 2: Trey Songz)\nGirl you fuckin' with the best\nTake a picture while I'm deep up in it\nOh-oh-oh, and if they living right next\nThen I bet they know my name in a minute\nLet me feel your body sweating, I promise I'll keep your body dripping\n\n(Verse 3: Nicki Minaj)\nSometimes I tell 'em I love 'em because I just wanna fuck 'em\nI never love 'em, I cuff 'em and when we done I'mma duck 'em\nHe Ferragamo the buckle, he Louis V on the duffel\nThe pussy wetter than puddles, I ride his dick like a shuttle\nI said real niggas let real bitches cum first\nAnd real bitches been bad bitches from birth\nUh, k-k-kiss him when he cumming\nM-m-make more money last year than Mister Drummond\nOh-oh-oh, he like it when I ride it slow\n\n(Chorus 2: Trey Songz)\nI'm touchin' you tonight, I'm lovin' you tonight (Wait nope)\nI'm fuckin' you, girl\nYou must be used to spendin', putting in that time\nTouchin', lovin', fuckin', can't make up my mind\nNicki, you know that I love ya, I'm loving you\nAnd I really wanna touch ya, I'm fucking you tonight\n\n(Outro: Nicki Minaj)\n What you mean, \"wait, no\", like... what?!\nYou better act like you know nigga, it's Nicki Minaj!"}