{"song_id":26404,"song_name":"i","artist_id":305702,"display_artist":"Kendrick Lamar","spotify_id":"08XAlO8SlW0MWgTDNYkG27","lyrics":"\"We got a young brother that stands for something! We got a young brother that believes in the all of us! Brother Kendrick Lamar! He's not a rapper, he's a writer, he's an author! And if you read between the lines, we'll learn how to love one another! But you can't do that-right on!-I said, you can't do that without loving yourself first. \"\n\n(This is a world premiere)\nI done been through a whole lot\nTrial, tribulation, but I know God\nSatan wanna put me in a bow tie\nPraying that the holy water don't go dry (get it, get it)\nAs I look around me\nSo many motherfuckers wanna down me\nBut an enemigo never drown me\nIn front of a dirty double-mirror they found me\n\nAnd I love myself\n(The world is a ghetto with big guns and picket signs)\nI love myself\n(But it can do what it want whenever it wants and I don't mind)\nI love myself\n(He said I gotta get up, life is more than suicide)\nI love myself\n(One day at a time, sun gon' shine)\n\nEverybody looking at you crazy (Crazy)\nWhat you gon' do? (What you gon' do?)\nLift up your head and keep moving (Keep moving)\nOr let the paranoia haunt you? (Haunt you)\nPeace to fashion police, I wear my heart\nOn my sleeve, let the runway start\nYou know the miserable do love company\nWhat do you want from me and my scars?\nEverybody lack confident, everybody lack confident\nHow many times our potential was anonymous?\nHow many times the city making me promises?\nSo I promise this\n\nAnd I love myself\n(The world is a ghetto with big guns and picket signs)\nI love myself\n(But it can do what it want whenever it wants and I don't mind)\nI love myself\n(He said I gotta get up, life is more than suicide)\nI love myself\n(One day at a time, sun gon' shine)\n\nThey wanna say there's a war outside and a bomb in the street\nAnd a gun in the hood and a mob of police\nAnd a rock on the corner and a line full of fiends\nAnd a bottle full of lean and a model on a scheme, yup\nThese days of frustration, keep y'all on tuck and rotation\nI duck these gold faces, post up fee-fi-fo-fum basis\nDreams of realities peace\nBlow steam in the face of the beast\nThe sky can fall down, the wind can cry now\nThe strong in me, I still smile\n\nAnd I love myself\n(The world is a ghetto with big guns and picket signs)\nI love myself\n(But it can do what it want whenever it wants and I don't mind)\nI love myself\n(He said I gotta get up, life is more than suicide)\nI love myself\n(One day at a time, sun gon' shine)\n\nWalk my bare feet (Walk my bare feet)\nDown, down valley deep (Down, down valley deep)\nI keep my fee-fi-fo-fum (Fee-fi-fo-fum)\nI keep my heart undone (My heart undone)\n\nAnd I love myself\n(The world is a ghetto with big guns and picket signs)\nI love myself\n(But it can do what it want whenever it wants and I don't mind)\nI love myself\n(He said I gotta get up, life is more than suicide)\nI love myself\n(One day at a time, sun gon' shine)\n\nI went to war last night\nWith an automatic weapon, don't nobody call a medic\nImma do it till I get it right\nI went to war last night\nI've been dealing with depression ever since an adolescent\nDuckin' every other blessin', I can never see the message\nI could never take the lead, I could never bob and weave\nFrom a negative and letting 'em annihilate me\nAnd its evident I'm moving at a meteor speed\nFinna run into a building, lay my body in the street\nKeep my money in the ceiling, let my mama know I'm free\nGive my story to the children and the lesson they can read\nAnd the glory to the feeling of the only unseen\nSeen enough, make a motherfucker scream, \"I love myself!\"\n\nI lost my head\nI must misread what the good book said\nOh woes be me, it's a jungle inside\nGive myself again till the well runs dry"}