{"song_id":26513,"song_name":"Feeling Myself","artist_id":312259,"display_artist":"Nicki Minaj Featuring Beyonce","spotify_id":"6Sm2YzLtL8FcyTMONOkiFw","lyrics":"Rrrrrrrrrr!\nYo B, they ready\nLet's go\n\nI'm feelin' myself, I'm feelin' myself\nI'm feelin' my, feelin' myself\nI'm feelin' myself, I'm feelin' my, feelin' my, feelin' myself\nI'm feelin' myself, I'm feelin' my, feelin' myself\nI'm feelin' myself, I'm feelin' my\n\nI'm with some hood girls lookin' back at it\nAnd a good girl in my tax bracket\nGot a black card that let Saks have it\nThese Chanel bags is a bad habit\nI-I do balls, Dal Mavericks, my Maybach, black matted\nBitch, never left but I'm back at it\nAnd I'm feelin' myself, jack rabbit\nFeelin' myself, back off, 'cause I'm feelin' myself, jack off\nHe be thinking about me when he whacks off, whacks on? Wax off\nNational anthem hats off, then I curve that nigga, like a bad toss\nLemme get a number two, with some Mac sauce\nOn The Run Tour, with my mask off\n\nI'm feelin' myself, I'm feelin' myself\nI'm feelin' my, feelin' myself\nI'm feelin' myself, I'm feelin' my, feelin' my, feelin' myself\nI'm feelin' myself, I'm feelin' my, feelin' myself\nI'm feelin' myself, I'm feelin' my\n\nChanged the game with that digital drop\nKnow where you was when that digital popped\nI stopped the world\nMale or female, it make no difference\nI stop the world, world stop...\nCarry on\n\nKitty on fleek, pretty on fleek\nPretty gang, always keep them niggas on geek\nRidin' through Texas, fearin' for his breakfast\nEverytime I whip it, I be talkin' so reckless\nHe said \"Damn Nicki it's tight,\" I say \"Yeah nigga you right\"\nHe say \"Damn, bae, you so little, but you be really takin' that pipe\"\nI say \"Yes daddy I do, gimme brain like NYU\"\nI said \"Teach me, nigga, teach me. All this learnin' here is by you\"\n\nI'm whippin' that work, he diggin' that work\nI got it, tiny sips of that 36 of that real\nHanky full of that bounce baby\nCome get you some of that bounce baby\n\nI'm feelin' myself, I'm feelin' myself\nI'm feelin' my, feelin' myself\nI'm feelin' myself, I'm feelin' my, feelin' my, feelin' myself\nI'm feelin' myself, I'm feelin' my, feelin' myself\nI'm feelin' myself, I'm feelin' my\n\nCookin' up the base, lookin' like a kilo\nHe just wanna taste, biggin' up my ego\nEgo, ego, ego, ego, ego, ego, ego, ego\nRidin' through Texas\nSmokin' all off, talkin' bout that high-grade\nBaby hold up, I can kill your migraine\n\nBitches ain't got punchlines or flow\nI have both and an empire also\nHe gettin' gifts from Santa Claus at the North Pole\nToday I'm icy, but I'm prayin' for some more snow\nLet that ho ho, let that ho know, he in love with that coco\nWhy these bitches don't never be learnin'\nYou bitches will never get what I be earnin'\nI'm still gettin' plaques, from my records that's urban\nAin't gotta rely on top 40\nI am a rap legend, just go ask the kings of rap\nWho is the queen and things of that nature\nLook at my finger, that is a glacier, hits like a lazer\nTrippin' on that work, trippin' off that purp\nFlippin' up my skirt and I be whippin' all that work\nTakin' trips with all them ki's, car keys got B's\nStingin' with the Queen Bey and we be whippin' all that D\n'Cause we dope girls we flawless, we the poster girls for all this\nWe run around with them ballers, only real niggas on my call list\nI'm the big kahuna, go let them whores know\nJust on this song alone, bitch is on her fourth flow\n\nRrrrrrrrrr!\nYou like it don't you? Snitches!\nYoung Money"}