{"song_id":26530,"song_name":"Throw Sum Mo","artist_id":6140339,"display_artist":"Rae Sremmurd Featuring Nicki Minaj & Young Thug","spotify_id":"5uqphUYsR45kPYplrYSAQh","lyrics":"Ass fat, yeah I know, you just got cash? Blow sum mo'\nBlow sum mo', blow sum mo'\nThe more you spend it, the faster it go\nBad bitches, on the floor, It's rainin' hunnid's, throw sum mo'\nThrow sum mo', throw sum mo', throw sum mo'\n\nHi, bye hater, I flood the club with paper\nShawty got a ass, some for now, some for later\nSomethin' like Nicki's, dancin' like Maliah\nI'm throwin' all this money I'm a fuck around and buy her\nI can flick the money all night 'til my wrist tired\nIf you put in work, this the night you gon' retire\nYou a bad bitch, I ain't even gon' deny her\nShe told me \"throw that money\", I said \"make it worth my while\"\nI'm 'bout to empty out the ATM\nShe doin' tricks that make a nigga wanna' spin\nGirl you know you got me fascinated\nJust keep on dancin' 'til I'm outta paper (Never)\n\nAss fat, yeah I know, you just got cash? Blow sum mo'\nBlow sum mo', blow sum mo'\nThe more you spend it, the faster it go\nBad bitches, on the floor, It's rainin' hunnid's, throw sum mo'\nThrow sum mo', throw sum mo', throw sum mo'\n\nFranklins, rainin' on your body\nRainin' on your body, rainin' on your body\nWon't you do what I say? Start rubbin' on your body\nYou like hunnid's on your body, girl you needs to get naughty\nHold up, hold on, her eyes on me, is that your ho?\nIf so I'm a get her fore' the nights over\nDJ play my shit so I'm finna' crank up off in the V.I.P zone\nSee the money go up and she dance on sight\nBy the end of the night she on endo'\nLemme' see you make it clap on tempo\nLemme' see you get low like limbo\n\nAss fat, yeah I know, you just got cash? Blow sum mo'\nBlow sum mo', blow sum mo'\nThe more you spend it, the faster it go\nBad bitches, on the floor, It's rainin' hunnid's, throw sum mo'\nThrow sum mo', throw sum mo', throw sum mo'\n\nCome in ho, mistletoe, I got birdies, crows\nFlip it a bit, wanna jump on the dick\nI'm like bool let's get it, let's get it\nI got these bitches kissin' on these bitches\nI can't even count em', I fuck by the digits\nSwag terrific, I might fuck that bitch in the kitchen\nBaby don't use dirty dishes or else you might whip up a burrr!\nMy neck, my wrists is a burrr!\nShe wanna fuck like dogs I'm like \"woof\"\nPanoramic roof, I drop the coupe, boo\nPulled up with a bitch, she look like New New\nIt's okay if I lie to you, bitch, my swag the truth\nHey, she come right back like new drivers do\nFifty thousand off fifty niggas, no caliber\n\nAss fat, yeah I know, you just got cash? Blow sum mo'\nBlow sum mo', blow sum mo'\nThe more you spend it, the faster it go\nBad bitches, on the floor, It's rainin' hunnid's, throw sum mo'\nThrow sum mo', throw sum mo', throw sum mo'"}