{"song_id":26570,"song_name":"Hotel","artist_id":305824,"display_artist":"Kid Ink Featuring Chris Brown","spotify_id":"4wYFAS2o03xNCN12Yi69Gu","lyrics":"I said why you over there lookin' at me?\nWhile I'm with my girlfriend\nWhy you over there lookin' at me and my girlfriend?\nLet's take it to the hotel, let's take it to the hotel\n\nI said why you over there lookin'?\nGot a starin' problem and you fuckin'\nI know you see my girl, stop frontin'\nI could tell you up to a lil' somethin', hol'up\nI'ma play it cool, baby roll one\nWhile you make your way and get over here\nMy girl ain't down then it's over\nJust tell her that she look good when I'm over there\nIn the first play, pour one up\nBaby don't be too thirsty\nGroupie love ain't ever gon' work\nSee hoes ain't loyal and never keep it lowkey\nThat ain't all right\nI'ma take a shot, couple shots through the night\nTell a joke, keep it fun, make her feel it's all right\nGive you the game wholesale\nAnd bet a hundred that I take 'em to the hotel\n\nI said why you over there lookin' at me?\nWhile I'm with my girlfriend\nWhy you over there lookin' at me and my girlfriend?\nLet's take it to the hotel, let's take it to the hotel\nTake it to the hotel, baby leave with me\nKnow I got a penthouse suite\nI said why you over there lookin' at me?\nWhile I'm with my girlfriend\n\nIt's kinda hard when I see you lookin' over here\nWith them eyes\nI got a girl but I'm feelin' your body\nSo I'ma have to just play both sides\nI hope she don't come over here\n'Cause I'm with my girl, you know I love her\nI got two of my bitches in the club\nAnd they about each other, oh no\n\nBut a nigga never Paranoid\nYou fuckin' with a man not a little boy\nWhat? I could barley hear your little voice\nIn the club but your body makin' all the noise\nClap it up, stack it up\nWhere your purse? Just pack it up\nGrab her hand, tell her we should go now\nIf you really wanna take this party to the hotel\n\nI said why you over there lookin' at me?\nWhile I'm with my girlfriend\nWhy you over there lookin' at me and my girlfriend?\nLet's take it to the hotel, let's take it to the hotel\n\nOver there lookin' all suspicious\nGet a clue girl, don't be a mystery\nI see you likin' on all my pictures\nOf me and my bitch\nUp in all of our business\nSo, you gotta know it ain't a limit to\nWhat appeal and a nigga do\nMake a straight girl go down\nJust bit down\nI might fuck around and lick her too\nIt ain't a problem, my metabolism high\nEat you both up for dinner\nJust keep it real with a real mothafucka\nAin't got time for no pretenders\nNow just bring it to me\nThat fleek, that freak, no classy stuff\nBeen pushin' up, don't pussy now\nBitch what you really on?\n\nI said why you over there lookin' at me?\nWhile I'm with my girlfriend\nWhy you over there lookin' at me and my girlfriend?\nLet's take it to the hotel, let's take it to the hotel"}