{"song_id":26627,"song_name":"Institutionalized","artist_id":305702,"display_artist":"Kendrick Lamar Featuring Bilal, Anna Wise & Snoop Dogg","spotify_id":"5kqQoLsjAHHxXmVe4oBT83","lyrics":"What money got to do with it\nWhen I don't know the full definition of a rap image?\nI'm trapped inside the ghetto and I ain't proud to admit it\nInstitutionalized, I keep runnin' back for a visit, hol' up\nGet it back\nI said I'm trapped inside the ghetto and I ain't proud to admit it\nInstitutionalized, I could still kill me a nigga, so what?\n\nIf I was the president\nI'd pay my mama's rent\nFree my homies and them\nBulletproof my Chevy doors\nLay in the White House and get high, Lord\nWho ever thought?\nMaster, take the chains off me\n\nZoom, zoom, zoom, zoom, zoom\nZoom, zoom, zoom\nZoom, zoom, zoom, zoom, zoom\nZoom, zoom, zoom\nShit\n\nLife can be like a box of chocolate\nQuid pro quo, somethin' for somethin', that's the obvious\nOh shit, flow's so sick, don't you swallow it\nBitin' my style, you're salmonella poison positive\nI can just alleviate the rap industry politics\nMilk the game up, never lactose intolerant\nThe last remainder of real shit, you know the obvious\nMe, scholarship? No, streets put me through colleges\nBe all you can be, true, but the problem is\nDream only a dream if work don't follow it\nRemind me of the homies that used to know me, now follow this\nI'll tell you my hypothesis, I'm probably just way too loyal\nK Dizzle will do it for you, my niggas think I'm a god\nTruthfully all of 'em spoiled, usually you're never charged\nBut somethin' came over you once I took you to the fuckin' BET Awards\nYou lookin' at artists' like the harvests\nSo many Rollies around you and you want all of them\nSomebody told me you thinkin' 'bout snatchin' jewelry\nI should've listened when my grandmama said to me\n\n\"Shit don't change until you get up and wash yo' ass, nigga\nShit don't change until you get up and wash yo' ass, boy\nShit don't change until you get up and wash yo' ass, nigga\nOh now, slow down\"\n\nOnce upon a time, in a city so divine\nCalled West Side Compton, there stood a little nigga\nHe was five foot something, God bless the kid\nTook his homie to the show and this is what they said\n\n\"Fuck am I 'posed to do when I'm lookin' at walkin' licks?\nThe constant big money talk 'bout the mansion and foreign whips\nThe private jets and passport, presidential glass floor\nGold bottles, gold models, sniffin' up the ass for\nInstagram flicks, suck a dick, fuck is this?\nOne more suck away from wavin' flashy wrist\nMy defense mechanism tell me to get him\nQuickly because he got it\nIt's a recession, then why the fuck he a King of Diamonds?\nNo more livin' poor, meet my .44\nWhen I see 'em, put the per diem on the floor\nNow Kendrick, know they're your co-workers\nBut it's gon' take a lot for this pistol go cold turkey\nNow I can watch his watch on the TV and be okay\nBut see I'm on the clock once that watch landin' in LA\nRemember steal from the rich and givin' it back to the poor?\nWell that's me at these awards\"\nI guess my grandmama was warnin' a boy, she said\n\n\"Shit don't change until you get up and wash yo' ass, nigga\nShit don't change until you get up and wash yo' ass, boy\nShit don't change until you get up and wash yo' ass, nigga\nOh now, slow down\"\n\nOnce upon a time, in a city so divine\nCalled West Side Compton, there stood a little nigga\nHe was five foot something, dazed and confused\nTalented but still under the neighborhood ruse\nYou can take your boy out the hood but you can't take the hood out the homie\nTook his show money, stashed it in the mozey wozey, Hollywood's nervous\nFuck you, good night, thank you much for your service"}