{"song_id":26625,"song_name":"Wesley's Theory","artist_id":305702,"display_artist":"Kendrick Lamar Featuring George Clinton & Thundercat","spotify_id":"77hlBnevpj8cbiH7sc0Iro","lyrics":"Every nigger is a star\nEvery nigger is a star\nEvery nigger is a star\nEvery nigger is a star\n\nEvery nigger is a star\nEvery nigger is a star\nWho will deny that you and I and\nEvery nigger is a star?\n\nHit me\nWhen the four corners of this cocoon collide\nYou'll slip through the cracks hoping that you'll survive\nGather your wind, take a deep look inside\nAre you really who they idolize?\nTo pimp a butterfly\n\nAt first, I did love you\nWhen I just wanna fuck\nLate night thinkin' of you\nUntil I got my nut\n\nTossed and turned, lesson learned\nYou was my first girlfriend\nBridges burned, all across the board\nDestroyed, but what for?\n\nWhen I get signed, homie I'mma act a fool\nHit the dance floor, strobe lights in the room\nSnatch your little secretary bitch for the homies\nBlue eyed devil with a fat ass monkey\nI'mma buy a brand new Cutty on fours\nTrunk the hood up, two times, deuce four\nPlatinum on everything, platinum on wedding ring\nMarried to the game, made a bad bitch yours\nWhen I get signed homie I'mma buy a strap\nStraight from the CIA, set it on my lap\nTake a few M-16s to the hood\nPass 'em all out on the block, what's good?\nI'mma put the Compton swap meet by the White House\nRepublican, run up, get socked out\nHit the pres with a Cuban link on my neck\nUneducated but I got a million dollar check, like that\n\nWe should never gave, we should never gave niggas money\nGo back home, money go back home\nWe should never gave, we should never gave niggas money\nGo back home, money go back home\n\nAt first, I did love you\nWhen I just wanna fuck\nLate night thinkin' of you\nUntil I got my nut\n\nTossed and turned, lesson learned\nYou was my first girlfriend\nBridges burned, all across the board\nDestroyed, but what for?\n\nYo what's up? It's Dre\nRemember the first time you came out to the house?\nYou said you wanted a spot like mine\nBut remember, anybody can get it\nThe hard part is keeping it, motherfucker\n\nWhat you want you a house or a car?\nForty acres and a mule, a piano, a guitar?\nAnything, see my name is Uncle Sam, I'm your dog\nMotherfucker, you can live at the mall\nI know your kind, that's why I'm kind\nDon't have receipts, oh man, that's fine\nPay me later, wear those gators\nCliche and say, fuck your haters\nI can see the borrow in you, I can see the dollar in you\nLittle white lies with a snow white collar in you\nBut it's whatever though because I'm still followin' you\nBecause you make me live forever baby, count it all together baby\nThen hit the register and make me feel better baby\nYour horoscope is a gemini, two sides\nSo you better cop everything two times\nTwo coupes, two chains, two C-notes\nToo much ain't enough both we know\nChristmas, tell 'em what's on your wish list\nGet it all, you deserve it Kendrick\nAnd when you hit the White House, do you\nBut remember, you ain't pass economics in school\nAnd everything you buy, taxes will deny\nI'll Wesley Snipe your ass before thirty-five\n\nLookin' down is quite a drop (It's quite a drop, drop)\nLookin' good when you're on top (When you're on top, you got it)\nA lot of metaphors, leavin' miracles metaphysically in a state of euphoria\nLook both ways before you cross my mind\n\nWe should never gave, we should never gave niggas money\nGo back home, money go back home\nWe should never gave, we should never gave niggas money\nGo back home, money go back home\n\nTax man comin', tax man comin'\nTax man comin', tax man comin'\nTax man comin'"}