{"song_id":26639,"song_name":"Good Lovin","artist_id":308504,"display_artist":"Ludacris Featuring Miguel","spotify_id":"3TxpOBmKTHuKD4mNdgkPYt","lyrics":"I keep dwellin' on the past, babe\nKnow what I need, yeah\n\nI need some real good lovin'\n'Cause I'm troubled by the things that I see\nI need some real good lovin'\n'Cause ain't nobody been around here lovin' on me\n\nIt's better to love and then lost than to never have loved at all\nIf that was true I wouldn't be drinking this alcohol\nEvery relationship failed to take a toll on you\nEspecially when you had hoes and area codes on you\nIs it easier to erase my memories\nAt a point when most of my past women became my enemies?\nSome on the fence, some befriended me\nBut when we see each other it's gon' be some weird energy\nI'm sorry that we couldn't make it work\nBelieve in your heart, I never intended to make you hurt\nNow they see me on the blogs with my new girl\nFriends talking 'bout \"that's supposed to be you, girl\"\n\nI need some real good lovin'\n'Cause I'm troubled by the things that I see\nI need some real good lovin'\n'Cause ain't nobody been around here lovin' on me\n\nI got a empty hole in my chest\nHow do I fill it? Somebody give a prescription\nI guess I gotta learn to live with regrets\nPay for mistakes and your exes take a commission\nBut what's a percent off the top when you hit the bottom\nAfter you break up wondering how to live without 'em?\nNeed solutions, less problems\n'Cause if love will drive you crazy I belong in the insane asylum\nHear the rain, feel the pain inside 'em\nKinda lost, need someone to guide 'em\nIt's nothin' worse than feelin' alone\nBut I'll admit to feelin' better when I'm hearing this song, it goes\n\nI need some real good lovin'\n'Cause I'm troubled by the things that I see\nI need some real good lovin'\n'Cause ain't nobody been around here lovin' on me\n\nSo I, dwelling on the past, all the moments on repeat, baby\nPlaying empty songs when I'm blowing my high\nFeeding my heart to a lion called guilt on an empty bed\nOn an empty bed\nDwelling on the past, all the moments on repeat\nPlaying empty songs when I'm blowing my high\nFeeding my heart to a lion called guilt on an empty bed\nWhile I lose my mind\nSo you know what I need\n\nI need some real good lovin'\n'Cause I'm troubled by the things that I see\nI need some real good lovin'\n'Cause ain't nobody been around here lovin' on me"}