{"song_id":26694,"song_name":"Electric Body","artist_id":275210,"display_artist":"A$AP Rocky Featuring ScHoolboy Q","spotify_id":"6br4Pc0BzU6dTD5fEmks2i","lyrics":"A$AP Rocky\nYeah, this year we finna make a killin'\nNow the money stack up to the ceilin'\nAll I know is payback, all I rep is A$AP\nNow we finna go off in the buildin'\nI could really give a fuck about your feelings\nThis'd be a schoolboy and a rude boy too\nNot a jerk like the new boys, groovin' like ScHoolboy Q, nigga\nI done killed a few boys, nigga\nDown a couple shots, turn it up another notch\nGot a bitch that's in the spot and she faded\nYeah, corset top with the new ass shots\nCouple Instagram likes, now she famous\nNose job, workin' on some payments\nOn a new car, now she finna trade it\nNext time, you shouldn't've sucked a nigga dick for free\nMan, I swear the smart girls are my favorite\n(Oh, my God, your cable's turned off\nYou shouldn't've sucked the nigga's dick for free)\nBrand new 'Rari, finna race it\nI am not the nigga you should play with\nThis year, I turned it into the races\nAll I wanna see is green faces\nAll I wanna count is green numbers\nMan that shit is weird, lookin' like The Matrix\nGave 'em high power, Always Strive and Prosper\nOnly took a little bit of patience\n\nShorty she like to pop ass high\nPopped her way up to first class high\nShe clap-clap-clap-clap-clap, she drop it low\nThen she clap-clap-clap-clap-clap, down to the floor\nShake that ass girl, make that coochie wet\nShake that ass girl, make that coochie wet\nShake that ass girl, make that coochie wet\n\nScHoolboy Q\nEver seen a crib like this? Diamonds in my ear like wrists\nPull off at the light like, 'Wuh', lookin' like a mil in that trunk\nTwo-seater got me lookin' all clumped, hit a nigga wig on sight\nServe a nigga mom off work, I'ma get it so high, I'm Christ\nNigga, ball so hard like Mike, I could whip that bitch like Ike\nI can fuck your bitch off hype, pink ring, got bling all right\nHow a hot nigga rock this ice? 14, almost got that strike\n14, almost did that time, 14, had a 905\nClip small, but the shit shoot fine\nShoot a spine, make a nigga recline\nStart sparkin', a nigga go blind, G Ride, hoppin out of Nissans\nDo I got them hoes chirpin'? Yeah\nDo I put the work in? Yeah\nDo I got them hoes out workin'? Yeah\nDo I make 'em put the work in the Birkin? Yeah\n\nA$AP Rocky\nShorty she like to pop ass high\nPopped her way up to first class high\nShe clap-clap-clap-clap-clap, she drop it low\nThen she clap-clap-clap-clap-clap, down to the floor\nShake that ass girl, make that coochie wet\nShake that ass girl, make that coochie wet\nShake that ass girl, make that coochie wet\n\nWith your electric body, we found ourselves with perfect ways\nWith your electric body, we're never gonna be alone\nWith your electric body, we found ourselves with perfect ways\nWith your electric body\nWith your electric body\nWith your electric body"}