{"song_id":26701,"song_name":"Planes","artist_id":304467,"display_artist":"Jeremih Featuring J. Cole","spotify_id":"75rDNLl8v6qVYHXGzfHv4c","lyrics":"This one goes out to all sides world wide\nLet that play ass nigga thumpy be your guide\nAs we go on a ride with playa hatin' killers and hood niggas thrive\nAnd lame mah'fuckers can barely survive\n\nCatch me rollin' through the city\nRidin' with the top off\nMan, my whip so big when you in it\nFuck around and get lost\nTold my bitch to let her hair down\nWhat this shit costs?\nTell me, baby, if you 'bout that life right now\nI hope it ain't talk, no\n\nI can put you in the Mile High Club, what's up?\nLet's take a trip\nHave you ever read \"The World Is Yours\"\nOn a blimp?\n\nTell her be free, baby spread your wings\nGot your legs in the sky like a plane\nLet me guide that, I'm the pilot\nCan't nobody see you 30 thousand feet\nOn your knees in them Prada's\nMakin' freaky shit come up out her\n\nGet high baby roll one, cloud nine, 'bout to go up\nLovin' the feelin' the turbulence get when we turn up\nWhen we land we can roll out\nShow you somethin' you ain't know about\nTonight we be takin' off flight with a camera to show out\n\nI got you in the air, your body in the air\nHow it feel up here?\nYou can scream as loud as you want, and loud as you can\nAnd ain't nobody gonna hear\nWould you like it better\nIf I hit the west coast?\nTell me, if you 'bout that life right now\nI hope it ain't talk\n\nI can put you in the Mile High Club, what's up?\nLet's take a trip\nHave you ever read \"The World Is Yours\"\nOn a blimp?\n\nTell her be free, baby spread your wings\nGot your legs in the sky like a plane\nLet me guide that, I'm the pilot\nCan't nobody see you 30 thousand feet\nOn your knees in them Prada's\nMakin' freaky shit come up out her\n\nGet high baby roll one, cloud nine, 'bout to go up\nLovin' the feelin' the turbulence get when we turn up\nWhen we land we can roll out\nShow you somethin' you ain't know about\nTonight we be takin' off flight with a camera to show out\n\nCole World, I got it, I got it, I got it, listen\nYou need a nigga that's gon' come over and dig you out\nYou need a nigga that you know is not gon' run his mouth\nYou need a nigga when he done probably gon' put you out\nYou need a nigga that's gon' put it in your mouth\nDick so big it's like a foot is in yo' mouth\nAnd y'ain't babysitting, but my kids all on yo' couch\nAnd oh, you nasty, oh, oh, you nasty\nBoth graduated so fuck keepin' it classy\nLook, they love me in the Chi like MJ\nThey love me in the Chi like Oprah\nNo nigga could block, not even Dikembe\nCompared to Cole, boy, you're softer than a sofa\nAnd so far my new shit's so fire, nigga, check my profile\nWho you know make waves in a low tide?\nDeebo'ed yo' bitch, now she both ours\nNigga, little brown liquor in my liver\nPretty brown thang in my bed\nBeen a long time since I had to ask for head\nSo god damn don't make me beg\nBut I will if I need to 'cause for real, girl, I need you\nI could put you on a flight, we could take off tonight\nIf you scared of heights, shit I got a pill I could feed you\nCole\n\nI can put you in the Mile High Club, what's up?\nLet's take a trip\nHave you ever read \"The World Is Yours\"\nOn a blimp?"}