{"song_id":26722,"song_name":"All Eyes On You","artist_id":310352,"display_artist":"Meek Mill Featuring Chris Brown & Nicki Minaj","spotify_id":"0hy1SOTEn9ifXTzOwnCwEr","lyrics":"Chris Brown\nBaby, is you drunk cause you had enough?\nAre you here lookin' for love? Oh\nGot the club goin' crazy\nAll these bitches, but my eyes on you\nIs you somebody's baby?\nIf you ain't, girl what we gon' do?\nIf you gon' need it, baby\nGive it all up for you right now\nWe got the club goin' crazy\nAll eyes on you\n\nMeek Mill\nShe was the baddest, I was the realest\nWe was the flyest, up in the building\nWe was countin' this money, lovin' the feelin'\nLook at you now, in love with a hitta\nBut now it's all eyes on me, and it all lies on me\nTo say somethin' to your pretty ass\nSome hood shit, like \"what you looking at?\"\n'Cause I'm good for that, Birkin bags, I'm good for that\nMight just be your plug for that\nYou might fall in love with that, got love for that\nWhat's your name? Who you with?\nWhere you from? You the shit\nChoose and pick, get the right one\nAll these chicks, got to like one\nAll these hit you, got to like one\nAll these bottles, got to like some\nAll these models, got the right one\nWhat you gon' do? Hide or run?\n\nChris Brown\nBaby, is you drunk cause you had enough?\nAre you here lookin' for love? Oh\nGot the club goin' crazy\nAll these bitches, but my eyes on you\nIs you somebody's baby?\nIf you ain't, girl what we gon' do?\nIf you don't need it, baby\nGive it all up for you right now\nWe got the club goin' crazy\nAll eyes on you\n\nNicki Minaj (Meek Mill)\nHe was the realest, I was the baddest, we was the illest\nWhen he approached me, I said, \"Yo what the deal is?\"\nIn and out them dealers, rockin' chinchillas\nI got him in the back of that 'bach, I think he catchin' feelings\nNow it's all eyes on us, and this all lies on trust\nAnd if them bitches wanna trip, tell 'em they tour guides on us\nThis kitty cat on reclusive, he duck, duckin' them gooses\nI put him on to that new new, now he only fuck with exclusives\nHe's like (What's your name?) My name Nick\n(Where you from?) New York in this bitch\n(Choose and pick) You got the right one\nAll them hoes, ain't nothin' like them\nNigga you know you'd never wife them\nNone of them niggas ain't never hit this\nStill at the top of all their hit lists\nWhat they gon' do? Meek and Nick\n\nChris Brown (Nicki Minaj)\nBaby, is you drunk cause you had enough?\nAre you here lookin' for love? Oh\nGot the club goin' crazy\n(All these hittas, but my eyes on you\nIs you somebody's baby?\nIf you ain't, boy what we gon' do?)\nIf you don't need it, baby\nGive it all up for you right now\nWe got the club goin' crazy\nAll eyes on you\n\nMeek Mill (Nicki Minaj)\nShe was the baddest (He was the realest)\nWe was the flyest (We was the illest)\nI was the realest (I was the baddest)\nWe was the flyest, up in the buildin'"}