{"song_id":26730,"song_name":"Play No Games","artist_id":281681,"display_artist":"Big Sean Featuring Chris Brown & Ty Dolla $ign","spotify_id":"3rsOs39rDAYxIOrDTHAgR9","lyrics":"OK, I won't deny it\nHalf the time you send a text, yep, you know I'm not replying\nJust to let you know, I'm not one of them niggas you be dodging\nI'm the one that you dodge with\nI'm the one that you gon' take that dress you saving out the closet\nI'm the one you need alone\nI'm the one that when you round your friends, that you gotta put on speakerphone\nJust so you can let them know what we be on, like he the one\nYeah yeah, I know I'm young but you respect me like a father figure\nYoung mobbish nigga, probably make you farther figures\nSean Don Perrier out in Paris with a pair of Ye's going\nWell, I would tell you but I gotta paraphrase\nAnd even when you tripping, we tripping, I pay for ya\nGourmet for ya, chauffeur arranged for ya\nI'll take that flight alone earlier in the day for ya\nJust to beat you there and prepare, let you know I'm waiting for ya\nFinally famous\n\nI ain't like them other niggas\nAnd I ain't bout to play no games with you\nYou know what your problem is?\nYou don't ever see the big picture\nI want you to take me serious\nBaby, I want you to take me serious\n\nWait, wait, waiting for ya\nI be wait, wait, waiting for ya\nYou've got a young boss nigga like me waiting for ya\nYou've got that bomb ass pussy, I've been waiting for ya\nWho ya love? Tell me who you fucking love\nTell me who you wanna fucking love\nI left that sexy dress out on the bed with a note there laying for ya\nWith directions where I'm waiting with dinner and waiter for ya\nI'm that nigga, she tell me I'm that nigga\nI'm the nigga that's your nigga even when you got a nigga\nThat you make love with, but right before take drugs with\nThen right after, hit the tub, wait on me with suds\nThen you back that ass up on me like it's 99\nWine fine, like a bottle from the 99\nHit you with the 99 like it's fucking primetime\nKilled the pussy, had to hit that shit like nine times\nGirl, even when I'm gone, just know I'm there for ya\nI'm all ears, in other words here for ya\nI'd probably rob a fucking bank and go to jail for ya\nAs long as I can smack that ass and pull that hair for ya\nFinally famous\n\nI ain't like them other niggas\nAnd I ain't bout to play no games with you\nYou know what your problem is?\nYou don't ever see the big picture\nI want you to take me serious\nBaby, I want you to take me serious\n\nI've been waiting on that ass all night though\nGirl, don't keep me waiting long\nYeah, yeah\nIt's true\nGot some things I wanna do to you, baby\nOh\n\nI ain't like them other niggas\nAnd I ain't bout to play no games with you\nYou know what your problem is?\nYou don't ever see the big picture\nI want you to take me serious\nBaby, I want you to take me serious"}