{"song_id":26747,"song_name":"Where Ya At","artist_id":302577,"display_artist":"Future Featuring Drake","spotify_id":"5nN8BwAQDJDguq7Dpd3JQQ","lyrics":"Where your ass was at dog, when niggas wasn't feed me?\nWhere your ass was at dog, when bitches didn't need me?\nWhere your ass was at dog, when niggas tried to run off?\nWhere your ass was at dog? You made me pull this gun out\nWhere your ass was at, dog, you went and switched sides?\nWhere your ass was at, dog, when niggas spread lies on you?\nWhere your ass was at, dog, when the bodies come slide?\nWhere your ass was at, dog, when I was serving piles?\nWhere your ass was at, dog, when niggas wasn't feeding?\nWhere your ass was at, dog, when bitches didn't eat?\nWhere your ass was at, dog, when niggas tried to run off?\nWhere your ass was at, dog? You made me pull this gun out\nWhere your ass was at, dog, when I was in the Pyrex?\nWhere your ass was at, dog, when I was drinking Hi-Tech?\nWhere your ass was at, dog, came through the projects?\nWhere your ass at we keep that fully loaded contracts\nHad to rent that on the dick ass jocking\nRunning through the pussy like a nigga going jogging\nFuck a little Louis, put it in a bitch pocket\nPut a pic with me on the gram now you popping\nWhere your ass was at when I was trapping in the stove?\nHad to struggle to get where I'm at and sell dope\nJackie Chan moves got game in the choke\nGas rolling up in the blunt, Amoco\n12 jumpers came in the spot to open up the dope\nCarlo, Bob, Joe gotta young nigga coughing\nJanet out the stove and we still raised honest\nBlowing on the O ho we call it full onion\n\nMan, where your ass was at when we took the city over?\nWhere your ass was at when all they ask us, \"What's the hold up?\"\nWhere your ass was at when niggas first got the news?\nNow your ass around because we're paying back dues\nWhere were you? When all the dogs needed help\nLawyers and the commissary ain't gon' pay itself\nWhere your ass was at when we recorded in the bathroom?\nWhere your ass was at I take attendance like a classroom\nMan I ain't got no choice 'cause nowadays I swear this shit done changed up for the boy\nI'm selfmade, selfish with my women, self employed\nI'll buy the neighbors house if they complain about the noise\nMan, where your ass was at, dog, when niggas wouldn't feed me?\nWhere your ass was at, dog, when bitches didn't need me?\nWhere your ass was at, last winter was the coldest?\nFuck was you at? I had the 6 on my shoulders\n\nWhere your ass was at dog, when niggas wasn't feed me?\nWhere your ass was at dog, when bitches didn't need me?\nWhere your ass was at dog, when niggas tried to run off?\nWhere your ass was at dog? You made me pull this gun out\n60 for a walk through bitch don't panic\nHad them bitches fall through fucking like a savage\nHeard you tryna swim in the ocean no jacket\nHeard that nigga came through squeezing on a ratchet\nHeard that nigga came through squeezing on a ratchet\nHeard a lot of dogs who will call you a mutt\nWhere your ass was at dog, when I was in my cup?\nThe reason I'm here today is 'cause I never gave up\nWhere your ass was at, dog, when niggas wasn't feed me?\nWhere your ass was at, dog, when bitches didn't need me?\nWhere your ass was at, dog, when niggas tried to run off?\nWhere your ass was at, dog? You made me pull this gun out\nWhere you ass was at, when I was trapping at the stove?\nHad to scrub to get where I was at and sell dope\nJanet out the stove and we still raised honest\nBlowing on the O ho we call it full onion"}