{"song_id":26817,"song_name":"$ave Dat Money","artist_id":6656889,"display_artist":"Lil Dicky Featuring Fetty Wap & Rich Homie Quan","spotify_id":"6AoYWCzsDls6c61Zp5qTuU","lyrics":"LD, AKA The Independent Variable\nTrap God, and we servin' up the whole world\n\nAy, where the gold at, baby?\nAy, where the clothes at, baby?\nAy, where the dough at, baby?\nIn the bank, you know I ain't tryna blow that, baby\nAy, we gon' save that money (I'm so thrifty)\nAy, we gon' save that money (I'm so stingy)\nAy, we gon' save that money\nWhat we do? We gon' save that money\n\nRap game got it all wrong\nWe ain't 'bout to go and spend money just to flex on them\nWe ain't really got it like y'all (Yeah, baby!)\nI'm a type of motherfucker that'll check the check\nDo the math, I ain't never gettin' robbed\nThose margaritas not goin' on my card\nI ain't 'bout to split a damn thing for convenience sake\nI'm at the restaurant workin' that waitress\nHold up\nYou ain't heard of Lil Dave, Yung L, The Jew Biz Major?\nFuck you know about the world he raised in?\nI've been savin' money since a motherfucker thirteen\nI wear the same pair of jeans everyday\nFree sandwiches, homie, two stamps away\nBook flight December but I leave in May\nDrugs are generic but still work the same\nI get logins for Netflix from my cousin Greg\nThanks Greg!\n\nAy, where the gold at, baby?\nAy, where the clothes at, baby?\nAy, where the dough at, baby?\nIn the bank, you know I ain't tryna blow that, baby\nAy, we gon' save that money (I'm so thrifty)\nAy, we gon' save that money (I'm so stingy)\nAy, we gon' save that money\nWhat we do? We gon' save that money\n\nAll of my luggage is Louie V, I swear to God, nigga\nAll of my bitches be scared of me, I put that rod in 'em\nAll of them bitches actin' thoughtless, I disregard them\nAll of them bitches actin' holy, ain't got no God in 'em\nI can teach a lil nigga somethin', preacher\nI can take his ass church fresh as hell, no Easter\nI can make his ass burp like a baby without no hiccup\nI can...\n\nQuan what's this have to do with saving money though?\nYou know a full verse would have been too expensive anyways\nI think\n\nI ain't parkin' that unless the meter green, homie\nHair cut several months in-between, homie\nHit the motherfuckin' lights when I leave, homie\nSingle ply TP ass bleed\nAirbnb the mother fucker, least I'm never there\nI'm in Cali, why the fuck my company in Delaware?\nHappy hour takin' out the chicken, I don't even care\nThat applies to both dating and wings\nPeep matinees phone bill got the motherfuckin' fam on it\n401k rollin' over bands on it\nCoppin' sweaters in the summer when the sale on them\nThe fuck you rappers bragging bout? You overpaying for it\n\nAy, where the gold at, baby?\nAy, where the clothes at, baby?\nAy, where the dough at, baby?\nIn the bank, you know I ain't tryna blow that, baby\nAy, we gon' save that money (I'm so thrifty)\nAy, we gon' save that money (I'm so stingy)\nAy, we gon' save that money\nWhat we do? We gon' save that money\n\nI ain't never hit a bar with a cover\nLow thread count, hard with the covers\nFree trial memberships though\nI never join the shiz though\nFuck you think this is though?\nFrequent flying like a motherfuckin finch do\nGeneral Tso, half a dozen on the stick\nJust so I can whet the appetite of dick\nWhat you talkin' about?\nMy AC never doing nothing, blow fans\nWalgreens card shoppin' all the off brands\nBoy go hard when collecting, got Venmo\nSave every motherfuckin' roach, tryna smoke\nCheck the clothes in my drawers, I ain't playin' around\nIt's LD, lil boy, Mr. Hand-me-down\nDirty drawers gettin' worn, can you blame me now?\nYou think I got $4.50 up in quarters on me well I fucking don't!\n\nAy, where the gold at, baby?\nAy, where the clothes at, baby?\nAy, where the dough at, baby?\nIn the bank, you know I ain't tryna blow that, baby\nAy, we gon' save that money (I'm so thrifty)\nAy, we gon' save that money (I'm so stingy)\nAy, we gon' save that money\nWhat we do? We gon' save that money\n\nEverytime these niggas tryna play\nAnd lately I've been stackin' up crazy\nStackin' up cause all about the bands, baby\n800k underneath the bed baby\n\nIf you at a restaurant and got an iced coffee\nAnd the waiter been refillin' that without a word of caution\nAnd you get your fuckin' bill and you can see 'em double chargin'\nFor the coffee and you told 'em there's a problem\nSing along like\nOh, don't double charge for me for that\nOh, don't double charge for me, we like\nOh, don't double charge for me for that\nDon't do it to yourself\n'Cause I might just ask what the ice cube's worth\nThat's the only differentiator making this a non-free perk\nAnd I might make work more difficult for you than it need be\nSo think about it, take a minute, let it breathe, B\nBut think about it, bruh, you saw me take the burger with the bacon on the side\nAfter looking at the price of the side of just bacon\nAnd comparing it to the what the difference in the cheeseburger\nVerse the bacon cheeseburger was and making my decision\nI would hate to be the waiter trying to tell me something different\nI'mma get on Yelp in a minute and review\nThis piece of shit place like only a kike know how\nUnless you take the extra coffee off I might get loud unless you...\nOh, it was just an accident?\nYou didn't even mean that \nYou didn't even... that was... that's... I'm so embarrassed"}