{"song_id":26897,"song_name":"Home Alone Tonight","artist_id":308556,"display_artist":"Luke Bryan Featuring Karen Fairchild","spotify_id":"2phomyGUWSjrHUXzbsYv17","lyrics":"(Oh oh)\nWhat you doing in this pace?\nWell I could probably ask you the same thing\nAnother round, girl, what you think?\nIf you're buying, well you know I'll drink\nSo make a seven and seven\nDo you want it on the rocks?\nA double shot of heaven\nSpilling' off the top\n\nWe'll go shot for shot for shot till we forgot what we came here to forget\nAin't a clock, a tick, a tock that's gonna stop a night we won't regret\nSo put your drink down and throw your camera up, flip it around and snap a payback picture\nSend it to my ex, I'll send it to my ex and send 'em both a text\nSaying we ain't we ain't going home alone tonight\nGirl you ain't gotta, I ain't gotta go home alone tonight\n\nSlow country from a cover band, I got you covered if you don't know how to dance\nBut if you want we could grab a cab... Girl we got all night, I've got a bottomless tab\nSo lets go...\n\nShot for shot for shot till we forgot what we came here to forget\nAin't a clock, a tick, a tock that's gonna stop a night we won't regret\nSo put your drink down and throw your camera up, flip it around and snap a payback picture\nSend it to my ex, I'll send it to my ex and send 'em both a text\nSaying we ain't we ain't going home alone tonight\nGirl you ain't gotta, I ain't gotta go home alone tonight\n\nIt feels too good to let it end right here (I ain't going home alone home tonight)\nSo lets not let it end, let it end right here (girl you're going home with me tonight)\n\nSo lets go shot for shot for shot till we forgot what we came here to forget\nAin't a clock, a tick, a tock that's gonna stop a night we won't regret\nSo put your drink down, throw your camera up, flip it around and snap a payback picture\nI'll Send it to my ex, I'll send it to my ex and send 'em both a text\nSaying we ain't going home alone tonight\nGirl you ain't gotta, I ain't gotta go home alone tonight\n\nWell I ain't going home alone tonight\nGirl you ain't gotta, I ain't gotta go home alone tonight\nIf you wanna, I ain't going home tonight\nHome alone tonight"}