{"rank":"34","song_id":"17260","song_name":"Principal s Office","artist_id":"431684","display_artist":"Young MC","spotify_id":"3XB0F5lxqPPCQuiDbxjApq","lyrics":"Now normally if I can help it\nI don't spend a lot of time in a principal's office\n(RING!!!) What!? 9'o Clock!!!\nNow as I get to school\nI hear the late bell ringing\nRunning through the hall\nI hear the glee club singing\nGet to the office\nI can hardly speak\n'Cause it's the third late pass that I go this week\nSo to my first class I run and don't walk\nAll I hear is my sneakers and the scratching of chalk\nAnd when I get to the room\nI hear the teacher say,\n\"Mr. Young, I'm happy that you could join us today.\"\nI try to sit down so I can take some notes\nBut I can't read what the kid next to me wrote\nAnd if that wasn't enought to make my morning complete\nAs I try to get up I find this gum on my seat\nAnd with the seat stuck to me,\nI raise my hand and say,\n\"Excuse me, but can I go to the bathroom, ma'am?\"\nThe teacher got upset and she screamed out \"No\"\nIt's off to the principal's office you go\n12'o clock comes with mass hysteria\nEverybody rushes down to the cafeteria\nPicked up my tray to have Thursday's lunch\nAnd when I tried the applesauce\nI heard it crunch\nI'm running up the stairs with a front tooth broken\nThe nurse just laughs and says,\n\"You must be joking.\"\nI look up at her with a smile on my face\nNo joke 'cause my front tooth is out of place\nSo I walk to school with ice on my lip\nA nurse's late pass like a gun on my hip\nMy books are real heavy\nI walk and I'm dragging\nAin't no school lunch next week,\nI'm brown-bagging it\nForget class\nI'ma shoot some ball\nWith a late pass I've got no trouble at all\nBut then the nurse walks up and says,\n\"What do ya know?\nIt's off to the principal's office you go\"\nRecess\nPassing notes is my favorite pastime\nI can't wait to find a girl to pass mine to\nTo express my feelings\nGive me a week\nMe and the girl will be dealin\nNow one young lady was looking at me\nI said,\n\"Hi, my name is Marvin, known as Young MC.\"\nBut then the bell rang and the teacher came in\nAnd that's when the game of passing notes will begin\nI wrote the first note and told her she was fine\nAnd I hope that the two of us could spend some time\nShe wrote me back and told me you're fine, too\nI'd love to go on a date and spend some time with you\nSo I sat there reeling and looking at the ceiling\nWords can't express the way that I was feeling\nThen I thought to myself,\nThe sure way to get her is to write another note\nOh, yes, a love letter\nWhen I finished the note it was ready to pass\nThe teacher took it\nAnd read it right in front of the class\nShe read it word by workd and line by line\nAnd everybody who was laughing was a friend of mine\nEven my girl was laughing\nIt was too late\nNo need to write another note\n'Cause there would be no date\nThe teacher looked at me and I said,\n\"I know, it's off to the principal's office I go\"\nYo, you think this bad?\nWait till I get my report card"}