{"rank":"60","song_id":"17365","song_name":"Expression","artist_id":"277460","display_artist":"Salt-N-Pepa","spotify_id":"3JempQ95v2ScWFBAGko352","lyrics":"Oh yeah, oh yeah\nYou know life is all about expression\nYou only live once, and you're not coming back\nSo express yourself, yeah\n\nCHORUS\nExpress yourself, you gotta be you and only you, babe\nExpress yourself, and let me be me\nExpress yourself, don't tell me what I cannot do, baby\nCome on and work your body\n\nNow Joe wanna be like Bob\nBob got it goin' on with no job\nAnd everything Rob got he got from Robin\nAnd everything she got she got ho-hoppin'\nMy girl Jilly wanna be like Jackie\nFat rope chains and I think that's wick-wacky\nTom and Dick wanna be like Harry\nLittle do they know he's bitin' on Barry\nStan was a scam, but Vinnie's legit\nMercedes coupe hometroop with no kit\nA businessman with a beeper for a reason\nNot like Tim because it's in this season\n\nCHORUS\n\nOh yeah, oh yeah\nHey Pep, you up next\n\nYes, I'm Pep and there ain't nobody\nLike my body, yes, I'm somebody\nNo, I'm sorry, I'm-a rock this Mardis Gras\nUntil the party ends, friends\nYes, I'm blessed, and I know who I am\nI express myself on every jam\nI'm not a man, but I'm in command\nHot damn, I got an all-girl band\nAnd I wear the gear, yeah, I wanna wear it, too\nI don't care, dear, go ahead and stare (oooo)\nAfraid to be you, livin' in fear (boo)\nExpression is rare, I dare you\n\nCHORUS\n\nOh yeah, oh yeah...\nYo, excuse us while we rap\nGo ahead, girls, express yourself!\n\nMy party, your party, anytime drop in\nCold hip-hop is always rockin'\nDon't you like it when the music drop\nJump, spread out, and stop?\nNow bring in the go-go (uh-oh)\nLook at how my butt go rock from left to the right\nYou wanna step to me, groove me\nI know you wanna do me\nCome on now, fellas, don't fight\n\nAt my door they're bum-rushin'\nTo hear the percussion\nSound of my go-go band\nI've long ago learned my lesson\nIt's all about expression\nWill the real Salt and Pepa please stand?\nAnd...\n\nExpress yourself, you've got to be you, babe\nExpress yourself, and let me be me\nExpress yourself, don't tell me what to do, babe\nExpress yourself, come on and work that body\n\nExpress yourself, you've got to be you, babe\nExpress yourself, don't tell me what to do, babe\nExpress yourself, you've got to be you, babe\nExpress yourself, don't tell me what to do, babe\n\nExpress yourself, oh yeah, oh yeah\n"}