{"rank":"61","song_id":"17438","song_name":"Mentirosa","artist_id":"310467","display_artist":"Mellow Man Ace","spotify_id":"3P6fS71hWhZvOnnxQojJ0Z","lyrics":"Ain't got nobody, baby......baby\n\nCheck this out baby\nTenemos tremendo lio\nLast night you didn’t go \nA la casa de tu tio (Huh?)\nResulta ser hey you were at a party \nHigher than the sky \nEmborrachada de Bacardi (no i wasn't)\nI bet you didn’t know\nque conocia al cantinero (what?)\nHe told me you were drinking \nand wasting my dinero\ntalking about \ncome in and enjoy \nwhat a women gives an hombre\n(but first of all see, I have to know your nombre)\nBut I really wanna ask ya que si es verdad (would I lie?)\nand please por favor tell me la verdad\ncause I really need to know, yeah\nnecesito entender if you're gonna be a player\nor be my mujer\ncause right now you're just a liar\na straight mentirosa (who me?)\ntoday u tell me something \ny manana es otra cosa\n\nain't got nobody, baby.....baby\n\nI remember the day que tu me decias \nTime and time again que tu me querias (I do)\nand at the time hey yo te creia \nporque no sabia that u were a relambia  \ncon fulanito y menganito, joseito y fernandito,\nlarry and joey y then his brother Chico (uh uh)\nmucho que frentera that’s a straight skeezer\nsi quieres un pedazito go her way\ncause she's a pleaser\nbut I tell ya straight up porque brother me di de cuanta \nthat on Main Street her cuerpo estaba a la venta\nnow get some el que quiera\nget some cualquiera\nhey yo she don’t care man \nshe's a tremenda fiera\nyeah you're hot to trying how to get what i got\npero ya que te conozco what I got i guess not (porque?)\ncuz just a mentirosa con tu lengua venenosa \ntoday u tell me something, y manana es otra cosa\n\n[dialogue]\nmellow-\"Girl, I can't believe it.\nYou know, my mother's talking about me,\nmy friends are talking about me. Not me about you.\"\ngirl-\"About me?\"\nmellow- \"You're nothing but a skeezer\"\ngirl- \"A skeezer? Don't be calling me no skeezer!\"\nmellow-\"Tu tienes mucho flojera mami si, uh huh, la verdad.\"\ngirl- \"Uh huh. Eso es lo que tu te crees.\"\nmellow-\"I bet you go to church and you're scared to confess.\"\ngirl-\"No, I do confess baby. I do confess.\"\nmellow-\"Uh huh. Do you tell the truth, though?\"\ngirl-\"Yeah I do.\"\nmellow-\"Yeah right.\"\ngirl-\"Do you?\"\nmellow-\"Yeah! You're nothing but a skeezer you know what?\nI got some other stories to say about you. And it goes like this.\"\n\nUn dia estaba en tu casa y ring there goes the phone\nrecogiste y dijiste (\"call me back, I’m not alone.\")\nel queria tu direccion, yeah just your address \ny antes que colgaste I heard u say (\"I'll wear a dress.\")\nalabao que descarada is what ran through my mind\nso I say lets go out tonight\", she says (\"we go out all time.\")\n\"oh, oh man!\"\nella no sabia that yo I knew her plan,\nde que iba a salir with that other man \nso I told the girl in Spanish I said \"hey ya me voy.\" (pero porque?)\ncause you ain't treating me like I’m some sucker toy\ncause who needs u anyways (I need you!)\ncon tu lengua venenosa (No te vayas Mellow, no te vayas! Yo te necesito!)\ntoday you tell me something y manana es otra cosa (tsk! but?!)\nMENTIROSA!\n\nAin't got nobody..."}