{"rank":"80","song_id":"17476","song_name":"We re All In the Same Gang","artist_id":"431280","display_artist":"The West Coast Rap All-Stars","spotify_id":null,"lyrics":"[Intro]\nGun is Cocked and Fired\nI'm King News and I come to you with the truth\nThe mean streets took six more lives overnight\nAll the result of gang-bang stupidity\nBy the way, you gangsters should know\nOne of your victims was a three year old girl\nWell, you gang members, you still don't get it, do ya?\n\n(With your badself)\n\n[Verse 1: King Tee]\nIt's straight up madness everywhere I look\nUsed to be a straight a student, now he's a crook\nRobbing people just to smoke or shoot up\nUsed to have a crew cut, now he's a pooh-butt\nDropped out of school and he joins the neighborhood gang\nHanging on the streets selling 'caine\nTo his own people\nNow when I say people I mean color\nYou a stupid mother-\nI'm trying to stress the fact that you're dumb\nGet yourself presentable, son, and just come\nTogether, you better, cause pretty soon it's gonna be too late\nA message from King Tee The Great\n\n[Verse 2: Body & Soul]\nSisters, since we are the mothers of this earth\nIt's time we start being good mothers from the birth\nOf our children, no time for sleeping\nTeach them to fight and win for the right reason\nIt's your time, it's your life, live it\nProud to be black, young and gifted\nLifted by the knowledge and taking the right route\nGang violence needs to be wiped out\nA-L-M-I-G-H-Ty and E-Z-I-R-E\nWe see the F-U-T-U-R-E\nShould be a positive thing\nBody & Soul and you, we're in the same gang\n\n[Verse 3: Def Jef]\nOne and the same\nEveryone came in the same chains\nCaught with the same aim\nBrain games and names changed\nTo protect the innocent by-stander\nLies, slander and the master-planner\nDestroy the black male\nCrack jail and semi-automatic\nFor static if the crack fails\nSo since we all talk the same slang\nStop killin, my brother, cause we're all from the same gang\n\n[Michel'le]\nDon't you know we've got to put our heads together?\nMake the change cause we're all in the same gang\n\n[Verse 4: Tone-Loc]\nNow as a youth I used to get my bang on\nAnd on the ave get my part-time slang on\nDoing time for me was no joke though\nThey knew I was crazy, so they labelled me Loco\nKhakis creased, golf hat, feelin sporty\nLow ridin and tossin up a forty\nThinkin in my mind that no one could handle us\nThe downest brothers ever touched Los Angeles\nI found life was much more suitable\nCause I'm the brother that makes black so beautiful\nI ain't slippin or down with a head trip\nI'm talkin to all the Bloods and all the Crips\nThrow down your rag and get on the right track, man\nIt's time to fight, unite and be a black man\nTone-Loc is on a positive change\nCause remember, we're all in the same gang\n\n[Verse 5: Above The Law]\nBein' the pimps that we are\nWe're here to speak on a situation that has gone too far\nHere at home in the ghettos of LA\nWhere a young black brother's not promised to see the next day\nCause we used to clock on the streets before we made beats\nBut fools just lay and prey on the weak\nIt don't depend on the color of a rag\nCause if you got what they want you know they gonna take what you have\nCause violence don't only revolve from drugs and thugs\nAnd gangs that bang\nMost times it's a political thang\nYeah, a couple of spots'll get popped\nAnd if the government wanted to freeze it it could all get stopped\nBut they don't because they want it like that\nBecause the system been set up to hold us back\nYeah, Above The Law means that we can do whatever\nSo why don't we stick together?\n(You got it)\n\n[Verse 6: Ice-T]\nIce-T rippin the microphone the way I do\nListen close, my brothers, cause I'm talkin to you\nThe problem is we got a suicidal lifestyle\nCause 90 percent of us are livin foul and wild\nI say job, you say ([Hen-G:] bad joke\nI rather jack another brother, watch the gun smoke)\nLivin in the fast lane flippin like you're insane\nYou won't stop until your blood runs down the street drain\nI got an idea, give me a minute\nAnd if it makes sense, then get with it\nWhat if we could take our enemies, feed em poison\nUndereducate their girls and boys and\nSplit em up, make em fight one another\nBetter yet, make em kill for a color\nAll my brothers need to know one thing\nNo matter what you think, we're all in the same gang\n\n[Michel'le]\nDon't you know we've got to put our heads together?\nStop the fighting\n(Make the change)\nBecause we're all in the same gang\n\n[Verse 7: Dr. Dre and MC Ren]\nYo, we're not here to preach because we're not ministers\nWe're telling like it is cause Ren and Dre is like sinister\nReality speaks for itself when it's spoken\nA basehead cluck can't blame nobody for smoking\nYo, bullets flying, mothers crying, brothers dying\nLying in the streets, that's why we're trying\nTo stop it from falling apart and going to waste\nAnd keeping a smile off of white face\nN.W.A never preaching, just teaching\nThe knowledge of the streets to each and\nAll that don't understand, that's why we came\nTo let you know that we're all in the same gang\n\n[JJ Fad]\nThe J double, F, the a, the d, that is\nAnd if you want the solution to the quiz\nWhat's black and black, yo, and kills another?\nAn ignorant sucker that isn't labelled as a brother\nBut another\nSo now it's time we evolve\nAnd get together and solve it\nCause the world is revolvin\nAround a terrible situation\nOne will kill another for a reputation\nSo it's time we stop and realize that we're all the same\nYo Train, tell em (We're all in the same gang)\n\n[Young MC]\nBrothers killin' other brothers\nI thought the idea was to love one another?\nOpen up the paper to one more death\nIf y'all keep this up then there'll be no one left\nI try my best to set an example\nSayin hype lyrics over hip-hop samples\nNot just a brag or to boast but to inform\nCause we're livin in the calm before the storm\nYou see, I believe that the children are the future\nBut what's it all about if in the future they shoot ya?\nWe're all human beings, if we're cut we'll bleed\nAnd I want to see all young people succeed\nDo 9 to 5, not 5 to 10\nJust go to work and not the state pen\nCause you live better when you're out there free\nAnd that's comin straight to ya from the Young MC\n\n[Digital Underground]\nI'm in a rage\nOh yeah? Yo, why is that G?\nOther races, they say we act like rats in a cage\nI tried to argue, but check it, every night in the news\nWe prove them suckers right and I got the blues\nAmerica\nGet busy, Humpty\nThe red, the white, the blue and\nThe blue and the red\nFor Crips and Bloods\nThe white for who's got you doin\nTime bustin caps on one another\nThe Underground's down for peace among brothers\nKill a black man?\nWhat?\nYo, what are you retarded?\nTell em, Hump\nYo, do you work for the Klan?\nDo what ya like\nUnless you like gangbangin\nLet's see how many brothers leave us hangin\n\n[Oaktown's 3.5.7.]\nThe gang that should hang is the one that contains\nThe sisters and the brothers who are all in the same frame of mind\nNow listen, get loose, it's unity time\nYeah, yeah\nPeace is a presence that we all need\nThe future's in our hands, in word and deed\nI'm Terrible T and I'm Sweet LD\nWe're 3.5.7. totally\n\n[MC Hammer]\nKickin on the ave 'bout a quarter to 9\nAll the homies gettin blind in an eight ball line\nNow on this tip they started runnin at the lip\nJumped in their deuce and took a little trip\nHit the block about 12 on the tick\nThe windows went down and the nines went click\nPeople started yellin, bodies started bailin\nBullets cold flyin sendin some to hell and\nIt's gotta stop, we don't need all the violence\nPeace in the hood and a moment of silence\nWe got together not for ego or fame\nWe got involved cause we're all in the same gang\n\n[Eazy-E]\nLast but not least, yo, Eazy's no sell-out\nAnd if you can't hang in the streets, then get the hell out\nI'm not tryin to tell ya what to do\nYou have your own freedom of choice who to listen to\nYou knew good from bad, fair from foul, right from wrong\nNow your mother's singing that sad song\n(My baby ain't never hurt nobody!)\nBut he still got smoked at BeBe's party\nBut you're not the first or the last\nYou're nothin but a short story from the past\nYou're dead now, not number one but a zero\nTake notes from Eazy-E, the violent hero\n\n[Michel'le]\nDon't you know we've got to put our heads together?\nDon't you know we've got to put our heads together?"}