{"rank":"51","song_id":"17494","song_name":"La Raza","artist_id":"305823","display_artist":"Kid Frost","spotify_id":"2PaGleg2P2owsq5ktgSnlL","lyrics":"(Verse 1)\r\nQuihubo aquí estoy and I'm soy Kid Frost\r\nYo soy jefe matón yes the Big Boss\r\nA pocos lowly\r\nIs for da balas\r\nI'm puttin' in your face and U won't say 'Nada'\r\nVatos cholos you call as what you will\r\nYou say we are assessins si U wanna kill\r\nIs it my brother be a nastyboy and go\r\nSi en da street hold all betters\r\nChicanos and a brand I proud\r\nGuantes chingazos simon se desquitan\r\nRigth now in the dirt\r\nWhat's da matter? Are you afraid, you gonna get hurt?\r\nI'm with my homeboys, --- my camaradas\r\nKeepin' back my millaje, y pa mi no vale nada\r\nYo soy chingón ese\r\nLike Al Caponne ese\r\nControlo a todos solo never try to swept me\r\nSome of you don't know what's happenin' que pasa\r\nNow for you, give me, wait...\r\nCuz this is for La Raza...\r\n\r\n(Chorus)\r\nThis for La Raza, Raza... (x 2)\r\n\r\n(Verse 2)\r\nThe form to I'm speakin' is not descaro\r\nY sabes que loco? Yo soy muy malo\r\nTu no sabes nada y yo vienes haloh\r\nBeginin' in the head to many times with the palos\r\nStill you are trying to act cool, with that shit no\r\nIt's so cool, I'm the cool, you are culo\r\nIs just the big we can takin' and ever\r\n... you're the lava\r\nYour own barrio isn't backin' wa\r\nBe just lookin' your ass\r\nAnd call to your prover\r\nAnd so I'm lookin' aleft es lo que pasa...\r\nhe he... yeah... this is for La Raza...\r\nRaza, raza...\r\n\r\n(Verse 3)\r\nCrusin' en la calle, I hate for the bolo\r\nNo want to go with me, so I have to go solo\r\nAnd when I go out alone... attack\r\nI touch all that cheladas when I don't wanna absttrack\r\nEverytime that I pack my piss, I pull all that quick\r\nAll the nazis desease\r\nJust like a song when the 18 bullet\r\nGot my finger on a triker, I'm not afraid to pull it\r\nIf this bara had a not say 'mafiosos'\r\nWhen you pull it away, no seas stupid, eres baboso\r\nSi en then don't you know what's happenin' que pasa... yeah...\r\n\r\nThis is for La Raza...\r\nRaza... (x 2)"}