{"rank":"81","song_id":"17507","song_name":"Banned In The U.S.A.","artist_id":"1496787","display_artist":"Luke Featuring The 2 Live Crew","spotify_id":null,"lyrics":"[Intro: George H. W. Bush]\nGovernment of the people\nFor the people\nBy the people\n\n[Intro: Reporter]\nEarlier today in Broward County, appellate court\nJudges upheld the previous ruling to ban the sale of Miami rap group the 2 Live Crew's double-platinum album, \"Nasty As They Wanna Be,\" in Broward County\n\n[Intro: Lawyer]\nWe think it's the banning of free speech. First Amendment protects material, presumptively\n\n[Intro: Luke]\nWe don't talk about, uh, harassing and sexually brutalizing women in my music, man!\nWe don't do that in my music, man! I'm tired of you saying that!\n\n[Verse 1: Fresh Kid Ice]\nWe've got white-collar people trying to grab our style\nSaying we're too nasty and we're 2 Live\nCorrupted politicians playing games\nBringing us down to boost their fame\nThey must be joking thinking we will fall\nBut they're like flies movin' the wall\nWe stand tall from beginning to end\nWith the help from fans and all our friends\nFreedom of speech will never die\nFor us to help, our ancestors died\nDon't keep thinking that we will quit\nWe'll always stand and never sit\nWe're 2 Live, 2 black, 2 strong\nDoing the right thing, and not the wrong\nSo listen up, y'all, to what we say\nWe won't be banned in the U-S-A!\n\n[Chorus]\nBanned in the U-S-A I was\nBanned in the U-S-A I was\nBanned in the U-S-A I was\nBanned in the U-S-A I was\n\n[Interlude: Various Samples]\nLuke's concerts are for adults\nIf it's an adult show you have to be 18\nOur record is a year old, but with all the publicity\nThere's a lot of people- curiosity is aroused!\nWe're selling records to a totally different audience\nI take a precaution that nobody else has\nI stickered my album\nI made two versions- two versions- two versions\n\n[Verse 2: Brother Marquis]\nThe First Amendment gave us freedom of speech\nSo what you sayin'? It didn't include me?\nI like to party and have a good time\nThere's nothin' but pleasure written in our rhyme\nI know you don't think we'll ever quit\nWe've got some people on our side who won't take your lip\nWe're gonna do all the things we wanna do\nYou can't stand to see a brother get as rich as you\nThis is the 90s and we're comin' on strong\nSayin' things and doin' things that you're sayin's wrong\nWisen up, cause on Election Day\nWe'll see who's banned in the U-S-A!\n\n[Chorus]\nBanned in the U-S-A I was\nBanned in the U-S-A I was\nBanned in the U-S-A I was\nBanned in the U-S-A I was\n\n[Interlude: Various Samples]\n[The United States of America]\n[Government of the people]\n[The United States of America]\n[For the people]\n[The United States of America]\n[By the people]\n[By the people]\nThe show in Hollywood, that was for 21-and-over people\nThey had police out there\nCardin' the people coming in the club\nAnd they still arrested us for performing in front of adults!\n\n[Interlude: Luke]\nWhat is this? Is this not America?\nThis is not China! This is not Russia!\nThis is not the place where they brought down the wall\nThis is America!\nWe have the right to say what we want to say\nWe have the right to do what we want to do\nAnd what I do in my house, you might not do in your house\nSo what I do in my house is my business\nAnd the simple fact of it all is that we are bonded by the First Amendment!\nWe have the freedom of expression!\nWe have the freedom of choice!\nAnd you, Chinese, black, green, purple, Jew\nYou have the right to listen to whoever you want to\nAnd even the 2 Live Crew!\nSo all you right-wingers, left-wingers\nBigots, Communists, there IS a place for you in this world!\nBecause this is the land of the free, the home of the brave\nAnd 2 Live is what we are!"}