{"rank":"24","song_id":"17651","song_name":"Round And Round","artist_id":"376920","display_artist":"Tevin Campbell","spotify_id":"7mjTuZkE1XkJnco5bVsZCf","lyrics":"Aww yeah.(Round & Round & Round)(Round, R-Round)\nYeah, yeah.Ooh yeah.\n\nCan you tell me where we goin' to\nCan you tell me what it is\nWe really wanna find\nIs the truth really there \nOr is it right under our hair\nFor all we know it's been there all the time\n\nI say, nothin' comes from dreamers but dreams\nI say, sittin at night all in our bowl\nWhile everyone else is down the street\nNothin' comes from talkers but sound (oh yeah)\nWe can talk all we want to\nBut the world still goes around and round\n\nRound and Round.(Ooh hoo)\nWe go round and round and round\nAnd what we're lookin' for still isn't found\n\nCan you tell me when we're gonna get to it\nI'm tired of foolin' around, said I wanna do it (Go for it, get to it)\nOoh, I learned my lesson ya'll\nSaid if you wanna have fun go for it\nAnd when you win, say I know it (Go for it, get to it)\n\nNothin comes from dreamers but dreams\nI said, sittin all night all in our bowl\nWhen everyone else is down the street\nNothin' comes from talkers but sound\n\n(Ooh) We can talk all we want to\nBut the world still goes around and round\n(Round, round, round, round)\nRound and Round\n(Get-g-get-g-get to it)\n(Go for it, get to it)\n\nWe go round and round and round\nAnd what we're lookin for still isn't found\n\n(Rap) One day I'll make it in the big city\nAnd I'll be lookin' for a girl who's pretty\nOne day I'll make a play and she will say O.K.\n'Cause I plan to be a cool kitty\n\nRound and round (aww yeah, aww yeah)\nI said nothin comes to dreamers but dreams\nOoh I say, sittin at night all in our bowls \nWhile everyone else is down the street\nNothin' comes from talkers but sound\n\nOoh, we can talk all we want to\nBut the world still goes around and round\nRound and round.Ooh-whoo\nWe go round and round and round\nAnd what we're lookin for, still isn't found\n\nRound and round we go.Round and round we go.\nRound and around and around and around and \nAround and around we go\n\nRound and round (aww yeah) round and around we go \n(aww yeah) round and around we go (aww yeah)\nround and around we go (aww yeah)\n\nRound & Round"}