{"rank":"34","song_id":"17699","song_name":"Rico Suave","artist_id":"302775","display_artist":"Gerardo","spotify_id":"6FfdQJ9HJcJAvsPVIyoGZ5","lyrics":"Seguro que han oído que yo soy educado\nSoy un caballerito un chico bien portado\nUn joven responsible y siempre bien vestido\nYo no se quien ha mentido\n\nI don't drink or smoke ain't into dope\nWon't try no coke, ask me how I do it, I cope\nMy only addiction has to do with the female species\nI eat 'em raw like sushi\n\nNo me gustan ternos, mi estilo es moderno\nSi me enterno, you me enfermo\nMi apariencia es dura, vivo en la locura\nNo me vengan con ternuras\n\nSo please don't judge a book by its cover\nThere's more to being a latin lover\nYou got to know how to deal with a woman\nThat won't let go\nThe price you pay for being a gigolo\n\nThere's not a woman that can handle\nA man like me\nThat's why I juggle two or three\nI ain't one to commit, you can omit that bit\nYou pop the question that's it\nHaber uno, dos, tres, cuatro mujeres\nY la situaci?all?no muere\nNo es un delito calmo mi apetito\nCon un llanto o un grito\n\nSo again don't let my lyrics mislead you\nI don't love you but I need you\nWould you rather have me lie\nTake a piece of your pie and say bye\nOr be honest and rub your thighs\n\nWell, it's ten o'clock and I'm two hours late\nI never said I was a prompt date\nBut you kept persisting that I meet your parents\nHuh, they're going to love my appearance\n\nDing dong el timbre suena\nTu madre abre, que vieja mas buena\nLe digo ¡Hola! Pero no para bola\nQue se ha creido vieja chola\n\nGo and serve the food mom\nQue tengo ambre\nIf you don't hurry, me va a dar un calambre\nY usted señor? Why's your chin on the floor?\nSierra la boca por favor\n\nWhat's this amor, these little huevos?\nEsto s?que yo no pruebo\n\nI'm used to good ol' fashioned\nHomestyle Spanish cooking\nIf i try that I'll be puking\nWell it's been a pleasure but we got to go\nRegresaremos temprano\nCinco, seis, o siete de la mañana\nSu hija esta en buenas manos"}