{"song_name":"It s A Shame (My Sister)","artist_id":311761,"display_artist":"Monie Love","spotify_id":"3kAeExOaqHi47eoVKBn13W","lyrics":"My sister, my sister, tell me what the trouble is\nI'll try to listen good and give the best advice that I can give\nSo, what's up with you this time?\nYour honey took a dive and now he's playin with your mind?\nOh no, this can not be accepted\nThe feelings that belong to you must be protected\nHold up, time out, I shout, get it together sister\nTell him to be nice or ditch the mister\n\nIt's a shame the way you mess around with my heart\nIt's a shame the way you hurt me!\n[x2]\n\nGet back on your feet please\nI'm beggin you to check out all your own needs\nDon't let nobody see you in a state of grievin, over the brother\nThere's another possibility\nWhich is for you to work out where you went wrong\nI guarantee to you that it will not take long\nFor you to make your mind up if the two of you belong\nYou know where honey's head at, and where he's comin from\nGet it out your system, don't be another victim\nThis took the nerve, oh boy, he really picked em, whaddya know\nIt's time for you to show you're not sleepin\nA progress report on the two of you, you're keepin\nPeekin through the peephole, to see if honey's sneakin\nYou estimated right, that night the other weekend\nCollectively the facts should conclude the decision\nYou caught the brother in a terrible disposition\n\nIt's a shame the way you mess around with my heart\nIt's a shame the way you hurt me!\n[x2]\n\nThat's it, pack it up, be wise my sister\nCause the facts keep stackin up, tell him, to kiss the you know what\nMake sure the door is shut, behind you\nI do believe the brother's out of luck, and stuck\nBut that's not, your P-R-O-B-L-E-M\nYou gotta let him go and let him know this is the end\nYou've been kissed, dissed, listed as a dumb one\nI hope he likes sad songs, he's gonna hum one\nHe's been a dum dum and that's the way it is forever\nThere comes a time, when you're at the end of your tether\nAnd you know, I think you went Far beyond that\nSo it was bound to backtrack\nAnd smack you with an irksome vengeance as it attacks you\nMakin sure you get the full entire view\nOf who's to blame, at the end, of the game\nThings will never be the same\nAnd it's a cryin shame\n\nIt's a shame the way you mess around with my heart\nIt's a shame the way you hurt me!"}