{"rank":"44","song_id":"17788","song_name":"Playground","artist_id":"279488","display_artist":"Another Bad Creation","spotify_id":null,"lyrics":"GA:\nYeah, boy. Another ABC card\nComin' from the playground\nTake it straight back to the bricks\nYo Chris, tell 'em where it is\n\nChris:\nChillin, cooler than a squeak, kickin' dirt on my sneakers\nSuckers on the corner lookin down at their beepers\nThey couldn't get a job or a nice home\nSo they wanna stay and wait for the pay-phone\nTake JoJo he's the youngest\nGirls jock him cuz he's reverse dressed\n?? strollin through the neighborhood\nSweatin' their brother tryin' to see why he's doin' good\n(sounds of sirens)\nRollin' through the park tryin' to make another hit\nLittle do they know that soldier's legit\nI'm not sayin this to put nobody down\nThis is what I see at the playground, ya know!\n\nGA:\nAwww yeah! Another ABC smash\nBut don't it make ya mad?\nUh, come on come on everybody\nAnd guess who's up next, kick it!\n\nDave:\nL-I-L D-A-V-E, 4 feet, shorty of the crew\nJust let me get on the mic and show you what I can do\nCold rockin' the microphone at home\n?? playin' under the phone\nLarge is how I'm livin', homes\n\nGroup:\nKick it D kick it D kick it\nPunch it D punch it D punch it\nSwing it D swing it D swing it\n\nDave:\nI swing my beats at the playground, ya know!\n\nGA:\nPut your hands in the air\nPut your hands in the air\nI don't wanna see nobody sittin' in their chair\nTrue dat! True dat! Yo Ro you are next!\n\nRo:\nWell Im RoRo comin in third\nNow its about that time that I get heard (hey!)\nAnd none of my rhymes will never ever be served\nWord to her play tricks on your nerves\nEverywhere I swerve is real superb\nAnd I'll be right back with part two of this funky rhyme, G\nHaha, yeah boy!\nYo Red I don't wanna flow no more, man\nY'all go ahead, I'm just gonna sit back and listen to this ghetto swing\nCuz this is what I do at the playground, ya know what i'm sayin'?\n\nGA:\nAwww yeah\nABC's gonna sing! Added to this missile - fusion hip hop with a little ghetto swing\nYo Red, kick the ballistics, G\n\nRed:\nIts the R to the E to the D and what you get is what you seein'\nStraight up east boy, word to miss\nKickin' and flippin' the rhymes for the kids man (for the kids)\nChillin' in the park, nice and smooth\n?? Mark tried to bust my groove\n?? words to the beat\nThis is where I met Iesha\nHad a big fanny, not like Annie\nGave up the 24 letter and some candy, haha\n(Where'd you meet her?)\nAt the playground, ya know!\n\nGA:\nOk, I guess you know by now\nMismatched\nPants inside out\nA fresh ?? cap\nA ?? with a name on the front\nSmooth\nYo Mark, take it home\n\nMark:\nIt's the Mizzark, chillin' in the pizzark\nI gotta break cuz my mother said be home by dizzark\nBut before I go, I'm gonna flow for you one time see\nSo listen to the rhyme, G\nThe East Coast Family, Boyz II Men, ABC, BBD\nNow flip the track, D\nMy momma is mad and my brother is Red\nIt's Mario Brothers when it's time for bed\nLast but not least, I wanna say peace and we be outta here\nFrom the playground, ya know!\n\nGA:\nI wanna say what's up to my homies\n(shouting in background)"}