{"rank":"95","song_id":"17810","song_name":"Treat  Em Right","artist_id":"299289","display_artist":"Chubb Rock","spotify_id":null,"lyrics":"Nineteen ninety\nChubb Rock jumps up on the scene\nWith a lean\nAnd a pocket full of green\nThe green doesn't symbolize I made it on the top\nBut RoboCop last year was a shock\nThe tone of the Popeye cut shook your butt\nKids are screaming; the media says, \"What...\n\"Kind of music is this for you to dance to?\"\nThe man with the plan and the man demands you\nLeave the smack and the crack for the wack\nOr the vile and the nine; keep a smile like that\nLeave the knife and the gun in the store\nAnd ignore temptation\nSent by the nation\nRacial gain causes pain; need a new rep\nIn your hearts and minds never forget Yusef\nHawkins\nAnd you're walking\nYou don't just run\nBlack on black; remember that; it's important\nAnyway the shunless one brings forth the fun\nNo hatred; the summer's almost done\nNo time for sleep\nJump in your Jeep\nAnd pump up the funky beat a whole week\nBeeper goes off yo smash it and trash it\nYou're too young to be plumped in a casket\nJust get your boys and bring the noise\nAnd just swing it\nAnd party people, sing it\n\nChorus:\nTreat me right\nI'll treat you good\n\nKids in the crib want dibs on the big man\n\"Can he come out? Can he come out and slam a jam?\n\"I'm his number one fan, yes I am\"\nAll these kids realize that I'm the man\nSix foot three and maybe a quarter of an inch bigger\nThan last year, but still a unique figure\nRob Swinger, Doc No, Dinky, and Hot Dog know\nThat I'm a man who was born to have a mic on\nNext to me at all time; ready to kick a rhyme\nThat will keep me out of financial bind\nThat's why when it comes to fans I'm never mean\nKids all see me between Gates and Green\nAlways say hello\nCause I'm a modest fellow\nNever try and play a super star that's mellow\nCause if these kids don't go buy our records\nWe'll be has-beens and plus naked\nSo we owe them\nSo pull out your pen\nSign an autograph; you might make a new friend\nSo just get your boys and bring the noise and just swing it\nAnd party people in the house, sing it\n\nChorus\n\nParty people in the house, listen up\nI'm the man with the plan and the man rips it up\nPeace to Howie Tee, good lookin', gee\nSwinger, Hot Dog, Doc No, Bud, Ev Lover, Dinky\nFish and chips with the hippy hippy hips\nBefore the tune ends, give me some lips (ah!)\nSanity Crystal, my niece\nAnd Lady Kazam, my homegirl, peace\nAnd leave the guns and have fun; out!\nAnd oh yeah, sing it\n\nChorus\n\nBreak\n\nWell coming back\nTo nineteen ninety\nChubb Rock jumps up on the scene with a lean and a hardcore dream\nThe dream wasn't crafted to be pornographic\nDecency started from the crib, plus kids\nDon't need to hear all of that on the rap\nThe strength of my vibe placed Chubbs on the map\nCause authority, seniority goes far\nMy staff gives autographs plus gives nuff laughs\nRead my mic, heed my sight, and definitely lead you right\nJust treat me right\nPeace\n\nTreat me right\nTreat me right\nTreat me right\n"}