{"rank":"84","song_id":"17826","song_name":"Dirty Love","artist_id":"419587","display_artist":"Thunder","spotify_id":"2lhE3z7LqYRLjHj7FvvtGw","lyrics":"I see you, walking by\nyou've got that far away look in your eyes\nIt was only, yesterday\nlike a cheap suit you were all over me\nI should know better by now, my friend\njust what I mean to you\nYou've been running in and out of my life so long\nI don't want nothing to do with you\n\nI don't need your dirty love, I don't want you touching me\nI don't want your dirty love, it's enough\ntrying to live with the memory\nNa-na-na-na-na-na-na\nNa-na-na-na-na-na-na-na\n\nChew me up, spit me out, turn my whole world inside out\nThere's a name for girls like you\nyou belong in the gutter, I know that you do\nBaby, I've had enough lies to last\nthe rest of my days on earth\nSo now, you're gonna get what you deserve, uh huh\n\nI don't need your dirty love, I don't want you touching me\nI don't want your dirty love, it's enough\n\nI know, there ain't no way I'll stay\nwe were gonna break it up someday\nAnd that day is now, oh baby, I'm getting out\nSo don't you cry now, sigh now\n'cause you've been living a lie now\nwhen I'm not around\n\nUh, grrr, ah\nYeah, yeah, yeah\n\nYou've been running in and out of my life so long\nthere ain't no way I'll stay\nNo way, NO\n\nI don't need your dirty love, I don't want you touching me\nI don't want your dirty love, it's enough, trying to live ith the memory\nNa-na-na-na-na-na-na\nNa-na-na-na-na-na-na-na\nOh, oh, oh\nNa-na-na-na-na-na-na\nNa-na-na-na-na-na-na-na\nBaby don't you know?\nNo, no, no, no, no, no, no, oh no\nSo get out, I've packed your bags\nI've left them at the door, so get 'em out\nStart walking, yeah, GO on\nGet on your broomstick and fly, to the sky, HAHA\nThat's right, don't look back, no no\nI know that you've be doing me wrong, I know it\nI know it, hey hey\nI know that you've be doing me wrong, I know it\nI know it, yeah\nI know that you've be doing me wrong\nthat's where your going is good, hey hey\nI know that you've be doing me wrong. BAD, come on, get out\nGo away, leave me alone, get on your shuttle and ride\noh no\nThis boy, he don't need your, he don't want your\ncheck and dollarbills\nPretty bad, eh? Yeah!\nI don't want it baby!"}