{"rank":"98","song_id":"17918","song_name":"When The Lights Go Out","artist_id":"302775","display_artist":"Gerardo","spotify_id":"6KYw0mdNPgSBn3UWJt7o4u","lyrics":"You wanna step to me\nI know you wanna do me\nCome on, fellas, don't fight\nThat's right\n\nMiss Bobbie, here I'm contemplating your body\nMagazine covers, laying all over\nBeen undercover, drooling like rover\nImagine if I was to be your lover\nI'd lick a little lower, take it a little slower\nBut actions speak louder than words\nSo I'll hush for now and let myself be heard\nYou're bound to make the same sound\nWhen the lights go out\n\n(Oh, when the lights go out)\nWhen the lights go out\n(Oh, when the lights go out)\n(Ooh ooh ooh)\n\nOh Bobbie, give me one night so I can hold you tight\nWet my apetite, make you feel just right\nRoll from side to side, rub around your thighs\nCheck the merchandise, then try it on for size\nTake a shot to find the spot that drives you nuts\nI don't intend to stop till you drop\nAnd when you do hit the lights so I can see those baby blues\nYou've got nothing to lose\n\n(Oh, when the lights go out)\nWhen the lights go out\n(Oh, when the lights go out)\nWhen the lights go out\n(Oh, when the lights go out)\nWhen the lights go out\n(Ooh ooh ooh)\n\nRight now, he&121\n\nSo Bobbie, what's it gonna be?\nWhy settle for less when you can be with me?\nI intend to do my best, forget the rest\nSo please, say yes, can't you see that I'm obssesed?\nNo girl can match ya\nI dream about you and when I gotcha I ain't touching no one but you\nBut until that day, the kid will play, so 'ciao' for now\nGot nothing more to say till the lights go out\n\n(Oh, when the lights go out)\nWhen the lights go out\n(Oh, when the lights go out)\nWhen the lights go out\n(Ooh ooh ooh)\n\n(Oh, when the lights go out)\nWhen the lights go out\n(Oh, when the lights go out)\nWhen the lights go out\n(Ooh ooh ooh)\n\n(Oh, when the lights go out) Come here, let me whisper in your ear\n(Oh, when the lights go out) Ven acércate a mi\n(Oh, when the lights go out) Ven aca más cerca\n(Oh, when the lights go out) Ven que te quiero enseñar algo\n(Oh, when the lights go out) No tengas miedo, ven aca\n(Oh, when the lights go out) He esperado el momento por mucho tiempo\n(Oh, when the lights go out) Ahora si, sigue\n(Oh, when the lights go out) Sigue, sigue\n(Oh, when the lights go out) No pares\n(Oh, when the lights go out) Oh yeah\n(Oh, when the lights go out) Otra vez, otra vez\n(Oh, when the lights go out) Aqui pasamos toda la noche..."}