{"rank":"82","song_id":"17917","song_name":"Let s Talk About Sex","artist_id":"277460","display_artist":"Salt-N-Pepa","spotify_id":null,"lyrics":"Let's Talk About Sex\n\n[Spinderella  cut it up one time!\nHit me  Come on]\n\nCHORUS\nLet's talk about sex  baby, Let's talk about you and me\nLet's talk about all the good things, And the bad things that may be\nLet's talk about sex x4\n\nLet's talk about sex for now to the people at home or in the crowd\nIt keeps coming up anyhow\nDon't decoy  avoid  or make void the topic\nCuz that ain't gonna stop it\nNow we talk about sex on the radio and video shows\nMany will know anything goes\nLet's tell it how it is, and how it could be\nHow it was, and of course, how it should be\nThose who think it's dirty have a choice\nPick up the needle, press pause, or turn the radio off\nWill that stop us, Pep? I doubt it\nAll right then, come on, Spin\n\nCHORUS\n\nHot to trot, make any man's eyes pop\nShe use what she got to get whatever she don't got\nFellas drool like fools, but then again they're only human\nThe chick was a hit because her body was boomin'\nGold, pearls, rubies, crazy diamonds\nNothin' she ever wore was ever common\nHer dates heads of state, men of taste\nLawyers, doctors, no one was too great for her to get with\nOr even mess with, the Prez she says was next on her list\nAnd believe me, you, it's as good as true\nThere ain't a man alive that she couldn't get next to\nShe had it all in the bag so she should have been glad\nBut she was mad and sad and feelin' bad\nThinkin' about the things that she never had\nNo love, just sex, followed next with a check and a note\nThat last night was dope\n\nLet's talk about sex, baby (sing it)\nLet's talk about you and me (sing it, sing it)\nLet's talk about all the good things\nAnd the bad things that may be\nLet's talk about sex (come on)\nLet's talk about sex (do it)\nLet's talk about sex (uh-huh)\nLet's talk about sex\n\nLadies, all the ladies, louder now, help me out\nCome on, all the ladies - let's talk about sex! All right\n(repeat)\n[Yo, Pep, I don't think they're gonna play this on the radio\nAnd why not? Everybody has sex\nI mean, everybody should be makin' love\nCome on, how many guys can fuck like my man\n\nCHORUS\n"}