{"rank":"85","song_id":"17926","song_name":"O.P.P.","artist_id":"312066","display_artist":"Naughty By Nature","spotify_id":"4piae89WoVnwucdJzWrB7M","lyrics":"[Intro: Treach]\nArm me with harmony\nDave, drop a load on 'em!\n\n[Verse 1: Treach]\nO.P.P., how can I explain it? I'll take it, frame by frame it\nTo have y'all all jumpin', shoutin', sayin' it\nO is for \"other,\" P is for \"peoples',\" scratch your temple\nThe last P, well, that's not that simple\nIt's sort of like, well, another way to call a cat a kitten\nIt's five little letters that are missin' here\nYou get on occasion if the other party isn't gamin'\nIt seems I gotta start the explainin', bust it\nYou ever had a girl and met her on a nice hello\nYou get her name and number\nAnd then left feelin' real mellow\nYou get home, wait a day\nShe's what you wanna know about, then you call up\nAnd it’s her girlfriend’s or her cousin’s house?!\nIt’s not a front, a F to the R to the O to the N to the T;\nIt's just her boyfriend's at her house\n(Oh, that’s why she’s scary)\nIt's O.P.P., time other people's what you get it\nThere's no room for relationship, there's just room to hit it\nHow many brothers out there know just what I'm gettin' at\nWho think it's wrong 'cause I was splittin' and co-hittin' that\nWell, if you do, that's O.P.P. and you're not down with it\nBut if you don't, here's your membership\n\n[Hook]\nYou down with O.P.P.? (Yeah, you know me!)\nYou down with O.P.P.? (Yeah, you know me!)\nYou down with O.P.P.? (Yeah, you know me!)\nWho’s down with O.P.P.? (Every last homie!)\nYou down with O.P.P.? (Yeah, you know me!)\nYou down with O.P.P.? (Yeah, you know me!)\nYou down with O.P.P.? (Yeah, you know me!)\nWho’s down with O.P.P.? (All the homies!)\n\n[Verse 2: Treach]\nWell, for the ladies O.P.P. means somethin' gifted\nThe first two letters' the same\nBut the last is somethin' different\nIt's the longest, loveliest, lean, I call it the leanest\nIt's another five-letter word\nRhymin' with \"cleanness\" or \"meanness\"\nI won't get into that, I'll do it ah sorta properly\nI'll say the last P, hmmm, stands for \"property\"\nNow lady, here comes a kiss\nBlow a kiss back to me, now tell me exactly\nHave you ever known a brother\nWho had another, like, a girl or wife\nAnd you just had to stop a toast\n'Cause he looked just that nice?\nYou looked at him, he looked at you\nAnd you knew right away\nHe had someone but he was gonna be yours anyway!\nYou couldn't be seen with him at all and still you didn't care\n'Cause in a room behind a door no one but y'all are there\nWhen y'all are finished, y'all can leave\nAnd only y'all would know; and then y'all could throw that skeleton bone right in the closet do'\nNow don't be shy\n'Cause if you're down I want your hands up high\nSay O.P.P. (O.P.P.!) I like to say with pride\nNow when you do it, do it well and make sure that it counts\nYou're now down with a discount\n\n[Hook]\nYou down with O.P.P.? (Yeah, you know me!)\nYou down with O.P.P.? (Yeah, you know me!)\nYou down with O.P.P.? (Yeah, you know me!)\nWho’s down with O.P.P.? (Every last lady!)\nYou down with O.P.P.? (Yeah, you know me!)\nYou down with O.P.P.? (Yeah, you know me!)\nYou down with O.P.P.? (Yeah, you know me!)\nWho’s down with O.P.P.? (All the ladies!)\n\n[Verse 3: Treach]\nA scab tried to O.P.P. me, I had a girl and she knew that\nMatter of fact, her and my girl was partners that\nHad a fall-out, disagreement, yeah, an argument\nShe tried to do me, so we did it in my apartment\nBust it! That wasn't the thing\nIt must've been the way she hit the ceiling, 'cause after that she kept on comin' back and catchin' feelings\nI said: \"Let's go, my girl is comin', so you gotta leave.\"\nShe said: \"Oh no, I love you, Treach!\"\nI said: \"Now child, please! You gots to leave\nCome grab your coat, right now you gotta go!\"\nI said: \"Now look you chooses stairs or choose the stair window\nThis was a fling, a little thing\nYou shouldn't have brought your heart\n'Cause you know I was OPP, hell, from the very start!\"\nCome on, come on, now let me tell you what it's all about\nWhen you get down, you can't go 'round\nRunnin' off at the mouth\nThat's rule number one in this O.P.P. establishment\nYou keep yo' mouth shut and it won't get back to her or him!\nExcitin', isn't it? A special kinda business\nMany of you will catch the same sorta O.P.P. messin' with\nHim or her, for sure ain't goin' to admit it\nWhen O.P.P. comes, damn skippy, I'm with it\n\n[Hook]\nYou down with O.P.P.? (Yeah, you know me!)\nYou down with O.P.P.? (Yeah, you know me!)\nYou down with O.P.P.? (Yeah, you know me!)\nWho’s down with O.P.P.? (This whole party!)\nYou down with O.P.P.? (Yeah, you know me!)\nYou down with O.P.P.? (Yeah, you know me!)\nYou down with O.P.P.? (Yeah, you know me!)\nWho’s down with O.P.P.? (This whole party!)"}