{"rank":"87","song_id":"17957","song_name":"Mind Playing Tricks On Me","artist_id":"302795","display_artist":"Geto Boys","spotify_id":"7ar8I5TiVCBpo4LNgyNIb0","lyrics":"[Intro: Scarface]\nI sit alone in my four-cornered room\nStarin' at candles\nOh, that shit is on?\nLet me drop some shit like this here, real smooth\n\n[Verse 1: Scarface]\nAt night I can't sleep, I toss and turn\nCandlesticks in the dark, visions of bodies bein' burned\nFour walls just starin' at a nigga\nI'm paranoid, sleepin' with my finger on the trigger\nMy mother's always stressin' I ain't livin' right\nBut I ain't goin' out without a fight\nSee, every time my eyes close\nI start sweatin' and blood starts comin' out my nose\nIt's somebody watchin' the Ak'\nBut I don't know who it is, so I'm watchin' my back\nI can see him when I'm deep in the covers\nWhen I awake I don't see the motherfucker\nHe owns a black hat like I own\nA black suit and a 'caine like my own\nSome might say, \"Take a chill, B.\"\nBut fuck that shit! There's a nigga tryin' to kill me\nI'm poppin' in the clip when the wind blows\nEvery 20 seconds got me peepin' out my window\nInvestigatin' the joint for traps\nCheckin' my telephone for taps\nI'm starin' at the woman on the corner\nIt's fucked up when your mind's playin' tricks on ya\n\n[Verse 2: Willie D]\nI make big money, I drive big cars\nEverybody know me; it's like I'm a movie star\nBut late at night, somethin' ain't right\nI feel I'm bein' tailed by the same sucker's headlights\nIs it that fool that I ran off the block?\nOr is it that nigga last week that I shot?\nOr is it the one I beat for 5000 dollars?\nThought he had 'caine, but it was Gold Medal flour\nReached under my seat, grabbed my popper for the suckers\nAin't no use to me lyin'\nI was scareder than a motherfucker\nHooked a left into Popeye's and bailed out quick\nIf it's goin' down, let's get this shit over with\nHere they come just like I figured\nI got my hand on the motherfuckin' trigger\nWhat I saw'll make your ass start gigglin'\nThree blind, crippled and crazy senior citizens\nI live by the sword\nI take my boys everywhere I go, because I'm paranoid\nI keep lookin' over my shoulder\nAnd peepin' around corners; my mind is playin' tricks on me\n\n[Verse 3: Scarface]\nDay by day it's more impossible to cope\nI feel like I'm the one that's doin' dope\nCan't keep a steady hand, because I'm nervous\nEvery Sunday morning I'm in service\nPrayin' for forgiveness\nAnd tryin' to find an exit out the business\nI know the Lord is lookin' at me\nBut yet and still it's hard for me to feel happy\nI often drift while I drive\nHavin' fatal thoughts of suicide\nBang and get it over with\nAnd then I'm worry-free, but that's bullshit\nI got a little boy to look after\nAnd if I die, then my child'll be a bastard\nI had a woman down with me\nBut to me it seemed like she was down to get me\nShe helped me out in this shit\nBut to me she was just another bitch\nNow she's back with her mother\nNow I'm realizing that I love her\nNow I'm feelin' lonely\nMy mind is playin' tricks on me\n\n[Verse 4: Bushwick Bill]\nThis year Halloween fell on a weekend\nMe and Geto Boys are trick-or-treatin'\nRobbin' little kids for bags\n'Til a law man got behind our ass\nSo we speeded up the pace\nTook a look back and he was right before our face\nHe'd be in for a squabble, no doubt\nSo I swung and hit the nigga in his mouth\nHe was goin' down we figured\nBut this wasn't no ordinary nigga\nHe stood about six or seven feet\nNow that's the nigga I'd be seein' in my sleep\nSo we triple-teamed on him\nDroppin' them motherfuckin' B's on him\nThe more I swung, the more blood flew\nThen he disappeared and my boys disappeared too\nThen I felt just like a fiend\nIt wasn't even close to Halloween\nIt was dark as fuck on the streets\nMy hands were all bloody from punchin' on the concrete\nGoddamn, homie!\nMy mind is playin' tricks on me"}