{"rank":"50","song_id":"17969","song_name":"Set Adrift On Memory Bliss","artist_id":"277128","display_artist":"P.M. Dawn","spotify_id":"4TK1YzdHTJp3RKxJpllBa9","lyrics":"The camera pans the cocktail glass,\r\nBehind a blind of plastic plants;\r\nI found the lady with the fat diamond ring.\r\nThen you know I cant remember a damn thing.\r\nI think its one of those de ja vu things,\r\nOr a dream thats tryin to tell me something.\r\nOr will I ever stop thinkin about it.\r\nI dont know, I doubt it.\r\nSubterranean by design,\r\nI wonder what I would find if I met you,\r\nLet my eyes caress you,\r\nUntil I meet the thought of missess princess who?\r\nOften wonder what makes her work.\r\nI guess Ill leave that question to the experts,\r\nAssuming that there are some out there.\r\nTheyre probably alone, solitaire.\r\nI can remember when I caught up\r\nWith a pastime intimate friend.\r\nShe said, bet youre probably gonna say I look lovely,\r\nBut you probably dont think nothin of me.\r\nShe was right, though, I cant lie.\r\nShes just one of those corners in my mind,\r\nAnd I just put her right back with the rest.\r\nThats the way it goes, I guess.\r\n\r\nBaby you send me\r\nSet adrift on memory bliss of you\r\n\r\nCareless whisper from a careless man,\r\nA neutron dance for a neutron fan;\r\nMarionette strings are dangerous things,\r\nI thought of all the trouble they bring.\r\nAn eye for an eye, a spy for a spy,\r\nRubber bands expand in a frustrating sigh.\r\nTell me that shes not dreaming.\r\nShes got an ace in the hole,\r\nIt doesnt have meaning.\r\nReality used to be a friend of mine,\r\ncause complete control, I dont take too kind.\r\nChristina applegate, you gotta put me on.\r\nGuess whos piece of the cake is jack gone?\r\nShe broke her wishbone and wished for a sign.\r\nI told her whispers in my heart were fine.\r\nWhat did she think she could do?\r\nI feel for her, I really do.\r\nAnd I stared at the ring finger on her hand,\r\nI wanted her to be a big pm dawn fan,\r\nBut I had to put her right back with the rest.\r\nThats the way it goes, I guess.\r\n\r\nBaby you send me...\r\nSet adrift on memory bliss of you"}