{"rank":"96","song_id":"17967","song_name":"Skat Strut","artist_id":"276861","display_artist":"MC Skat Kat","spotify_id":null,"lyrics":"MC Skat Kat: Well You've never seen a kat with so much charisma\nGot More Moves than a mutant nina- turtle that is\nAnd I'm doing the Skat Strut\nTo hell with John Travolta and the Disco Duck\n\nThey call me Skat Kat, the dance floor maniac\nOne more of my hip is like an afro-disiac\nSwinging and wingingI'm just doing my own thing\nGirls don't jump me\nGive me room to be funky\n\nStep to the dance floor bust a little spin\n(I thought I saw a putty kat, I did)\nSHUT UP KID!!\nThis is a new dance so shake your butt\nAnd get a load of what its like to be doing Skat Strut\n\nNow Jack was nimble and Jack was quick\nBut it was Skat Kat that made Jack trip\nI burned him on the butt with a flick of my bic\nAnd then I cold ran away with the candle stick\nI've got all the right moves\nLadies think I'm Loveable\n\nLove to wine and dine sippin' on bubble\nBut most of all, I like dancing y'all\nAnd doing my Skat Strut from wall to wall\nIt's as simple as it gets, just stick out your neck\n\nLift up your leg and step to the left\nNow shake a little as you groove to the beat\n--Bend over, shake your big booty\n\nAnd if you get dizzy from shaking your butt\nYou must have shook the wrong end cuz you ain't doing\nThe Skat Strut (I though I saw a putty kat- I did, I did)\n\nAs we go a little something like this-- Hit it!!\n\nWithout a question, its the strut to fame\nI can see myself now on the aisles of \"Soul Train\"\nPeople want to know if its meant to be silly\nI say only when it's done by Milli and Vanilli\n\nThe dance is mine a generation of felines\nMastered this step back in '69\nReturn of the Skat Strut a brand new dance\n\n(I thought I) could but you can't-- BUST IT\n\nHomeboy Fatz, Why don't you step up to the microphone\nAnd give them a little taste of\nYour beat box boy---\n\nFATZ: Hey man, I've told you\nI don't like nobody telling me what to do\nNow I'm a beat-box, but I'm a do-it-my-way\nAnybody got something to say?\n\nMC Skat Kat: For those who don't know me\nMy name is Skat\nI'm the kat who did the rap in \"Opposites Attract\"\nMe and Paula did a duo and then I went solo\nTo grab the microphone and make the ladies go\nHO!\n\nAnd now that I've got you at my command\nIts my sole opportunity to make you dance\nI want all four paws on the dance floor\nDo that strut until your legs get sore\nCome on! Come on! Come on!"}