{"rank":"70","song_id":"17991","song_name":"Pop That Coochie","artist_id":"431856","display_artist":"The 2 Live Crew","spotify_id":"0HbpUUXotQ5uJV2A0HCoLX","lyrics":"FKI = Fresh Kid Ice\nBM = Brother Marquis\n\n(Mixx scratches \"Aw hit me!\")\n\nVerse 1\n(FKI) There's only one place where we can go\nTo see freaky Girls doin' shows\nDoin' tricks to make us holler\nOn a giving night, all for a dollar\nSilicone breasts, all on their chests\nNothin' like others, but above the rest\nThey'll do anything to turn us on\nThem girls got it goin' on!!\n(BM) I like big booty and big and Plenty\nGirl, you know you've been have by many\nSo come and be my private dancer\nI got some money if that's the answer\nI really wanna be with you;\nI get hard after seeing you\nHow hard? Hard like a rock\nWhen you make that Coochie pop!\n\nChorus(2x): Luke\nPop that Coochie! Heyyy! Pop that Coochie, baby!\nPop that Coochie! Pop, pop that Coochie, baby!\n\nVerse 2\n(FKI) Freaky girls with plenty of Class\nRollin' to the music and shakin' real fast\nBend over backwards, make me shout\nAnd work that body, in and out\nMovin' their body with plenty of action\nBringin' to the men more satisfaction\nDoin' what they feel to turn us out\nJust work that body all the way out!\n(BM) Shake it! Don't break it!\nIt took your momma nine months to make it\nBend over and spread 'em, girl\nShow-w-w me those country pearls\nPlay that button you know real quick\nLet me Blow Me A Freaky Kiss\nGirl, you know you look so cute\nThrowin' that Coochie the way you do!\n\nChorus\n\nVerse 3\n(FKI) Poppin' that Thang a dance for the ladies\nStraight from the South, into the 90's\nFreaky girls are the ones I like\nIn G-strings in the middle of the night\nSmoke-filled stages, women in cages\nGuards at the door, armed with gauges\nAs they dance and I get hot\nKeep throwin' that Body! Don't stop!\n(BM) I like the way you get the champagne glass\nIt makes me wanna Blast Off Real Fast\nSo come on, baby, and pop it quick\nI fall in love when you Can't Sit\nGirl, you don't know? You ain't heard?\nMessin' with me, you're gonna get served\nSee, none of my Girls, they never complain\nSo come on, baby, and pop that thang!\n\nChorus\n\nLuke:\nJanet J, pop, that Coochie!\nBu-bles, pop, that Coochie!\nMa-donna, pop, that Coochie!\nSandra-P, pop that stinky smelly Coochie, baby!\n\n\nChorus\n\nLuke:\nBREAKDOWN!!"}