{"rank":"64","song_id":"18015","song_name":"Is It Good To You","artist_id":"303396","display_artist":"Heavy D","spotify_id":"4WHQzXnWyTlE1UOmmxRDOw","lyrics":"[intro: Heavy D]\nAlright\nThis one goes out to all the lovers in the house, knowI'msayin?\nI'm gonna express my feelings right about now\non the way I like to do things\nT-R, bring it in\n\n[Chorus: sung]\nIs it good to you - I like it\nIs it good to you - Ooh I like it\nIs it good to you - I like it\nIs it good to you - Ooohooh boy\n\n[Heavy D]\nHow would you feel if I worked you down?\nMade your head spin like a merry-go-round\nTake control like Charles In Charge\nI really can't wait, let's stay in the garage\nOops, let me run as I get the whipped cream\nCan't have ice cream without whipped cream\nPlus an ice cube, to make you swing\nMy main man did it, eh do the right thing\nC'mon let me tickle you in all the right places\nKeep my eyes open while I watch ya make faces\nFeelin quite dandy, comfortable and cozy\nLet me draw the curtains cos my neighbours are nosey\nSo make a little room, here comes big daddy\nBig like a truck, satisfyin like a Caddy\nMany will call but the chosen are few\nand all I wanna know, is it good to you?\n\n[Chorus: sung, (Heavy D)]\nIs it good to you - I like it\nIs it good to you - Ooh I like it (Is it good to you)\nIs it good to you - I like it\nIs it good to you - Ooohooh boy\n\n[Heavy D]\nMake a move, make a move, my lollipop cutie\nLay down on the cover, let the Lover do his duty\nIt looks like rain, but rain doesn't matter\nWe can take time, hold hands and chit-chatter\nAnd what about love? Love's a possibility\nbut let's make sure we share the same mentality\nClose the door, dim the lights\nEverything is okey-dokey, cos we set it alright\nAnd how bout oil? Warm from the heat\nI can slick ya body down from your head to your feet\nMake ya smile from a simple kiss\nClose your eyes and I'll grant your first wish\nOpen your arms and wrap me tight like a teddy bear\nthen take your fingers and run it thru my hair\nMany will call but the chosen are few\nbut all I wanna know, is it good to you?\n\n[Chorus: sung, (Heavy D)]\nIs it good to you - I like it\nIs it good to you - Ooh I like it (Is it good to you)\nIs it good to you - I like it\nIs it good to you - Ooohooh boy yeah (Yeeaah, lay back a little)\n\n[Heavy D: bridge]\nYou know when we kiss\nI really wanna make ya feel right now\nI mean, is it good to you?\nCos believe me when I tell you, it feels good to me\n\n[Heavy D]\nCheck it\nRoll over my lover, the sun is beaming\nThe hot water's runnin and the bathroom's steaming\nChampagne bottle in the corner half done\nRoom's still bright from the morning sun\nYeah, we're snuggled up now it's time to buckle up\nSo call me later cutie, and I'll pick you up\nMany'll call but the chosen are few\nand all I wanna know, is it good to you?\n\n[Chorus: sung, (Heavy D)]\nIs it good to you - I like it\nIs it good to you - Ooh I like it yeah (Is it good to you)\nIs it good to you - I like it\nIs it good to you - Ooohooh I like it yeah (Is it good to you)\n\nIs it good to you - I like it (I wanna know)\nIs it good to you - Ooh I like it yeah (Is it good to you)\nIs it good to you - I like it yeah (I'd like to know)\nIs it good to you - You got me singin oooohhhh.....\n\n[interlude: Heavy D]\nC'mon sing it baby\nC'mon lemme hear it honey\nC'mon sing it baby\nC'mon lemme hear it honey\nC'mon sing it baby\nC'mon lemme hear it honey\nC'mon sing it baby\nC'mon lemme hear it honey\n\nIs it good to you - I like it (Is it good to you)\nIs it good to you - Ooh I like it yeah (Is it good to you)\nIs it good to you - Yeah yeha yeaheh yeah (Is it good to you)\nIs it good to you - I like it yeah (Is it good to you)\n\nIs it good to you - Oooh I like it yeah (Tell me bout it baby)\nIs it good to you - Oooh I like it yeah (Is it good to you)\nIs it good to you - I like it yeah (How do you feel?)\nIs it good to you -\n(Tell me baby, tell me baby bout it, is it good to you?)\n\nIs it good to you\nI LIKE IT BABY"}