{"rank":"92","song_id":"18106","song_name":"Everything s Gonna Be Alright","artist_id":"312066","display_artist":"Naughty By Nature","spotify_id":"5C2sjSiYH8Wx6cZj0gZzh4","lyrics":"[Intro]\nSmooth it out\nThis is a story about the drifter\nWho waited through the worst for the best in crosstown\nWho never planned on havin' so dick\nWhy me, huh?\n\n[Chorus]\nEverything's gonna be alright (alright)\nEverything's gonna be alright (alright)\nEverything's gonna be alright now (alright)\nEverything's gonna be alright (alright)\n\n[Verse 1]\nSome get a little and some get none\nSome catch a bad one and some leave the job half done\nI was one who never had and always mad\nNever knew my dad, mother fuck the fag\nWhere anywhere I did pick up, flipped the clip up\nToo many stick-ups, 'cause niggas had the trigger hic-ups\nI couldn't get a job, nappy hair was not allowed\nMy mother couldn't afford us all, she had to throw me out\nI walked the strip, which is a clip, who wanna hit?\nThey got 'em quick, I had to eat, this money's good as spent\nI threw in graves, I wasn't paid enough\nI kept 'em long 'cause I couldn't afford a haircut\nI got laughed at, I got chumped, I got dissed\nI got upset, I got a Tec and a banana clip\nWas down to throw the led to any tellin' crackhead\nI'm still livin' broke, so a lot of good it would've did\nOr done, if not for bad luck, I would have none\nWhy did I have to live a life of such a bad one\nWhy when I was a kid and played out was a sad one\nAnd always wanted to live like just a fat one\n\n[Chorus]\n\n[Verse 2]\nA ghetto bastard, born next to the projects\nLivin' in the slums with bums, I sit and watch them\nWhy do I have to be like this? momma said I'm priceless\nSo I am all worthless, starved, and it's just for being a nice kid\nSometimes I wish I could afford a pistol then, though\nLast stop to hell, I would've ended things a while ago\nI ain't have jack but a black hat and napsack\nFour squad stolen in cars in a blackjack\nDrop that, and now you want me to rap and give?\nSay somethin' positive? Well positive ain't where I lived\nI lived right around a corner from west hell\nTwo blocks from south shit, it was in a jail cell\nThe sun never shone on my side of the street, see\nAnd only once or twice a week I would speak\nI walked alone, my state of mind was home sweet home\nI couldn't keep a girl, they wanted kids for cause of chrome\nSome life, it you ain't wear gold your style was old\nAnd you got more juice than dope for every bottle sold\nHell no, I say there's gotta be a better way\nBut hey, never gamble any game that you can't play\nI'm slowin' and flowin' and goin' in on and knowin' not now\nHow will I do it, how will I make it?  I won't, that's how\nWhy me, huh?\n\n[Chorus]\n\nMy third year into adulthood, and still a knucklehead\nI'm better off dead, huh, that's what my neighbor said\nI don't do jack but fightin', lightin' up the streets at night\nPlayin' hide and seek with a machetti ??? like Freddy swipe\nSome say I'm rollin' on, nothin' but a dog now\nI answer that with a tech, who wanna bow-wow?\n'Cause I done been through more shit within the last week\nThan I fly flowin' in doo-doo on the concrete\nI been a deadbeat, dead to the world and dead wrong\nSince I was born that's my life, oh you don't know this song?\nSo don't say jack, and please don't say you understand\nAll that man to man talk just hot damn\nIf you ain't live you couldn't feel it, so kill it, skillet\nAnd all that talk about it won't help it out, now will it?\nAnd illtown fell like I stuck-up props, got shot\nDon't worry, I hit Bob, flurry, and his punk-ass dropped\nBut I'm the one who has been labeled as an outcast\nThey changin' schools, I'm the misfit that will outlast\nBut that's cool with the bull, smack 'em backwards\nThat's what you get for fuckin' with a ghetto bastard\n\n[Outro]\nIf you ain't ever been to the ghetto\nDon't ever come to the ghetto\n'Cause you ain't understand the ghetto\nAnd stay the fuck out of the ghetto\nWhy me?"}