{"rank":"94","song_id":"18125","song_name":"The Choice Is Yours","artist_id":"288498","display_artist":"Black Sheep","spotify_id":"6281LdA2cVFwVM0xC5cqA8","lyrics":"[Intro]\nHere they come yo, here they come\nHere they come yo, here they come\nThis or that?\nThis or that?\nThis or that?\nThis or that?\nThis or that?\nThis or that?\nThis or that?\nThis or that?\n\n[Verse 1]\nWho's the black sheep, what's the black sheep?\nKnow not who I am, or when I'm coming, so you sleep\nWasn't in my realm, or wasn't in your sphere\nKnew not who I was, but listen here\nDres, D-R-E-S, yes I guess I can start\nIf it's all right with you, I'll rip this here joint apart\nBack, middle, to the front, don't front\nWanna a good time, gonna give you what you want\nCan I hear a hey? (hey)\nCan I get a yo? (yo)\nYou got a 'hat? (huh)\nIt's for the hoes (oh)\nThe styling is creative, black sheep of the native\nCan't be violated, or even decepticated\nI got brothers in the Jungle, cousins on the quest\nDead departed uncles, in pea porridge, may they rest\nGuess, which way, what, when, how\nMista Lawnge, Dres, Black Sheep slam... Now\nKnow you've heard the others, phonies to the lovers\nThen of course, the choice is yours\n\n[Hook]\nYou can get with this, or you can get with that\nYou can get with this, or you can get with that\nYou can get with this, or you can get with that\nI think you'll get with this, for this is where it's at\nYou can get with this, or you can get with that\nYou can get with this, or you can get with that\nYou can get with this, or you can get with that\nI think you'll get with this, for this is kinda phat\n\n[Verse 2]\nWhere's the black sheep, here's the black sheep\nEven if we wanted to, the flock could not be weak\nWatch me swing like this, why should I swing it like that\nBecause in fact, on me it might not attract\nTherefore I ignore, do as I feel inside\nI live with me, I've got my back tonight\nYa know what I'm saying\nYo Black, I'm not playing\nNeed to go with this, or go with this with no delay and\nSee, in actuality, wonder can it be\nI made it look easy, because it is to me\nAny time capacity was filled, tried to rock it\nAny time a honey gave us play, tried to knock it\nNever was a fool, so we finished school\nNever see us sweat, and you'll never see us drool\nOut to rock the globe while it's still here to rock\nDon't punch girls, and we don't punch a clock\nGotta go, gotta go, see you later by the cat\nAnd you can't beat that with a bat\n\n[Hook]\nYou can get with this, or you can get with that\nYou can get with this, or you can get with that\nYou can get with this, or you can get with that\nI think you'll get with this, for this is where it's at\nYou can get with this, or you can get with that\nYou can get with this, or you can get with that\nYou can get with this, or you can get with that\nI think you'll get with this, for this is kinda phat\n\n[Break]\nEngine, engine, number nine\nOn the New York transit line\nIf my train goes off the track\nPick it up! Pick it up! Pick it up!\n\n[Verse 3]\nBack on the scene, crispy n' clean\nYou can try, but then why, cause you can't intervene\nWe be the outcast, down for the settle\nWon't play the rock, won't play the pebble\nOpen the door, you best believe, we're sliding through it ... sssswiftly\nNiftily, we can make it hip to be what we are\nCause what we be, be the epitome, doo, dah, dipitty\nSo now I dwell just to say you're plainer\nHold your cup, cause I got the container\nPass a plate or, cross the fader\nBlack sheep get play like the Sony Innovator\nNever the traitor, party inflater\nAnd you can get a scoop ... later\n\n[Hook]\nYou can get with this, or you can get with that\nYou can get with this, or you can get with that\nYou can get with this, or you can get with that\nI think you'll get with this, for this is kinda phat\nYou can get with this, or you can get with that\nYou can get with this, or you can get with that\nYou can get with this, or you can get with that\nI think you'll get with this, for this is where it's at\n(Where it's at, where it's at, where it's at, where it's at)\n(Eee come on, eeh come on, eeh come on, eeh come on)"}