{"rank":"89","song_id":"18130","song_name":"Poor Georgie","artist_id":"276854","display_artist":"MC Lyte","spotify_id":"1UVcvbTyky4jXHLQqsRPZk","lyrics":"[Verse 1]\nI met him in a club hangin' out one night\nHe said, \"Hello, I'm George...hi, Lyte\nHow's everything going, huh? How ya doin'?\nHope everything's fine, ooh, and uh umm\nCan I call you sometime? Can I get the digits?\nAnd the address, so I can come visit?\"\nI gave him the digits, that wasn't a problem\n'Cause if he caused any, I would have to solve them\n'Cause George looked good, MMM, damn good!\nAnd if I didn't, some other girl would\nIn my mind, I hope for the best\nConvincing myself that this was not a test\n'Cause I heard many things about Georgie\nNothing kinky, like no orgies\nI heard he knows how to make love\nLike an angel from the heaven above\nWho was I kidding I'd give him a try\n'Cause Lyte needs love too and that ain't no lie\nKeep your ears open, hope that you listenin'\n'Cause I'm about to take you on a George Porgie mission\n\n\"Can it be I've stayed away too long\"\n\"My world is empty without you, babe\"\n\"Can it be I've stayed away too long\"\n\"My world is empty...\"\n\n[Verse 2]\nI gave him the number, I saw it in his eyes\n\"She gave me the number? Hmmm I'm surprised\"\nGood conversation over the phone\nHe began to comfort me whenever I was alone\nGeorge was sweet, so nice and so neat\nWith any other guy he didn't have to compete\nGeorge was mature, he made sure\nThat he was the only man I'd ever adore\nGirls, have you, ever had a friend\nThat you'd get with, every now and then?\nI know for a fact George had a lot of girls\nSpread out from state from state around the world\nAs long as he was smart and kept his girls in check\nMade sure I never saw them and showed me respect\nHe didn't have to be loyal, like men should be\nI don't care about the other girls, just be good to me!\nBut if I ever saw one, that would be the end\nHe couldn't kick the storyline that she was just a friend\nThe girls I didn't care if her ass don't lie\nSee 'cause Georgie was into making young girls cry\n\n\"Kissed the girls and made them cry\"\n\"Kissed the girls and made them cry\"\n\"Kissed the girls and made them cry\"\n\"Kissed the girls and made them cry\"\n\n\"Kissed the girls and made them cry\"\n\"Can it be I've stayed away too long\"\n\"My world is empty without you, babe\"\n\"Kissed the girls and made them cry\"\n\"Kissed the girls and made them cry\"\n\"Can it be I've stayed away too long\"\n\"My world is...\"\n\"Kissed the girls and...\"\n\n[Verse 3]\nGeorge was clean, no drugs and such\nBut once in a while, he'd drink too much\nHangin' in a club where they play rockers\nHim and his friend, drinkin' vodka\nI was looking for him, and I found him there\nWith his clothes messed up and his (fucked) up hair\nI told him he was messin' up, he wouldn't go far\nHe got mad and asked his friend for the keys to the car\nI said, \"Don't drive, use your head\nDrive while you're drunk and you'll kill yourself dead\"\nWe begin to argue, bad words were said\nThen he got kicked out by some long-haired dread\nRan into the car as if, in a hurry\nHe started the car but his vision was blurry\nHe didn't care, he drove off into the night\nRiding for miles, without his headlights\nGeorgie Porgie had too much on his mind\nHe was still young yet running out of time\nLast week he took tests and the doctor told him\nGeorge had cancer in his lungs and his colon\nSee when he was twelve, he started smokin'\nPaid no attention when he started chokin'\nThoughts flashed through his head, there they stuck\n'Til Georgie Porgie crashed into a truck\nI wished I woulda told him how I liked him so much\nHow he made me feel with the slightest touch\nNow he's gone and I can't tell him nothin'\nWish he was here so I could say somethin'\nThe story is not to say that I'm in sorrow\nJust to say no one is promised tomorrow\nIf you love someone you should say it often\nYou'll never know when they'll be layin' in a coffin\nWake up, it's important that you know that\nNo one on Earth is promised tomorrow...\nBelieve that! And don't think that it can't happen to you\n\n\"Kissed the girls and made them cry\"\n\"Kissed the girls and made them cry\"\n\n\"Can it be I've stayed away too long\"\n\"My world is empty without you, babe\"\n\"Can it be I've stayed away too long\"\n\"My world is empty without you, babe\"\n\"Can it be I've stayed away too long\"\n\"My world is empty without you, babe\"\n\"Can it be I've stayed away too long\"\n\"My world is...\"\n\n\"Kissed the girls and made them cry\"\n\"Kissed the girls and made them cry\""}