{"rank":"99","song_id":"18179","song_name":"No Sunshine","artist_id":"305823","display_artist":"Kid Frost","spotify_id":"7bYII9aTzFdEJQpCLcWhba","lyrics":"[intro - Prince Teddy]\nWhat is time?\nTime is when a man is trying to make time with your woman,\nbut you're doing time behind bars and your time is standing still\nYo Frost, kick it to these people for real you know what I'm saying?\n\n[verse 1 - Frost]\nTime, sifts through the hourglass, through night and day\nand I watch as the games people play\nIt's like do unto others than split\nand if you can't back up what you say then you ain't shit (yeah)\nI've seen the manifestations of the street\nSo I can manifest what I've seen on a drum beat\nlike just last night (yo what happened)\nI watched these two vatos get in a crazy fight\none of them was quick to pull a knife\nhe stabbed him in the heart and now he's doing life\nin prison at the age of 21 (yeah)\nliving on death row cause he couldn't let go\ncaught in the web of violence (damn)\nroll deep when they creep, and move in silence of the lambs (yo)\na tattooed tear dropped as the iron gates slam\n\n[chorus - Bill Withers & Frost]\nAin't no sunshine - Bill Withers\nAin't no sunshine - Frost\nAin't no sunshine - Bill Withers\nAin't no sunshine - Frost\nAin't no sunshine - Bill Withers\nAnytime, hey - Frost\nAin't no sunshine - Bill Withers\nAin't no sunshine - Frost\nAin't no sunshine - Bill Withers\nAin't no sunshine - Frost\nAin't no sunshine, Anytime - Bill Withers\n\n[verse 2 - Frost]\nDamn, damn ain't that a shame?\nyou're lost so take the caution don't play the game\nshould've listen to the Frost when I was trying to come across to you\nbut no you didn't think (sucker)\nyou just keep getting yourself more deep until you sink\nso there's no one else to thank but yourself\nso go ahead take bow for a job well done\nbut you'll never see the day of the sunshine or the fun times\njust the old days and your old ways\ncorrupt and wicked\nout there doing dirt, instead of just kicking it\npow pow bang bang and all that noise (yeah)\nyeah you and all your homeboys\ntake time to read between the lines\ncause ain't no sunshine\n\n[chorus]\n\n[verse 3 - Frost]\n(yo kid) I know about being macho\nCallin the shots the big time head honcho (yeah)\nBut here's something even more gacho\nOne of my homeboys is your old lady's Sancho\nYo shit happens\nA number lights up on his beeper right as I'm rappin\nWhile you sit in a cell writing a letter \nsaying when you get out, your things will be better (right)\nbut man she couldn't wait \nso she's going out on a date\nwith every Tom, Dick, and Harry\nand if you ask me, your shit's getting scary\nso how you gonna handle this \nWhen your ho's in Los Angeles, acting so scandalous\nYo, you can't blame her you didn't take the time\nand now, ain't no sunshine\n\n[chorus]\nAin't no sunshine - Bill Withers\nAin't no sunshine - Frost\nAin't no sunshine - Bill Withers\nAin't no sunshine - Frost\nAin't no sunshine - Bill Withers\nThat's for you, '92 you know what I'm saying? - Prince Teddy\nAnytime, yeah - Frost\nAin't no sunshine - Bill Withers\nAin't no sunshine - Frost\nAin't no sunshine - Bill Withers\nAin't no sunshine - Frost\nAin't no sunshine, Anytime - Bill Withers\nDamn - Frost\n\n[interlude - Prince Teddy]\nSo if you don't wanna do no time, \nyou better take time to try to draw the line you know what I'm saying?\nOr you're gonna be the next fool in line doing time, \nyou know what I'm saying?  Like my man said...\n\n[chorus]\nAin't no sunshine - Bill Withers\nAin't no sunshine fool - Prince Teddy\nAin't no sunshine - Bill Withers\nAin't nothing happening up there you know what I'm saying? - Prince Teddy\nAin't no sunshine, Anytime - Bill Withers \nYo, me and Frost is out of here, Peace - Prince Teddy\n\nThere just ain't no sunshine - Bill Withers\n(laughing)"}