{"rank":"88","song_id":"18196","song_name":"They Want EFX","artist_id":"300346","display_artist":"Das EFX","spotify_id":"2rQDtzREtofoyhDNYk95jf","lyrics":"[Verse 1]\nBum stiggedy bum stiggedy bum, hon, I got the old pa-rum-pum-pum-pum\nBut I can fe-fi or fo, diddly-bum, here I come\nSo Peter Piper, I'm hyper than Pinocchio's nose\n'Cause I'm the supercalafragilistic tic-tac pro\nI gave my oopsy, daisy, now you've got the Crazy\nI'm Crazy with the books, Googley-goo where's the gravy\nSo one two, um, buckle my, um shoe\nYabba Doo, hippity-hoo, crack a brew\nSo trick or treat, smell my feet, yup I drippedy-dropped a hit\nSo books get on your mark and spark that old censorship\nDrats and double drats, I smiggedy-smacked some whiz kids\nThe boogedy-woogedly Brooklyn boy's about to get his, dig\nMy waist bone's connected to my hip bone\nMy hip bone's connected to my thigh bone\nMy thigh bone's connected to my knee bone\nMy knee bone's connected to my hardy-har-har-har\nThe jibbedy-jabber jaw ja-jabbing at your funny bone, um\nSkip the Ovaltine, I'd rather have my honeycomb\nOr preferably the sinsemilla, Let's spiggedy-spark the blunts, um\nDun dun dun dun dun, dun dun\n\n[Hook]\nThey want EFX, some live EFX\nThey want EFX, some live EFX\nThey want EFX, some live EFX\nSnap a neck for some live EFX\n\n[Verse 2]\nWell I'll be darned, shiver me timbers yo, head for the hills!\nI picked a weeping willow, and a daffodil\nSo back up bucko or I'll pulverize McGruff\nCause, this little piggy gets, busy and stuff\nArrivederci, heavens to mercy, honky tonk I get swift\nI caught a Snuffleupagus and smoked a boogaloo spliff\nI got the nooks, the cranies, the nitty gritty 40 doe\nSo all aboard, castaway, hey where's my boogaloo?\nOh-h-h-h-h-h-hhh I'm steamin, a-go-ny!\nWhy's everybody always pickin on me?\nThey call me Puddin' Tane, and rap's my game\nYou ask me again and I'll t-tell you the same\nSince I'm the vocal vegemintarian, stick 'em up freeze so\nNo Parks sausages, mom, please\nA-Blitz shoots the breeze, twiddly-dee shoots his lip\nCrazy Drayzie shot the sheriff yup, and I shot the gift\nAnd that's PRET-TY SNEA-KY SIS, oh yo\nI got my socks off, my rocks off, my Nestle's cup of cocoa\nHolly Hobbie tried to slob me, tried to rob me silly stunt\nDiggedy-dun dun dun dun dun, DUN DUN!\n\n[Hook](x2)\nThey want EFX, some live EFX\nThey want EFX, some live EFX\nThey want EFX, some live EFX\nSnap a neck for some live EFX\n\n[Verse 3]\nYahoo, hidee-ho yup I'm coming around the stretch\nSo here Fido boy, fetch, boy, fetch\nI got the rope-a-dope a slippery choker, look at me get raw\nAnd I'm the hickory-dickory top of morning boogoloo big jaw\nWith the yippedy zippedy Winnie the Pooh bad boy blue\nYo crazy got the gusto, what up, I swing that too\nSo nincompoop give a hoot and stomp a troop without a strain\nLike Rosco P. Coltrane\nI spiggedy-spark a spiff and give a twist like Chubby Checker\nI take my Froot Loops with two scoops, make it double decker\nOh Finster Baby come to Papa Duke\nA babaloo, ooh, a babaloo boogedy boo\nI went from Gucci to Stussy, to fliggedy-flam a groupie\nTo Zsa Zsa, to yibbedy-yabba dabba hoochie koochie\nTally ho I-I'll take my Stove Top instead of my Tater, so\nMaybe I'll shoot 'em now, nope maybe I'll shoot 'em later, yep\nI used to have a dog and Bingo was his name oh, so uh\nB-I-N-G-O-oh\nYou do the hokey pokey and you turn yourself around, hon, so uh\nDun dun dun dun dun, dun dun\n\n[Hook ](x2)\nThey want EFX, some live EFX\nThey want EFX, some live EFX\nThey want EFX, some live EFX\nSnap a neck for some live EFX"}