{"rank":"93","song_id":"18220","song_name":"Scenario","artist_id":"275205","display_artist":"A Tribe Called Quest","spotify_id":"79XBc1SvgNZvoGEph6Sjq2","lyrics":"[Produced by A Tribe Called Quest]\n\n[Hook]\nHere we go, yo, here we go, yo\nSo what, so what, so what's the scenario?\nHere we go, yo, here we go, yo\nSo what, so what, so what's the scenario?\n\n[Verse 1: Phife Dawg]\nAyo, Bo knows this (What?)\nAnd Bo knows that (What?)\nBut Bo don't know jack, 'cause Bo can't rap\nWell, what do you know? The Di-Dawg is first up to bat\nNo batteries included and no strings attached\nNo holds barred, no time for move-fakin'\nGots to get the loot so I can bring home the bacon\nBrothers front, they say the Tribe can't flow\nBut we've been known to do the impossible like Broadway Joe, so\nSleep if you want, NyQuil will help you get your Z's, troop\nBut here's the real scoop\nI'm all that and then some, short, dark, and handsome\nBust a nut inside your eye to show you where I come from\nI'm vexed, fuming, I've had it up to here\nMy days of paying dues are over, acknowledge me as in there (Yeah!)\nHead for the border, go get a taco\nWatch me wreck it from the jump street, meaning from the get-go\nSit back, relax, and let yourself go\nDon't sweat what you heard, but act like you know\n\n[Verse 2: Charlie Brown]\nYes, yes, y'all, (Yes, y'all!)\nWho got the vibe? It's the Tribe, y'all (Tribe, y'all!)\nReal live, y'all (Live, y'all!)\nInside, outside, come around\n(Who's that?)\nBrown!\nSome may, I say, call me Charlie\nThe word is the herb and I'm deep like Bob Marley\nLay back on the payback, evolve rotate the gates\n(Contact!)\nCan I get a hit?\n(Hit!)\nBoom, bip with a brother named Tip, and we're ready to flip\nEast coast stomping, ripping, and romping\nNew York, North Cak-a-laka, and Compton\nChecka-checka-check it out\nThe loops for the troops, more bounce to the ounce\nAnd wow-how-now-wow, how now, Brown cow?\nWe're ill 'til the skill gets down\nFor the flex, next, it's the textbook, old to the new\nBut the rest are doo-doo\nFrom radio, to the video, to Arsenio\nTell me, yo; what's the scenario?\n\n[Verse 3: Dinco D]\n(True blue!)\nScooby Doo, whoopie doo\nScenarios, radios, rates more than four\nScores for the s'mores that smother dance floors\nNow I go for mine, shades of sea shore\nShip-shape, crushed grapes, apes that play tapes\nPapes make drakes baked for the wakes\nOf an (L-ah-!), an (-eader!), simply just a leader\nBase in the space means peace, see ya later\nLater (Later!) later, alligator\nPop blows the weasel and the herb's the inflater\nSo, yo, the D, what the O\nIncorporate I-N-C into a flow\nFunk flipped, flat back, first this foul fight, fight, fight\nLaugh, yo, how'd that sound? (Ooh!)\n\n[Verse 4: Q-Tip]\nIt's a Leader-Quest mission and we got the goods here (Here!)\nNever on the left 'cause my right's my good ear (Ear!)\nI could give a damn about a ill subliminal\nStay away from crime so I ain't no (Criminal!)\nI love my young nation, groovy sensation\nNo time for hibernation, only elation\nDon't ever try to test the water, little kid\nYo, Mr. Busta Rhymes, tell him what I did—\n\n[Verse 5: Busta Rhymes]\n—I heard you rushed and rushed (And attacked!)\nThen they rebuked and you (Had to smack!)\nCausing rambunction throughout the sphere\nRaise the levels of the boom inside the ear—\n\n[Verse 6: Q-Tip]\n—You know I did it\nSo don't violate or you'll get violated\nThe hip-hop sound is well agitated\nWon't ever waste no time on a played out ego\nSo here's Busta Rhymes with the scenario:\n\n[Verse 7: Busta Rhymes]\nWatch; as I combine all the juice from the mind\nHeel up, wheel up, bring it back, come, rewind\nPowerful impact (Boom!) from the cannon!\nNot bragging, tryna read my mind, just imagine\nVo-cab-u-lary's necessary\nWhen diggin' into my library\nOh, my gosh! Oh, my gosh!\nEating Ital Stew like the one Peter Tosh\nUnh! Unh! Unh! All over the track, man\nUnh, pardon me, unh! As I come back!\nAs I did it, yo, I had to beg your pardon\nWhen I travel through the town I roll with the squadron\nRawr! Rawr! Like a dungeon dragon\nChange your little drawers 'cause your pants were saggin'\nTry to step to this, I will twist you in a turban\nAnd have you smelling ripe, like some old, stale urine\nChickity Choco, the chocolate chicken\nThe rear cock diesel, buttcheeks, they were kicking\nYo, bust it out before the Busta bust another rhyme\nThe rhythm is in sync (Uh!) the rhymes are on time (Time!)\nRippin' up the sound just like Horatio\nObserve the vibe and check out the scenario\nYeah, my man, mothafucka!\n\n[Hook]\nHere we go, yo, here we go, yo\nSo what, so what, so what's the scenario?\nHere we go, yo, here we go, yo\nSo what, so what, so what's the scenario?\nHere we go, yo, here we go, yo\nSo what, so what, so what's the scenario?\nHere we go, yo, here we go, yo\nSo what, so what, so what's the scenario?"}