{"rank":"56","song_id":"18227","song_name":"Mr. Loverman (From \"Deep Cover\")","artist_id":"278794","display_artist":"Shabba Ranks","spotify_id":"4NzZftBCbGpXhca5OcfFwF","lyrics":"Hear this all the man, mek sure you know how fi undestand\nYou women, straight up, to the max, alright, come now\nWoman if a loving yuh looking for yuh\nbuck upon the right man\nLoving yuh looking for yuh buck upon the right one\nWoman a loving yuh looking for yuh\nbuck upon the right man\nLoving yuh looking for yuh buck upon the right one\nDem call me\nMr. Loverman dem call me Mr. Lover\nMr. Loverman dem call me Mr. Lover\nDem call me\nMr. Loverman dem call me Mr. Lover\nMr. Loverman dem call me Mr. Lover\nBecause a woman tek a trip she coming from England\nTo satisfy her soul you know seh she want a man\nBut is Shabba Ranking she buck upon\nA gwain mek she explode just like a bomb\nEvery hour, every minute, and every second\n\nRepeat\n\nCause\nHe hol' her pon her finger and overstand\none look in a she eye mi know seh she want a man\ntalking to her and she respond\nshe tell me seh she handle man like a bomerang\nme tell me seh me a de hooligan\nfi all tyrant yuh buck upon\nMr. Loverman yuh buck upon Mr. Lover\nMr. Loverman yuh buck upon Mr. Lover\nYuh buck upon Mr. Loverman yuh buck upon Mr. Lover\nMr. Loverman yuh buck upon Mr. Lover\nThe love nah contract yuh know it a expand\nand from it a expand it just a galang, galang\na gwain givelove to a woman me seh all night long\nwoman if a loving yuh looking for yuh\nbuck upon the right one\nSearch nuh more yuh buck upon the right one\nIf a loving yuh looking for yuh buck upon the right one\nSearch nuh more yuh buck upon the right one\nYuh have it in a yuh mine fi come thrill me wid it\nA gwane lay down and mek yuh kill me wid it\nbecause thrilling that is Shabba favorite habit\nand when me lay dung yuh know me nah run from it\n\nRepeat\n\nCause if a loving yuh wan' a loving yuh a get\nyuh never experience dis ya love yet\ncause dis a love a mek yuh wok up a sweat\nand in a dis ya love a mek yuh nah go live and fret\nbecause me love yuh from yuh toe straight to yuh neck\nloving yuh hunting for yuh buck upon de right one\nIf a loving yuh looking yuh buck upon de right one\n\nRepeat\n\nA gwa'ne tell yuh why dem call me Mr. Loverman\ncause fi mi love is Jackly depending\nCarolyn it so Shabba she belong\nwhether sh gone to next Island\nDem call me Mr. Lover dem call mi Mr. Lover cause\nyuh have it in a yuh heart fi thrill me wid it\nA gwane lay down and mek yuh kill me wid it\nyuh know that thrilling is my favorite habit\nShabba Ranking naw run from it\nYuh buck upon Mr. Loverman\nYuh buck upon Mr. Lover\nMr. Loverman yuh buck upon Mr. Loverman\nTo the love that yuh get it explode like a bomb\nevery hour, every minute, every second\nto the one Jacqulyn Shabba love strong\nShe buck upon Mr. Loverman\nShe buck upon Mr. Loverman\nMr. Loverman she buck upon Mr. Loverman\nTo the pan coot dem I don't care a\nMr. Loverman she buck upon Mr. Loverman\nTo the Hooligan dem I don't care a\nMr. Loverman she buck upon Mr. Loverman\nWoman a loving yuh searching for, yuh buck upon\nthe right one\nCome search nuh more, you buck upon the right one\nIf a loving yuh looking yuh buck upon the right one\nSearching for yuh buck upon the right one\nYuh buck upon Mr. Loverman from in a jam one\nMr. Loverman, Mr. Loverman, Mr. Loverman\nDem call Mr. Loverman\nDis yah loving yuh get a from yuh belly bottom\nfrom the ground to yuh head top"}