{"rank":"76","song_id":"18240","song_name":"They Reminisce Over You (T.R.O.Y.)","artist_id":"328693","display_artist":"Pete Rock","spotify_id":"2Mb3zpobD0CvJGWv6NpsPy","lyrics":"[Produced by Pete Rock]\n\n[Intro]\n(I reminisce, I reminisce)\n(I reminisce, I reminisce)\n(I reminisce, I reminisce)\nI reminisce, I reminisce\nUh! (I reminisce, I reminisce)\nYeah (I reminisce, I reminisce)\n(I reminisce, I reminisce)\n(I reminisce, I reminisce)\n\n[Verse 1: C.L. Smooth]\nI reminisce for a spell, or shall I say think back\nTwenty-two years ago to keep it on track\nThe birth of a child on the 8th of October\nA toast but my granddaddy came sober\nCountin' all the fingers and the toes\nNow I suppose, you hope the little black boy grows, huh\nEighteen years younger than my mama\nBut I rarely got beatings cause the girl loved drama\nIn single parenthood there I stood\nBy the time she was 21, had another one\nThis one's a girl, let's name her Pam\nSame father as the first but you don't give a damn\nIrresponsible, plain not thinking\nPapa said chill but the brother keep winking\nStill he won't down you or tear out your hide\nOn your side while the baby maker slide\nBut mama got wise to the game\nThe youngest of five kids, hon here it is\nAfter 10 years without no spouse\nMomma's gettin married in the house\nListen, positive over negative for the women and master\nMother Queen's risin a chapter\nDéjà vu, tell you what I'm gonna do\nWhen they reminisce over you, my God\n\n[Bridge 1: Pete Rock]\nMy God\nIt's so\nYeah, so lovely\nThat's how we like to do it in the 90's\nPete Rock & CL Smooth comin' atcha\n\n[Verse 2: C.L. Smooth]\nWhen I date back I recall a man off the family tree\nMy right hand Poppa Doc I see\nTook me from a boy to a man so I always had a father\nWhen my biological didn't bother\nTaking care of this so who am I to bicker\nNot a bad ticker but I'm clocking pop's liver\nBut you can never say that his life is through\nFive kids at 21 believe he got a right too\nHere we go while I check the scene\nWith the Portuguese Lover at the age of 14\nThe same age, front page, no fuss\nBut I bet you all your dough, they live longer than us\nNever been senile, that's where you're wrong\nBut give the man a taste and he's gone\nNoddin' off, sleep to a jazz tune\nI can hear his head banging on the wall in the next room\nI get the pillow and hope I don't wake him\nFor this man do cuss, hear it all in verbatim\nTelling me how to raise my boy unless he's taking over\nI said pop maybe when you're older\nWe laughed all night about the hookers at the party\nMy old man standing yelling good God, almighty\nUse your condom, take sips of the brew\nWhen they reminisce over you, for real\n\n[Bridge 2: Pete Rock]\nFor real, baby\nLike that\nWe for real\nComin' atcha\nIn '92\nPete Rock & CL Smooth\nYeah, c'mon, hit me!\n\n[Verse 3: C.L. Smooth]\nI reminisce so you never forget this\nThe days of wayback, so many bear witness the fitness\nTake the first letter out of each word in this joint\nListen close as I prove my point\nT to the R the O-Y, how did you and I meet?\nIn front of Big Lou's, fighting in the street\nBut only you saw what took many time to see\nI dedicate this to you for believing in me\nRain or shine, yes in any weather\nMy grandmom Pam holds the family together\nMy Uncle Doc's the greatest better yet the latest\nIf we're talking about a car, Uncle Sterling got the latest\nI strive to be live cause I got no choice\nAnd run my own business like my Aunt Joyce\nSo Pete Rock hit me, nuff respect due\nWhen they reminisce over you, listen\n\n[Outro: Pete Rock]\nListen, just listen\nTo the funky song as I rock on\nAnd that's word is bond\nI'm not playin\nEverybody, just coolin\nThis song we dedicate\nTo the one and only\nNever be another\nHe was my brother\nTrouble T-Roy\nIt's like that y'all\nAnd you don't stop\nPete Rock and CL Smooth for '92\nAnd we out, later"}