{"rank":"61","song_id":"18257","song_name":"Back To The Hotel","artist_id":"276934","display_artist":"N2Deep","spotify_id":"2TVWQ8xDTLvjimMSqW3F96","lyrics":"V-town, brother check it out, i'm by the dope town\nDick in hand, you shoulda had your toke down\nA little city, chillin in the north bay\nNeedless to say, my boyz don't play fool\nYo que sabo, you know how the songs goes?\nIn the back, sippin purple chongos\nDon't look for trouble but it always seems to find us, forty\nGripin panties, sippin, and the seats are right behind us\nQuick left, one blow, k.o.\nHit the road to the next episode\nIn the saga of a few fellows\nOh what the hell, i guess i better tell ya\nIt's friday night, i got a brand new kick on\nFor me to get bent on\nHit the country of the picked up ml\nEighty west, back to the hotel\nAt the tele, bones is doing butt work\nJohnny ziti had his hand up her miniskirt\nThe late in the corner started to flirt\nAnd i knew that when she saw me baby doll was gonna jaw me\nSet for the night so i took her to my ride\nGrab my mickey's and my boda and i met her outside\nWho-ride, i'd like to do this honey to the triple gold z's\nAcid in my bottle, so i gotta get some more\nPut the pedal to the metal back to the liquor store\nCause you know what i mean when i'm feelin kinda funky\nA sick honky, straight going donkey\nMoney in my sock, jimmy in my glove\nLayin in the livin, cause i'm about to make good love\nAnd burn rubber up the block\nBack to the tele, i gotta get some new cock\nAh naw, could it be?\nI just got a page an' a broad wanna do me\nHooked it up, told her meet me at the hotel\nShe had a friend with her so i called tl\nSmooth me up, sally wanted me dicked\nAnd monty licked, so try an' make it real quick\nAh yeah, i jumped in the f-train\nBut wait a minute, we gotta hit the store main\nI got to get some gum and some tic-tac's\nTwo tall cans and a packet of blackjack\nWe got the goods, now we're headed for the hoe down\nThere goes the tele, so fella won't you slow down\nPark the ride in front like a sick one\nJust in case, we gotta bust a quick one\nLock the load into eighteen\nBut law low cause i really don't wanna be seen\nIs this the one? aw yeah, that's the right one\nI got the black bod and you got the white one\nSo hit the light an', i just might man\nTry an' throw this thing all night an'\nGet her so strung, that she'll drop some melt\nSo i can catch turf and hit another hotel from: \"if you lived here, you'd be home now.\""}