{"rank":"90","song_id":"18250","song_name":"Strobelite Honey","artist_id":"288498","display_artist":"Black Sheep","spotify_id":"1ppE6XvxAX2EOR5POLUzy0","lyrics":"[Verse 1]\nI skipped the line, I paid my dime\nI hung my coat, and now it's time\nTo move to the forefront make my rounds\nSay peace and give a pound have a drink, get down\nI'm on the floor, besides the door\nThe sound is rich, and I ain't poor\nI'm looking for Susie or Wendy or Judy\nBut look at her (but look at her)\nBut look at her\n(Who me?)\nYes, you sweetie, although it's hard to see thee\nI see your silhouette and what I see has got me needy\nI need you for a second of your time\nBut then I reckon that a second is too short let me try\n(You're slamming!)\nBut anyway, I'd like to say\nI'm Dres of the Black Sheep givin' you play\nStep out in the light, come show off yourself\nYo, I'm sorry, I thought you were someone else\n\n[Chorus]\nI gotta go, I gotta go, I gotta go (Don't go)\nI gotta go, I gotta go, I gotta go (Don't go)\nI gotta go, I gotta go, I gotta go (Don't go)\nJust don't know \"Why?\" Hon, I just don't know\nI gotta go, I gotta go, I gotta go (Don't go)\nI gotta go, I gotta go, I gotta go (Don't go)\nI gotta go, I gotta go, I gotta go (Don't go)\nSee something ain't right \"Why?\" It's the strobe light\n\n[Interlude]\n[Mista Lawnge]\nVan Damme, Oh man, now you look out\nI can not dig it, I can not dig it\nNo, Black yo, I can not dig it\n\n[Dres, Strobelite Ho]\nListen Hon, I mean aaaaaah\nIt was nice looking at you, I just have to go\nMy man is right over there\n(Where you going?)\nI have to go my - Huh?\nI'm on my way Black, I'm on my -\n(Don't you have a number or something?)\nListen it's uh, seven six five, four three two one\n(Wh-what area code is that?)\nOne, nine-hundred\n\n[Verse 2]\nListen here dear, step to the rear\nFind yourself a seat, buy yourself a beer\nEat some pretzels, go play some videos\nThank you for your time honey but ho I gotta go\nI think I lost my coat, and plus I'm double parked\nI thought you was my girl, you see I can't see in the dark\nAnyway I'm out, out is what I be\nI've got to step\n(With the viscosity)\nWhen you see a honey by the strobe light\nBlack I hope you got good sight\nFor honey that you see, like a Shakespeare soliloquy\nMay or may not be, all that\nIn fact, quite wack\nWith the girl that makes you stop tracks\nBut neither here nor there fear\nUnless, of course, you don't care\nListen baby girl, let me say it slow\nI-have-to-go\nNot to dis, but let's disperse\nYo, I'll see you later, unless I see you first\n\n[Chorus]\nI gotta go, I gotta go, I gotta go (Don't go)\nI gotta go, I gotta go, I gotta go (Don't go)\nI gotta go, I gotta go, I gotta go (Don't go)\nJust don't know \"Why?\" Hon, I just don't know\nI gotta go, I gotta go, I gotta go (Don't go)\nI gotta go, I gotta go, I gotta go (Don't go)\nI gotta go, I gotta go, I gotta go (Don't go)\nSee something ain't right \"Why?\" It's the strobe light\n\n[Outro]\nCan't swing tonight, so ahhhhhhh\nHoney take a hike, go fly a kite\nAnd I don't mean to be um impolite\nBut yo, I'm outta here aight?"}