{"rank":"53","song_id":"18263","song_name":"End Of The Road (From \"Boomerang\")","artist_id":"297041","display_artist":"Boyz II Men","spotify_id":"1c48FSKfpobDF3VzopU10V","lyrics":"(spoken)\nGirl you know we belong together\nI have no time for you to be playing with my heart like this\nYou'll be mine forever baby, you just see\n\nWe belong together\nAnd you know that I'm right\nWhy do you play with my heart,\nWhy do you play with my mind?\nSaid we'd be forever\nSaid it'd never die\nHow could you love me and leave me and never say good-bye?\n\nWhen I can't sleep at night without holding you tight\nGirl, each time I try I just break down and cry\nPain in my head oh I'd rather be dead\nSpinnin' around and around\n\nCHORUS:\nAlthough we've come to the End Of The Road\nStill I can't let go\nIt's unnatural, you belong to me, I belong to you\nCome to the End of the Road\nStill I can't let go\nIt's unnatural, you belong to me, I belong to you\n\nGirl, I know you really love me,\nYou just don't realize\nYou've never been there before\nIt's only your first time\nMaybe I'll forgive you, hmm\nMaybe you'll try\nWe should be happy together forever, you and I\n\nCan you love me again like you loved me before\nThis time I want you to love me much more\nThis time instead just come to my bed\nAnd baby just don't let me, don't let me down\n\nREPEAT CHORUS.\n\n(spoken)\nGirl I'm here for you\nAll those times of night when you just hurt me\nAnd just run out with that other fella\nBaby I knew about it, I just didn't care\nYou just don't understand how much I love you do you?\nI'm here for you\nI'm not out to go out and cheat on you all night\nJust like you did baby but that's all right\nHey, I love you anyway\nAnd I'm still gonna be here for you 'till my dying day baby\nRight now, I'm just in so much pain baby\nCoz you just won't come back to me\nWill you? Just come back to me\n(Lonely)\nYes baby my heart is lonely\n(Lonely)\nMy heart hurts baby\n(Lonely)\nI feel pain too\nBaby please\n\nThis time instead just come to my bed\nAnd baby just don't let me down\n\nREPEAT CHORUS.\n"}