{"rank":"97","song_id":"18324","song_name":"Get Ready For This","artist_id":"431863","display_artist":"2 Unlimited","spotify_id":"45Q5IYHJbBdmvlcnwVpXw5","lyrics":"Y'all ready for this?\n\nGet down with the sound, house on the ground\nFreeze when I squeeze, drop to your knees\nYou must of bet, I'm in here to stay\nReady to take you around the way\n\nSo get ready for this, mind your own biz\n'Cause I am bad, yeah the microphone wiz\nNo need to sit, 'cause we're 2 Unlimited\nReady, ready, ready for this\n\nFeel the base, you just get closer\nBe impressed by the words I chose of\nOnce again kickin' it live\nDoin' everything yo just to survive\n\nAbove the law, I take our stand\nBeing on stage with a mic in my hand\nBustin' it loud to the crowd\nThe age is 20, I'm from the south\n\nBe a part, break my heart\nGet ready for this, mind your own biz\nPeople in the front, show me what you want\nAnd I won't give it in, get ready for this\n\nWe're 2 Unlimited, so people won't you sing?\nMovin' up and down, dancin' on the ground\nFeelin' kinda free security\nHow's this sound that moves you from the ground\n\nHouse on the ground, bass in your face\nRacin' the place, no time to waste\nBeing hypnotised, I can see it in your eyes\nFeelin' kinda better, put on your sweater\n\nBeing black or white, I think it doesn't matter\nSuper, dope, def, and even outrageous\nIf I was an animal, they'd 've kept me in cages\nSo get ready for this\nY'all ready for this?\n\nBe a part, break my heart\nGet ready for this, mind your own biz\nPeople in the front, show me what you want\nAnd I won't give it in, get ready for this\n\nWe're 2 Unlimited, so people won't you sing?\nMovin' up and down, dancin' on the ground\nFeelin' kinda free security\nHow's this sound that moves you from the ground\n\nStep back, relax, don't you wanna come in?\nWhen I start rappin' the girlies wanna come in\nInto my house, into my room\nThat's the part where it goes, boom, boom\n\nName here is Ray, the group is 2 Unlimited\nWe've got a lot to say\nTo you, ah yeah and your other crew\nIf it is a dream, boom see boom"}