{"rank":"24","song_id":"18325","song_name":"Forever Love (From \"Mo  Money\")","artist_id":"299542","display_artist":"Color Me Badd","spotify_id":null,"lyrics":"Now here we are, The two of us,\nAnd nothing's gonna come between us again.\nForever love, I feel you're with me,\nYou抮e the sun that chases away the rain. Oh....\nI cherish all the love you bring,\nIt's here forever and a day,\nI love you more than anything,\nI can't throw that away. My Love.....\n\nThere's nowhere, Baby unless you're there,\nI could never let you down.\nBy the way, I have wanted to say,\nI will always be around, Forever love.. Oh.. Forever Love, baby oh...\nInside my heart, You'll never die,\nYou understand the man that hides deep inside.\nSo come to me, (So come to me)\nI need you dearly, ( I need you dearly)\nI'll never give you reason to say good-bye... (never say good-bye)\n\nThere were times I made you cry,\nAnd times I wasn't there for you,\nBut for our love I'd even die, (for our Love)\nFor you I'm gonna stay.\n\nThere's nowhere baby unless you're there, \nI could never let you down..\nBy the way, ( By the way...)\nI have wanted to say, (ya-ha...)\nI will always be around, ya...Forever love.. ( I need you baby)\n\nYou know, girl being with you is like the meaning of my life,\nYou give me so much happiness,\nJust to see you smile gives me the strength to go on.\nI cherish all the moments we spend together,\nThe laughter, The tears, there all so special to me\nI guess what I'm really trying to say is, That I love you..\nI cherish all the love and rain you bring,\nI know it抯 falling...\nI love you more than anything,\nI can抰 throw that away... that away....Ohh...\nThere's nowhere, Baby unless you抮e there,\nI could never let you down.. ( I抣l never let you down)\nBy the way, I have wanted to say, ( all I wanna do is...)\nI will always be around..\nthere's nowhere, Baby unless you're there, (oh no, no, no,)\nI could never let you down..\nYou know if you want me you got me..\nIf you need me I'll be there..\nI will always be around..\nI'll always be around girl, ( be around)\nI'll never let you down, ( be around)\nYou know I will..\nFor the memory of you,\nFor all the times we shared together,\nFor all we've been through,\nForever Love..\n"}