{"rank":"70","song_id":"18337","song_name":"My Name Is Prince","artist_id":"351039","display_artist":"Prince And The New Power Generation","spotify_id":"6kqeBsFnxLp7PbcPxKtCTJ","lyrics":"My name is Prince and I am funky\r\nMy name is Prince, the one and only\r\nI did not come 2 funk around\r\nTill I get your daughter, I won't leave this town\r\nIn the beginning (funky) God made the sea\r\nBut on the 7th day He made me\r\nHe was tryin' 2 rest y'all when He heard the sound\r\nSound like a guitar cold gettin' down\r\nI tried 2 bust a high note, but I bust a string\r\nMy God was worried until he heard me sing\r\n\r\nMy name is Prince and I am funky\r\nMy name is Prince, the one and only\r\nHurt me!\r\n(Do that, do that somebody) {x8}\r\nHurt me!\r\n\r\nMy name is Prince and I am funky\r\nWhen it come 2 funk, I am a junkie\r\nI know from righteous, I know from sin\r\nI got 2 sides and they both friends\r\nDon't try 2 clock 'em, they're much 2 fast\r\nIf U try 2 stop 'em, they'll kick that ass\r\nWithout a pistol, without a gun\r\nWhen U hear my music, U be havin' fun\r\nThat's when I gotcha, that's when U mine\r\n2 tell the truth, tell me what's my line?\r\n\r\nMy name is Prince and I am funky (U can't stop Prince)\r\nMy name is Prince, the one and only (U can't stop Prince)\r\nHurt me!\r\n(Do that, do that somebody) {x4}\r\nFunky fresh 4 the 90's (Prince)\r\n\r\nMy name is Prince, I don't wanna be King\r\nCuz I've seen the top and it's just a dream\r\nBig cars and women and fancy clothes\r\nWill save your face but it won't save your soul\r\nI'm here 2 tell U that there's a better way\r\nWould our Lord be happy if He came 2day?\r\nI ain't sayin' I'm better, no better than U, huh\r\nBut if U want 2 play with me, U better learn the rules (Ow!)\r\n\r\nMy name is Prince and I am funky (U can't stop Prince)\r\nMy name is Prince, the one and only (U can't stop Prince)\r\nI did not come 2 funk around (U can't stop Prince)\r\nTill I get your daughter, I won't leave this town\r\nI won't leave this town {x2}\r\nI won't leave this, leave this, leave this\r\n\r\nMy name is Prince and I am funky (U can't stop Prince)\r\nMy name is Prince the one and only (U can't stop Prince)\r\nFunky fresh 4 the 90's\r\n(Do that, do that somebody) {x4}\r\nHurt me!\r\n\r\nThe funkier I be, the funkier I get, ooh shit\r\nLickety split on the lyric, a new jack in the pulpit\r\nWatch it deacon, your track is leakin'\r\nWhat is this U're seekin'?\r\nThe syncopated rhymes are at their peak when\r\nU jumped on my D.I.C.K.\r\nThat's the one thing I don't play\r\nThe jock strap was 2 big 4 U anyway\r\nU're just a simpleton\r\nI'll bust U like a pimple, son\r\nMy star is 2 bright, boy\r\nI'll sink U like the ship Poseidon Adventure\r\nU're bumpin' dentures 2 be cocksure\r\nThere must be more coming from your mouth than manure\r\nSo with a flow and a spray, I say hey\r\nU must become a Prince before U're King anyway\r\n\r\n(Do that, do that somebody) {x2}\r\n\r\nIt's time I get ig-ig-ig-ig-ig-ig-ignorant\r\nDef be the beat that I'm rockin'\r\nYo, so come get a hit\r\nAnd put your thinking cap on\r\nU've been forewarned\r\nI call upon the inner forces I've got brewin' in my cauldron\r\nThat means my nugget, sometimes I'm rugged\r\nThe style I posses be havin' the other brothers buggin'\r\nAnd this is 4 those who oppose\r\nAnd propose 2 overexpose, disclose\r\nPose a threat 2 my brother\r\nLike any other man makin' a stand\r\nI'll be damned if I let U play this hand\r\nI'm the blackjack dealer and the cards are stacked\r\nWhat do U expect 2 win when U're used 2 playing craps?\r\nYeah, let's get rid of them, hmm?\r\n\r\n(Do that, do that somebody) {x2}\r\n\r\nIt's gettin' tricky, that means a sticky situation\r\n2 resurrect a groove with feeling and give it this much affection\r\nPassion flows who knows what lurks in the gallows of my mind\r\nI put my foot in the ass of Jim Crow\r\n12 inches of non-stop sole\r\nI'm on a roll - yo P, it's time 4 the show\r\nSo do that, do that somebody\r\nWave your hands in the air, this is a motherfuckin' party\r\nWhile U're layin' back, I'm on the attack\r\nPaddywhack - give yourself a bone\r\nThis is my house and I'm prone\r\n2 layin' some chrome upside some motherfucker's dome\r\nAnd I'm out\r\n\r\nMy name is Prince and I am funky\r\nMy name is Prince, the one and only\r\n\r\nMy name is Prince {x10}"}