{"rank":"90","song_id":"18353","song_name":"360 Degrees (What Goes Around)","artist_id":"303075","display_artist":"Grand Puba","spotify_id":null,"lyrics":"[GPM] Yeah yeah yeah yeah yeah\n\"There's just one thing I wanna say..\"\n[GPM] The reel to reel to reel to reel yo\n\"There's just one thing I wanna say..\"\n[GPM] Copy copy copy copy copy\n\"There's just one thing I wanna say..\"\n[GPM] We gonna hit it down like this, y'all know the flav\n\"There's just one thing I wanna say..\"\n[GPM] Uhh, Alamo, is you wit me?\n\"What goes around comes back around again..\"\n[GPM] Stud Doogie, is you wit me?\n\"What goes around comes back around again..\"\n[GPM] S.O.S., is you wit me?\n\"What goes around comes back around again..\"\n[GPM] Yo this how we gon' bust it down, yo you know the flavor\n\"What goes around comes back around again..\"\n[GPM] You know what time is it, check it yo, this how we flow\n\n[Grand Puba Maxwell]\nHere comes the Puba and you know I won't fake it\nUsually bust records on gettin butt naked\nMade for the Benzi, drive a nigga skins he\npump the tape, grab your dick, get with the Puba frenzy\nC'mon honey sing, don't you, try to eject\n_Slow Down_'s what you say, once my joint gets erect\nSome try to copy but they just can't sketch it\nSome try to follow but they just can't catch it\nWith the boom boom tap, yeah alla dat\nHuh, I'm livin fat, me fall off, there'll be none of that\nSee who's the one to flip it?  Quick to tell a nigga to zip it\nStud drink the 40 cause we ain't got time to sip it\nGrand Puba got body\nKick some of them, some of those, and some yardies\nAs dope as they come, suckers sing or hum\nDon't try to step to this, you know your shit is slum\nFirst batter up well here's the pitch - it's a curve\nSecond batter up because the first got served\nThe one who arouse, as I browse for a blouse\nKick styles by the piles, as I leave a trail for miles\nSkins when I please, hit from here to Tel Aviv\nI'm gettin G's, no more time for the line of free cheese\nHere's the four one one hon, the one who gets the job done\nI know you know the flavor of the Puba\n\n\"What goes around comes back around again..\"\n[GPM] Yeah yeah yeah yeah, na-nah nah nah nah, this how we bump it yo!\n\"What goes around comes back around again..\"\n[GPM] Yaknahmsayin?  Big Jeff in the house, we gon' move it like this\n\"What goes around comes back around again..\"\n[GPM] Ha hah, Baby Pop Baby Pop in the house, bust how we bust it down\n\"What goes around comes back around again..\"\n[GPM] Y'all you know the flavor.. Sincere Allah, check check check check!\n\n[Grand Puba Maxwell]\nO-kay o-kay o-kay, what more could I say?\nAlamo get the boom and.. parlay parlay\nI'm far from the average, civilize the savage\nWhen I'm low on protein I'm with the bean soup and cabbage\nSkins on the diet, kick the flavor, cause a riot\nDo a show and get the dough and then I'm off to the Hyatt\nSo tie me on the spliff, ain't no ands or if\nAnd if you really wanna riff you just might end up playin stiff\nGirbauds hangin baggy, Hilfiger on the top\nKnapsack on the back, that's just my flavor Hobbes\nAs my man gives a zigga zigga, watchin three grow bigga bigga\nTo Pos K, that's my nigga\nHere goes the wreck, whaddayou expect?\nIf you wanna see some wreck, send cash, not a check\nGrand Puba, more than a public figure\nQuick to kick the bone up the butt of a golddigger\nNow Tic-Tac-Toe means I hit three in a row\nIf I do a show then you better have my dough\nLow, low, well how low can you go?\nCall on Grand Puba if you really need a pro\nCause my shit's more rugged than G.I. Joe\nDon't front honey, act like you know\nNow big up to my Brooklyn mob (Brooklyn!  Brooklyn!)\nBig up to my Uptown mob (Uptown!  Uptown!)\nNow brothers wanna diss me cause it's my turn to burn\nMy best advice for the brothers is to sit back and learn\nI don't diss nobody to be somebody\nI just like to kick the flavor to make the people party\nSee all I'm sayin, is respect due\nThose who tried to follow, sorry I left you\nGrand Puba, Stud Doogie and Alamo\nSo if you ever want the flavor you know where to go\nNow how we go..\n\nYeah, ha ha ha!\nThe reel to reel, yeah yeah yeah, this is how we move it\nYou know the flavor, y'all know the flavor, you know the flavor\nHere we go yo, and you don't stop (big up to all the people)\nBig up!  Big up!\nBig Jeff hold tight!  Ha hah, ha hah!\nOn and on y'all\nTime to get gone\nWord is bond"}