{"rank":"83","song_id":"18426","song_name":"Punks Jump Up To Get Beat Down","artist_id":"297065","display_artist":"Brand Nubian","spotify_id":"374rBVAfbGAwFnIk6XAj2H","lyrics":"(\"Get nothin' but abuse!\")\nRefrain 4x\nPunks jump up to get beat down!\n(\"Get nothin' but abuse...\")\n\n[Verse 1 – Sadat X]\nOne day when I was ridin' on the train I seen these two kids talkin'\nAbout the Nubian reign had fallen\nI didn't say nothin' cuz these kids caught my goat\nEven wore my coat like a murder that they wrote\nSo this kid with mouth swagger 'n I'll blaze the cloak and dagger\nSo I gotta show Dukes the macho lot that I am\nI can rock a jam, make the world drop ham\nOh yes, I'm the bad man, and bad men wear black\nAnd if it comes to droppin' bombs, yo, I'm with that\nThough I can freak, fly, flow, fuck up a faggot\nDon't understand their ways I ain't down with gays\nYou wanna grab the style that was made from my mom and my dad\nWhen I was young I used to run with a notepad\nThen time flew and somehow I knew that I was bad to the bone...\nBlack prodigy since the age of twen-ty\nI could write a rhyme, rip it up and write a next one\nRight on the spot, sign my name with a dot\nDiamond D threw me some smooth shit, Bronx crowd roar\nStick up your wack jam, everybody hit the floor\nOkay it's you, Slim, the hard rock of the pack\nDon't wanna kneel to the brothers, you must be holin'\nBust some shit in his chest, now his whole body's swollen\nWhy did I have to do it? He asked for it\nHis man saw it, so it don't mean shit to me\nHe's gone, that's how it's supposed to be....check it out now\nI ain't goin' out, man that short shit is dead\nHave you heard what I said? If not, ask the dread\nHe got a cannon that's bad...similar to the one that I got from my own dad\n\nRefrain 4x\n\n[Verse 2 – Lord Jamar]\nYour punk ass'll be grass quick fast like my name was Flash\nWhen a nigga try and rob me for my cash\nYou thought you had a sweet vic, a nice pick\nBut you didn't anticipate that I might be sick\nNow who's the trick, cuz I'm not a ho. (No, no-no-no!)\nI always do the fuckin', just might do the buckin'\nI leave my Nikes stuck in your rectum, till you learn\nBrand Nubian, yo, you gotta respect 'em\nDissect 'em, yo, our word is bond regardless\nTo my what, and do the Puma strut\nSo step the fuck off, before I punch you in your face\nWith the mothafuckin' bass!\nThen you're gonna taste blood in your mouth, it's gonna flood south\nTo the ground, and you're gonna know I don't fuck around\nSo if you think you had two soft newjacks\nWe're gonna have top off you with a few cracks\nTo the jaw and you won't pop that shit no more\nExplainin' to your friends why you're layin' on the floor\nDid you want some more? I didn't think so\nJust got whipped like a faggot in the clink, so\nI suggest you take your bloody mess and find a piece of wire\nFix your broken jaw, then it's time to retire\nLord Jamar will live long, cuz I give strong blows the heads of my foes\nDread flows, gives me power as it grows\nWatch how rass-cladda you catch the speed knot\nHeed not, and hell will be your home\nLord Jamar, Sadat, as we swell your dome\n\nRefrain 4x"}