{"rank":"28","song_id":"18446","song_name":"Hip Hop Hooray","artist_id":"312066","display_artist":"Naughty By Nature","spotify_id":"3fwUpUntnrvggfHhvyQq6D","lyrics":"Let's give it up for Naughty by Nature!\n\nHip Hop hooray...\nHo...Hey...Ho\n\n(Vinnie) \n\nYou drew a picture of my morning\nBut you couldn't make my day, Hey!\nI'm rockin' and you're yawning\nBut you never look my way, Hey!\nI'm lickin down you darlin'\nIn every single way, Hey!\nYour funny flow is foreign\nAnd a green card's on the way! \n\n(Treach) \n\nThis ain't got shit to do wit shampoo\nBut watch your head n shoulders brother older bold enough to fold ya\nYo I told ya a raid afraid of what I made\nPlus played a funky fit so save ya flips\nPlus tricks for that music plus the monkey bit. \n\n(Vinnie) \n\nTriggas from the Grilltown Illtown\nSome ask how it feels now\nHow the deal is that we're real so we're still around\nDon't lamp wit a freestyle phantom ain't tryin' to be handsome \nShrinkin' what ya thinkin' cause I'm vampin' \n\nCHORUS: \n\nI live and die for Hip Hop \nThis is Hip Hop for today\nI give props to Hip Hop so Hip Hop hooray...\nHo...Hey...Ho \n\n(Treach) \n\nYou heard a lot about a brother gaining mo' ground \nBeing low down I do the showdown wit' any little ho round, no! \nI wanna know who you're believing through you're funny reasons \nEven when I'm sleeping you think I'm cheatin'\nYou said I know you're Mr. O.P.P. man yo PP man won't only see me man\nYou should've known that I was wit if a bit when I ain't hit it \nAnd step not to consider the Rep Heck!\nI did your partner cause she's hot as a baker cause I'm Naughty by Nature\nNot cause I hate cha!\nYou put your heart in a part of a part that spreads apart\nEven though I forgave ya when you had a spark. \n\nYou try to act like something really big is missing\nEven though my name's graffiti written on your kitten\nI love Black women always and disrespect ain't the way\nLet's start a family today Hip Hop hooray...ho...hey! \n\nHip Hop Hip Hip Hop Hip Hip Hop Hooray!\nThere's many hungry Hip Hoppers one reason Hip Hop's\nHip top today swerve what cha heard\nCause I ain't bailing no hey ain't choppin no crops\nBut still grownin ever day! \n\n(Vinnie) \n\nHere's a thunder sound from the wonders found\nFrom the underground town down the hill\nFeel how Illtown drown smiles to frowns\nSnatchin' crowns from clowns beat downs are found\nDon't know me don't come around. \n\nTippy tippy (pause)\nTippy tippy (pause)\nSometimes creepin' up I eat em up\nYour style is older than Lou Rawls!\nPeace to this one and that one and them\nThat way I shout out and I didn't miss one friend\nFools get foolish neither them or Parker Lewis knew us\nYou could have crews wit shoes and can't step to us\nSome kitty purr I call em sir too\nAny trick that diss gets a curfew\nI put my projects for boots step through troops and leave proof \nMy problem solvers name is Mook!\nI hittin' woodys in a hoody\nPeace to Jesette, Jobete, Jo-Jo, Genae, and every hood gee!\nThat's right my fight is ill\nPeace goes to L.O.N.S. and Quest, Nice & Smooth & Cypress Hill\nI live and die for Hip Hop\nThis is Hip Hop of today\nI give props to Hip Hop so Hip Hop hooray...ho...hey...ho! \n\n"}