{"rank":"95","song_id":"18450","song_name":"Nuthin  But A \"G\" Thang","artist_id":"301270","display_artist":"Dr. Dre","spotify_id":"4kUV72Pe5TK6sVMDJI6CqA","lyrics":"[Produced by Dr. Dre]\n\n[Verse 1: Snoop Dogg]\nOne, two, three and to the four\nSnoop Doggy Dogg and Dr. Dre is at the door\nReady to make an entrance, so back on up\n(‘Cause you know we're 'bout to rip shit up)\nGive me the microphone first, so I can bust like a bubble\nCompton and Long Beach together\nNow you know you're in trouble\nAin't nothin' but a G thang, baby\nTwo loc'ed out niggas, so we're crazy\nDeath Row is the label that pays me\nUnfadeable, so please don't try to fade this (hell yeah!)\nBut, um, back to the lecture at hand\nPerfection is perfected, so I'ma let 'em understand\nFrom a young G's perspective\nAnd before me dig out a bitch I have to find a contraceptive\nYou never know, she could be earnin' her man\nAnd learnin' her man, and at the same time burnin' her man\nNow, you know I ain't with that shit, Lieutenant\nAin't no pussy good enough to get burnt while I'm up in it\nAnd that's realer than Real-Deal Holyfield\nAnd now you hookers and hoes know how I feel\nWell, if it's good enough to get broke off a proper chunk\nI'll take a small piece of some of that funky stuff\n\n[Hook: Dr. Dre + Snoop Dogg]\nIt's like this and like that and like this and a–\nIt's like that and like this and like that and a–\nIt's like this and like that and like this and a–\nDre, creep to the mic like a phantom\n\n[Verse 2: Dr. Dre]\nWell, I'm peepin' and I'm creepin' and I'm creepin'\nBut I damn near got caught ‘cause my beeper kept beepin'\nNow it's time for me to make my impression felt\nSo sit back, relax, and strap on your seat belt\nYou never been on a ride like this befo'\nWith a producer who can rap and control the maestro\nAt the same time with the dope rhyme that I kick\nYou know and I know, I flow some old funky shit\nTo add to my collection, the selection symbolizes dope\nTake a toke, but don't choke\nIf you do, you'll have no clue\nOn what me and my homie Snoop Dogg came to do\n\n[Hook: Dr. Dre + Snoop Dogg]\nIt's like this and like that and like this and a–\nIt's like that and like this and like that and a–\nIt's like this, and who gives a fuck about those?\nSo just chill 'til the next episode\n\n[Refrain: Kid Dynamite + Public Enemy (Congress Alley)]\nYou’ve got the feeling\nTo rock the other side\nYou’ve got the feeling (yeah, yeah)\n\n[Verse 3: Snoop Dogg]\nFallin' back on that ass, with a hellafied gangsta lean\nGettin' funky on the mic, like a old batch of collard greens\nIt's the capital S, oh yes, I'm fresh, N double-O, P\nD, O, double-G, Y, D, O, double-G, you see\nShowin' much flex when it's time to wreck a mic\nPimpin' hoes and clockin' a grip like my name was Dolomite\nYeah, and it don't quit\nI think they in the mood for some mothafuckin' G shit\n(Hell yeah!) So, Dre (What up, Dogg?)\nGotta give them what they want (What's that, G?)\nWe gotta break 'em off somethin' (Hell yeah!)\nAnd it's gotta be bumpin' (City of Compton)\n\n[Verse 4: Dr. Dre]\nIs where it takes place, so when asked, your attention\nMobbin' like a motherfucker, but I ain't lynchin'\nDroppin' the funky shit\nThat's makin' the sucker niggas mumble\nWhen I'm on the mic, it's like a cookie: they all crumble\nTry to get close, and your ass'll get smacked\nMy motherfuckin' homie Doggy Dogg has got my back\nNever let me slip, ‘cause if I slip, then I'm slippin'\nBut if I got my nina, then you know I'm straight trippin'\nAnd I'ma continue to put the rap down, put the mack down\nAnd if you bitches talk shit I'ma have to put the smack down\nYeah, and you don't stop\nI told you I'm just like a clock when I tick and I tock\nBut I'm never off, always on to the break of dawn\nC-O-M-P-T-O-N and the city they call Long Beach\nPuttin' the shit together\nLike my nigga D.O.C., no one can do it better\n\n[Hook: Dr. Dre + Snoop Dogg]\nLike this, that and this and a–\nIt's like that and like this and like that and a–\nIt's like this, and who gives a fuck about those?\nSo just chill 'til the next episode\n\n[Refrain: Kid Dynamite + Public Enemy (Congress Alley)]\nYou’ve got the feeling\nTo rock the other side\nYou’ve got the feeling (yeah, yeah)\nYou’ve got the feeling\nTo rock the other side\nYou’ve got the feeling (yeah, yeah)"}