{"rank":"67","song_id":"18492","song_name":"Down With The King","artist_id":"369290","display_artist":"Run-D.M.C.","spotify_id":"2oSPru8bef0EMhF9tvMSLn","lyrics":"[Intro]\nReporters cry, producers die\nThey wanna be down with the King!\nProducers die, they wanna be down\nWanna be down with the King!\n\n[Verse 1: Run]\nDown with the king for years, about ten of 'em\nRecruiting suckers, Mac and Mike, and makin' men of 'em\nTears and fears for my peers, they rippin'\nYou think that it is, it is, if not it isn't\nRace for the border my daughter, cause beats you're bangin' out\nJeeps rockin' beats in the streets when there's time for hangin' out\nGather, or rather form a circle around a loud\nCause brothers or others could never ever rock a crowd\nIs it because he's runnin' off with the mouth\nOr was he really clearly tryin' to play a nigga out\nNope, shut him down, the king with a crown\nCause all you wanna be is Diggy Down\n\n[Hook]\nDown with the king\nThe king down with the king [x7]\nThe king\n\n[Verse 2: CL Smooth]\nTwo years ago, a friend of mine\nAsked me to say some MC rhymes\nSo I said this rhyme I'm about to say\nThe rhyme was meeca, and it went this way\nRecollect a mecca mic check on the windmill skills\nMac distracts, wearing Godfather hats\nIt's okay to parlay to forte better\nTell 'em my nigga made a sweater tougher than leather\nSwing another Rodney King thing and i'll wreck\nBut just like the white one I get no respect\nMoney stay awake, cause them other niggas are fake\nFrom Hollis to the Beacon, now your dumb ass is leakin'\nC.L. and Run DMC so rush it\nBig time way before Hammer got to touch it\nRemember the faces in all types of places\nLook Ma, no shoelaces\nAnd I'm\n\n[Hook]\nDown with the king, the king down with the king\nThe King down with the king, the king down with the king\nThe King down with the king, the king down with the king\nThe King down with the king, the king down with the king\nThe King\n\n[Verse 3: DMC]\nI'm takin' the tours, I'm wreckin' the land\nI keep it hardcore because it's dope man\nThese are the roughest toughest words I ever wrote down\nNot mean for a ho like a slow jam, check it\nSucka emcees could never swing with D\nBecause of all the things that I bring with me\nOnly G-O-D could be a king to me\nAnd if the G-O-D be in me, then the king I be\nThe microphone is granted when it's handed to me\nI was planted on this planet and I plan to emcee\nThe emcee fiends only seem to agree\nThat I rock all the world and the society\nI rages on the stages with a tune of verse\nI get praises from these pages to the universe\nMy voice is raw, my lyrics is law\nI keep it hardcore like you never saw\n\n[Hook]\nDown with the king, the king down with the king\nThe King down with the king, the king down with the king\nThe King down with the king, the king down with the king\nThe King down with the king, the king down with the king\nThe King\n\nVerse 4: [Pete Rock]\nI'm the man you see, in the place to be\nI went to John Jay University\nAnd since kindergarten I acquired the knowledge\nAnd after twelve grade I went straight to college\nDown with the kings on the mic, a full swinger\nThe P to the R, not an R&B singer\nThe R to the U-N-D-MC'n\nThe fly human beings, tonight I hold the key and\nFlowin' with the funk track, here to soul brother black\nPick up the bass, better yet leave a space\nSo let me put my big black twinkie on in to the early mornin'\nHad skins yawning'\nMecca? (yo) you want the mecca? (yo)\nI'll make a funky beat so we can blow, check it out\nPete Rock's the beat knock, put you in a headlock\nAnd now all the outty out flock is down with the king\n\n[Hook]\nDown with the king, the king down with the king\nThe King down with the king, the king down with the king\nThe King down with the king, the king down with the king\nThe King down with the king, the king down with the king\nThe King\n\n[Outro]\nDown with the king, the king down with the king\nThe King down with the king, the king down with the king\nThe King down with the king, the king down with the king\nThe King down with the king, the king down with the king\nThe King Down with the\nThe King Down with the\nThe King Down with the\nThe King Down with the\nThe King Down with the king"}