{"rank":"86","song_id":"18508","song_name":"Roll Wit Tha Flava","artist_id":"407303","display_artist":"The Flavor Unit MC s","spotify_id":null,"lyrics":"Once again, it's on\nWhere I'm from there ain't no picket fences pick it\nStraight and ruff so you pick it my sticky finger was a Glock\nMany dash for the fast cash, but I like the cash to last\nSo I rap till my ass collapse\nI'm never trouble but if troops will come and jam me\nYou Remind Me like Mary then I'm scaring your little projects\nOn the prarie I'm hairy and hot like Dougie with a smokie\nSo I boo-boo, just like Fu-Schnicks I'll say F-U-2\nA-bibbedy-bibbedy-bibbedy-bibbedy-bong-gang ultra-king\nBut BBD boxing up yang, giddy-up\nDidduh-duh, didduh-duh, didduh-dum dum dum\nI'm coming again and again a Ku-Fu vomit\nGosh, darn it! Like we're lyin' to bits\nThe John-John Jacob lyrical shaker\nYes and Jengle-ma-heimershmitz\nI sings my lyrical style from Flatbush\nQuick to Greenwich Village\nI'm strong to the finish\nWhen I eats, me spinach\nI'm one of the lyrical flava\nMy nigga Foxx is stompin faggots\nCheck my dum-dum-dum-dum-dum and step\nNow I been breakin rappers down for a while now\nNow it's time to break, child\nRappers get chopped like the head on a fat cow\nI'm mister micraphone, rappers can't f*ck around\nI'm Freddie the Foxx I'll brake it back and buck em buck em down\nYou know my rep I got a record like the turnpikes\nWhen I was young they use to call me Freddie-burn-mics\nBut now they call me big Foxx, daddy boot-knocks\nWith burn marks on my hips from my twin Glocks\n(Queen Latifah) I got flava for days\n(KRS-One) Flava unit has a title\nRoll With the Flava\n\nVerse Four: Queen Latifah\nNow it's about the time to put you out of sight and out of mind\nI got the skills to blast you off the mic and out of rhymes\nNow who the hell-am-I-a?\nThe L-A-T-I-F-A-H the motherf*ckin sire\nI come in on time\nYou wear a silly grin we like we do when niggas in\nWe gotta practice so scalp the hairs off your chinny-chin-chin\nThe Flava Unit's got my back, so I'm quick to start shit\nGet the short end of a bat, cause we beat him broken sticks\nI-guy-guy-guy-guy-guy bet you never knew\nThat I could flow I flew I grow I grew\nI blew up the spot, I'm sippin my props\nAnd now I am just passin through\nRuff rugged rigid nigga, the one who's quick to figure\nSome think they're big, but the heavster is bigger\nThe funky flip-flop flava unit, my hip-hop neigbor doin it\nCame to the studio, check my flow, and ran right through it\nI bet you thought I wouldn't come, I came\nI'm never done till I'm done rippin drums like a shotgun, ohh!\nNow ladies, what's my name? (aaah)\nThat means it's time to go\nI'm the same muuuhf*cker from it's time to flow, so\nSome might have dissed the way I flow it out\nNiggas need to throw it out\nSimply cause it's somethin you don't know about\nSo watch the Nice man shake the ground\nAnd now I'm Rollin with the Flava cause\nThe Flava's what I'm rollin in my sound\nTo make you get down, rippin the sound from J.C. to Uptown\nNow\nNow if you got a nine, and you got a nine\nAnd you got a nine, and you got a nine\nAnd he got a nine, and she got a nine\nWell it's a motherflockin party yo cause I got mine\nSo bust it the Black Sheep are (where?) here (where)\nHere (where) there, everywhere there's a Jeep\nThere's a Sheep beat beatin up the air\nGraphic as illustratin frustratin like waitin\nThe Sheep are a joke? Nigga you playin\nYo I drink twenty forties, smoke forty blunts\nSay a hundred rhymes and not sound like you once\nTwice, three times, nigga never figured\nYou'd be triggered by Dres, that R and B smokin nigga\nDoin it, screwin it, chewin it, well\nDone on the weak bun hon can't you tell\nUnification cells on the flava flingin\nIf a Queen has the balls my lady is a King\nSo long live the King, and love to my Unit\nSpoon it and you'll croon it, diss it, and yo balloon it"}