{"rank":"87","song_id":"18501","song_name":"Funky Child","artist_id":"307872","display_artist":"Lords Of The Underground","spotify_id":"3UhwS81S9L7i2byZCrhSAv","lyrics":"Born with the funk from the womb of Brenda \nSee I likes the Lords but you used to dig The Spinners\n\nFirst with the style from the birth canal \nAnd now I got the flav to make the crowd go wild \nDo dig it (screams) Ooh watch me kick it \nI'm taking no shorts unless this ?girl from my midget?\n\nI packs the piece more than chicken packed grease \nI'm nearly knocking boots, but if not I'll knock teeth\n\nWahh! Gaga, ooh cries the baby \nSmacked on the ass now the Doitall's crazy \nNo rattles or playpens, the crowds what I'm rapping \nAnd yes I do Reruns, as if this boy was happening \nNow January 14th has birthed the funk one \nThe D-Day for Dupree and yes I'm funk-ay \nI got you bobbing to the funky style \nK-Def let 'em know here comes the funky child \n\n[K-Def] \nYeah, born in the underground of Newark, now witness\nthe birth of Mr. Funkee \n\n[Mr. Funkee] \nThe fifth of the terror, it's the return of Funky\nKreuger \nA.K. Anger, but yo that's Mr. Funkee Wallbanger \nConcieved in the fire by you warned through disaters \nThe funky child was taught to the ways of the masters \nMr. Funkee, yes girl the black mack is back \nHere to kick my funky style, funky this and funky that\n\nYou can work kid you know, you could practice all your\nlife \nBut I still take the show and then I go home with the\nwife \nOh my God, funky with the style, Lord have mercy \nI hurdle over rappers just like Jackie Joyner-Kersee \nWatch me flip the script, let me show you what the\nfunk do \nMake you call me uncle (What?) Uncle (What?) Uncle\n(Who?) \nWhen I was younger I used to sing with my sister \nNow I kick the ill styles you have to call me mister \nCooling in the House of Hits, time to buckwild \nRaised in the ways of the funky child \n\n(Funky child) (Funky funky style) (Scratched by Lord\nJazz 6x) \n\n[Doitall] \nWell um, back up baby, here come the schooler \nWe're hit when we dry crawl and hit rock 'n' roller \nI'm caught in the swinging, hear no ties by the\nPendulum \nJust ???, so this is how I'm killing them \nK is on the M.P., Jazz is on the Technique \nMarley's on the mix and now the Lords have a hit like\nPOW! \nNow it's time to get buckwild \nAnd watch my funky brothers freak the underground \nIn a second, or minute, in no times flat \n(Flatline noise) Bring it back \nAnd go grab the album to give the Lords money \nTake it home to mom to say \"Ain't they funky?\" \n\n[Mr. Funkee] \nWe gone psycho and everbody thought they did was\nstyles \nThey didn't affect me, I said \"So what?\" I kept on\nwriting rhymes \nI keep my funky style perfected so no one can stop my\nflow \nI fear no man, cause if it's on fool, then it's on\n(And it's on) \nDon't worry not for other crews selling out \nAs long as Lords of the Underground stay underground \nThe brothers of LOTUG will keep the lyrical fitness \nDon't worry about me selling out, mind your business \nYou might say \"Damn, Mr. Funkee's throwing out\" \nBut if you listen to the words then you'll know what\nI'm about \nAny props you receive are the props that you earn \nI'm off till the funky child returns"}