{"rank":"81","song_id":"18507","song_name":"Throw Ya Gunz","artist_id":"315093","display_artist":"Onyx","spotify_id":"2nCVH8UkoII2jWwx6SYVso","lyrics":"Intro:\r\n\r\nTake em out, take em out, bring em out dead\r\nShine em up, shine em up, shine the bald head\r\nOne gun, two gun, three gun, four\r\nYou're, mine, it's all about crime\r\nOnyx! (echoes)\r\n\r\nVerse One: Suave\r\n\r\nIt's time to get live, live, live like a wire\r\nI set a whole choir on fire (UHH!)\r\nWell done, on the grill, shot skills kills\r\nand no frills - they try to diss me? They gettin crispy\r\nHa, ha hah hah, AND WE DO IT LIKE THIS\r\nIn fact, ?? ?? and jack Jack's\r\nCause they can burn in hell shit for all that I care\r\nBeware the bald head the dread said is they fear\r\nStick-up's assassin, traction new reaction\r\nThese fuckin niggaz shoulda made the All Madden\r\nOnyx is wreckin shit, slip slide step quick\r\n?? ?? Infinite that gets crashed like a rented\r\nThe shit they write is black and white; well mines got mad color\r\nAin't that right, my blood brother?\r\nWord up, raise it up!\r\nWe do it with the crew that don't give a fuck\r\n\r\nSo throw ya gunz in the air, throw ya gunz in the air\r\nBuck buck like you don't care\r\n\r\nVerse Two: Fredro Starr\r\n\r\nUh-oh!! Heads up, cause we're droppin some shit\r\nOn your now shot-skills, Onyx tec-9 for a while\r\nKeep your eyes open in the fight, I'ma swell em\r\nThe hardcore style, rowdy n wild, hits I'ma sell em (sell em)\r\nTo all competition slide back then listen\r\nI'm kickin all that, shit to the doormat\r\nClaimin this domain, cause mad pains\r\nBlood stains, long range - got gats!\r\nCrazy clips, I sink ships, cuttin faces like a pirate\r\nI've never caught a flood, for the mad shit that I did\r\nHeard, you got the word so observe\r\nI shatter and splatter bodies that blows and bust nerds, OPEN!\r\nI always leave my barrel smokin\r\n\r\nThrow ya gunz in the air\r\nAnd buck buck like you just don't care\r\nJust throw ya gunz in the air\r\nAnd buck buck like you just don't care\r\nJust throw ya gunz in the air\r\nAnd buck buck like you just don't care\r\nJust throw ya gunz in the air\r\nAnd buck buck like you just don't care\r\n\r\nVerse Three: Sticky Fingaz\r\n\r\nAhhh, I hate your fuckin guts, and I hope that you die\r\nSticky Fingaz, the name, and my life is a lie\r\nCause I'm havin a bad day, so stay out of my way\r\nAnd what the pistol packin people say you better obey\r\nJust in the nick of time, I commit the perfect crime\r\nRip my heart, from my chest, put it right into a rhyme 9YEAH!)\r\nI don't feel pain cause it's all in the mind\r\nAnd what's - mines is mines and, yours is mine\r\nDon't fuckin blink or I'ma rob yo' ass blind\r\nOnyx, is rippin shit, I got the tech nine\r\nSo what the plumber got boy buck buck buck buck\r\nIt's like a catastrophe, fuckin with me G\r\nI'm a bald head with a kinfe\r\nI want your money or your life\r\nSo, so, so, so?\r\n\r\nSo throw ya gunz in the air\r\nAnd buck buck like ya just don't care\r\nJust throw ya gunz in the air\r\nAnd buck buck like you just don't care\r\nJust throw ya gunz in the air\r\nAnd buck buck like you just don't care\r\nJust throw ya gunz in the air\r\nAnd buck buck like you just don't care\r\n\r\nOutro:\r\n\r\nWe the motherfuckin Onyx!\r\nAnd we don't give a flying motherfuckin fuck\r\nAy yo DS man we gonna come get you out of jail man\r\nFuck that, yo DS we comin man, we got the bail\r\nWe got the bail, we gonna break you out man\r\nFuck that, yeah!\r\nWe the fuck up out of this piec"}