{"rank":"61","song_id":"18517","song_name":"Knockin  Da Boots","artist_id":"276320","display_artist":"H-Town","spotify_id":"2LP2NrdZlsabtHT0GUCwUa","lyrics":"Yeah, we doin this one for all da ladies. Ha...H-town boys.\nKickin it with my boy luc.\nFo da '93 you know what im sayin?\n‘cause we will be knockin da boots\nG.I. Shazzam and dino\nThey gon' do something a lil sexy like you know what im sayin?\nYo, check da verse...\n\nA late night I thought to back to when we made good love\nListening to some Marvin Gaye all night long\nBut I want that whole thing back\nMake these moments once again go right\nSo wontcha, so wontcha, do it for us babe\n\nGood loving body rockin' knockin boots all night long, yeah\nMaking love until we're tired, till the break of dawn.oh come on\nOh come on and turn the lights down and let me get on it yeah\nCause when I do just me and you, it'll be so right\n\nGive me some good love (some body rockin, knockin da boots)\nGive me some good love (some body rockin, knockin da boots)\nSome body rockin baby, Give me some good love (some body rockin, knockin da boots)\nThat's all I need, I need, Give me some good love (some body rockin, knockin da boots)\n\nI feel so good when I'm near you\nThat's why I always wanna be close to you\nIm so addicted, im so addicted to making love to you baby\nAll night long baby, all night long long long \n\nGood loving body rockin' knockin boots all night long, oh oh\nMaking love until we're tired, till the break of dawn.ohh come on\nOh come on and turn the lights down and let me get on it,oh\nCause when I do just me and you, it'll be so right so right so right\n\nGive me some good love (some body rockin, knockin da boots)\nGive me some good love (some body rockin, knockin da boots)\nThat's all I want baby yeah, Give me some good love (some body rockin, knockin da boots)\nGive me some good love (some body rockin, knockin da boots)\nSome sweet rocking, some sweet love (some body rockin, knockin da boots)\nGiving you mounts of pleasure cause im ready (some body rockin, knockin da boots)\nIm so ready, im so ready baby (some body rockin, knockin da boots)\nTo give you every thing that we've been waiting on so come on and give it to me babe (some body rockin, knockin da boots)\n\nAww yea..right about now were in the intermission tip\nSo all you ladies go get your towels you know what im saying..\nHah..cause its laid out like that you know?\nBut wait a minute we aint through. kick the amp.\n\nWoaahh oh ooohh\nOoooohh aww babe\nI want your good touch lady\nYou hearin me my baby?\nIts driving me crazy (some body rockin, knockin da boots)\nSo wontcha come on\nCome and rock my body, rock my body baby\nGo on and rock my body\nYeah, I wanna lay you down ( some body rockin knockin da boots)\nSo let me make some sweet love\n(until fade)"}