{"song_name":"Typical Reasons (Swing My Way)","artist_id":351251,"display_artist":"Prince Markie Dee","spotify_id":"null","lyrics":"[Verse One: Markie Dee]\nOne minute you're so fly and now you're busted\nSweetheart, we got a lot to discus kid\nYour relationship is wavering\nDon't walk away, come here and listen\nCause I speak straight up so they attract\nI'm sorry baby but your man ain't all that\nBefore you verbally stomp me, just wait a sec\nAnd explain why you're always looking wrecked\nBy now any other lady would have just had it\nLooking depressed at battered, shattered\nDreams of you two being the perfect item\nThe feelings you had try to fight them\nCause your man's a conniver so stay alert\nMark my words you're gonna get hurt\nDoes your man abuse you physically or mentally?\nChange what I put, slavery you need to be free\n\n[Chorus:]\nSo maybe you need to swing my way\nMarkie Dee can do you right in a fly way\nI'm the one you should chose\nGirl you won't be abused\nSo maybe you need to swing my way\nMaybe you need to swing my way\nMarkie Dee can do you right in a fly way\nNot like the man you're with now, I keep my hands to myself\nSo maybe you need to swing my way\n\n[Verse Two:]\nMistreated you like a towel\nAnd when he gets busted he thinks that he's an owl\nYour eye is puffy, your jaw is swollen\nYou shouldn't be smacked, you're made to cuddle and hold an\nCores and snuggle like a Teddy Bear\nHis attitude's changed, begins to put fear\nIn your heart, but you depart from being afraid\nMany thoughts of leaving were crushed so you stayed\nSaying what he did before he won't do again\nHe wants more of a lover and less of a friend\nCatch my drift? You're put to the test so\nYou refuse and get struck with a left blow\nHe tells you in a flame way\n\"That's what you get for rejecting your man\" Hey\nNow you're crying on the floor\nYour man's no damn good, need I say more?\n\n[Chorus]\n\n[Verse Three:]\nNow I'm not saying I'm an angel, I got many associates\nI treat them all right and appropriate\nI'm not talking marriage and settling down\nBut I can treat you much better than that clown\nNo matter what I say you still seem to protect him\nNo matter the amount of times you're hit you respect him\nDamn, if you only knew\nHow much affection could be given to you\nIf you move the right way which is my way\nForget what your so-called-boyfriend might say\nYou're too good for his kind\nWiden your horizons and focus your mind\nOn a real man. I won't stress you or keep sweating it\nI'll buy your clothes but pay your rent it's kind of pressin it\nSo tell me, who do you chose?\nHere's an alter way then either win or can lose\n\n[Chorus x4]\nMaybe you need to swing my way"}