{"rank":"92","song_id":"18510","song_name":"Love Me Or Leave Me Alone","artist_id":"297065","display_artist":"Brand Nubian","spotify_id":"6mgN9sBgmWDemT36Tm3ZFX","lyrics":"[Sadat X]\nAiyyo Jamar I got a girl that's bad! (uh-huh)\nBut she don't understand my ways.. (why's that?)\nArguin days after days after days..\n\n[Lord Jamar]\nWell I can dig it\nSee I done had some fly ones\nBut they try to get just that, thought I'd like to chase the cat\nBut I'm not a Dog, God is who you're lookin at\nCouldn'ta tooken that, bullcrap, you woulda caught a jack\n\n[Sadat X]\nI told her, \"Yo the first thing is when the telephone rings\nIt ain't really nuthin but noise\"\nYou wanna flip and lose your poise?\n\n[Lord Jamar]\nNow they quick to flip, but yo honey get a grip\nYou gotta understand I'm a man with needs that needs fulfilling\nAnd if you ain't with it somebody else is willing\nYou gotta love me, or leave me alone\n\nYou gotta love me, or leave me alone\nYou gotta love me or leave me alone *4X*\n\n[Sadat X]\nI got this good thing girl, it's the righteous love\nNot that quick on the top, one shop hop\nI'll make your knees get wet in the places I'll pet\nI'll make you breathe, faster than you can believe\nWithin your hole I'll use my control\nAnd the final burst, I'll hold\n*reggae chat* until it comes\nBackscratches added up in sums\nDidn't your momma teach you bout b**** a man?\nBent my d*** so bad that I ran\nNow I'll, freak of the week, or ride the quest of a yardgirl's hips\nYour p**** can't see these lips\nI keep my tongue in my mouth.. cause I can't see down South\nVulgar? Maybe, obscene with the purpose\nSayin, \"I'ma do my own thing, bein I'm my own King..\nAnd it's up to you to follow\"\nSo on your Wisdom I'll shine my light\nBring forth the seed, created in the night\n\nYou gotta love me, or leave me alone\nYou gotta love me or leave me alone *4X*\n\n[Lord Jamar]\nThe degree, love h**** right, get it right\nEither all the above, or it ain't true love\nI ain't down for a honey who don't wanna submit\nAlways throwin a fit, wanna talk a lot of s***\nBut love to get hit from behind\nGettin crazy joy from my Lazy-Boy that reclines\nSeems the only time we're not in a fight..\nIs when I'm layin the pipe..\nYou don't want me to bone another chick\nQuick to claim my name and my d***\nBut when I tell you get off the swine and get refined\nYou act like you're blind and you lost your d*** mind\nSee I'm not the kind to let a woman run it\nHow my man Rick say it? _I Shouldn't Have Done It_\nIs what I'd be saying if you was runnin the show\nNo h*, there's no gold, the G-O-D know\nThe time on the Sun and the Moon and the Stars\nDance to the tune of Lord Jamar\nAnd if you're actin tone def it's your own mental death\nHuh, you gotta love me, or leave me alone\n\nYou gotta love me, or leave me alone\nYou gotta love me or leave me alone *4X*"}