{"rank":"97","song_id":"18552","song_name":"Dre Day","artist_id":"301270","display_artist":"Dr. Dre","spotify_id":"3xKQle9YQLHz2nE5ifKBeY","lyrics":"[Intro: Dr Dre]\nHah, yeah\nHell yeah\nHah, know what I'm saying?\nYeah\n\n[Verse 1: Dr Dre]\nMista Busta, where the fuck you at?\nCan't scrap a lick, so I know you got your gat\nYour dick on hard, from fuckin' your road dogs\nThe hoods you threw up with, niggas you grew up with\nDon't even respect your ass\nThat's why it's time for the doctor to check your ass, nigga\nUsed to be my homie, used to be my ace\nNow I wanna slap the taste out ya mouth\nMake ya bow down to the Row\nFuckin' me, now I'm fuckin' you, little ho\nOh, don't think I forgot, let you slide\nLet me ride, just another homicide\nYeah, it's me so I'mma talk on\nStomping on the Eazy-est streets that you can't walk on\nSo strap on your Compton hat, your locs\nAnd watch your back cause you might get smoked, loc\nAnd pass the bud and stay low-key\nB.G. cause you lost all your homie's love\nNow call it what you want to\nYou fucked with me, now it's a must that I fuck with you\n\n[Interlude]\nYeah, that's what the fuck I'm talkin' about\nWe have your mothafuckin' record company surrounded\nPut down the candy and let the little boy go\nYou know what I'm sayin? Punk motherfucker\n(We want Eazy! We want Eazy!)\n\n[Verse 2: Snoop Dogg]\nBow wow wow yippy yo yippy yay\nDoggy Dogg's in the motherfuckin' house\nBow wow wow yippy yo yippy yay\nDeath Row's in the motherfuckin house\nBow wow wow yippy yo yippy yay\nThe sounds of a dog brings me to another day\nPlay with my bone, would ya Timmy?\nIt seems like you're good for making jokes about your jimmy\nBut here's a jimmy joke about your momma that you might not like\nI heard she was the 'Frisco dyke\nBut fuck your mama, I'm talking about you and me\nToe to toe, Tim M-U-T\nYour bark was loud but your bite wasn't vicious\nAnd them rhymes you were kicking were quite bootylicious\nYou get with Doggy Dogg \"oh is he crazy?\"\nWith your mama and your daddy hollering \"Baby!\"\nSo won't they let you know\nThat if you fuck with Dre, nigga you're fuckin' wit Death Row\nAnd I ain't even slanging them thangs\nI'm hollering 187 with my dick in your mouth, beyotch\n\n[Interlude: RBX]\nYeah nigga, Compton and Long Beach together on this motherfucker\nSo you wanna pop that shit, get your motherfuckin cranium cracked nigga\nStep on up\nNow, we ain't no motherfuckin joke so remember the name\nMighty, mighty D-R\nYeah, motherfucker\n\n[Verse 3: Dr. Dre + Snoop Dogg]\nNow understand this: my nigga Dre can't be touched\nLuke's bending over so Luke's getting fucked, buster\nMust've thought I was sleazy\nOr thought I was a mark cause I used to hang with Eazy\nAnimosity made you speak what you spoke\nAyo Dre\nWhattup?\nCheck this nigga off, loc\nIf it ain't another ho that I gots to fuck with\nGap teeth in your mouth so my dick's gots to fit\nWith my nuts on your tonsils\nWhile you're onstage rapping at your wack-ass concert\nAnd I'mma snatch your ass from the backside\nTo show you how Death Row pull off that hoo-ride\nNow you might not understand me\nCause I'mma rob you in Compton and blast you in Miami\nThen we gonna creep to South Central\nOn a street knowledge mission as I steps in the temple\nSpot him, got him, as I pulls out my strap\nGot my chrome to the side of his White Sox hat\nYou trying to check my homie, you better check yourself\nCause when you diss Dre you diss yourself, motherfucker\nYeah, nigga\n\n[Outro: Snoop Dogg]\nYeah, nine-deuce\nDr. Dre, dropping chronic once again\nIt don't stop: punishing punk motherfuckers real quick like\nDoggy Dogg in the motherfuckin house\nLong Beach in the motherfuckin house\nCompton style nigga, straight up, really tho\nBreaking all you suckas off something real proper like\nYou know what I'm sayin?\nAll these sucka ass niggas can eat a fat dick\nYeah, Eazy-E can eat a big fat dick\nTim Dog can eat a big fat dick\nLuke can eat a fat dick"}