{"rank":"78","song_id":"18593","song_name":"I Get Around","artist_id":"431886","display_artist":"2Pac","spotify_id":"74kHlIr01X459gqsSdNilW","lyrics":"[Intro: Shock G & 2Pac]\nRound and round (aw yeah)\nRound and round, round we go (I get around)\nRound and round\nStill clown with the Underground, when we come around\nRound and round, round we go (stronger than ever)\nRound and round\n\n[Verse 1: 2Pac]\nBack to get wrecked, all respect\nTo those who break their neck to keep their hoes in check\n‘Cause, oh, they sweat a brother majorly\nAnd I don't know why your girl keeps pagin' me\nShe tell me that she needs me, cries when she leaves me\nAnd every time she sees me, she squeeze me—lady, take it easy!\nHate to sound sleazy, but tease me\nI don't want it if it's that easy\nAyo, bust it, baby got a problem saying \"bye-bye\"\nJust another hazard of a fly guy\nYou ask \"Why?\", don't matter, my pockets got fatter\nNow everybody's lookin' for the latter\nAnd ain't no need in being greedy, if you wanna see me\nDial the beeper number, baby, when you need me\nAnd I'll be there in a, jiffy\nDon't be picky, just be happy with this, quickie\nBut when you learn you can't tie me down\nBaby doll, check it out: I get around\n\n[Hook: Shock G & 2Pac]\nWhat you mean you don't know?\nRound and round, around we go\nI get around, the Underground just don't stop for hoes\nRound and round\nI get around, still down with the Underground\nRound and round, around we go\nI get around, yeah, ayo Shock, let them hoes know\nRound and round\n\n[Verse 2: Shock G & Money B]\nNow you can tell from my everday fits I ain't rich\nSo cease and desist with them tricks (tricks)\nI'm just another black man caught up in the mix (mix)\nTryin' to make a dollar out of 15 cents (a dime and a nickel)\nJust cause I'm a freak don't mean that we could hit the sheets\nBaby, I can see, that you don't recognize me\nI'm Shock G: the one who put the satin on your panties\nNever knew a hooker that could share me; I get around\n\n[Verse 3: Money B & Shock G]\nWhat's up, love? How you doin'? (alright)\nWell, I've been hangin', sangin'\nTryin' to do my thang, oh, you heard that I was bangin'\nYour homegirl you went to school with? That's cool\nBut did she tell you about her sister and your cousin?\nThought I wasn't (uhh)\nSee, weekends were made for Michelob\nBut it's a Monday, my day, so just let me hit it, yo\nAnd don't mistake my statement for a clown\nWe can keep in the down low long as you know that I get around\n\n[Hook: Shock G & 2Pac]\nRound and round, around we go\n2Pacalypse Now don't stop for hoes, I get around\nRound and round\nRound and round, around we go\nWhy I ain't call you? Hahahah, please!\nRound and round\n\n[Verse 4: 2Pac]\nFinger tips on the hips as I dip\nGotta get a tight grip, don't slip; loose lips sink ships\nIt's a trip, I love the way she licks her lips, see me jockin'\nPut a little twist in her hips ‘cause I'm watchin'\nConversations on the phone 'til the break of dawn\nNow we're all alone: why the lights on?\nTurn them off! Time to set it off, get you wet and soft\nSomethin' is on your mind, let it off\nYou don't know me, you just met me, you won't let me\nWell, if I couldn't have it (silly rabbit) why you sweatin' me?\nIt's a lot of real G's doin' time\nCause a groupie bent the truth and told a lie\nYou picked the wrong guy, baby, if you're too fly\nYou need to hit the door, search for a new guy\nCause I only got one night in town\nBreak out or be clowned, baby doll, are you down?\nI get around\n\n[Outro: Shock G]\nRound and round, around we go\nRound and round, around we go, uhh\nRound and round, around we go\nRound and round, around we go\nRound and round, round we go\nRound and round, round we go\nRound and round, round we go, whoa\nRound and round we go\nRound and round\nRound and round\nRound and round\nRound and round"}