{"rank":"95","song_id":"18610","song_name":"Chief Rocka","artist_id":"307872","display_artist":"Lords Of The Underground","spotify_id":"34MRi5GRWHFUa731JBxFEl","lyrics":"Verse One: Mr. Funke\n\nBoom shaka laka yo here comes the Chief Rocka\nRock it down so jump up off the tip you're not my nucca\nFor sharper type to battle make the people say ooh ahh\nThink I won't curse I'll break down and say puta\n?Hey madrigon sesa me bichafi mi chocha?\nSay what I want because I'm that type of guy\nNow fam a lam I'll be damned, slam jams the weak\nCould it be the skunk weed that makes us oh so funky?\nNow hold it let me choose, couldn't be the booze\nNo it's the shoes (the shoes?) It's gotta be the shoes!\nCause girlies, they clock, they stand around and jock\nso I say boom shaka lak, grab the microphone then rock\n?To think I'm the troop, when on the mic?\n?I'll say it, it ain't the shows kid?\n?Like drunk and a grump and sound over some uhhhh!?\nThe Cat in the Hat and the mouse ran up the stairs\n\"That doesn't make no sense!\" C'mon who cares?\nSee even without the gift there's yours so don't be tryin to knock me\nI say what I want to say, as long it sounds funk\nSome MC's wanted to buy me, so they try to take stands\nBut they don't understand, I'm the motherfuckin man\nI amaze and astound, rhythm up and down\nSmack a group of them around, let them know who wears the crown\nWho's-the-tip-of-the-top, the-cream-of-the-crop, the-best-under-the-sun?\nI'm the Lord Chief Rocka, number one, Mr. Funke, uhh\n\nVerse Two: DoItAll\n\nWell umm, boom, shak-a-lak, I got the flavors, the funk\nWhew! And it's smellin up the hip-hop\nA little bit of this, a little bit of that\nMixed a, little of this, and now I gotta rap\nI'm the, Chief Rocka, so I guess I am in charge\nI freak it with a twist so you'll boom it in your cars\nI'm the, one with the flow and the grip like G.I. Joe\nI snatch, I grab, and then I grab the dough, see if\nI was an Indian I'd still be the Chief\nThe only other difference I'd smoke weed in a leaf\nTo the hip, the hop, to the hibby to the hibbidy\nhip-hop, oh no, I don't wanna go pop!\nI got, too much soul, rhythm and blues\nR&B ya see, all that's cool, but\nhip-hop and rap yeah that's where my heart's at\nEven back when I used to break on a box\nBackspins for backspin, even while I'm rappin\nBefore I had a record, I always kept em clappin\nFreestylin on the block, now I Chief Rock\nI always entertain, by diggin in my crux\nMy brain, so if it's gonna rain let it rain\nI spook you with the hit, make you jump like House of Pain\nBoogaloo boogaloo, shake and jump\nAnd remember, remember, Chief Rocka won't front\n\nVerse Three: DoItAll, Mr. Funke\n\n[DIA] Ay Mr. Funke\n[MrF] Whassup?\n[DIA] Can I get assistance?\n[MrF] For what?\n[DIA] For what? Yo Jazz, flex a cut\nWell back is the backer, I'm chillin with my knocker\nAnd if ya got beef, then you can live with Jimmy Hoffa like\n[duo] what goes up, must come down\n[DIA] But not me clown\nI cut em, crack a speaker when I'm pumpin\nSo jump in, and watch your earrrs start hummin\nthrough the block, and don't forget to boom shak shak-a-lak\n[MrF] Well damn DoItAll can I rock?\nI hear a beat I grab the mic, and then I start this workin\nThe kids around the way used to think that I was buggin\nBut they don't understand how I feel about the funk\nI walk with the funk, I talk with the funk\nI eat with the funk, I sleep with the funk\nI live for the funk, I'll die for the funk\nSo now what do they say, when I'm walkin up the block?\nBoom shaka laka there goes the Chief Rocka"}