{"rank":"33","song_id":"18625","song_name":"Alright","artist_id":"306091","display_artist":"Kris Kross Featuring Supercat","spotify_id":"3uGjLZ5abCyCfYXBVfpf8X","lyrics":"just kick a little somethin' for them cars that be bumpin' \nsomethin' real smooth \nyou can just ride to \ntell me how you feel \nhere we go... \nThe day seems nice and bright and everything feels alright \nWent to school without a fool tryin' to pick a fight \nI was loced out Kris Kross shirts and khakis \nLookin' and feelin' like nothin' but a Mac \nSee the bell rang and I got my dash \nFellin' good cause it was the last day of school and I passed \nNo moms trippin' so me and my mom went dippin' \nTo celebrate the fact that I wasn't slippin' \nThe downtown scene was packed \nPeople screamin' from they ride to my ride and to the Mac \nI says \"What I am is what I am is who I be\" \nAnd yall should have seen how they was tryin' to get to me \nCool, cause dissin' and no pay \nThey're the reason why we are who we are to this very day \nAnd all that love keeps me and Chris tight \nLong as we give some love back everything's alright. \n\nNow everything feels alright when I'm rollin' through my hood \nAnd I see the one that used to do the dirt then turned good \nLittle kids try to be like me with the braids, the shades, some pants, \nand some Nikes, G \nAnd yet more letters, and the letters sayin' \n\"I'm your number one fan could you write me back man?\" \nYesssss..... \nI try to pass 'em my autograph \nI try to do as many as I can \nNow it feels good when I'm rollin' through my hood \nAin't nobody dissin' and a nigga thinks he's too good \nCause I'm down like four flat tires \nJust a little nappy headed kid from the proj. \nShowin' I can do right and not do wrong \nRappers and the Beejees comin' up strong \nAnd we ain't got no love for the side \nWe only love those who love us back \nRight? \n\nNow people seem to think what I do is a blast \nCause I'm always on the road and I'm makin' some cash \nBut they don't know \nReally know \nThe pressure it is for some kids tryin to make it in this here biz \nEarly mornin' interviews then we step to school \nStep from school \nBack to interviews then it's on to other dues \nSo, warm it up Chris \nI said \"Ya warm it up Chris\" \nThat's what I was born to do \nNow throw your hands in the air and wave from side-to-side \nIf the feelin' thatcha feelin' is the feelin' of pride \nSee, I ain't come out wack I come out right \nUnlike those 'mose who tried to pass the mike \nIt's the Daddy Mac \nBig thing \nEverything is real but you wanna dis cause a nigga sold a couple mill. \nLook here, ya can't say nothin' if ya last in a line \nSo when you dis it just lets me know I'm on your mind \nAnd it's alright"}