{"rank":"76","song_id":"18639","song_name":"Streiht Up Menace (From \"Menace II Society\")","artist_id":"276851","display_artist":"MC Eiht","spotify_id":null,"lyrics":"Wake your punk ass up for the 93 shot\nMC Eiht's in the motherfuckin house.. gyeah\nAnd it ain't nothin but a compton thang y'all\nAnd we ain't nuttin but niggaz on the run\nAnd this goes out to my niggaz.. gyeah\n\nA fucked up childhood, is why the way I am\nIt's got me in the state where I don't give a damn, hmm\nSomebody help me, but nah they don't hear me though\nI guess I'll be another victim of the ghetto\n\nAin't no escapin, cause I'm way too young\nPops is dealin, and on top of that got moms sprung\nScheamin off the top, pops never figured\nThat he'd go down by the hands of another nigga\n\nNow my pops is gone and that ain't no good\nGot to follow in the foot steps of the homies from the hood\nAnd where's the role model?\nNiggaz putting brew in my fuckin baby bottle!\n\nDamn, and through all the motherfuckin pain\nThey done drove my moms in-sane\nSo I guess I gotta do work so I ain't finished\nI grow up to be a streiht up menace, gyeah\n\nUhh, come on y'all\nStreiht up menace\n\nNow I'm of age, and livin in the projects\nGettin paid off the clucks and the county checks\nI'm Fil-ia fresh outta high school, never did I wonder\nThat the motherfuckin hood would take me under\n\nGyeah, I'm kickin it with the homies and they got the straps\nOff to the corner store, owned by the fuckin {Japs}\nSee a bitch in the right lane so I comes with the mack\nAstro Bam pulls a motherfuckin jack from the back\n\nNow he's got the strap to my homie's head\nSee him play that shit cool, and don't be a fool!\nHe shot my nigga in the fuckin head\nI caught one in the shoulder, if I didn't run I was dead\n\nNow I'm layin in the hospital bed\nThinkin about them punk motherfuckers and my eyes is bloodshot red\nGyeah motherfuckers, I ain't finished\nBe on the look-out for the streiht up menace, gyeah\n\n\nUhh, whassup y'all\nStreiht up menace .. damn!\nReally..\nStreiht up menace .. damn!\n\nI'm in too deep\nI done killed a motherfucker and I just can't sleep\nOne-Time's tryin to do a smooth, creep\nAnd on top of that\nNiggaz after me for fuckin one of they hood rats\n\nI ain't got time for the fuckin bitch's story\nNiggaz want me gotta come to my territory\nAnd ain't no 'You Can Get the Fist'\nNiggaz come, and they get done on they own risk\nWhat is it all about?\n\nShould I leave or should I stay cause I don't wanna punk out\nOh what should I do? The homies say\n'The hood's where it's good, homeboy, I thought you knew'\nSo in the process to show the hood my best\n\nNo time to react, caught two in the chest\nNow look who's down, I guess I'm finished\nI go out like a streiht up menace, gyeah\n\nUhh, come on y'all\nStreiht up menace .. damn!\nAnd on and on\nI guess we outta here\n\nPeace to my niggaz on the run\nAnd it ain't nuttin but streiht up menaces, damn!\nJust like I said before y'all\nIt ain't nuttin but a compton thang\n\nAnd MC Eiht's in the house for the 93 shot\nAnd this one's for the niggaz, gyeah"}