{"rank":"93","song_id":"18637","song_name":"Let Me Roll","artist_id":"278349","display_artist":"Scarface","spotify_id":"4Lnnj8r68374ZiAePjDPdj","lyrics":"Ah -\nIt's jumpin off in H-Town, baby\n\nHe-he-he\nStrictly for the funk lovers, give it to me\n\nAnd we really want the whole world to see\nHow it goes..\n\nWe want your mind to blow, baby\n\n..when you free your mind and let it float\n\nLet me roooooooooooooll..\nWe want your mind to blooooow\nJust let us hang with you\n\n[ VERSE 1 ]\nHangin in the hood, just shootin the breeze\nMy partners on the cut smokin swisher sweets\nTrippin on the hoochies rollin by in they rides\nGuzzlin up a forty ounce of cold St. Ides\nJammin to a tape to my partner had made\n'Growin' up in the Hood' bein mixed with Face\nSwisher sweet's a killer, feelin nothin but nice\nReached in my pocket for the old school dice\nPulled out a knot and dropped the dice on the flo'\nAnd asked my partner Mike what they hittin fo'\nPulled out a yard and said, \"We bettin a dove\"\nTee Lee Baby, show your partner some love\nKickin back fadin, put the flame to the joint\n3-2, drop baby, 3-2's your point\nBack in the do' with a fo' and a ace\nPicked up his ends and waved the dice in my face\nAnd then he hollered out \"School house!\"\nSchooled em again, now d's come in ounce\nAnd walked away from the crap game broke\nBut it ain't no thing, yo - just let a brother smoke\n\nLet me roooooooooooooll..\nWe want your mind to blooooow\nJust got some things to do\n\n[ VERSE 2 ]\nBack on the creep after losin some change\nSeen my partner [Name], Big Chief and James\nCreepin on the boulevard, actin a fool\nTrippin on the broads at the old school\nMusic bumpin hard, never turnin it down\nTrunk super tight with surround-by sound\nPaint job crackin cause the punch ain't fade\nJammin that brand new 2Low tape\nWindows all smokey, blowin coke-laced seed\nI'm throwin up the deuce to the HPD\nNow they lookin crazy like I sold the hay\nJust another day in the heart of S.A.\nRoll a little further there, I seen O.G.\nWith his brother named [Name], S.A. O.G.\nThey chopped up the hood, so I'm chunkin it back\nAnd then they pulled out a $200 sack\nWhen I saw it I almost choked\nTwist your partner one, big baby, just let your partner smoke\n\nLet me roooooooooooooll..\nWe want your mind to blooooow\nWe got some things to do\n\n[ VERSE 3 ]\nSmokin on some lovely, now I'm feelin fine\nIt's jumpin off at the 9.9\n5th Ward in the house with the S.A. fools\nAin't no set trippin cause we all so cool\nDrinkin up the bottle, gettin drunk as a skunk\nThat 151 just ain't no punk\nHit the stage and grabbed the mic and started flexin styles\nA stage full of tight MC's goin buckwild\nNow throw your hands in the air like that\nOn the wheels of steel is my homie Lonnie Mack\nGettin down on his own\nNow I'm finna pass my partner Jay the microphone\n\n[ Lil' Jay ]\nThrow your hands in the air like that\nNorthside where you at, where you at, where you at?\nThrow your hands in the air like that\nSouthside where you at, where you at, where you at?\nThrow your hands in the air like that\nEastside where you at, where you at, where you at?\nThrow your hands in the air like that\nWestside where you at, where you at, where you at?\n\nLet me roooooooooooooll..\nWe want your mind to blooooow\nLet me roooooooooooooll..\nWe want your mind to blooooow\nWe got some things to do\nJust let us hang with you\nWe some drink for you\n"}