{"rank":"92","song_id":"18688","song_name":"Method Man","artist_id":"431539","display_artist":"Wu-Tang Clan","spotify_id":"5XLC8xoqyua4U7wJiZAWik","lyrics":"Intro Part One: Method Man (album version)\r\n\r\nYeahhh, torture motherfucker what?\r\n[Torture nigga what?]\r\nWhat?\r\nI'll fuckin\r\nI'll fuckin tie you to a fuckin bedpost\r\nwith your ass cheeks spread out and shit\r\nRight?\r\nPut a hanger on a fuckin stove and let that shit sit there\r\nfor like a half hour\r\nTake it off and stick it in your ass slow like\r\nTssssssss\r\n\r\n[Yeah, I'll fuckin\r\nYeah I'll fuckin lay your nuts on a fuckin dresser\r\nJust your nuts layin on a fuckin dresser\r\nAnd bang them shits with a spiked fuckin bat]\r\nOoooohhhh\r\n[Whassup? BLAOWWW!!]\r\n\r\nI'll fuckin\r\nI'll fuckin pull your fuckin tongue out your fuckin mouth\r\nand stab the shit with a rusty screwdriver, BLAOWW!!\r\n[I'll fuckin]\r\n\r\n[I'll fuckin\r\nI'll fuckin hang you by your fuckin dick\r\noff a fuckin twelve sto-story building out this motherfucker]\r\n\r\nI'll fuckin\r\nI'll fuckin\r\nsew your asshole closed, and keep feedin you\r\nand feedin you, and feedin you, and feedin you\r\n\r\nIntro Part Two: Genius (all versions)\r\n\r\n[Yo, roll the dice, yo roll the dice\r\nYo, so it's going down like that, huh? Yeah?\r\nNiggaz is whylin, check it out kid]\r\n\r\nFrom the slums of Shaolin, Wu-Tang Clan strikes again\r\nThe RZA, the GZA, Ol Dirty Bastard, Inspectah Deck, Raekwon the Chef\r\nU-God, Ghostface Killah and the Method Man\r\n\r\nM-E-T, H-O-D, MAN\r\nM-E-T, H-O-D, MAN\r\nM-E-T, H-O-D, MAN\r\nM-E-T, H-O-D, MAN\r\n\r\nVerse One:\r\n\r\nHey, you, get off my cloud\r\nYou don't know me and you don't know my style\r\nWho be gettin flam when they come to a jam?\r\nHere I am here I am, the Method Man\r\nPatty cake patty cake hey the method man\r\nDon't eat Skippy, Jif or Peter Pan\r\nPeanut butter, cuz I'm not butter\r\nIn fact I snap back like a rubber\r\nband, I be Sam Sam I am\r\nAnd I dont eat green eggs and ham\r\nStyle will hit ya, wham!, then goddamn\r\nYou be like oh shit that's the jam\r\nTurn it up now hear me get buckwu-wu-wild\r\nI'm about to blow light me up\r\nUpside downside inside and outside\r\nHittin you from every angle there's no doubt\r\nI am, the one and only Method Man\r\nThe master of the plan wrappin shit like Saran\r\nWrap, with some of this and some of that\r\nHold up (what?) I tawt I tat I putty tat\r\nOver there, but I think he best to beware\r\nOf the diggy dog shit right here\r\nYippy yippy yay yippy yah yippy yo\r\nLike Deck said this aint your average flow\r\nComin like rah ooh ah achie kah\r\nTell me how ya like it so far baby paw\r\nThe poetry's in motion coast to coast and\r\nRub it on your skin like lotion\r\nWhat's the commotion, oh my lord\r\nAnother corn chopped by the Wu-Tang sword\r\nHey hey hey like Fat Albert\r\nIt's the Method Man ain't no if ands about it\r\nIt's the Method\r\n\r\nBreak:\r\n\r\nAll right, y'all get ya White Owls, get ya meth, get ya skins\r\nDon't forget your fourty\r\nAnd we gonna do it like this\r\n\r\nI got, fat bags of skunk\r\nI got, White Owl blunts\r\nAnd I'm about to go get lifted\r\nYes I'm about to go get lifted\r\n\r\nI got, myself a fourty\r\nI got, myself a shorty\r\nAnd I'm about to go and stick it\r\nYes I'm about to go and stick it\r\n\r\nVerse Two:\r\n\r\nUhh\r\nH-U-F-F huff and I puff\r\nBlow like snow when the cold wind's blowin\r\nZoom, I hit the mic like boom\r\nWrote a song about it like to hear it here it goes\r\nQuestion what exactly is a panty raider\r\nIll behaviour savior or major flavor\r\nAll of the above oh yeah plus I do so\r\nAlso flam I'm the man call me super\r\nNot an average Joe with an average flow\r\nDoing average things with average hoes\r\nYo I'm super I'll make a bitch squirm\r\nFor my, Su-per Sperm (check it)\r\nCheck it I give it to ya raw butt naked\r\nI smell sess pass the Method\r\nLet's get lifted as I kick ballistics\r\nMissles and shoot game like a pistol\r\nClip is loaded when I click bang dang\r\nA Wu-Tang slug hits your brain\r\nJ-U-M-P jump and I thump\r\nMake girls rumps like pump and Humpty Hump\r\nWow, the Shaolin style is all in me\r\nChild, the whole damn isle is callin me\r\nP-A-N-T-Y-R-A-I-D-E-R mad raw I don't cry\r\nMeaning no one can burn or toss and turn me\r\nOoh I be the super sperm\r\nChim chimmeny chim chim cherie\r\nFreak a flow and flow fancy free\r\nNow how many licks does it take\r\nFor me to hit the Tootsie Roll center of a break\r\nPeep and don't sleep the crews mad deep Wu-Tang\r\nFadin motherfuckers like bleach\r\nSo to each and every crew\r\nYou're clear like glass I can see right through\r\nYou're whole damn posse be catchin em all cause you vic'd\r\nand ya didnt have friends to begin with\r\nI'm\r\n\r\nM-E-T, H-O-D, MAN\r\nM-E-T, H-O-D, MAN\r\nM-E-T, H-O-D, MAN\r\nM-E-T, H-O-D, MAN\r\n\r\nHere I am, here I am, the Method Man\r\n\r\nOutro: RZA\r\n\r\nStraight from the slums of Shaolin\r\nWu-Tang Killa B'z on a swarm\r\n[Your soul have just been taken through the 36 chambers of death, kid]\r\n\r\n*coughing*\r\n[Word to mother, Method Man signing off, peace]"}