{"rank":"68","song_id":"18680","song_name":"Shoop","artist_id":"277460","display_artist":"Salt-N-Pepa","spotify_id":"2c7H254xlKoGhmZT194C0T","lyrics":"[Intro Pepa]\n(Hey yeah, I wanna shoop baby!)\nHow you doing baby?\nNo, not you, you, the bow-legged one, yeah\nWhat’s your name?\nDamn baby, that sounds sexy\n\n[Verse 1 Pepa]\nHere I go, here I go, here I go again\nGirls, what's my weakness, men\nOk then, chilling, chilling, minding my business\nYo Salt, I looked around and I couldn't believe this\nI swear, I stared, my niece my witness\nThe brother had it going on with something kinda uh\nWicked, wicked, had to kick it\nI'm not shy so I asked for the digits\nA ho, no that don't make me\nSee what I want slip slide to it swiftly\nFelt it in my hips so I dipped back to my bag of tricks\nThen I flipped for a tip, make me wanna do tricks for him\nLick him like a lollipop should be licked\nCame to my senses and I chilled for a bit\nDon't know how you do the voodoo that you do\nSo well it's a spell, hell, makes me wanna shoop shoop shoop\n\n[Hook]\nShoop shoop ba-doop\nShoop ba-doop\nShoop ba-doop ba-doop ba-doop\nShoop ba-doop\nShoop ba-doop\nShoop ba-doop ba-doop ba-doop\n\n[Verse 2 Salt]\nYou're packed and you're stacked 'specially in the back\nBrother, wanna thank your mother for a butt like that (thanks, Mom)\nCan I get some fries with that shake-shake booty\nIf looks could kill you would be an Uzi\nOr a shotgun - bang! What's up with that thang?\nI wanna know, How does it hang?\nStraight up, wait up, hold up, Mr. Lover\nLike Prince said you're a sexy motha-\nWell-a, I like 'em real wild, b-boy style by the mile\nSmooth black skin with a smile\nBright as the sun, I wanna have some fun\nCome and give me some of that yum-yum\nChocolate chip, honey dip, can I get a scoop?\nBaby, take a ride in my coupe, you make me wanna\n\n[Hook]\nShoop shoop ba-doop\nShoop ba-doop\nShoop ba-doop ba-doop ba-doop\nShoop ba-doop\nShoop ba-doop\nShoop ba-doop ba-doop ba-doop\n\n[Verse 3 Pepa]\nWell let me bring you back to the subject, Pep's on the set\nMake you get hot, make you work up a sweat\nWhen you skip-to-my-lou, my darling\nNot falling in love but I'm falling for your [super sperm]\nWhen I get ya betcha bottom dollar you were best under pressure\n[Yo, Sandy, I wanna like, taste you]\nGetcha getcha lips wet cause it's time to have Pep\n\n[Verse 4 Salt]\nOn your mark, get set, go, let me go, let me shoop\nTo the next man in the three-piece suit\nI spend all my dough, ray me, cutie\nShoop shoop a-doobie like Scoobie Doobie Doo\nI love you in your big jeans, you give me nice dreams\nYou make me wanna scream, ooo, oooo, oooo\nI like what you do when you do what you do\nYou make me wanna shoop\n\n[Hook]\nShoop shoop ba-doop\nShoop ba-doop\nShoop ba-doop ba-doop ba-doop\nShoop ba-doop\nShoop ba-doop\nShoop ba-doop ba-doop ba-doop\n\n[Interlude Salt]\nOh my goodness, girl look at him\nHe is the cutest brother in here\nAnd he's comin' this way, oooh\n\n[Verse 5 Big Twan]\nS and the P wanna get with me, cool (uh-huh)\nBut I'm wicked, G, (yeah) hit skins but never quickly (that's right)\nI hit the skins for the hell of it, just for the yell I get\nMmm mmm mmm, for the smell of it\nThey want my bod, here's the hot rod (hot rod)\nTwelve inches to a yard and have you sounding like a retard (yeah)\nBig 'Twan Love-Her, six-two, wanna hit you\n(So what you wanna do?)\nWhat you wanna do?\n(Mmmm, I wanna shoop)\n\n[Hook]\nShoop shoop ba-doop\nShoop ba-doop\nShoop ba-doop ba-doop ba-doop\nShoop ba-doop\nShoop ba-doop\nShoop ba-doop ba-doop ba-doop\n\nOh, you make me wanna shoop\nHey yeah, I wanna shoop, baby"}