{"rank":"92","song_id":"18699","song_name":"Shifftee","artist_id":"315093","display_artist":"Onyx","spotify_id":"2eC6RqPZjACasYhnJX8HyB","lyrics":"Ahhhhhh! Got struck by lighting and the thunder!\nWildin in the shit from the tundra - The wonder\nHelp me up, someone's pullin me under!\nA scorcher, flame on the brain, this is torture\nTerrible, horrible, sick shit I brought ya!\nSacrifice the virgin, urban I'm splurgin\nSplit splice, I prefer to bring it like a surgeon right\nBombs I got shatter, bulletholes in the paper\nEscape the, madness, ONYX, the baddest! (Yup)\nSouls of a soldier in the streets of survival\nIf you have to find the blackness, here's the gun to guide you!\nFumble up, crews crumble up, under pressure God!\nIt's hard, fuck you broke your tooth playin'\nShiftee! Low down, gritty and grimey\n\nShiftee! Low down, gritty and grimey\nShiftee! Low down, gritty and grimey\nShiftee! Low down, gritty and grimey\nShiftee! Low down, gritty and grimey\n\nCome and just bust me, peel the real shit!\nDrilled through ya ear drum, hell yeah, I'm fearsome!\nMy equilibrium, is touched with the U.S.G., sickness\nContaminated with slickness!\nFilthy nasty grungy, tracks of the wretched\nI gotta deflect it, crazy desperate, deception!\nYeahhh, son, keep 'em on the run!\nIf you wasn't a two, then you musta been the one!\nIt's not a big case, to erase, who makes it my fate\nYou just, waste your time and blood, so you better play ya space!\nCause if that's some shit, gon' get real stupid!\nAnd, you and your man, can TROOP IT!\n\nShiftee! Low down, gritty and grimey\nShiftee! Shiftee! Shiftee! Shiftee!\n\nAiy you you nasty ass! (What's up big fella!)\nHey whatever, whatever shit, the dirty desert dweller!\nWho said never, all in together!\n(Now I'm a show you how the Afficial niggas FUCK IT UP!)\n\nShiftee! Low down, gritty and grimey\nShiftee! Low down, gritty and grimey\nShiftee! Low down, gritty and grimey\nShiftee! Low down, gritty and grimey\nShiftee! Low down, gritty and grimey\nShiftee! Low down, gritty and grimey\nShiftee! Low down, gritty and grimey\nShiftee! Low down, gritty and grimey\n\nOne day I'ma rule the fuckin world, just mark my word\nI've got the filthiest shit, human ears ever heard!\nAnd even if you wash my mouth out with soap\nI'll still be as disgusting and despicable!\nUnpredictable, liable to flip my lid!\nMy moms dropped me on my head, when I was a kid!\nBack then I lost all my marbles, today I lost my job\nSo in essence it's armageddon, somebody's bound to get robbed!\nWatch out! This could be you I believe\nPut a gun to your face, it's better to give than recieve!\nI'm more than meets the eye, energize, make your blood pressure rise\nMad Face ain't no disguise!\n\nShiftee! Low down, gritty and grimey\nShiftee! Low down, gritty and grimey\nShiftee! Low down, gritty and grimey\nShiftee! Low down, gritty and grimey\n\nYeaaaaaaa!"}