{"song_name":"(I Know I Got) Skillz","artist_id":278931,"display_artist":"Shaquille O Neal","spotify_id":"552FLke39OTBgGsoKSsjJ9","lyrics":"[Intro: Shaq]\nYo Jef, why don't you give me a hoopa beat or something\nSomething I can go to the park to\nYeah, there you go, allright, I like that, I like that\nIt sound dope\n\n(Bust 'em in the eye Shaq)\n\n[Verse 1: Shaq]\nYou wanna fight? come fight me\nI'll hit ya with the \"wa-psh-psh-psh\", see, see\nI get dirty after dark, I'll treat you like Spielberg\nYou'll get your ass kicked in in a park\nYou don't believe me, the proof is in the pudding\nBeen a boy in the hood way before Cuba Gooding\nI flip scrpits with the mad pa-style, freeze\nMusic please\nI dribble rhymes like Basketball-ems\nPeople call me E.T.,\n(what's that Shaq man?)\nExtra-Tallems\nYou better than Shaq-tack, fool, shut up liar!\nI lean on the Statue of Liberty when I get tired\nThan I'll punch you in the stomach, I don't give a heck\n(hey yo, why you bug a hooker like that?)\nYo, she breathed down my neck!\nPeople walk around like, Yo, they got charged!\nBut I'm big like Gorilla, 6'7\" ain't large!\nI kick rhymes like moduck-kwong do\nI smoke-smoke the mic-mic\nLike Cheech and Chong do\nYou don't like Shaq, frankly I don't give a damn\nI know I got skills man, I know I got skills man\n\n[Verse 2: Def Jef]\n\nSuprise, look who's back\nNot a prize from a Cracker Jack\nLook at that, it's Def Jef with the Shaq Attack\nFlexin', I'll be crackin your back with the boom-boom-bap\nPass that mic over here, you ain't gon' want it back\nEverybody said I got fat, yep, but so did my wallet\nStill ripping rhymes and dropping bombs like Khalid Muhammad\nDo yourself a solid, don't flex, you go sex\nYou know the time, get the high-hat, the Rolex\nThe way I see, if I was wack like you I'd be at me\nThe way I hold it down, you'd swear my name was Gravity\nDef Jef with the funk, Def Jef don't front, you know how the name is spelt\nI'm making it vital, my title, fool, break yourself\nAttack the track like Shaq on a whack broad\nComing up with the hits, and I'm coming down with the backboard\nDon't fake the funk, just make the sound's up from the trunk\nThe reason your tape didn't hit the deck is because your hits don't bump\nSo get back, ain't no hassle, cause you ain't holding nuthin\nKeep sticking around, you get beat down like you stole something\nSleep on me and the Shaq and jump your own hand\nCause I know I got skills man, I know I got skills man\n\n[Verse 3:]\n\n[Def Jef]\nAh yeah, yall don't know nothing about this\nThe Shaq Man and The Arsenal\nWhat's up like that?\nDouble XL in the nine-ohs kid\nSkills to make mills\nBig up, Flava Unit, Funky Town pros, upstate, yeah ??? ya large\nSo check this out Shaq man, we gon' let this beat play right here, let all\nThe brothers and sister know.....\n\n[Shaq]\nNah, nah, let me continue\nI'm a be like Pete Rock and see what's next on the menu\nMic-checka, the rim and rhyme wrecka\nRocks from here to Mecca\nBoom shack-a-lak-a-lak-a.\nI got a hand that'll rock ya cradle\nCream you like cheese, spread you on my bagel\nMy Ford Explorer boomin' with the trunk of funk\nAll you jealous punks can't stop my dunks\nThe brand new like Heavy\nBuilt like Chevy, Impala\nBut Shaq's a smooth balla\n(Yeah, but what about rhymin'?)\nI can hold my own\nKnick-knack shaq-attack, give a dog a bone\nRhymin is like hoopin', I'm already a legend\nBack in the days in the food stamp section\nUsed to kick rhymes like, \"Baby, baby, baby!\"\n\"Every once, every twice, three times a lady.\"\nIs what I listend to, riding with my moms\nHow you like me now? I drop bombs\nWhen you see me, please tap my hands\nI know I got skills man, I know I got skills man\n\n[Outro: Shaq]\nI'd like to give a shout-out to my boy Uzi, Def Jef, Little Swany, Meech\nRon Mac, and my other cousin Ron\nThis is another rough shot from the arsenal\nAnd you know what? Booty rappers, stay booty\nHa-ha-ha, and we out\n\nAhhh ha ha ha ha\nAhhhhh ha ha ha ha\nAhhhh... sike!"}