{"rank":"42","song_id":"18729","song_name":"Never Should've Let You Go (From \"Sister Act 2\")","artist_id":"303491","display_artist":"Hi-Five","spotify_id":"0MAN1rfwKRlzjltPho8opa","lyrics":"Girl, when I first met you I didn't realize\nYou were looking to stay around but I was looking to play around\nNow I can't forget you, can't forget your pretty smile\nTook for granted the love you gave\nAnd only thought of the love we made\n\nJust when I found someone who could love me\nLike the way that I need\nI acted the fool and pushed her away from me\n\nAnd I'll be thinking 'bout you every night and every day\n'Cause in my heart I'll know that I never should have let you go\nAnd my love for you is stronger than I ever knew\nBut I couldn't tell you so that I never should have let you go\n\nDo you think about me like I wasn't worth your time?\nI would give anything I have if you give me another chance\nDo you think you're better off without me?\nPlaying games with your heart and mind, oh yeah\n\nI don't blame you for leaving me but now you gotta believe in me\nIf you come back, girl, I promise that you'll see a change in my ways\nI'll get down on my knees, I'll do anything you say\n\nAnd I'll be thinking 'bout you every night and every day\n'Cause in my heart I'll know that I never should have let you go\nAnd my love for you is stronger than I ever knew\nBut I couldn't tell you so that I never should have let you go\n\nIs there someone else standing where I stood\nGiving you the love you never got from me?\nGirl, I would give you the world if I only could\nGirl, you will see, will you come back to me\nWon't you come back to me?\n\nAnd I'll be thinking 'bout you every night and every day\n'Cause in my heart I'll know that I never should have let you go\nAnd my love for you is stronger than I ever knew\nBut I couldn't tell you so that I never should have let you go\n\nAnd I'll be thinking 'bout you every night and every day\n'Cause in my heart I'll know that I never should have let you go\nAnd my love for you is stronger than I ever knew\nBut I couldn't tell you so, no, I never should have let\nNo, I never should have let, no, I never should have let you go, oh"}