{"rank":"93","song_id":"18771","song_name":"Here Come The Lords","artist_id":"307872","display_artist":"Lords Of The Underground","spotify_id":"5RK7cBkPvATJ9f7XMXoaBl","lyrics":"[DoItAll] Hey yo Funke wake up! \n[Mr. Funke] Huh? \n[DoItAll] Turn your radio up! \n[Mr. Funke] What?! \n[DoItAll] It's us! \n[Mr. Funke] It's US?! \n[DoItAll] Yeah listen to the cut! \nIt's our style! \n[Mr. Funke] Our style? \n[DoItAll] Your style \n[Mr. Funke] Stop brother \n[DoItAll] Aiyyo nigga wake up \"let me show you some\nthin!\" \nListen to the way they flip the metaphors and phrases \nListen, listen, it's drivin me CRA-ZY \nCause everytime I do a style and flip it kind of\nsimple \nBrothers say, \"That's fat,\" and do it on the demo \nFrom a demo to a promo now a hit on the radio \nNext thing you know, they'll be doing our video \n[Mr. Funke] Same one? \n[DoItAll] Same one! Concepts, whole nine \nAnd crazy similarities to the whole rhyme \nI'm not worried though (why?) I'm flippin hits from\nthe grill \nAnd in the underground only real stays real, so umm \ncheck the skills, the skills are kinda ill and yo \nHere Come the Lords, cause we're here to make a kill! \n\n(Here Come the Lords) 7X \n\n[Mr. Funke] Aiyyo, Marley! \n[Marley] Aiyyo whassup knocka? \n[Mr. Funke] Do you hear these suckas tryin to clock\nthe Lord Chief Rocka \n[Marley] Yeah I hear em, they're just a bunch of\nclones on your bone \n[Mr. Funke] Hold up, I'm tryin to figure out where\ncould they get my style from \nAiyyo wait a minute, remember the tape you shopped\naround a while back? \n[Marley] Yo what, wasn't that your boys? \n[Mr. Funke] Now they got our stuff down pat! \n[Marley] Yo man don't sweat it, just show em why they\ncall you Mr. Funke \nYo Lord Jazz, pass me some of that Brass Brass Monkey \n\n[Mr. Funke] \nHere Come the Lords, Here Come the Lords, Mr. Funke\ndon't you see me? \nI told you we were comin, you suckas didn't believe me\n\nThe Skipper, my Lords style stick like Jack the Ripper\n\nI'm hangin other rappers like your girl hangs on my\nzipper \nLord Jazz, hit me one time, make it funky \nStop being stingy knocka, pass that Brass Monkey \nI step, off a stage, everyone knows, who I am \nGrab the mic like Teddy Riley and I _Jam_ (chicka,\naawww, Jam) \nGive me the mic and watch me wax that ass *horn\nsample* \nKeep the camera moving cause I'm kinda fast *horn\nsample* \nYou can trip, you can flip, you could even slip or dip\n\nbut you'll never ever rip, Funke style as good as this\n\nBecause you sound like you're drugged, you might as\nwell be a singer \nYour whimsy couldn't touch me if your name was Sticky\nFingaz \nSo when I come around, don't try to be down, don't try\nto be down \nJust dig the sound, cause here comes the Lords of the\nUnderground \n\n(Here Come the Lords) 7X \n\n[DoItAll] \nWell umm, open up the doors and yell, Here Come the\nLords \nYell it loud yell it loud, let me hear it from a crowd\n\nI packs em, _In the Closet_ like Michael Jackson \nAnd love to hear the girls go OOH when I'm rockin \nSo catch it, no stutter in my flow but I wrecks it \nAnd caught you on the dillz from my jam called _Check\nIt_ \nCheck it check it check it check it microphone check\nit \nYeah, you went wild, cause your moms digs my records \nSo come on, I'm takin you where the sun don't shine \nThe underground, but everything is fine \nI rhyme, copacetic, unless it gets hectic \nYour vocal chords'll get CRACKED, you gets no\nchloraseptic \nSo hit em, so chill, chill man chill \nI know who used to be but now who's _Top Bill_ \nWell it's me, and yes, I am back by the Funke \nMarley filled the House with Hits so you know The\nLords are chunky \nWe stink, like pee-eww, funk from my shoe \nBut what about this funk, can two brothers like us do \nbut get down like James Brown and rock the whole town \nHah! And now The Lords have broke ground \n\n(Here Come the Lords) 7X \n(Here Come the Lords) 7X \n\n* Lord Jazz cuts n scratches 'Here Come the Lords' *"}