{"rank":"85","song_id":"18789","song_name":"93  Til Infinity","artist_id":"279975","display_artist":"Souls Of Mischief","spotify_id":"2MlV4hyxUgN9zjFUqWvWFb","lyrics":"[Intro]\nYo, whassup? This is Tajai\nOf the mighty Souls of Mischief crew\nI'm chillin' with my man Phesto, my man A-Plus\nAnd my man Op', you know he's dope (yo)\nBut right now, y'know, we just maxin' in the studio\nWe hailin' from East Oakland, California\nAnd, um, sometimes it gets a little hectic out there\nBut right now, yo, we gonna up you on how we just chill\n\n[Verse 1: Opio]\nDial the seven digits, call up Bridgette\nHer man's a midget; plus she got friends, yo, I can dig it\nHere's a 40, swig it, you know it's frigid\nI got 'em chillin' in the cooler, break out the ruler\nDamn! That's the fattest stog' I ever seen\nThe weather's heat in Cali\nGettin' weeded makes it feel like Maui\nNow we feel the good vibrations\nSo many females, so much inspiration\n\n[Verse 2: A-Plus]\nI get inspired by the blunts too\nI'll front you, if you hang with a bunk crew\nI roam the strip for bones to pick\nWhen I find one, I'm done\nTake her home and quickly do this\nI need not explain this (Nah)\nA-Plus is famous, so get the anus!\n\n[Verse 3: Tajai]\nHey, Miss! Who's there? I'm through there\nNo time to do hair; the flick's at eight, so get straight\nYou look great – let's grub now\nA rub down sounds flavor, later there's the theatre\nWe in the cut, the cinema was mediocre\nTake her to the crib so I can stroke her\n\n[Verse 4: Phesto]\nKids get broke for their skins when I'm in\nClose range, I throws game at your dip\nLike handball, ‘cause the man's all that\nAll phat, I be the chill from 93 'til\n\n[Hook: Souls of Mischief]\nYeah, this is how we chill from 93 'til\nThis is how we chill from 93 'til\nThis is how we chill from 93 'til\nThis is how we chill from 93 'til\nUh-huh, this is how we chill from 93 'til\nThis is how we chill from 93 'til\nThis is how we chill from 93 'til\nThis is how we chill… from 93 'til\n\n[Verse 5: A-Plus]\nHuh, my black Timbs do me well (yeah)\nWhen I see a fool and he says he heard me tell (what?)\nAnother person's business, I cause dizziness\nUntil you stop acting like a silly bitch\n\n[Verse 6: Phesto]\nYo, crews are jealous 'cause we get props\nThe cops, wanna stop our fun, but the top\nIs where we're dwellin', swell and fat, no sleep\nI work fit, and jerks get their hoes sweeped\nUnder their noses, this bro's quick\nThey hit blunts and flip once\nI'm chillin', ‘cause my crew's close, kid\n\n[Verse 7: Tajai]\nI'm posted, most kids accept this as cool\nI exit, ‘cause I'm an exception to the rule\nI'm steppin' to the cool spots where crews flock\nTo snare a dip, or see where the shit that's flam B\nBlam leakin' out his pocket\nSo I got tons of indo and go to the Owen's basement\nMy ace been fattenin' up tracks\nTime to get prolific with the whiz kid\n\n[Verse 8: Opio]\nGreenbacks in stacks, don't even ask\nWho got the fat sacks? We can max pumpin' fat tracks\nExchangin' facts about impacts, ‘cause in facts\nMy freestyle talent overpowers, brothers can't hack it\nThey lack wit, we got the mack shit\n'93 'Til Infinity – kill all that wack shit!\n\n[Hook: Souls of Mischief]\nYeah, this is how we chill from 93 'til\nThis is how we chill from 93 'til\nThis is how we chill from 93 'til\nThis is how we chill from 93 'til\nUh-huh, this is how we chill from 93 'til\nThis is how we chill from 93 'til\nThis is how we chill from 93 'til\nThis is how we chill… from 93 'til\n\n[Verse 9: Phesto]\nI be coolin', school's in session, but I'm fresh in\nRappin', so I take time off to never rhyme soft\nI'm off on my own shit\nWith my own clique, roll many backroads\nWith a fat stog' and blunt, foldin' runts\nHoldin' stunts captive with my persona\nPlus a bomber, zestin'\nNiggas is testin' my patience, but I stay fresh, and…\n\n[Verse 10: Tajai]\nRestin' at the mall, attendance on 'noid\nBut I am shoppin' for my wish to exploit\nSome ill fits, some new kicks\nI often do this, ‘cause it's the pits not being dipped\n\n[Verse 11: Opio]\nFlip the flyer attire females desire\nBaby, you can step to this if you admire\nThe extraordinary, dapper rapper\nKeep tabs on your main, squeeze before I tap her\n\n[Verse 12: A-Plus]\nI'll mack her, attack her with the smoothness\nI do this, peepin' what my crew gets (Huh)\nLoot, props, respect, and blunts to pass\nCrews talk shit, but in my face they kiss my ass (Smack!)\nThey bite flows, but we make up new ones\nIf you're really dope, why ain't you signed yet?\nBut I get my loot from Jive/Zomba\nI'ma bomb ya; you will see, from now 'til infinity\n\n[Hook: Souls of Mischief]\nYeah, this is how we chill from 93 'til\nThis is how we chill from 93 'til\nThis is how we chill from 93 'til\nThis is how we chill from 93 'til\nUh-huh, this is how we chill from 93 'til\nThis is how we chill from 93 'til\nThis is how we chill from 93 'til\nThis is how we chill… from 93 'til\n\n[Outro: Souls of Mischief]\nHah-hah, just coolin' out, y'know what I'm sayin'?\nBut, but who's chillin' around the land, y'know?\nYo, who's chillin'? I think I know who's chillin'\nYeah, tell me who's chillin' then, Plus\nCasual – you know he's chillin'\nYo, Pep Love – he gotta be chillin'\nJay-Biz – you know he's chillin'\nAyo, man, my man Snupe is chillin', man\nYo, Mike G – you know he's here chillin'\nYeah, my man Mike P – you know he gotta chill\nDel the Funky Homosapien is chillin'\nAye, aye, my man Domino – yo, he's chillin'\nYeah… it's like that, yeah"}