{"rank":"93","song_id":"18793","song_name":"I m Looking For The One (To Be With Me)","artist_id":"7127435","display_artist":"Jazzy Jeff","spotify_id":"7351lA69VXW1TLs0OgP0Ad","lyrics":"[Chorus]\nI am looking for the one to be with me now\nAre you looking for the one to be with you, now?\nI am looking for the one to be with me, now\nAre you looking for the...do you feel the same way too?\n\nCome on, clap your hands, wind it up if you're feelin' alright\nClap your hands, wind it up, if you're feelin' the vibe\nNod your head from side to side, as you ride the vibe\nCause it's a party all night\nYou can't fight the feelin' you feelin'\nCause you're feelin' fine wit' nothing really on your mind\nIt doesn't matter if you're wit' your crew\nBecause (they can feel the same way too)\nI came to get down (you came to get down?)\nYou came to get down? (we came to get down)\nI like that sound\nCause it's a party over here, party over there\nParty right here (hey)\nFew over there (hooo)\nKeep it goin', keep it goin', keep it goin' now\nKeep it flowin', keep it flowin', keep it flowin' now\nKeep it going, 'cause this is for you\nSo (you can feel the same way too)\n\n[Chorus]\nYou know the puck don't stop here\nFuck, the puck started here\nThat's why I gotta put my heart in here\nTo give you that old funky-funky-funky-funky-junky funk\nThat I know you want\nSo get your boom box so we can boom blocks\nOr shake it up somethin' pride for life\n'Cause we rockin', right?\nIt ain't a question 'bout bein' true\nBecause (you can feel the same way too)\nA little somethin' for the radio (hooo)\nA little somethin' for the video (hooo)\nA little somethin' for the jeeps (ride-ride)\nA little somethin' for the streets (hey, hey)\nA little somethin' for the homies on the block\nA little somethin' for the honies in the flocks\nA little somethin' from me to you\nSo (you can feel the same way too)\n\n[Chorus]\nNine Trey, everybody wanna be a gangsta\nBuck-buck-buck-buck, but no more, thanks to me\nYou got somethin' you can flip on the other tip\nAs you get lost in the smooth rhymes I rip\nYears and years my peers misunderstood\nThat I made cuts from my guts to make you feel good\nAnd if you get it, this is for you\nSo (you can feel the same way too)\nPut your hands in the air, come on now\nPut your hands in the air, come on, yeah\nFeel the vibe, Jazzy Jazz in the place, right\nThe upper-ground sound and pound to knock you outta your hide\nFeelin' a'ight? You feelin' a'ight? (yeah)\nYou feelin' a'ight? You feelin' a'ight? (yeah)\nWell next time bring a friend wit' you\nSo (they can feel the same way too)\n\n[Chorus]"}