{"rank":"88","song_id":"18817","song_name":"Boom Shak A-Tack","artist_id":"296993","display_artist":"Born Jamericans","spotify_id":"5gmAkmq7V1ZjoxHRfgU4AO","lyrics":"[Intro: Edley Shine]\n(Yeah, yeah)\nWarning! warning! warning!\nTo all those who have been yawning\nKids from foreign coming down inna the early morning\nThis is di don gorgon weh dem call, Edley\nOnly the Designer deh pon di side a me\nKnow say we a number one\nThe artical, Boom Shak-A-Tack\nWe a come down, this a natural fact\nCarry the kids dem come, watch it Notch\nHere this!\nAs the kids dem pop it off\n\n[Chorus: Notch]\nDi wickedest time, me and mi girl a come\nBorn Jamericans, we tear di place down\nNuh put it down deh\nPapa make it 'tand deh, yeah!\nSometimes coffee, sometimes tea\nYou know say Born Jamericans a celebrity\nWe ram dance a town, and in any country\nAll of di girls, me say dem love we, yeah!\nLook how girls dem nice and sweet\nDi glimmity-glammity weh deh underneath\nWe want it everyday, not to mention di week, woii!\n\n[Hook: Edley Shine]\nSay reggae music run di world, fi respect that\nCuz every time we touch the mic dem screaming, Boom Shak-A-Tack\nCrowd of massive catch di vibes, we're unorthodox\nThis is a lesson, definition of the Boom-Shak-A-Tack\n\n[Verse 1: Edley Shine]\nNow batty rider, tear off, nuh gyal pickney get hot\nNow bwoy a beat down di wall, selector wheel up that!\nIt's Shine a gi' you di verbs, the action words\nDrop down inna di roughneck sound, fi make the sound boys  observe\nI man would never run away inna di heart of battle\nI 'round up di girls dem, like cowboy round up cattle\nFrom line one, verse two, mi just a show off me skill\nAnd I would never sell mi soul for a thousand dollar bill\n\n[Hook: Edley Shine]\nReggae music run di world, fi respect that\nCuz every time we touch the mic dem screaming, Boom Shak-A-Tack\nCrowd of massive catch di vibes, we're unorthodox\nThis is a lesson, definition of the Boom-Shak-A-Tack\n\n[Chorus: Notch]\nDi wickedest time, me and mi girl a come\nBorn Jamericans, we tear di place down\nNuh put it down deh\nPapa make it 'tand deh, yeah!\nLook how girls dem nice and sweet\nDi glimmity-glammity weh deh underneath\nWe want it everyday, not to mention di week, woii!\n\n[Verse 2: Edley Shine]\nPhysical fit is the kid, when me start to release\nMe grab di microphone and chat fi make me dollars increase\nSexy girls to the flock, 'cuz he's a healthy young man\nAnd me will surely gi' you di remedy one by one\nBorn Jamericans is di crew from the streets of Washington\nWhere nuff people smoke crack and the fire di M1\nMi legalize, mi nah despise, di air is rugged and rough\nSome DJs open up their mouth,  its like a damn trash truck\n\n[Hook: Edley Shine]\nBut, reggae music run di world, fi respect that\nCuz every time we touch the mic dem screaming, Boom Shak-A-Tack\nCrowd of massive catch di vibes, we're unorthodox\nThis is a lesson, definition of the Boom-Shak-A-Tack\n\n[Bridge: Notch (Edley Shine)]\nChittle-lee-lee-dannon-e-wine (Woy)\nChittle-lee-lee-dannon-e-wine (Woh-owoh)\nChittle-lee-lee-dannon-e-wine (Wow-owoy, Yeah)\nWell check it out (Yeah)\nChittle-lee-lee-dannon-e-wine (Woy)\nChittle-lee-lee-dannon-e-wine (Woy-o-woh-ooo-woy)\nLa la la di di la deny\nLa la la lala la la la lie\n\n[Verse 3: Edley Shine]\nA just di kids from foreign, how dem a go manage?\n9 Inches of lead, out to do damage\nThe Ed' pon di microphone, dem have fi respect that\nDi lesson, definition, of di Boom-Shak-A-Tack\nDi kid pon di microphone, mi nah lay down flat\nEntertainment a for all enjoyment\nA lyrical technician, that is my employment\nKids from foreign, how dem a go manage?\nBoom Shak-A-Tack\nNatural fact\nEd' pon di microphone\nDon' lay down flat (Chittle-lee-lee-dannon-e-wine, Woy)\nBoom-Shak-A-Tack\nNatural fact\nDi Ed' pon di microphone (Chittle-lee-lee-dannon-e-wine, Woh-ooh-woy)\nDon' lay down flat\n\n[Outro: Notch (Edley Shine)]\nSayonara, amigo (A so di kids dem mash it up)\nWe'll see you tomorrow (Bam! bam! )\nSayonara, amigo (Flex it out!)\nWe kill a sound boy for a few more pesos (Budda-rind-ding-ding)\nSayonara, amigo\nYou know that Born Jamericans are off to El Paso\nSayonara, amigo\nThis is a lesson, definiton\nOf di Boom Shak-A-Tack"}