{"rank":"77","song_id":"18815","song_name":"Gin And Juice","artist_id":null,"display_artist":"Snoop Doggy Dogg","spotify_id":"2Y81BhPvihMpyZeNnIwLHZ","lyrics":"[Produced By: Dr. Dre]\n\n[Intro: Daz Dillinger & (Snoop Dogg)]\n(Ugh) Ha-ha-ha, I'm serious, nigga\nOne of y'all niggas got some bad motherfuckin' breath\n(Oh, man) Aye, baby, aye, baby, (shit) aye, baby\nGet some bubblegum in this motherfucker or somethin'\nAye, nigga, get somethin' to eat, dog\nAye, nigga, study long, study wrong, nigga\n\n[Verse 1: Snoop Dogg]\nWith so much drama in the L-B-C\nIt's kind of hard bein' Snoop D-O-double-G\nBut I, somehow, some way\nKeep comin' up with funky-ass shit, like, every single day\nMay I kick a little something for the G's\nAnd make a few ends as I breeze through?\nTwo in the mornin' and the party's still jumpin'\n‘Cause my momma ain't home\nI got bitches in the livin' room gettin' it on\nAnd they ain't leavin' till six in the mornin'\nSo what you wanna do?\nShit, I got a pocket full of rubbers and my homeboys do too\nSo turn off the lights and close the doors\nBut (but what?) we don't love them hoes, yeah\nSo we gon' smoke a ounce to this\nG's up, hoes down, while you motherfuckers bounce to this\n\n[Hook: Snoop Dogg & Dr. Dre]\nRollin' down the street, smokin' indo\nSippin' on gin and juice, laid back\nWith my mind on my money\nAnd my money on my mind\nRollin' down the street, smokin' indo\nSippin' on gin and juice, laid back\nWith my mind on my money\nAnd my money on my mind\n\n[Verse 2: Snoop Dogg]\nNow that I got me some Seagram's gin\nEverybody got they cups, but they ain't chipped in\nNow this type of shit happens all the time\nYou got to get yours but, fool, I gotta get mine\nEverything is fine when you listening to the D-O-G\nI got the cultivating music that be captivating he\nWho listens to the words that I speak\nAs I take me a drink to the middle of the street\nAnd get to mackin' to this bitch named Sadie (Sadie?)\nShe used to be the homeboy's lady (Oh, that bitch)\n80 degrees, when I tell that bitch please\nRaise up off these N-U-T's, ‘cause you gets none of these\nAt ease, as I mob with the Dogg Pound\nFeel the breeze beyotch, I'm just…\n\n[Hook: Snoop Dogg & Dr. Dre]\nRollin' down the street, smokin' indo\nSippin' on gin and juice, laid back\nWith my mind on my money\nAnd my money on my mind\nRollin' down the street, smokin' indo\nSippin' on gin and juice, laid back\nWith my mind on my money\nAnd my money on my mind\n\n[Verse 3: Snoop Dogg]\nLater on that day, my homie Dr. Dre\nCame through with a gang of Tanqueray\nAnd a fat ass J of some bubonic chronic\nThat made me choke; shit, this ain't no joke\nI had to back up off of it and sit my cup down\nTanqueray and chronic, yeah, I'm fucked up now\nBut it ain't no stoppin', I'm still poppin'\nDre got some bitches from the city of Compton\nTo serve me; not with a cherry on top\n‘Cause when I bust my nut I'm raising up off the cot\nDon't get upset, girl, that's just how it goes\nI don't love you, hoes, I'm out the door, and I'll be...\n\n[Hook: Snoop Dogg & Dr. Dre]\nRollin' down the street, smokin' indo\nSippin' on gin and juice, laid back\nWith my mind on my money\nAnd my money on my mind\nRollin' down the street, smokin' indo\nSippin' on gin and juice, laid back\nWith my mind on my money\nAnd my money on my mind\n\n[Outro: Snoop Dogg & Dr. Dre]\nRollin' down the street, smokin' indo\nSippin' on gin and juice, beyotch\nWith my mind on my money\nAnd my money on my mind\nRollin' down the street, smokin' indo\nSippin' on gin and juice, beyotch\nWith my mind on my money\nAnd my money on my mind"}