{"rank":"75","song_id":"18814","song_name":"Loser","artist_id":"281071","display_artist":"Beck","spotify_id":"6h6p4WuDlZVdBfmGqT0dcR","lyrics":"[Verse 1]\nIn the time of chimpanzees I was a monkey\nButane in my veins and I’m out to cut the junkie\nWith the plastic eyeballs, spray-paint the vegetables\nDog food skulls with the beefcake pantyhose\nKill the headlights and put it in neutral\nStock car flaming with the loser in the cruise control\nBaby's in Reno with the vitamin D\nGot a couple of couches, sleep on the love-seat\nSomeone came in saying I’m insane to complain\nAbout a shotgun wedding and a stain on my shirt\nDon’t believe everything that you breathe\nYou get a parking violation and a maggot on your sleeve\nSo shave your face with some mace in the dark\nSaving all your food stamps and burning down the trailer park\nYo, cut it\n\n[Hook]\nSoy un perdedor\nI'm a loser baby, so why don't you kill me?\n(Double barrel buckshot)\nSoy un perdedor\nI'm a loser baby, so why don't you kill me?\n\n[Verse 2]\nThe forces of evil in a bozo nightmare\nBan all the music with the phony gas chamber\nCause one’s got a weasel and the other’s got a flag\nOne’s on the pole, shove the other in a bag\nWith the rerun shows and the cocaine nose-job\nThe daytime crap of the folksinger slob\nHe hung himself with a guitar string\nA slab of turkey-neck and its hanging from a pigeon wing\nYou can't get right if you can't relate\nTrade the cash for the beat for the body for the hate\nAnd my time is a piece of wax falling on a termite\nWho’s choking on the splinters\n\n[Hook]\nSoy un perdedor\nI'm a loser baby, so why don't you kill me?\n(Get crazy with the cheese whiz)\nSoy un perdedor\nI'm a loser baby, so why don't you kill me?\n(Drive-by body pierce)\n(Yo, bring it on down)\n\nI'm a driver I'm a winner\nThings are gonna change, I can feel it\n\n[Hook]\nSoy un perdedor\nI'm a loser baby, so why don't you kill me?\n(I can’t believe you)\nSoy un perdedor\nI’m a loser baby, so why don't you kill me?\nSoy un perdedor\nI'm a loser baby, so why don't you kill me?\n(Sprechen Sie Deutsch, eh, baby?)\nSoy un perdedor\nI'm a loser baby, so why don't you kill me?\n(Know what I'm sayin'?)"}