{"rank":"93","song_id":"18824","song_name":"Sound Of Da Police","artist_id":"276658","display_artist":"KRS-One","spotify_id":"3Y6XWs8xMlCngyIxNOFnsp","lyrics":"[Produced by Showbiz]\n\n[Refrain]\nWoop-woop! That's the sound of da police\nWoop-woop! That's the sound of da beast\nWoop-woop! That's the sound of da police\nWoop-woop! That's the sound of da beast\n\n[Verse 1]\nStand clear, Don man'll talk\nYou can't stand where I stand, you can't walk where I walk\nWatch out, we run New York\nPoliceman come, we bust him out the park\nI know this for a fact, you don't like how I act\nYou claim I'm sellin' crack, but you be doin' that\nI'd rather say see ya, ‘cause I would never be ya\nBe an officer? You wicked overseer!\nYou hotshot, wanna get props and be a savior\nFirst show a little respect, change your behavior\nChange your attitude, change your plan\nThere could never really be justice on stolen land\nAre you really for peace and equality?\nOr when my car is hooked up, you know you wanna follow me\nYour laws are minimal\n‘Cause you won't even think about lookin' at the real criminal\nThis has got to cease\n‘Cause we be getting hyped to the sound of da police\n\n[Refrain]\nWoop-woop! That's the sound of da police\nWoop-woop! That's the sound of da beast\nWoop-woop! That's the sound of da police\nWoop-woop! That's the sound of da beast\n\n[Verse 2]\nNow here's a likkle truth, open up your eye\nWhile you're checkin' out the boom-bap, check the exercise\nTake the word overseer, like a sample\nRepeat it very quickly in a crew, for example\nOverseer, overseer, overseer, overseer\nOfficer, officer, officer, officer\nYeah, officer from overseer\nYou need a little clarity? Check the similarity!\nThe overseer rode around the plantation\nThe officer is off, patrollin' all the nation\nThe overseer could stop you, \"What you're doing?\"\nThe officer will pull you over just when he's pursuing\nThe overseer had the right to get ill\nAnd if you fought back, the overseer had the right to kill\nThe officer has the right to arrest\nAnd if you fight back they put a hole in your chest\n(Woop!) They both ride horses\nAfter 400 years, I've got no choices\nThe police them have a likkle gun\nSo when I'm on the streets, I walk around with a bigger one\n(Woop-woop!) I hear it all day\nJust so they can run the light and be upon their way\n\n[Refrain]\nWoop-woop! That's the sound of da police\nWoop-woop! That's the sound of da beast\nWoop-woop! That's the sound of da police\nWoop-woop! That's the sound of da beast\n\n[Verse 3]\nCheck out the message in a rough stylee\nThe real criminal are the C-O-P\nYou check for undercover and the one P.D\nBut just a mere Black man, them wann check me\nThem check out me car, for it shine like the sun\nBut them jealous or them vexed, ‘cause them can't afford one\nBlack people still slaves up 'til today\nBut the Black police officer nah see it that way\nHim want a salary, him want it\nSo he put on a badge and kill people for it\nMy grandfather had to deal with the cops\nMy great-grandfather dealt with the cops\nMy great-grandfather had to deal with the cops\nAnd then my great, great, great, great—when it's gonna stop?!\n\n[Refrain]\nWoop-woop! That's the sound of da police\nWoop-woop! That's the sound of da beast\nWoop-woop! That's the sound of da police\nWoop-woop! That's the sound of da beast"}