{"rank":"95","song_id":"18830","song_name":"You Know How We Do It","artist_id":"276477","display_artist":"Ice Cube","spotify_id":"67ncYmW29pNJJY2yXuLPwT","lyrics":"[Ice Cube]\nYeah... yeah!  \nFool -- you know how we do it\n\nWest Side\nComin from the West Side\nNothin but the West Side\n\nAin't nuttin goin on but the bomb-ass rap song\nHittin all night long\nJust like me on the black and white ivory\nGettin six on artillery, you don't want to see a G\nBreak yo' ass like dishes\nBuster-ass tricks, sleep with the fishes\nRunnin from Lennox, up at Venice\nThey wanna have me in stripes, like Dennis the Menace\nBut that ain't poppin, ain't no stoppin\nFo'-hoppin, ass droppin, Coupe Deville\nMy truth can, ill - fool I got skills\nSo, back on up 'fore I check that chin\nDown as fuck and I'm full off Henn'\nYou gets no love and I thought you knew it\nFool, you know how we do it\n\nComin from the West Side\nWest Side, comin from the West Side\n \n[Ice Cube]\nChillin with the homies, smellin the bud\nDouble parked and I'm talkin to Dub\nabout who got a plan, who got a plot\nwhom got got, and who got shot\nCause everybody knows that he got the info\nCrazy Toones hangin out the window\nFool I got them bomb-ass tapes\nDa Lench Mob, _planet of the Apes_\nI'm down with Eiht, and _watts Up_\nKam is solo, they got nuts\nWhen Ice Cube write a sentence\nI want \"The Bomb,\" just like George Clinton\nS-K-D is down to catch a body\nPut on _knee Deep_, we'll turn out your party\nYou gets no love and I thought you knew it\nFool, you know how we do it\n\nYou know how we do it\n\n[Ice Cube]\nJack B. Nimble, and Jack B. Quick\nif you wanna jack me on a lick, cause\nI'm that fool from South Central\nYou think you stuck yourself, with a number 2 pencil\nThat's how I poke hot lead in yo' ass\nWith \"Mo' Bounce to the Ounce\" in the dash\nMash up, Ve-nice, headed for the West \nEverything is great, slow down for the dip\nOn a 100 and 8th and keep mashin\nDon't drink and drive to keep the fo' from crashin\nStashin a glock and I thought you knew it\nYou know how we do it\n \nComin from the West Side, West Side\nNuttin but a West Side\nIt's hittin on the West Side"}