{"rank":"74","song_id":"18916","song_name":"Ease My Mind","artist_id":"279949","display_artist":"Arrested Development","spotify_id":"3Z2y0q0pLkSLQ5G2d0IxCq","lyrics":"I need some time to ease my mind\n\nThrusted in a world that I don't know\nFrom my mamas lips between my mamas hips\nI'm cuddled by her hands because she understands\nIt's that bond that keeps the movement movin' on\nLife is surrounded with so many insecurities\nBack stabbin' is like breathing when in poverty\nI try to make my sanity, with the insane\nGod is secondary to most, when they scrap for money\nBut, then again money can cause even more death\nWhen a African becomes a nigga step n fetch n all\nI dare say when price is right U can buy us all\nWell not me, cuz I don't truly give a care about you\nI'll move in poverty, in wealth but I'll surely move!\nAin't syncopated with your beats or your wack grooves\nMy break beat is to break away from yo thang\nAll these things you put on me makes this brother sing...\n\nChorus:\nI need some time to ease my mind\n\nMind & soul is even more important then body\nMoney can put my body in all exotic spaces\nMeanwhile my mind & soul remotely dwells\nWithin that fine spot between all messed up & hell\nAnd so I move on with confidence of harmony\nAnd do my thang to resist this wack society\nCuz if you don't resist, & I mean consciously\nYou'll fool your sub-conscious into accepting it\nI ain't acceptin' it - I keep my focus\nI keep my focus - I ain't acceptin'it\nGive me a face pencil to draw a smile on me\nAnswer my prayer to give my Earthly body inner peace\nAnswer my prayer to give my Earthly\nBody\nInner\nInner peace\nUntil that day upon which my souls released!\n\nChorus\n\nNeed some time need some time\nWhen the sista's say it then you know it's gotta be real!\n\nThrusted in a world that I don't know\nFrom my mommas lips between my mamas hips\nI'm cuddled by her hands because she understands\nIt's that bond that will keep the movement movin' on\nIt's that bond that will keep the movement movin' on\nAnd so I GOTTA BE READY TO RELINQUISH\nGotta be ready to relinquish, my breath of life for struggle\n\nThat is why I tell you...\n\nI need some time to ease my mind"}