{"rank":"97","song_id":"18921","song_name":"Old Times  Sake (From \"Above The Rim\")","artist_id":"281203","display_artist":"Sweet Sable","spotify_id":null,"lyrics":"[Intro: Eminem]\nGood evening\nThis is your fucking captain speaking\nWe will soon be reaching an altitude of\nFour million and a half.. feet\nThat's eight million miles in the sky\nPlease... undo your seat belt for takeoff [chkk]\nYou are now free to smoke about the cabin\n\n[Verse 1: Dr. Dre]\nI'm Dre, from back in the day\nFrom N.W.A, from black and the gray\nFrom choking a bitch, to smacking her face\nFrom stacking up bodies, to racking AKs up\nFrom racking up hits, to stacking them crates up\nI'm still hungry, and I'm back with a tapeworm\nAnd we're what's happenin' in rap entertainment\nMe and Shady, as far as competition, faggot, there ain't none\n\n[Verse 2: Eminem]\nSpeak of the Devil, it's attack of the Rain Man\nChainsaw in hand, bloodstain on my apron\nSoon as the blade spun, vrrunn, they run away from\nWho wanna play dungeon? No one is safe from\nIn search of a brain surgeon, a great one\nWait, it ain't funny, man, it's urgent, I need one\nTwo boxes of detergent in a paint gun\nAnd an emergency squirt gun to spray A-1\n\n[Chorus: Eminem]\nSo one more time for old time's sake\nDre, drop that beat and scratch that break\nNow just blow a little bit of that smoke my way\nAnd let's go (You are now smoking with the best)\nI said, one more time for old time's sake\nDre, drop that beat and scratch that break\nNow just send a little bit of that smoke my way\nAnd let's go (You are now smoking with the best)\n\n[Verse 3: Eminem]\nSmoke signal in the sky like Verizon Wireless\nA nice environment\nSurprised entirely, hypnotized by the sound\nI surround the hydrants, taking lives of firemen\nSay goodbye, here I am again, naked wives and Vicodin\nBefore I begin to get so high, pussy boy, I could spin\nVinn-vinn, fuck the handle, I fly off the hinge\nLet that boy off the bench, coach, and throw it to him\nThere he goes in his trench coat, no clothes again\nBaby, make us some french toast and show us some skin\nI'll show you every inch grows on my foreskin\nShow me nipple, I pinch both, and throw up a ten\nNow you know it's a sin to tease, blow us again\nThe sorcerer of intercourse; if it's forced, it's him\nDon't fight the feeling if you're feeling the force within\nAnd when you wake up in the morning next to the porcelain\n\n[Chorus: Eminem]\nSo one more time for old time's sake\nDre, drop that beat and scratch that break\nNow just blow a little bit of that smoke my way\nAnd let's go (You are now smokin' with the best)\nI said, one more time for old time's sake\nDre, drop that beat and scratch that break\nNow just send a little bit of that smoke my way\nAnd let's go (You are now smokin' with the best)\n\n[Verse 4: Dr. Dre]\nNow where there's smoke, there's fire\nWhere there's fire, there's flames\nWhere there's flames, there's chronic\nEither you high or you ain't\nI got no time for no games\n\n[Verse 5: Eminem]\nNuh-uh, he ain't playin'\nHe's gon' get the AK and aim it right at your brain\nI'm slightly insane, vodka and creatine\nHpnotiq and Red Bull, it's an incredible energy drink\nAnd it's given me wings, I believe I can fly\nWhile I pee on a girl, you won't catch me CSI\nIt's as easy as pie, and as simple as cake\nDre, get on the mic and make 'em tremble and shake\n\n[Verse 6: Dr. Dre]\nNow put your smoke up in the air, raise your Henny and Coke\nAnd if you really wanna get fucked up, just let me know\nWe can smoke 'til there's no more lighter fluid to do it\nLet's get into it, you're smokin' with the triedest and truest\nI got the Midas touch when it comes to rollin' shit up\nYou motherfuckers ain't smokin', you just holdin' shit up\nNow here we go, let's get up, get down, hold up a blunt\nI smoke the kinda stuff that make the records go number one\n'Cause if at first you don't succeed\nWon't hurt to smoke some weed\nNow them words are just a little more personal for me\nSeeing as how I blew up off of puffing them trees\n\n[Verse 7: Eminem & (Dr. Dre)]\nWell smoke enough for me, fuck yeah, light it up Cheech\nCome on, smoke me out cuz, give me contact buzz\nGet me on track, they love me when I'm on that stuff\nBut this is Earth calling Shady, man, come on back – What?\nMan, we're losing him, he won't even respond back, fuck!\nNow look at all the pretty women in here (Damn, bitches!)\nDre, it's hot, I think we better go check on their temperatures\nI'll get the thermometer, you get the bandages\nNow baby, just bend over, this won't hurt a damn bit, just —\n\n[Chorus: Eminem]\nGive me one more time for old time's sake\nDre, drop that beat and scratch that break\nNow just blow a little bit of that smoke my way\nAnd let's go (You are now smokin' with the best)\nI said, one more time for old time's sake\nDre, drop that beat and scratch that break\nNow just send a little bit of that smoke my way\nAnd let's go (You are now smokin' with the best)"}