{"rank":"65","song_id":"18936","song_name":"Funkdafied","artist_id":"300055","display_artist":"Da Brat","spotify_id":"29VrHhpC5AS9b7XJYDPhqb","lyrics":"Da Brat:\n\nHard times in the Funk\n\nIntro: Jermaine Dupri\n\nYeah, So Funkdafied\nSo let's take a ride with the Brat, tat, tat tat...on that ass\n\nChorus:\n\nSo, So, So Funkdafied\nSo, So, So Funkdafied\nSo, So, So Funkdafied\n\nVerse 1:\n\nOpen up, open up\nAnd let the funk flow in\nFrom this nigga name J and his new found friend\nI'm hittin switches like Eric on the solo creep\nFor yo jeep it's the B.R.A.T.\nPuttin the dip in your hip from right to left\nIt's the ghetto west bitch and I'm So So Def\nNigga that's my click\nNigga that's who I rolls with\nAnd we kicks nothing but the fat(sh,sh,hhh)\n\nThem calls me the funkdafied, funkalistic, vocalistic\nwith the real shit, we got the shit you can't funk wit\n(Why?!)\nBecause we so funkdafied\n(Why?!)\nWe make you move from side to side\nWell, it's da G H da E T T O, nigga\nBrat and J.D. comin' like that big baby\nSo lay back and listen as I catch up on my pimpin'\nAnd freak this dest just like Ashford and Simpson\n\nChorus:\n\nCause I'm so, so, so funkdafied\nSo, So, So funkdafied\nSo, So, So funkdafied\nSo, So, So Funkdafied\n\nVerse 2:\n\nPuttin' it down (puttin' it down) ain't no thang to me\nAnd ain't too many hoes that can hang with me\nIt's like that and as a matter of fact\nWhen it comes the Brat tat tat tat\nI make your neck snap back\nMeaning I got the hit that a get'cha bent\nTearing the roof off this mutha like Parliament\nI'm on a roll In Control like Janet, damnit!\nBrat your the funk Bandit and they can't handle it\nI know\nThat's why I keep hittin'em with this grammer\nLettin' all ya'll know that I'm the real mama jama\nStraight to the head like a chronic sack\nI pass the mic to the Brat and yo I passed it back\n\nWella sistas and fellas\nIt's time to get your groove on\nI provide the funkdafied sounds that make yo move homes\nBreaking these fools off proper like\nIt's S.O.S.O.D.E.F. dynamite\nHummin, hummin comin up at cha like Ralph K\nAnd since this ain't no Honeymoon, I'm here to stay\nAnd the way we comin' at cha\nBaby we can't miss\nThere's a new tag team in town\nNigga, Whoomp, there it is\n\nChorus:\n\nCause I'm so, so, so Funkdafied\nSo, so, so funkdafied\nSo, so, so funkadfied\nSo, so, so funkadfied\n"}