{"rank":"96","song_id":"18963","song_name":"Warrior s Drum","artist_id":"305918","display_artist":"King Just","spotify_id":"295Whs5jorlB1GC7bC6DQY","lyrics":"[Intro]\nCan I get the phat intro?\nThis is how you was gon start it off?\nYeah, knowhatimsayin?\nThis is the God, the Drunken Monk, King Just\nComin thru for the Shaolin crew\nBlack Fist, yo hit 'em wit a uppercut\n\n[Chorus]\nHeya heya heya, huh\nHeya heya heya, huh\nHeya heya heya, huh\nHeya heya heya, huh\n\n[King Just]\nHeya heya, can I get some?\nThe sounds of the Warrior's Drum\nOn the warpath, don't make me laugh\nCuz you never in your life, wanna ever see the God's wrath\nI'mma chief that smoke weed outta peace pipes\nYo, bro, I'm half Indian, so you're right\nI'mma about to show you wit my mic sword\nYo Shaolin sling, come on raise the sword\nCharge, they all crowd from the Black Fist\nI got fudge in my mouth, they say that'll let your own wrist\nM.C.'s fall and they can't get up\nI do the rap, why, yes that's a cut\nHuh, right back at you, niggas better run\nOr feel the force of the Hell Razah's gun\nGupao, gupao, my style is wild chopped in the Shao'\nZoo, aow, aow, I can flip it acapello\nI'll make you jelly like Jell-O, figaro, figaro\nWho would think that the Just would go opera\nYou could ask Hammer, he know my shit is popper\nStopper, stopper, like Cuddy Ranks\nI'm takin money to bank, and my moms I like I'd like to thank\nShaolin, Black Fist, they do the job\nAnd Just came back wit that ol' funky rhyme\nBring it\n\n[Chorus]\n\n[King Just]\nAnd there's a thousand M.C.'s, lined up against the wall\nTimber, they all gonna fall\nHassan Chop, yo I can't stop\nGivin you that off the wall hip hop\nTo ya ear, make ya wanna cheer\nHallelujah, ch-ch grrrr, now I'm in second gear\nYo, I'm out of here, to get the mo' tical\nFrom the Meth-Tical, hit the budd' tical\nKnow I'm headed to the hotel\nBut I'll be pokin and strokin\nYo the hair, got Tical, got a nigga open\nHey daddy, who them those over there?\nShaolin Soldiers, huh, wait a minute, no one told ya\nThat I'm the nigga, that they call Stompy\nWho got the looks of a killa dead zombie\nI take 'em off, sure fast cannin ya tour\nThey couldn't catch my style if I was a baseball\nBases loaded, and I got my back gun\nBlaow, boom, bang, oh shit a home run\n*Crowd cheerin noise* Yo, the crowd goes crazy\nBring it, if you want, cuz you really don't amaze me\n\n[Chorus]\n\n[King Just]\nLook who's back, it's the Hell Razah, raisin hell\nAnd I've been rockin rhymes, since niggas been rockin gazelles\nMy slang can bang, so I guess I be the man\nYou couldn't hang wit my style, if you invented the Ku Klux Klan\nI'm like AT&T, I'ma reach ya through ya speaker\nI got more sole than a sneaker\nAsylum, I'm crazy, I guess I'm wildin\nMy stylin, is the record straight from the Shaolin\nBy the kiss of the Black Fist\nShit is sick, here to make ya wanna drown a fish\nUnder water, I'mma slaughter, like a change machine wit no quarter\nOut of order, run for the border\nThe hardcore rap act is back\nI stick out like a thumbtack, I wipe niggas off the map\nAnd I rhyme to get paid, cuz when I raid\nI wouldn't wanna hear ya style wit a hearing aid\nStraight up crook, meaner than Captain Hook\nLook out, look out, stomp like Bigfoot\nAnd I don't give a fuck about a girl\nMy crew is more crazy than Bebe Kids in fuckin Fun World\nI'm causin niggas doom, I mean sonic boom\nI'm fuckin stupid, I write rhymes in the boiler room\nLike Krugger, funky dope maneuver\nThe Drunken Monk is so funky, they call me manure\nHorse shit, I flip shit, oh my God, I rip shit\nI talk shit, no one can shit, like I shit\nShit like this, get you upset\nBecause the shit that I was singin, was pumpin through ya projects\nHow much types must I say shit?\nWell, if the shit ain't worth the shit\nThen I don't wanna be wit the shit\nAnd then you be like \"Oh shit, he flipped it\"\nNow ain't that some shit kid?\n\n[Chorus 2X]\n\n[Outro]\nHerb like this, mound up and roll it out\n"}