{"rank":"92","song_id":"18961","song_name":"Nappy Heads","artist_id":"302537","display_artist":"Fugees","spotify_id":"6fkoeMnX3YhXs8M17Y6pvw","lyrics":"[Wyclef]\nWhy am I trapped in a cage?  (THE NAPPY HEADS ARE COMIN OUT)\nBarber can I get a fade?  (THE NAPPY HEADS ARE COMIN OUT)\nTeacher teacher check my grades  (THE NAPPY HEADS ARE COMIN OUT)\nI grab the mic in a RAGE...\n\nYou maintain to put a negro in pain you used to diss me\n\"You sure you wanna hang with old Eddie Kane?\" (+The Five Heartbeats+)\nAin't nuttin wrong, so snap your head to the song\nWord is bond, you get wrong, I'll have you sing like Louis Armstrong\nAnd I say to myself, WHAT A WONDERFUL WORLD\nBut what the fuck was so wonderful bout pickin cotton -- on a farm?\nThe harder they come, the harder they fall, so come one come all\nDon't stall or I'ma stick you like a voodoo doll\nDoors locked stop draw for the count, who drops?\nTen-nine-eight-seven-six-five-four-three-two-one-\n-you-slept-on-a-kid-from-the-boondocks\nOut of Hooterville land of the ill kill\nBellsburg Viking so you know I'm top ranking Phil\nSome say newcomer like the yuma but save the rumor\nCause I've been rockin ever since eighty-three\nwhen I used to rock my Pumas\nRap, narcotic psychotic so hear the sentencin\nOne out of ten, I'm passin the mic next time I'll get WICKED\nHeard the man who went before, got intimated\nYou tried to gas me up, too much gas, you got intoxicated\nYou wasn't ready for the real'n, dealin, chillin\nWyclef, no competition when I'm bringin pure death\nI'm jumpin like a monkey to get mines off\na-from a caterpillar, to the mic moth\n\n(THE NAPPY HEADS ARE COMIN OUT)\nTeacher teacher check my grades  (THE NAPPY HEADS ARE COMIN OUT)\nI coulda sworn I had an A  (THE NAPPY HEADS ARE COMIN OUT)\nI grab the mic in a RAGE...\n\n[Pras]\nYou put, one and one together now you think you a rapper\nBaseball cap backward, forearms swingin like a hip-hopper\nYou do the rhyme, thinkin no one can stop ya\nI be the followin that chop ya down as I clock ya, hah\nWhen I say five-oh, I mean fifty not guns or cops\nNow here's the heavyweight knocker, the freedom fighter\nNatural rhythm rock a mic I always rhyme I'm never drinkin vodka\nAny old style, I throw it in a locker\n\n[Lauryn Hill]\nWell I'm a Gucci rocker, I never drank no vodka\nMe got no bag of cheeba cause I never had a knocker\nMy cousin's name was Shaka, for short we called him 'Aka\nI flip it on wack MC's because to me they flow like caca\n\n[Pras]\nYou boogie move the groove, nothing to prove you lose\nYour style remind of yesterday, old news\nSad sung blues who's, chose the one to feel the pain\nor bring the cane, tick-tock I come to pick your lock\nIt's not for capital gain\nSo watch out for the remain, or cry from bloodstain\nBustin nuts, bustin style\nGettin buckwild some think I'm the descendant of a wilder child\nComin on the mic, from a higher level\nBroke is no joke/choke the hell out of the devil\n\n[Wyclef]\n(THE NAPPY HEADS ARE COMIN OUT)\nWhat about Martin?  (THE NAPPY HEADS ARE COMIN OUT)\nWhat about Malcolm?  (THE NAPPY HEADS ARE COMIN OUT)\nRosa Parks?  (THE NAPPY HEADS ARE COMIN OUT)\nYou hung a man after dark  (THE NAPPY HEADS ARE COMIN OUT)\nCease the violence!  (THE NAPPY HEADS ARE COMIN OUT)\n\nYo who got the power, to make a man raise from the dead?\nSome said that it was Jesus, they said he was a notty dread\nBut I don't mean to confuse a world that's confused\nMind's atomic, so like a bomb, let me drop it\nCan't get too deep, cause some sleep while I wake\nin a dream that's made of wine but let me bring it back to grapes\nTeacher, explain the parable, it's simple:\nIt's easier for the camel to go through the eye of a needle\nthan for you to enter the kingdom, or battle\nand walk away, with the title when I get, brutal\nFeelings are mutual so sign your life, to Prudential\nDon't even flinch, the other becomin spiritual\nThere's six million ways to die but choose four\ncause I can still be in the desert buttnaked and be HARDCORE!\n\n[Lauryn Hill]\nWhen ? checks that means pump your fist\nRemember Moses people, this is Exodus\nDon't try to stop this, the force comes from Genesis\nThem who did us wrong, ask the Lord for forgiveness\nThe man got a drum, made the land of the dumb\nWe droppin the bass drum, then we ??\nYou can't kill the battle with a ?? .. feeling Joshua\nSo march to St. Lawrence\nYo march I got your back, march!\n\n[Wyclef]\nCrown Heights  (THE NAPPY HEADS ARE COMIN OUT)\nCease the violence  (THE NAPPY HEADS ARE COMIN OUT)\nA moment of silence  (THE NAPPY HEADS ARE COMIN OUT)\nfor those who died  (THE NAPPY HEADS ARE COMIN OUT)\nPublic Enemy  (THE NAPPY HEADS ARE COMIN OUT)\nnumber one  (THE NAPPY HEADS ARE COMIN OUT)\nFredric Douglass  (THE NAPPY HEADS ARE COMIN OUT)\nHarriet Tubman  (THE NAPPY HEADS ARE COMIN OUT)\n??  (THE NAPPY HEADS ARE COMIN OUT)\nBob Marley  (THE NAPPY HEADS ARE COMIN OUT)\nPrazwell  (THE NAPPY HEADS ARE COMIN OUT)\nTo my man Khalid  (THE NAPPY HEADS ARE COMIN OUT)\n\n[Lauryn Hill]\nNow, speak of resistance, we're nappy heads\nRhymes, kinks, braids and dreads\nThe mother of creation, epitome of creativity, yeah\nand keep your heads nappy\n"}