{"rank":"73","song_id":"18980","song_name":"None Of Your Business","artist_id":"277460","display_artist":"Salt-N-Pepa","spotify_id":"29cvbkZWIWyMRJI7DD9n3w","lyrics":"What's the matter with your life?\n\nWhy you gotta mess with mine?\n\nDon't keep sweatin' what I do\n\nCuz I'm gonna be just fine - check it out!\n\n\n\nCHORUS\n\nIf I wanna take a guy home wit me tonight\n\nIt's none of yo business\n\nAnd if she wanna be a freak and sell it on the weekend\n\nIt's none of yo business\n\nNow you, shouldn't even get into who I'm givin' skins to\n\nIt's none of yo business\n\nSo don't try, to go and change my mind, I'll tell you one more time\n\nIt's none of yo business\n\n\n\nNow who do you think you are\n\nPuttin' your cheap two cents in?\n\nDon't you got nothin' to do\n\nThan worry about my friends? -- Check it!\n\n\n\nI can't do nothin', girl, without somebody buggin'\n\nI used to think that it was me, but now I see it wasn't\n\nThey told me to change, they called me names, and so I popped one\n\nOpinion's are like assholes and everybody's got one\n\nI never put my nose where I'm not supposed to\n\nBelieve me, if he's something that I want, I'm steppin' closer\n\nI'm not one for playing high-pole\n\nLike the house of ditty 90210 type of the ho\n\nI treat a man like he treats me\n\nThe difference between a hooker and a ho ain't nothin' but a fee\n\nSo hold your tongue tightly, wish you could be like me\n\nYou're poppin' all that mess only to stress and to spite me\n\nNow you can get with that or you can get with this\n\nBut I don't give a shit cuz really it's none of your business\n\n\n\n[1993, S and P, packin' and mackin'\n\nBamboozlin' and smackin' suckers with this track\n\nThrow the beat back in!]\n\n\n\nCHORUS\n\n\n\nHow many rules am I to break before you understand\n\nThat your double-standards don't mean shit to me?\n\nI know exactly what you say when I turn and walk away\n\nBut that's ok cuz I don't let it get it to me\n\nNow every move I make somebody's clockin'\n\nDon't ask me nothin', will you just leave me alone?\n\nNever mind who's the guy that I took home...to bone\n\n\n\nOk, Miss Thing never givin' up skins\n\nIf you don't like him or his friends what about that Benz?\n\nYour Pep-Pep's got an ill rep\n\nWith all that macaroni trap for rap you better step\n\nOr better yet get your head checked\n\nCuz I refuse to be played like a penny cent trick deck of cards\n\nNo, I ain't hard like the bitches on a boulivard\n\nMy face ain't scarred, and I don't dance in bars\n\nYou can call me a tramp if you want to\n\nBut I remember the punk who just humped and dumped you\n\nOr you can front if you have to\n\nBut everybody gets horny just like you\n\nSo, yo, so, yo, ho - check it, double deck it on a record butt-naked\n\nPep's ass gets respect, and this butt is none of your business\n\n\n\nCHORUS\n\n\nSo the moral of this story is: Who are you to judge?\n\nThere's only one true judge, and that's God\n\nSo chill, and let my Father do His job\n\n\nCuz Salt and Pepa's got it swingin' again\n\nCuz Salt and Pepa's got it swingin' again\n\nCuz Salt and Pepa's got it swingin' again\n\n"}