{"rank":"76","song_id":"19080","song_name":"Bring The Pain","artist_id":"310648","display_artist":"Method Man","spotify_id":"70URk5qnFOfhALCdYltqfT","lyrics":"[Intro: Method Man]\nBasically...\nCan't fuck with me\n\n[Verse 1: Method Man]\nI came to bring the pain hardcore from the brain\nLet's go inside my astral plane\nFind out my mental, based on instrumental\nRecords, hey, so I can write monumental\nMethods, I'm not the King\nBut niggas is decaf, I stick 'em for the CREAM\nCheck it, just how deep can shit get\nDeep as the abyss and brothers is mad fish accept it\nIn your Cross Colour clothes, you've crossed over\nThen got Totally Krossed Out and Kris Krossed\nWho da boss? Niggas get tossed to the side\nAnd I'm the dark side of the Force\nOf course it's the Method, Man from the Wu-Tang Clan\nI be hectic, and comin' for the head piece, protect it\nFuck it, two tears in a bucket, niggas want the ruckus\nBustin' at me, bruh, now bust it\nStyles, I gets buckwild\nMethod Man on some shit, pullin' niggas files\nI'm sick, insane, crazy, driving Miss Daisy (yeah)\nOut her fucking mind, now I got mine, I'm Swayze (yeah)\n\n[Hook: Method Man]\nIs it real, son, is it really real, son? (yeah)\nLet me know it's real, son, if it's really real (what, yeah)\nSomething I could feel, son, load it up and kill one (what, uhh)\nWant it raw deal, son, if it's really real—yeah—, uh\n\n[Interlude: Booster & Method Man]\nWhen I was a little stereo (stereo)\nI listened to some champion (champion)\nI always wonda (wondered)\nWhen I will be di numba one? (Tical, hah)\nNow yuh listen to di Gorgon (Gorgon)\nAnd di Gorgon sound a Rein\nAn' any jump and come tes' mi (test me)\nLet mi a-go lick out dem brain (but it's sound boy)\n\n[Verse 2: Method Man]\nBrothers want to hang with the Meth, bring the rope\nThe only way you'll hang is by the neck, Nigga Bolt\nOff the set, comin' to your projects\nTake it as a threat, better yet it's a promise\nComin' from a vet on some old Vietnam shit\nNigga, you can bet your bottom dollar, hey, I bomb shit\nAnd it's gonna get, even worse, word to God\nIt's the Wu, comin' through stickin' niggas for they garments\nMovin' on your left, southpaw, Mr. Meth\nCame to represent and carve my name in your chest\nYou can come test, realize you're no contest\nSon, I'm the gun that won that old Wild West\nQuick on the draw with my hands on the four-\nNine-three-eleven with the rugged rhymes galore\nCheck it, 'cause I think not when this hip-hops like proper\nRhymes be the proof while I'm drinkin' 90 proof\nHuh, vodka, no OJ, no straw\nWhen you give it to me, ayy, give it to me raw\nI've learned when you drink Absolut straight it burns\nEnough to give my chest hairs a perm\nI don't need no chemical blow to pull a ho\nAll I need is Chemical Bank to pay da mo'\n\n[Break: Method Man]\nWhat, basically that, Meth-Tical, '94 style (crash)\nWord up, we be hazardous\nNorthern spicy brown mustard hoes\nWe have to stick you (horn)\n\n[Hook: Method Man]\nIs it real, son, is it really real, son? (motherfucker)\nLet me know it's real, son, if it's really real\nSomething I could feel, son, load it up and kill one\nWant it raw deal, son, if it's really real\n\n[Outro: Method Man]\nI'll fuckin', I'll fuckin' cut your kneecaps off\nAnd make you kneel at some staircase, piss\nI'll fuckin' cut your eyelids off\nAnd feed you nuthin' but sleepin' pills (*laugh*)\nGet yours, motherfucker\nSo—So fuck the ho, fuck the ho\nLook at this nigga, this motherfucker, shit"}