{"rank":"83","song_id":"19108","song_name":"Kitty Kitty","artist_id":"431979","display_artist":"69 Boyz","spotify_id":null,"lyrics":"* the author requests correction sent direct to his e-mail\n\n{ } = the fellas\n( ) = the ladies\n\nChorus [2x]:\n{Here kitty-kitty, here kitty-kitty-kittyyyyy!}\nAw, kitty kitty!\n{Here kitty-kitty, here kitty-kitty-kittyyyyy!}\nI thought I saw a puddy tat!\n\nBridge A [2x]:\n(What you doin'?) {Nuttin', hon!  Uhh, uhh, I'm just nuttin', hon!}\n(What you doin'?) {Nuttin', hon!  Aww, honey-hon!}\n\nLike I said, the party ain't dead\nThese girls ain't even scared to give head!\nVerse 1:\nGirl, stop tryin' to be smooth\nMake way for a brother to make the first move\nYou're tryin' to act nice and sweet\n'Cause I know that you is a freak\nSo let a brother lick them paws\nAnd run the tongue on the g-string draws\nAnd tease the kitty just a little\nThen stick my pole in the middle\nBefore I hit, let me ask\nDid the dogs done hit in the path\n'Cause if they ain't got they shots\nThen the kitty might not get got\nThey say it ain't got a bad bone\nIn any ol 'eyes, it's gold\nSo girl, don't act seditty\nJust give a brother some of that kitty!\n\nChorus, Bridge A\n\nLike I said, the party ain't dead\nAll these chicken heads just scared!\nVerse 2:\nKitties is cool and all that\nBut I like the real big cats\nSee, a cat got a little more strength\nSo they can take a little more length\nYou gotta feed a kitty real slow\nBut a cat can take a little bit mo'\nSo lay on down on the silk\nSo you can get a bowl of this milk\nThen let's do it like dogs\nI wanna see ya climb the walls\nAnd once I get in them guts\nI'ma do that straight cat strut\nSo please don't make a brother beg\nTo get inbetween them legs\nCome on girl, have some pity\nAnd give a brother some of that kitty!\n\nBridge B [4x]:\nTrue dat, true dat!  True dat, true dat!\n\nChorus\n\nJay-Ski:\nJack and Jill went up the hill to fetch a pail of water\nJack came down, said \"Thank you ma'am, but uh, you got change for a quarter?\"  Aaow!\n\nBridge C [4x]:\n{Oh, baby!}  (Hey!)\n\nJay-Ski:\nCheck it out!\nLil' Miss Muffet sat on a tuffet eatin' a bowl o' cream o' wheat\nShe gave me a show, whatta you know, that lil' *hoe* was a freak!  Aaow!\n\nBridge C\n\nJay-Ski:\nCheck it!\nLittle Jack Horner sat in the corner beggin' this girl all night\nShe said no, he said \"Oh!  You gon' come on down and take a hike, baby!\"\n\nBridge C\n\nJay-Ski:\nLittle Bo Peep lost her sheep, eyes were full of tears\nI think girl need her *LONG BLEEP*; Whoot, there it is!  Aaow!\n\nBridge C, Bridge B, Chorus"}