{"rank":"62","song_id":"19163","song_name":"Tour","artist_id":"298642","display_artist":"Capleton","spotify_id":"4VMHdR8uVUYMqjPMQKNSiQ","lyrics":"Yeh!\r\nI say starighten yuh crooked ways\r\nBlessed is the man that walketh not in the counsel of the ungodly\r\nSelassie I liveth everytime (me sing!)\r\n\r\nAfter me lef from Jamaica go a foreign pon tour\r\nPreaching teaching the people fi sure\r\nAnswer to Jah when him a knock pon your door\r\nIf yuh ignore yuh goin perish fi sure\r\n\r\nCome back in Jamaica, everything insecure\r\nRich a get rich and the poor a get poor\r\nCome back come hear say Panhead skull bore\r\nCome back an hear say Dirtsman skull bore\r\nHear say John Pope Paul all a come yah pon tour\r\nDJ dung yah a brandish mi what more\r\nBoogerman ah plan all fi guh march and tour\r\nTour Kingston and all go tour Portmore\r\nBut me know de whole a dem would a-must dead fi sure\r\nAnd de DJ dem nah teach people no more\r\nA pure clashing and fighting dem no unite no more\r\nAlla tell de girls girl dem fi bruck out like a sore\r\nIt seems like the people dem no love God no more\r\nIf Slackness a the sickness then Culture a the cure\r\nIce all mi block and all a whole city!\r\n\r\nChorus\r\n\r\nAfter mi come back a Jamaica nuff things gone wrong\r\nCyaan know di uhman dem differnet from di man\r\nWhole a dem a dressing in di same pollution\r\nDawn an John a join competition\r\nMan a take them money an a go Obeah man\r\nMan a grudge full and dem no stop envy man\r\nBut dem laborite, and dem labor wrong\r\nMan a walk pon road and lick down innocent man\r\nLik down the little pickiney inna de prom\r\nDis is one thing me got fi overstand\r\nMost of the youth dem stop dis Rastaman\r\nDe get fi know say Rasta a di right tradition\r\nAnd respect Selassie as the almighty one\r\nIf Slackness a the fault, Culture a the solution\r\n\r\nChorus\r\n\r\nHold up! Wait a minute!\r\nCome back a Jamaica things naw run right\r\nMan alla fuss and dem no stop from fight\r\nSome long icepick and some ole rusty knife\r\nMan a walk a road a take innocent life\r\nBut dem labor wrong and dem labor right\r\nMan a walk a road around and take out innocent life\r\nSay Selassie I and alla dem start to fight\r\nSay Emanuel and nuff a dem alla fight\r\nSay Marcus Garvey and nuff a dem a fight\r\nWoman alla shine and man no stop fight\r\nIf Slackness a the darkness, then Culture a the light\r\nIce all mi block an all a whole city (How me say!)\r\n\r\nChorus\r\n\r\nThis is most of the thing me tell the people on the tour\r\nAnswer to Jah when him a knock pon the door\r\nMake sure your hands clean and make sure ya heart pure\r\nSelassie call you, your safe an secure\r\nThings yuh used to do yuh naw guh do them no more\r\nPlace yuh use to go yuh naw guh go there no more\r\nFood yuh used to eat yuh naw guh eat dem no more\r\nThings yuh used to say yuh naw go say dem no more\r\nLeading dem a gwan like dem a bruck out like soldiers (say)\r\nSee dem a go ((fi dandis?)) upon the seashore\r\n\r\nChorus\r\n\r\nHold up! Wait a minute!\r\nCome back in Jamaica, everything insecure\r\nRich a getting rich and the poor a get poor\r\nCome back an hear say Panhead skull bore\r\nCome back an hear say Dirtsman skull bore\r\nHear say John Pope Paul all a come yah pon tour\r\nDJ dung yah a brandish mi what more\r\nBugggerman ah plan all fi guh march and tour\r\nTour Kingston and all go tour Port Moore\r\nBut mi know di whole a dem woulda must dead fi sure\r\nAnd the DJ them naw teach people no more\r\nClashing and fightin dem nuh unite no more\r\nAll a tell the girl dem fi bruck out like a sore\r\nIt seem like the people them no love God no more\r\nIf Slackness a the sickness then Culture a the cure\r\nIce all a block an all a whole city\r\n\r\nChorus\r\n\r\nAfter me come back in Jamaica nuff things gone wrong\r\nCaan know di woman dem different from the man\r\nAll a dem a dress inna the same pollution\r\nDown on general competition\r\nMan a take them money an a guh obeah man\r\nMan a grudge full and dem no stop envy man\r\nBut dem laborite , and dem labor wrong\r\n(assorted scratching, etc)"}