{"rank":"84","song_id":"19166","song_name":"Take You There","artist_id":"328707","display_artist":"Pete Rock & C.L. Smooth","spotify_id":"0EklkzKtNBWHHRHiEXeBxt","lyrics":"[Verse 1: C.L. Smooth]\nNever judge a book by the cover\nDiscover the soul brother with the Mecca don\nWorking brunette to blonde\nHow many Edison con when I respond in full black\nWith us having the vernon villains back-to-back\nAmazing grace when I face the great paper chase\nFor real it’s long overdue\nSo I don’t wanna talk to you\nI stroke the hell out of mademoiselle who insisted\nEvery night, she get her back twisted in the unlisted\nI’m living through my son so daddy see it this way\nI want him in the NFL, his brother in the NBA\nNo doubt I'm with a piece, down in mecca, all crazy\nTo the late Eve, none of this is make-believe\nI breathe some of the most powerful lyrics of our century\nBattle physically, conquer mentally\nEssentially, you’re dealing with a Mecca affair\nSo anywhere you wanna go y’know, I’ll take you there\n\n[Hook]\nC.L, whatcha gonna do\nYou know, you can make me, boo\nOver, over again\nCome on and take me there\n\n[Verse 2: C.L. Smooth]\nControl now so in the future see me calling the shots\nFrom larger plots to cash to mini-bikes and open mics\nI’m blowing up spots for knots in the millennium years\nAnd now I drop it on my peers, brings tears and fears\nAnd now the question manifest in my only\nMy soldiers wear Versace or the army fatigue\nThat brings a world of intrigue and glamour to my arsenal\nOf gods, pimps to players and layers of decepticons\nMy whole mind-state gravitate to weapon\nMaking people in the business get a misconception\nIt ain’t hard to the core, it ain’t sex on the beach\nIt’s just another plateau the brothers have to reach\nEmphatic with non-cypher, then we were broke and misguided\nTry to gas me like Hitler once we get divided\nNo question, you’re dealing with a Mecca affair\nSo anywhere you wanna go, I’ll take you there\n\n[Hook]\n\n[Verse 3: C.L. Smooth]\nSet it so I can make em all respect my fame\nWhen brothers try to count all my chips in the game\nNow let me civilize your foolish acts of gunplay\nThe plan of a stick man, the price in how to get away\nChose for negroes, the most hypnotical flows\nOn the planet, another East Coast track rose, goddammit\nMy theme, to mainstream’s the knocker\nOnly time I get writer's block is when my lucci's on lock\nPretty much I’m coming through in the clutch see\nMy thought is a bombshell, built to only propel\nOr is it just my style of hustle making a mark\nTo rumble the playgrounds with more danger than Jurassic Park\nIt was dark, when I brought it to the light, for spite\nMy staff’s got me taking nothing but champagne baths\nNow the aftermath’s dealing with a Mecca affair\nSo anywhere you wanna go, I’ll take you there\n\n[Hook]"}