{"rank":"88","song_id":"19167","song_name":"Supa Star","artist_id":"303176","display_artist":"Group Home","spotify_id":"2AgfpSymxoyUddENiTFbwy","lyrics":"Intro:\nLil' Dap: Damn son\nMelachi: What the fuck is wrong with you man? Shit shouldn't be happening\nout here man. Niggas don't be realizin' the shit man but yo tell 'em what\nyou be seein' out your window.\nLil' Dap: Yo I be seeing out my window gunshots everyday.\nMelachi:Man yo I be seeing sex money and drugs too but yo tell 'em how duke\nsaid.\nLil' Dap: The world's about to end.\n\nMelachi the Nutcracker:\nBorn in the ghetto it's hard to survive\nSome have achieved and many brothers tried\nBut I realized which life to choose\nI wanna make money so I gotta pay dues\nBut there's no rules and you only have one chance\nIf ya fuck up kid you face the circumstance\nAt night I use to scream and shout\nLivin' in the ghetto trying to get the hell out\nSo I would try as I watch my friends die\nBut all I could do was sit back and cry \nThese are feelings I'm expressing through my rhymes \nI been through hard times so many problems on my mind\nI wasn't living rich and I also wasn't poor\nI try to appreciate but I deserve more\nYeah superman supa star\nGive me super fat doe like Pablo Escobar\n\"Super duper star\"\n\nLil' Dap:\nFeared by bandits hated by chicks\nLoved by kids I never did a bid\nYes the Group Home is thick\nPlus I don't eat beef cause get dizzy if ya think shit is weak\nYo I work hard and hard my man trace it down to the car\nAfter that keep it movin' have no time to be foolin'\nAround town A&R's you get down with the hype sound\nThe things I say will make a grown man dream\nI speak sayings \"Go by yourself, be by yourself\"\nLet my lyrics vibrate and shake the earth\nI travel ghetto to ghetto back streets to street\nKick a rhyme or crime with this ill mastermind\nMom dukes use to tell me with these tears in her eyes\nNow I'm out on my own survival with the dime\nLike an African tribe little Dap will blow your mind\nCheck it out like this \n\nMelachi:\nAnd then like that\n\n\"Super star\"\n\nHook:\n\"So what the fuck y'all movin' on up\" -Melachi\n\"Yes the Group Home is thick so all y'all punks hear this\"           (x3)\n\"So what the fuck y'all movin' on up\" \n\"Yo check it check it out like this here we go\"-Melachi\n\nMelachi:\nWalkin' the tunnels of hell the next level\nIt's the Nutcracker givin' hell to the devil\nPlayin' the game the New York pain\nMakes me wanna bust but I just maintain\nCause now-a-days I talk to a brother\nAlways love your mother cause you'll never get another\nIn the streets bustin' off shots fuck the cops\nI got super small props\nBig time doe, money is a thriller\nI'm gettin' more iller than the Zodiac killer\nNo lie but before I say bye \nYou can't take money with cha when you die\n\n\"Super duper star\"\n\nLil' Dap:\nYo I got niggas flippin' they wig\nChicks grabbin' they cunts\nAs they rhyme they get doper and then they greet me with blunts\nOne times for your mind before I brake these streets\nAin't nothin' holdin' me back hip hop track\nYo son you know the feelin' shit will get revealed\nAs the times will get better\nAnd you know I got skills I seen the days turn into nights \nAs the stars shine bright\nMotherfuckers Moet and chicks they keep steppin'\nLike Dom Perrion one day will live large\nWord to Allah and it don't seem hard\nNo more jealousy and envy\nCurse is put apon me\nWatch me live free at the clink\nWith my niggas you'll see \nRaisin' to the top like a rocket shit yo I go far\n\"Super star\"\n\nHook\n"}