{"rank":"65","song_id":"19184","song_name":"Brooklyn Zoo","artist_id":"277100","display_artist":"Ol' Dirty Bastard","spotify_id":"4Az3a137YyUrAJD7JlzBCm","lyrics":"[Produced by True Master & Ol' Dirty Bastard]\n\n[Intro]\nShit. Word. I bust that nigga ass right now\nAin’t no–none of them niggas can’t fuck with me\nWhat? Nigga you could never fuck with me, my nigga\nI’ll fuck you up right now! What?! What?! What?!\nBust your motherfucking ass boy!\nI ain't no motherfucking joke, you know who you talking to?\n(Word up, bust that nigga ass, word up)\nOl' Dirty Bastard, you know what I’m sayin'?\nI fuck you up right now\nYeah! What?! What?! What?!\n\n[Verse]\nI'm the one-man army, Ason\nI never been tooken out, I keep MCs looking out\nI drop science like girls be dropping babies\nEnough to make a nigga go crazy\nIn the G-Building, taking all types of medicines\nYour ass thought you were better than\nAson, I keep planets in orbit\nWhile I be coming with deeper and more shit\nEnough to make you break and shake your ass\nAs I create rhymes good as a Tastykake makes\nThis style, I'm mastered in\nNiggas catching headaches, what? What? You need Aspirin?\nThis type of pain, you couldn't even kill with Midol\nFuck around, get sprayed with Lysol\nIn your face like a can of mace, baby\nIs it burning? Well, fuck it, now you're learning\nHow I don't even like your motherfucking profile\nGive me my fucking shit: CH-CH-BLAOW!\nLast seen and heard, no-one knows\nYou forget: niggas be quiet as kept\nNow you know nothing\nBefore you knew a whole fucking lot\nYour ass don't wanna get shot\nA lot of MCs came to my showdown\nAnd watched me put your fucking ass low down\nAs you can go, below zero\nWithout a doubt I never been tooken out\nBy a nigga, who couldn't figure\nYo by a nigga, who couldn't figure\nYo by a nigga, who couldn't figure (Brooklyn Zoo)\nHow to pull a fucking gun trigger\nI said \"Get the fuck outta here!\"\nNigga wanna get too close, to the utmost\nBut I got stacks that'll attack any wack host\nIntroducing - yo fuck that nigga's name\nMy Hip Hop drops on your head like rain\nAnd when it rains it pours, cause my rhymes hardcore\nThat's why I give you more of the raw\nTalent that I got will r-iz-ock the spot\nMCs I'll be burning, burning hot\nWhoa-hoa-hoa! Let me like slow up with the flow\nIf I move too quick, oh, you just won't know\nI'm homicidal when you enter the target\nNigga get up, act like a pig trying to hog shit\nSo I take yo ass out quick\nThe mics, I've had it my nigga, you can suck my dick\nIf you wanna step to my motherfucking rep\nCH-CH-BLOAW! BLOAW! BLOAW! Blown to death\nYou got shot cause you knock knock knock\n\"Who's there?\" Another motherfucking hardrock\nSlacking on your macking cause raw's what you lack\nYou wanna react? Bring it on back\n\n[Hook]\nShame on you, when you step through to\nThe Ol' Dirty Bastard, Brooklyn Zoo!\nShame on you, when you step through to\nThe Ol' Dirty Bastard, Brooklyn Zoo!\nShame on you, when you step through to\nThe Ol' Dirty Bastard, Brooklyn Zoo!\nShame on you, when you step through to\nThe Ol' Dirty Bastard, Brooklyn Zoo!\nShame on you, when you step through to\nThe Ol' Dirty Bastard, Brooklyn Zoo!\nShame on you, when you step through to\nThe Ol' Dirty Bastard, Brooklyn Zoo!"}