{"rank":"96","song_id":"19208","song_name":"Keep Their Heads Ringin' (From \"Friday\")","artist_id":"301270","display_artist":"Dr. Dre","spotify_id":"4QAEx1QTsrl0fPpa8Fk2Rz","lyrics":"[Intro: Dr. Dre]\nYeah, what up, this is Dr. Dre\nThe party's goin' on\nThank God it's Friday\n\n(Buck buck buck buck booyakasha!)\n(Buck buck buck buck booyakasha!)\n(Buck buck buck buck booyakasha!)\n(Buck buck buck buck booyakasha!)\n\n[Hook: Dr. Dre]\nKeep their heads ringin'!\n(Ring ding dong\nRing-a-ding ding ding dong)\nKeep their heads ringin'!\n(Ring ding dong\nRing-a-ding ding ding dong)\n\n[Verse 1: Dr. Dre]\n(Hey you! Sittin over there)\nSay what?\n(You better get up out of your chair)\nThat's right\n(And work your body down)\nYeah\n(No time to funk around, cause we gon')\nFunk you right on up\nSo get up: get a move on and get your groove on\nIt's the D-R-E the spectacular\nIn a party I go for your neck, so call me \"Blacula\"\nAs I drain a nigga's jugular vein\nAnd maintain to leave blood stains, so don't complain\nJust chill, listen to the beats I spill\nKeeping it real enables me to make another mil'\nStill, niggas run up and try to kill at will\nBut get popped like a pimple: so call me Clearasil\nI wipe niggas off the face of the Earth since birth\nI've been a bad nigga, now let me tell you what I'm worth\nMore than a stealth bomber, I cause drama\nThe enforcer, music floats like a flying saucer\nOr a 747 jet, never forget\nI'm that nigga that keeps the hoes' panties wet\nThe mic gets smoked once you hear the beat kick\nWith grooves so funky, they come with a Speed Stick\nSo check the flavor that I'm bringin'\nThe motherfuckin' D-R-E will keep they motherfuckin' heads ringin'\n\n[Hook: Dr. Dre]\n(Ring ding dong\nRing-a-ding ding ding dong)\nKeep their heads ringin'!\n(Ring ding dong\nRing-a-ding ding ding dong)\n\n[Verse 2: Dr. Dre]\n1, 2 for the crew, 3, 4 for the dough\n5 for the hoes (hoes!) 6, 7, 8 for Death Row\nMad niggas about to feel the full effect of intellect\nSo I can collect respect - plus a check\nNow I fin' to get into my mental\nWill take care of this business I need to attend to cause my rent's due\nAnd this rap shit's my meal ticket\nSo you god damn right: I'm gonna kick it or get evicted\nI bring terror like Stephen King\nA black Casanova, running niggas over like Christine\nWhen I rock the spot with the flavor I got\nI get plenty of ass, so call me an ass-tronaut\nAs I blast past another nigga's ass that thought he was strong\nBut I smoke him like grass, just like Cheech and Chong\nWhen I flow, niggas know it's time to take a hike\nCause I grab the mic and flip my tongue like a dyke\nI got rhymes to keep you enchanted\nProduce a smokescreen with the funky green to keep your eyes slanted\nSo check the flavor that I'm bringin'\nThe motherfuckin' D-R-E will keep they motherfuckin' heads ringin'\n\n[Hook: Dr. Dre]\n(Ring ding dong\nRing-a-ding ding ding dong)\nKeep their heads ringin'!\n(Ring ding dong\nRing-a-ding ding ding dong)\n\n[Bridge]\nIf you want to get on down\nYou gotta get on down\nJust get on down\n\n[Verse 3: Dr. Dre]\nDebonair with flair, I scare wear and tear\nWithout a care, running shit as if I was a mayor\nBut I ain't no politician, no competition\nSending all opposition to see a mortician\nI'm up front, never in the backdrop\nStep on stage and get faded just like a flat-top\nYour rhyme sounds like you bought em at Stop 'n Go\nDre came to wax you, so just call me Mop 'n Glow\nMany tried to, but just can't rock with\nI'm 6'1\", 225, I'm pure chocolate\nYour chances of jacking me are slim, G\nCause I rock from summer until Santa comes down the chimney\nHo ho ho, and so, as I continue to flow\nCause yo, I'm just a fly negro\nSo, check the flavor that I'm bringin'\nThe motherfuckin' D-R-E will keep they motherfuckin' heads ringin'\n\n[Hook: Dr. Dre]\n(Ring ding dong\nRing-a-ding ding ding dong)\nKeep their motherfuckin' heads ringin'!\n(Ring ding dong\nRing-a-ding ding ding dong)\nKeep their heads ringin'!\n(Ring ding dong\nRing-a-ding ding ding dong)\nKeep their heads ringin'!\n(Ring ding dong\nRing-a-ding ding ding dong)\nYeah, uh, come on!\n\n[Bridge]\nIf you want to get on down\nYou gotta get on down\nJust get on down\nIf you want to get on down\nYou gotta get on down\nJust get on down\n\n[Outro]\nI know you're bobbin' your head\nCause I can see you\nI know you're bobbin' your head\nCause I can see you\nYou can't see me!\nDeath Row, let me know you in the house (Beyotch!)\nYeah, that's right, we out"}