{"rank":"84","song_id":"19219","song_name":"Purple Medley","artist_id":"351039","display_artist":"Prince","spotify_id":null,"lyrics":"Keep bustin'!\nDig if U will the picture\nOf U and I engaged in a... kiss\nU don't have 2 be beautiful 2 turn me on\nIf we can not make babies\nMaybe we can make some time\n(Baby, U're so creamy)\n\nShe said how'd U like 2 waste some time\nAnd I could not resist when I saw little Nikki grind\nNikki, oh\n\nDon't worry, I won't hurt U\nI only want U 2 have some fun\nBaby, baby, baby I'm a star (Star, ooh)\nMight not know it now\nBaby, but I are, I'm a star, eh (Star, ooh)\nI don't wanna stop 'til I reach the top, oh\nOw!\n\nIf I gave U diamonds and pearls\nWould U be a happy boy or a girl?\nAll I can do is just offer U my love\nAll I can offer U is my love\n\nI never meant 2 cause U any sorrow\nI never meant 2 cause U any pain\nI only wanted one time 2 see U laughing\nOnly want 2 see U laughing in the purple rain\n\nDearly beloved\nWe are gathered here 2day 2 get through this thing called life\n\nSexy dancer, I want your body, want your body\nSexy dancer, dance\nSexy dancer, I want your body, want your body\nSexy dancer, dance\nAhhh!\n\nWork it baby, work it\nLet's work {x2}\nI've had my eyes on U\nEver since U walked in the room\nCome on and take my hand\nDon't try 2 understand\nHey baby, nothing can stop us now\nI'm gonna show U how, oh yeah\nShow U how 2 work\nCome on, let's have some fun\nWe'll work till the morning comes\nYeah yeah, I wanna see U work\nCome on\n\nEvery Friday night I call yo ass up on the phone\nA deeper voice answers and says U're not at home (Sexy {x4})\nIf U think that I'm some fool who'll go 4 that silly line\nHoney, put down all your money U win everytime, oh (Sexy {x4})\nOh, irresistible bitch - I love the way U walk (U sexy mutha...ow!)\nIrresistible bitch - I love the way U talk\nIrresistible bitch - I love the way U kiss (U sexy mutha...ow!)\nAin't it a shame?\nHuh, I wish I could resist\n\nI ain't trying 2 pressure U baby\nBut all I ever wanted 2 do\nI wanna be your lover\nI wanna be the only one that makes U come running\nI wanna be your lover\nI wanna turn U on, turn U out\nAll night long make U shout\nOoh, lover, yeah!\nI wanna be the only one U come 4\nYeah {x4}\n\nI'm goin' down 2 Alphabet Street\nI'm gonna crown the first girl that I meet\nI'm gonna talk so sexy, she'll want me from my head 2 my feet\nYeah yeah yeah yeah\n\nTalk 2 me lover, come and tell me what U taste\nDidn't your mama tell U life is 2 good 2 waste?\nTalk 2 me lover, come and tell me what U taste\nDidn't your mama tell U life is 2 good 2 waste?\n2 good 2 waste, 2 good 2 waste\nDidn't your mama tell U life is 2 good 2 waste?\n\nLove come quick\nLove come in a hurry\nThere are thieves in the temple 2night\n\nThe moon up above shines down upon our skin\nWhispering words that scream of outrageous sin\nIf that's what we are\nWe all want a love bizarre\n\nIf I was your girlfriend\nOoh, if I was your girlfriend\nWould U let me wash your hair?\nCould I make U breakfast sometime?\nWould U let me pick out your clothes?\nWould U let me drive U 2 work?\n\nI was working part time in a 5 and dime\nMy boss was Mr. McGee\nHe told me several times that he didn't like my kind\nCuz I's a bit 2 leisurely\nIt seems that I was busy doin' something close 2 nothin'\nBut different than the day before\nThat's when I saw her, ooh, I saw her\nShe walked in through the out door, out door\n\nShe wore a raspberry beret\nThe kind U find in a second hand store\nRaspberry beret\nAnd if it was warm, she wouldn't wear much more\nRaspberry beret\nI think I love her\n\nGuess I shoulda known by the way U parked your car sideways\nThat it wouldn't last\nSee, U're the kinda person that believes in makin' out once\nLove 'em and leave 'em fast\nGuess I must be dumb, she had a pocket full of horses\nTrojan and some of them used\nBut it was Saturday night, I guess that makes it all right\nAnd U say - \"What have I got 2 lose?\"\nAnd honey, I said little red Corvette\n\nThis is it\nTime for U 2 go 2 the wire\nU will hit\nCuz U got the burnin' desire\nThe kinda girl U wanna teach\nShe's a peach\n\n(Go!) {repeats}\n(Oops, upside yo ass) {x5}\n{Crowd noise}\nLadies and gentlemen, Prince!"}