{"song_name":"I'll Be Around","artist_id":362010,"display_artist":"Rappin' 4-Tay Featuring The Spinners","spotify_id":"2ZxweO12nwE9hPOsd3P7Q5","lyrics":"phone rings)\r\nLady: Ragtop records may I help you?\r\nFly: Can I speak to Fo?\r\nLady: I moment please he's around.\r\n4 Tay: Yo wassup?\r\nFly: Wassup Fo? I know you finished that cut for the radio.\r\n4 Tay: As a matter of fact Fly I just finished it baby boy don't worry\r\nabout nothin I'll be around.\r\n\r\n(4 Tay)\r\nRegardless if I'm chillin backstage or on tour\r\nWith my homie Young Fly even Al B. Sure\r\nNever hesitate to call me whenever I'm done\r\nCause homie I'm real and I'm always true to my loved ones\r\nToo many wakes and funerals full of tears\r\nYou say there's something on your mind well here I'm all ears\r\nCause nobody thinking about the funk that you're choosin it\r\nA lot of my homies stuck in the pen for life for losin it\r\nCall up your folks you keep thinkin about home\r\nRecorder keeps a peep and there's a block on the phone\r\nAnd all of this is enough to make a brother's nerves bad\r\nReminds me of a sitution that I once had\r\nSpent that spent this endless relentless tremendous women on my jock\r\nAnd don't nobody mindin business\r\nHe say she say throwin salt about it\r\nAnd chooses to talk about you cause there's no one else to talk about\r\nTalk about the show and the flow and all the clout\r\nThen be real with yourself and talk about and turned it out\r\nIt's not hard to compete when his name is poppin\r\nA scared man can never win that's why I stay clockin\r\nFools be huffin and puffin don't wanna see me about nothin I'm down\r\nAnd if you ever need me Fly I'll be around\r\n\r\n(chorus- sampled from the Spinners &quot;I'll Be Around)\r\nWhenever you call me I'll be there\r\nWhenever you want me I'll be there\r\nWhenever you need me I'll be there\r\nI'll be around\r\n\r\n(talking)\r\nCause I'll be around you know I love you boy\r\n\r\nLife ain't based on peaches and cream\r\nThis new generation lost a whole lot of dreams\r\nFuture doctors, producers and mothers\r\nThe list goes on but now we killin our brothers\r\nAnd if we killin our brothers that means we're killin our own kind\r\nThese kids is watchin now it goes to their mind\r\nRat tat a tat cause you got a gat\r\nThen they want a gat you livin like that?\r\nMoms ain't cookin she worked the week straight\r\nIf anything she's the one that deserves a hot plate\r\nThe ghetto the ghetto ain't nothin to dream about\r\nTryin to get out now that's somethin to think about\r\nFools might disagree but I'm a stay sucka free\r\nNow I'm so black so strong they can't fade me\r\nBlacks are blacks worst enemy there's still no remedy\r\nYou got me for a grip do you call yourself kin of me?\r\nJealousy envy I see it in your eyes\r\nTell me what's wrong with seeing a black man rise\r\nI keep it funky it's pretty hard to miss it now is it explicit\r\nA message for the mind and the moral of statistics\r\nSo I'm doin what we call a roll call\r\nTalkin about the ones who won't rap then take a downfall\r\nI spit the street life and then I go underground\r\nYou silly it's called versatility and I'll be around\r\n\r\n(chorus)\r\n\r\n(Talking)\r\nYeah all you bustas yeah I was down but I'll be around\r\n\r\nThings are gettin crucial you gotta exercise your mind\r\nOr learn about life before you're left behind\r\nBut how you gonna get it right when you're not doin right\r\nWhen you get mad all you want is a gunfight\r\nThis tension causes a gang of madness\r\nNow you want funk that results to sadness\r\nSadness results to a lot of revenge\r\nAnd you're so called friends really ain't you're friends\r\nSo how do you know who you're able to trust\r\nIf you think about the past look what happened to us\r\nI never trust no one I only trust myself\r\nOr I would've been a victim like everyone else\r\nIn friendship or hardship whenever you need me\r\nJust give me a call G I won't deceive thee\r\nThese fools be shakin best believe they're fakin\r\nJust tryin to get a grip of all the money you're makin\r\nThis ain't race a mind is a terrible thing to waste\r\nI drop the rap and J drops the bass\r\nTo the flow cause ain't nobody get with Fo\r\nI'm a down young brother comin straight outta Frisco\r\nDroppin a message out of love to your town\r\nLove your brothers and sisters and I'll be around\r\n\r\n(chorus"}