{"rank":"88","song_id":"19250","song_name":"The I.N.C. Ride","artist_id":"309917","display_artist":"Masta Ace Incorporated","spotify_id":null,"lyrics":"Chorus:\n\nIt's the ride y'all, come on we're goin on a ride\nIt's the ride y'all, come on I know you wanna ride\nIt's the ride y'all, come on we're goin on a ride\nIt's the ride y'lla, it's the I.N.C. Ride\n\nVerse One:\n\nR to the I, D to the E, check out how we the I.N.C. \nGet more Biz than Markie as I spark thee\nmike like lightnin, that's frightenin, I'm hypin\nniggaz up, cuz they don't know the score\nOoooh here comes the roar, knock on your door\nI wonder who it is and who could it be\nAin't nobody but the I.N.C.\nWit mo' Soul than the Train I'm a reign\nWith 808 beats that hit big like Kane\nDaddy, caddy, Coup DeVille, chill\nJump in my ride and slide down the hill\nTo see if we catch dem kids talking that was talkin that mess\nAnd tryin to impress, never the lesstheless, yo\nI gotta let em know they can't find us, so get behind us\nCause we cruise in the I.N.C. Ride\n\nChorus\n\n\n(Incorpate the I-N-C into a flow) -- 4X\nFrom the East side, to the West side\nFrom the North side, to the South side\nFrom the East side, to the West side\nFrom the North side, to the South side\n\nVerse Two:\n\nAin't nobody but the A (o-kay)\nAnd I'm not the one you wanna play (don't play)\nI'm flat like a cap on a can of flat black\nLet me snap back break a nigee down with my rap\nCause this is how we do\nWho is the crew coming through with the brand new\nAs we flex and get fly, you cry\nThe roof is on fire but my name ain't Left Eye\nPunks be all up on it like a Charlotte Hornet\nbut they full of Chicago Bull-shit cuz they don't want it\nOoooh, don't let me sing, I'm peaking\nI'm freakin, get in that ass like a G-String\nAnd that you don't need\nWe'll be blowin up like that movie Speed indeed you're on a ride\n\nChorus\n\n(Incorpate the I-N-C into a flow) -- 4X\nFrom the East side, to the West side\nFrom the North side, to the South side\nFrom the East side, to the West side\nFrom the North side, to the South side\n\nYou're in a Lexus, or Blazer\nYou're in a Beamer, or a Benz\nYou're in a Corvette, or a Nissan\nYou're in a Sidekick, wit your friends\nYou're in a Caddy, a Landcruiser\na Range Rover, a Mustang\nYou're in a Burban with ten woofers\nThen your system, it must bang\n\nFrom the East, to the West\nFrom the North, to the South\nFrom the East, to the West\nFrom the North, to the South\nFrom the East, to the West\nFrom the North, to the South\nFrom the East, to the West\nFrom the North, to the South\nthe I.N.C. Ride\n"}