{"rank":"68","song_id":"19254","song_name":"I'll Be There For You/You're All I Need To Get By","artist_id":null,"display_artist":"Method Man Featuring Mary J. Blige","spotify_id":"0mn2aNlhflKRuWhzhiMnda","lyrics":"You're all, I need\nTo get by, ahhhhh\nYou're all, I need\nTo get by, ahhhhh\n\nLie together, cry together, I swear to God I hope we fuckin' die together\n\nShorty I'm there for you anytime you need me\nFor real girl, it's me in your world, believe me\nNuttin make a man feel better than a woman\nQueen with a crown that be down for whatever\nThere are few things that's forever, my lady\nWe can make war or make babies\nBack when I was nothin\nYou made a brother feel like he was somethin\nThat's why I'm with you to this day boo no frontin\nEven when the skies were gray\nYou would rub me on my back and say \"Baby it'll be okay\"\nNow that's real to a brother like me baby\nNever ever give my booty away and keep it tight aight\nAnd I'ma walk these dogs so we can live\nIn a phat-ass crib with thousands of kids\nWord life you don't need a ring to be my wife\nJust be there for me and I'ma make sure we\nBe livin in the effin lap of luxury\nI'm realizing that you didn't have to funk wit me\nBut you did, now I'm going all out kid\nAnd I got mad love to give, you my nigga\n\nLike sweet morning dew\nI took one look at you\nAnd it was plain to see\nYou were my destiny\nWith you I'll spend my time\nI'll dedicate my life\nI'll sacrifice for you\nDedicate my life for you\n\nLike sweet morning dew\nI took one look at you\nAnd it was plain to see\nYou were my destiny\nWith you I'll spend my time\nI'll dedicate my life\nI'll sacrifice for you\nDedicate my life for you\n\nI got a love jonz for your body and your skin tone\nFive minutes alone I'm already on the bone\nPlus I love the fact you got a mind of your own\nNo need to shop around you got the good stuff at home\nEven if I'm locked up North you in the world\nWrapped in three-fourths of cloth never showin your stuff off, boo\nIt be true me for you that's how it is\nI be your Noah, you be my Wiz\nI'm your Mister, you my Mrs. with hugs and kisses\nValentine cards and birthday wishes? Please\nBe on another level of planning, of understanding\nThe bond between man and woman, and child\nThe highest elevation, cuz we above\nAll that romance crap, just show your love\n\nLike sweet morning dew\nI took one look at you\nAnd it was plain to see\nYou were my destiny\nWith you I'll spend my time\nI'll dedicate my life\nI'll sacrifice for you\nDedicate my life for you"}