{"rank":"61","song_id":"19282","song_name":"Feel Me Flow","artist_id":"312066","display_artist":"Naughty By Nature","spotify_id":"5cKQS9890SpoU2DyqclNWG","lyrics":"You 'bout to feel the chronicles of a bionical lyric\nlyrically splittin dismissin\nI'm on a mission of just hitting\nnow it's written and kitten hittin wit mittens\nI'm missing wishing man listen\nI glisten like sun and water while fishing.\nBust the move and then swerve\nServe words with nerve embedded I said it word\nDamn, you nerd man, you heard\nComing from the town of Illy and alleys are \nfull of Phillies and Rallys suckers get\nSilly as Sally then found in alleys, I'm rowdy really\n\n1-So here we go now, \n  Holla if ya hear me though, come and feel me flow\n\nNever mixing with tricking brothers bitching\nOver fixins that ain't fittin to be hittin.\nOn nothin splittin things that's bitten\nAnd gettin written off\nLike a fatter bad bladder boy ya pissing me off\nBefore you even started so what\nSo long see you fly by my try how else \nCould I say it when you play it try boom bye bye.\n(rpt 1, 1)\n\nThe flow pro poetical with skills only\nA vet'll know better know where's \nThe wetter flow that'son point like\nDecimals manhandlin new crews\nPartying with the Zoo Crew\nLooking for the pink in poo poo.\nI thought you knew too stone style is of stamina\nJammin ta while we plannin ta jam\nWe bust plus we're the party\nAmateur damager managin damagin mics\nMen and even mannequins.\nYou're a fan again now I wanna know whose the man again?\nNaughty's back like vertibrates word to hey-a-ho\nThe way I show you pray I flow\nSteady breakin to the boogie so bang time\nTo slang bang and watch all the poo tang tangs hang\n(rpt 1, 1)\n\nPlay and Kay'll break the body of a beat\nThe beat the break into boogie\nFirm and fully chase bass lines like bullies\nAll we wanna know is if your body wanna party\nIt's nuff poo tang tang for everybody\nSo hip up and split up get up\nGet up your wit up souped up put your dukes up\nNo guts set up for sit ups flip up watch us rip up. \nShakes shows until they fizz up\nRizz up like your with us if not zip up \nYou lip up whip up.\nHits with ransom's foul styles get and ones\nWe come back cause we heard \nHip hop needed another anthem\nBlack like Noah in fact and for ya\nIf we was back in the days with the Drifters \nWe would've been known as the Flowers\nBevin these since the seventies \nFind me so we went crazy in the eighties\nSo we won't kiss heinies in the nineties\nOops the Naughty's troop in sections of forties\nSo clap your hands and hold your shorty I'm Naughty.\n"}