{"rank":"55","song_id":"19296","song_name":"Colors Of The Wind (From \"Pocahontas\")","artist_id":"1496610","display_artist":"Vanessa Williams","spotify_id":"7xG1fakElLbxwyr9eyGEK6","lyrics":"You think I'm an ignorant savage\nAnd you've been so many places\nI guess it must be so, but still I cannot see\nHow the savage one is me\nHow can there be so much that you don't know\nYou don't know\nYou think you own whatever land you land on\nThe Earth is just a dead thing you can claim\nBut I know every rock, and tree and creature\nHas a life, has a spirit, has a name\nYou think the only people who are people\nAre the people who look and think like you\nBut if you walk the footsteps of a stranger\nYou learn things you never knew, you never knew\nHave you ever heard the wolf cry to the blue corn moon?\nOr asked the grinning bobcat why he grinned?\nCan you sing with all the voices of the mountain?\nCan you paint with all the colours of the wind?\nCan you paint with all the colours of the wind?\nCome run the hidden pine trails of the forest\nCome taste the sun-sweet berries of the earth\nCome roll in all the riches all around you\nAnd for once, never wonder what they're worth\nThe rainstorm and the river are my brothers\nThe heron and the otter are my friends\nAnd we are all connected to each other\nIn a circle, in a hoop that never ends\nHave you ever heard the wolf cry to the blue corn moon?\nOr let the eagle tell you where its been?\nCan you sing with all the voices of the mountain?\nCan you paint with all the colours of the wind?\nCan you paint with all the colours of the wind?\nHow high does the sycamore grow?\nIf you cut it down, then you'll never know\nAnd you'll never hear the wolf cry to the blue corn moon\nOr whether we are white or copper-skinned\nCan you can sing with all the voices of the mountain?\nYou need to paint with all the colours of the wind?\nYou can own the Earth and still\nAll you'll own is earth until\nYou can paint ,with all the colours of the wind..."}