{"rank":"88","song_id":"19301","song_name":"Mind Blowin'","artist_id":"279637","display_artist":"Smooth","spotify_id":"4kYBrdNJUdoB7iJs9WJMvu","lyrics":"INTRO\nMind blowin, mind blowin, mind blowin,Mind blowin\n\nVerse1\nHere he comes wit his drop top Benz kickin it wit his freinds. About 2 spend a few ends, straight kickin it finger lickin it\nNot comin 2 quick but you kno you wanna get wit this. So baby don't ignore me just do as I like we can freak it all nite. Soft & Wet I think you want 2 get on your tips rockin hips so baby don't trip. I wanna hear you go \" Ohh ah yeah\" & when i'm done you'll be fienin for my next come. i'll give a run for your money honeydip. You a trip on tha flava of my lips\n\nBridge\nLayin back, tha Female Mack flava so damn smooth we freakin all nite long, cuz I got tha bone. Up & down, round & round give it 2 me like you really kno you should it's finger lickin good\n\nChorus(2x)\nMind blowin (hey!) you kno it's on cuz I got tha bone. Let me tell you want none unless you wanna get sprung\n\nVerse2\nI put a band in my back so it won't break. Movin it all around you wanna see how much tha woman can take. Meet me at tha spot when tha time is rite\nTurn down tha lights come & give it 2 me rite. Throw on my pumps put tha rise in tha rump not tha grind & tha bump, just tell me what you want. I love me a honey even a summer bunny. I won't tell if you won't tell. First step I'll light a candle, lick you from head 2 toe. Front & back side 2 side let tha jimmy unwind while I'm freak it 2 ya mind\n\nBridge\nLayin back, tha Female Mack falva so damn smooth we freakin all nite long, cuz I got tha bone. Up & down, round & round give it 2 me like you really kno you should it's finger lickin good\n\nChorus(2x)\n( Smooth) Mind blowin (hey!) you kno it's on cuz I got tha bone. Let me tell you want none unless you wanna get sprung\n\nSo baby don't trip I wanna hear you go\" Ohh ah yeah\" I wanna hear you go \" ohh ah yeah, yeah\n\nBridge\nLayin back, tha Female Mack falva so damn smooth we freakin all nite long, cuz I got tha bone. Up & down, round & round give it 2 me like you really kno you should it's finger lickin good\n\nChorus(2x)\n( Smooth) Mind blowin(Smooth) (hey!) you kno it's on cuz I got tha bone. Let me tell you want none unless you wanna get sprung.(Tha Female Mack, Tha Female Mack)\n\nSoft & Wet I think you wanna get on ya tips. Soft & Wet I think you wanna get on ya tips. Soft & Wet I think you wanna get on ya tips. Soft & Wet I think you wanna get on ya tips. Soft & Wet I think you wanna get on ya tips. Soft & Wet I think you wanna get on ya tips. Soft & Wet I think you wanna get on ya yips. So & Wet, so baby don't trip\n\nChorus(2x)\n( Smooth) Mind blowin(Smooth) (hey!) you kno it's on cuz I got tha bone. Let me tell you want none unless you wanna get sprung.(Tha Female Mack, Tha Female Mack)\n\nFades Out"}