{"rank":"75","song_id":"19322","song_name":"Player's Anthem","artist_id":"1496937","display_artist":"Junior M.A.F.I.A.","spotify_id":"6PhOzQShyz2vjELsXax7TQ","lyrics":"[Produced by DJ Clark Kent]\n\n[Chorus: The Notorious B.I.G.]\n(Niggas) Grab your dick if you love hip-hop\n(Bitches) Rub your titties if you love Big Poppa\nGotcha, open off the words I say because\n\"This type of shit it happens everyday\"\n\n[Verse 1: Lil' Cease]\nNow who smoke more blunts than a little bit?\nWhat are you a idiot?\nListen to the lyrics I spit like M1's\nGot mad guns up in the cabin\nCause Cease ain't the one for the dibbin and dabbin shit\nI make it happen, you got your ass caught\nAll you saw was fire, from the Honda Passport\nOr the M.P., what if you see, then I miss ya\nI blow up spots like little sisters\nG'wan grit ya teeth, g'wan bite ya nails to the cuticles\nLike Murray, my killings be the most beautiful\nJunior M.A.F.I.A. clique thick like Luke dancers\nNiggas grab your gats, bitches take a glance at\nThe little one, pullin over in the Land Rover\nPlayin Big Willie style with a chaffeur, yaknahmean?\nStack the green, read all between the lines\nA nigga act up, makes the bastard hard to find\n\n[Chorus: The Notorious B.I.G.]\n(Niggas) Grab your dick if you love hip-hop\n(Bitches) Rub your titties if you love Big Poppa\nGotcha, open off the words I say because\n\"This type of shit it happens everyday\"\n\n[Verse 2: Notorious B.I.G.]\n(How ya livin Biggie Smalls?) I'm surrounded by criminals\nHeavy rollers even the sheisty individuals\nSmokin skunk and mad Phillies\nBeatin down Billy Badasses, cracks in stacks and masses\nIf robbery's a class, bet I pass it\nShit get drastic, I'm buryin ya bastards\nBig Poppa never softenin\nTake you to the church, rob the preacher for the offerin\nLeave the fucker coughin up blood, and his pockets like rabbit ears\nCovet the wife, Kleenex for the kid's tears\nVersace wear, Moschino on my bitches\nShe whippin my ride, countin my one's, thinkin I'm richest\nJust the way players play, all day everyday\nI don't know what else to say\nI've been robbin niggas since\nRun and them was singin \"Here We Go\"\nSnatchin ropes at the Roxy, homeboy, you didn't know?\nMy flow, detrimental to your health\nUsually roll for self, I have son ridin shotgun\nMy mind's my nine, my pen's my Mac-10\nMy target, all you wack niggas who started rappin\nJunior M.A.F.I.A. steelo, niggas know the half\nCaviar for breakfast, champagne bubble baths\nRunnin up in pretty bitches constantly\nThe Smalls bitch, who the fuck it was supposed to be?\n\n[Chorus: The Notorious B.I.G.]\n(Niggas) Grab your dick if you love hip-hop\n(Bitches) Rub your titties if you love Big Poppa\nGotcha, open off the words I say because\n\"This type of shit it happens everyday\"\n\n[Verse 3: Lil' Kim]\nI used to pack Macs in Cadillacs\nNow I pimp gats in the Ac's, watch my niggas backs\nNines in the stores, Glocks in the bags\nMaxin mini-markets, gettin money with the Arabs\nNo question, confession, yes it's the lyrical\nBitches squeeze your tits, niggas grab your genitals\nProteins and minerals, excluse subliminals\nBig Momma shoots the game to all you Willies and criminals\nI kick the rilli with my peeps all day\n325's roll by with the windows down halfway\nD-K-N-Y, oh my, I'm jiggy\nIt's all about the Smalls and my fuckin nigga Biggie\nBitches love the way I bust a rhyme\nCause they all in line screamin one more time\nNiggas, grab your dicks if you love hip-hop\nBitches rub-a-dub in the back of the club, straight up"}