{"rank":"53","song_id":"19354","song_name":"1st Of Tha Month","artist_id":"296202","display_artist":"Bone Thugs-N-Harmony","spotify_id":"4mROEfIj4uGyr7AOkz6u64","lyrics":"[Hook: Layzie Bone and Bizzy Bone]\nWake up, wake up, wake up\nIt's the 1st of the month\nSo get up, get up, get up\nSo cash your checks and come up\n\n[Verse 1: Krayzie Bone]\nHey, my niggas, we havin' a wonderful day\nAnd I won't front with ya, why?\n'Cause it's the 1st of the month\nAnd now we smokin', jokin', rollin' blunts\nAnd sippin' on 40 ounces, thuggin'\nCome, come, we've got the blunts and rum\nFrom jumpin' all nights we high\nHit up the block to where? East 99\nI get with my nigga to get me some yayo\nDouble up, \"Nigga, what you need?\nWe got weed to get P.O.D.'ed, fiend for the green leaves.\"\nDouble up for the first fo' sho' better lay low\n'Cause the popo creep when they roll slow\nIf you can't get away, better toss that yayo\nKeep your bankroll\nYeah, we havin' a celebration, I love to stay high\nAnd you better believe when it's time to grind\nI'm down for mine, crime after crime\nFin to creep to the pad, 'cause Mom's got grub on the grill\nAnd we got the 4-0, you know it's the 1st of the month\nAnd, my nigga, we chills for real\n\n[Hook: Layzie Bone and Bizzy Bone]\nWake up, wake up, wake up\nIt's the 1st of the month\nSo get up, get up, get up\nSo cash your checks and come up\n\n[Verse 2: Bizzy Bone]\nWake up, and I see that my sister was already dressed\nShe said: \"I'ma run and go get my stamps\nWatch and make sure no one snatches my check.\"\nNigga, that's the mailman\nSort through the mail and put it up into me pocket\nSo I be hittin' the 99 to get me a dub for 40 bucks\nBut ain't no bucket ride that RTA, hop on the 10 to the Clair\nReady to get 'em up with-a me thugs\nAnd to cash that dum, man, I gotta get paid\nPlaya, playa, holla, holla, Saint Clair got much to offer\nWhether it be weed on 93\nOr off on the Glock-Glock for some dollars\nSo, get a bag of dope and a quarter O\nOh, most all of my niggas got the same\nAnd we gonna roll it all up to smoke\nHittin' that reefer hydro\nYou know the cut, so fuck them popo\nToss all that yayo, and we're gonna say \"no\"\nRunnin' through the alley and into the mally\nUp on the second the Sun down\nThose run from January on down to December\nI'm lovin' the 1st of the month\n\n[Hook: Layzie Bone and Bizzy Bone]\nWake up, wake up, wake up\nIt's the 1st of the month\nSo get up, get up, get up\nSo cash your checks and come up\n\n[Verse 3: Wish Bone]\nGotta grind, gotta get mine, in the hood that I claim\nAnd I slang on that double 9-9\nGotta find them dubs\nGonna get a 40, can a thug get love?\nWhat's up? Try to slang on my corner\nNigga, you's a goner: Saint Clair niggas don't like that\nAnd sellin' them dummies, makin' that money\nCome back, nigga, get pap pap\nFrom the 1st to the 15th niggas smoke plenty weed\nBut I gotta save, gotta come up\nPut my rocks on the cut\nWhen I get high, nigga, blaze that blunt, huh\nTime to roll to the pad\nCount up my profits and add it to the stash\nGotta watch my back\nSee for niggas that's tryin' to rob me, fool\nBut never no shorts or no losses\nDumpin', keepin' these niggas up off me\nSee, gotta search the whole block\nSpend a couple of bills, thugs smoke a lot of weed on the 1st\n\n[Hook: Layzie Bone and Bizzy Bone]\nWake up, wake up, wake up\nIt's the 1st of the month\nSo get up, get up, get up\nSo cash your checks and come up\n\n[Verse 4: Layzie Bone + (Krayzie Bone)]\nWakin' up, feelin' buzzed, up early mornin'\nStretchin', I'm yawnin', lightweight, bent\nChugga-lugga take a 5th to the dome\nInstead I kick it with my trues\nBut it's the 1st, so I'm gettin' me hustle on\nHop on the phone, callin' up Krayzie Bone\nWanna know, did your O.G. check come?\n(Sure, put me down!)\nI'ma hop on the bus with Biz (Yo, Brother, let's get drunk!)\nAnd I'm comin' with blunt after blunt of this skunk\nNigga T just put me down\nOh God, how I love when the 1st come around\nNow I'm freakin' me Black n Mild, headed cross town\n'Cause niggas, the 1st get celebrated\nRushin' to the block 'cause I wanna get faded\nLookin' all wild 'cause I'm gettin' me hair braided\nWe heavy off into this game\nTrue to the 1st, just call me that pro slang\nThem nickels and dimes and 20's and 50's\nThe 1st be the day for the dopeman\nSlangin' that cocaine, fool, and I'm workin' late tonight\nAnd all them fiends be lovin' them thugs\n'Cause I got them rocks for them pipes\nCome, come with-a ease\nI gotta get paid on the 1st, gotta blaze up my spliff\nGet live with the Bone Thugs\nPoetic Hustlaz, and the Graveyard Shift, on the 1st\n\n[Hook: Layzie Bone and Bizzy Bone]\nWake up, wake up, wake up\nIt's the 1st of the month\nSo get up, get up, get up\nSo cash your checks and come up"}