{"rank":"96","song_id":"19377","song_name":"Return Of The Crooklyn Dodgers (From \"Clockers\")","artist_id":null,"display_artist":"Crooklyn Dodgers '95","spotify_id":"6BI8xtNeXiiyLLDhAQv4at","lyrics":"[Intro]\n\"We did it like that and now we do it like this\"\n\"We did it like that and now we do it like this\"\n\n[Verse 1: Chubb Rock]\nNow clock kids, who got the cocaine?\nDon't tell me it's the little kids on Soul Train\nThe metaphor sent from my brain to my jaw\nIt comes from other places, not the tinted faces\nJournalistic values are yellow and then, of course, falters\nYou'll watch Channel Zero with that bitch Barbara Walters\nShe'll have you believe black invented crack\nWhen President Lyndon had the formula way back\nIn '63 with Kennedy.  Yes, the double cross\nRemember that's when they blow his fucking head off\nVietnam vets come back looking like\nOne-armed pets.  Nixon bounced pure checks\nNo picket fence, no job, no 8-cylinder\nCar, blue collar turns to bourgeois\nDepressed in your chest, Demerol\nFor sess, no dough, crack in vials much less\nWhitey can sell on the corners of Bushwick\nWhitey can sell on the corners of Flatbush\nWhite Tees can sell on the corners of Bed-Stuy\nPass the torch to that nigga guy.  So just\nDie, nigga, die, nigga\nYou're too black, you can't handle, you're too strong\nGet high, fly, clock.  Next, boost your steel\nIn '95, we take back Ebbets Field\n\n[Verse 2: O.C]\nBrooklyn.  Traveling distance to party\nBrooklyn.  Absent at functions?  Not hardly\nBrooklyn.  The name alone holds Godly\nYou don't know?  You better ask somebody\nCrack filled streets since '85.  The Beast getting\nPaid to not bust.  Hookers’ drawers got crust\nClaps clapping regular, hardcore niggas with\nFat gold chains on the corner maintaining\nGold teeth flashing, stickup kids playing in front of\nLatin Quarters—keep home your daughters\n‘Cause if bullets fly, watch the flaming.  Ignorant\nDucks are shooting, wiling.  They're not aiming\nOne Easter—now, to think about it, what a pity\nFive people died in front of Skate City\nSenseless.  Back then you was ill if you had a gun\nPeople gash you and flash you.  Damn, no fun\nAlbee Square, you couldn't shop too much ‘cause\nFort Greene would hem you, wreck the fuck on up.  You had\nDo or Die, East New York, mad Hell\nFellas cutting school, trooping to all go Maxwell\nSo many memories I can't manifest\nYo, ‘Ru, start where I finish and, to Brooklyn, God bless\n\n[Scratched Hook]\n\"Crazy ass Crooklyn kids\"\n\"Represent the Brooklyn all-nighter\"\n\"Crazy ass Crooklyn kids\"\n\"Because it is, survival of the fittest\"\n(Repeat x2)\n\n[Verse 3: Jeru the Damaja]\nListen ‘cause, for your mind, I got the right nutrition.  We keep\nShit hard like fat asses and cases of Heineken\nHere in Brooklyn, home of the warrior and villain\nTrife type chicks, “Top Billin'”s the anthem\nRastas smoke marijuana, enter-\n-prising businessmen shoot dice on the corner\nExcuse me while I light my spliff but some choose to sip\nSo bullets hit brains when bottles hit lips\nClips, whatever happened to .38 Special?\nNow it's Desert Eagles, government issue\nProbably the same one that killed Noriega.  Chips\nThat power nuclear bombs power my Sega\nSubliminal hypnotism and colonialism\nLeave most niggas dead or in prison\nIn Crookland, right hand cuts off the left hand\nTo spite the hand.  Jealous of the next man, so violent\nCrimes black-on-black, plus mad crack to boot\nEverybody can't rap, so most hustle and shoot\n“Make money money, get money, take money.”  I can't\nUnderstand that concept ‘cause Jah rules everything around me\nFire burns the unjust like arson, larceny\nMelt emcees with mental telepathy\nWith precision, we're slicing and dicing.  Peace to\nThe East New York, Perverted Monks, and Mike Tyson\n\n[Scratched Hook x2]\n\nCrooklyn (2X)"}