{"rank":"89","song_id":"19374","song_name":"Sittin' On Chrome","artist_id":"309917","display_artist":"Masta Ace Incorporated","spotify_id":null,"lyrics":"Sittin on chrome (8X)\n\nChorus: *with sample from Eazy E*\n\nHe once was a dog from around the way... [so you better take it]\nEazy!                                    [and I'm sittin on chrome]\nHe once was a dog from around the way... [so you better take it]\nEazy!                                    [and I'm sittin on chrome]\n\nI just got paid...\nIt's Friday night...\nI'm sittin on chrome...\nAnd I'm feelin alright...\n\nVerse One:\n\nTake it EZ, like E cuz I be\nLettin niggaz know what time it is when it comes to me\nYou can't find us here anywhere and I tear\nyou a new asshole, as beautiful as gold\nLook at your reflection in my shine, find\npissy hallways are always on my mind\nBut not tonight, I'm sittin on chri-dome\nMakin more waves than my cellular phi-done\nMental energy from within keeps me higher\nthan anything rolled and set on fire let me try a\nlittle somethin new, grand cuz what I am\nis mathematic, I must to blow your static if I can\nI.N.C., Crew I thought you knew\nThat's how you do well check it this is how I do\n\nChorus\n\nVerse Two:\n\nI'm sittin on C-H, R-O-M-E\nSippin Brass Monkey, Digga got the Remi\nMartin I'm startin to feel like I wanna\nHit the strip spot and I think that I'm gonna\nI see my nigga Jose, \"Mida, que pasa?\"\nWe goin to the spot, need a ride?  I gotcha\nSo come on in, come on in, come on in\nIt's like fire when you see my chrome spin\nI paid the valet, I stepped to the stage\nI think I wanna play with the girl in the cage\nLap dance, lap dance, lap dance\nBaby look I got trouble in my pants\nI just checked my wallet, no more dough\nI just paid your rent and now I gotta go\nShe did me till I's done, smooth like Bally\nI walked outside, they said that they ain't got no valet\nSomebody caught me slippin, dipped with my ride\nBut we gonna catch they ass on the B-Side\n\nChorus\n\nI just got paid...\nIt's Friday night...\nI'm sittin on chrome...\nAnd I'm feelin alright...\n\nVerse Three:\n\nYou can't I-N-C me, the\nAce niguh, so be ghost like Amity-\n-ville horror, till tomorrow, you're done\nSo jet like Delta, I'm Fly like the Nun\nMy mental state's, more Great than the Lakes\nI'm Superior, it's Erie how I breaks\nNiggaz down, with the sound as I shine\nOne time, and the chrome is the mind\n\nChorus\n"}