{"rank":"56","song_id":"19381","song_name":"I Hate U","artist_id":"351039","display_artist":"Prince","spotify_id":null,"lyrics":"U have just accessed the Hate Experience\nDo U wish 2 change your entry?\nVery well, please enjoy your experience\n\nI never thought that U would be the one\nAfter all the things that we've been through\nU gave your body 2 another in the name of fun\nI hope U had some baby, if not, boo hoo\nCHORUS:\nIt's so sad but I hate U like a day without sunshine\nIt's so bad but I hate U cuz U're all that's ever on my mind\nHoney, I hate U - Now everyday would be a waste of time\nCuz I hate U\nI never thought that I could feel this way\n2 fall in love was a table reserved 4 fools\nSay U're sorry if U wanna but it's all in vain\nI'm out the door sweet baby, that's right, we're through\nCHORUS\nThis court is now in session\nWould the defendant please rise?\nState your name 4 the court\nNever mind (Billy Jack Bitch)\nU're being charged with one 2 many counts of heartbreaking\nIn the 1st degree\nI don't give a damn about the others\nMy main concern is U and me\nYour honor, may I call 2 the stand my one and only witness?\nA girl that know damn well she didn't have no damn business\nI know what U did, how U did it and uh.. who U did it with\nSo U might as well plead guilty cuz U sure can't plead the 5th\nNow raise your right hand\nDo U swear 2 tell the whole truth\nNot the half truth like U used 2 so help U God?\nNod your head one time if U hear me\nIf U don't, I'll have 2 use the rod\nAnything 2 make U see that uh.. U're gonna miss me\nYeah, U're gonna miss me\nUh, uh, uh, oh!\nIf it please the court\nI'd like 2 have the defendant place her hands behind her back\nSo I can tie her up tight and get into the act\nThe act of showing her how good it used 2 be\nI want it 2 be so good she falls back in love with me\nClose your eyes\nI'm gonna cover your ass with this sheet\nAnd I want U 2 pump your hips like U used 2\nAnd, baby, U better stay on the beat\nDid U do 2 your other man the same things that U did 2 me?\nRight now I hate U so much I wanna make love until U see\nThat it's killin' me, baby, 2 be without U\nCuz all I ever wanted 2 do was 2 be with U ... ow!\nI hate U (I hate U)\nBecause I love U (Because I love U)\nBut I can't love U (I can't love U)\nBecause I hate U (I hate U)\nBecause I love U\nI love U, baby\nI love U {x3}\nI love U cuz U're all that's ever on my mind\nI hate U because I love U\n"}