{"rank":"97","song_id":"19394","song_name":"Danger","artist_id":"289504","display_artist":"Blahzay Blahzay","spotify_id":"49cWIQPU0Pm2D7uNw8zmCb","lyrics":"Put out the word Blahzay has emerged -\nSurged - most preferred from the verbs and words\nI finesse. Try your best\nTo diagnose. When I host\nYou get roast, toast\nBaked, grilled, broiled! When I rumble, you crumble\nMy stuff is good like mondongo soup\nRappers getting soup fronting rugged\nBut I don't plug it, when my sematic hits to your nugget\nAnd expose, you know how it goes when it be gritty\nWhen we roll is like we got the key to the city\nIt won't be pretty\nFor you to challenge, knock you off balance\nBetter reconsider your talent\nYou weasel, you better off pumpin diesel\nI find it feasable your days is over frontin' evil\nShouting to your people trying to bless your spot\nBut we don't believe that cause CBS tells a lot\nOn who got shot and who does all the crime\nDANGER! And you knew it all the time\n\n[Refrain]\nWhen the East is in the house, Oh my God!\nDANGER!\n\nAnd when we're in the house, ain't no time to act sheisty\nCome out a spicy to your ass that is pricely\nCostin', you get baked like Mr. Boston\nBeans in box, you need more strength than just locks\nI rocks hardcore even when I dress suited\nOn some business shit my street is deep rooted\nWhat is this shit?\nRappers want to blossom, but they're all a costume\nThinking we buffoon, I'll tell you soon, you learn the hard way\nTims and blunts going Broadway\nThrough this theater\nHard rocks is getting weirder\nLike Vera from \"Alice\"\nThe East is in your palace\nOn some proper shit and it will never be the opposite\n\n[Refrain]\n\nAnd when we move on your circuit\nYou better pray to who you worship\nThat's recommended, ass kicks come splendid\nLong-winded but I don't need my respiratory\nTo bless my story, you got nothing for me\nFakes been plotting behind doors, they schemin' up\nFor my arrival, rappers are teamin' up\nDo your stuff finize is going to be limpin' MC's\nWhen I plan my rap you be left handicapped\nSweat! gather because I break you no jalopy\nBuilding all heads that be older than your papi\nPack the wind while PF backspin\nTo the essence, you get scarred to my presence"}