{"rank":"53","song_id":"19398","song_name":"Throw Your Set In The Air","artist_id":"299883","display_artist":"Cypress Hill","spotify_id":"5DLTWfzNkhcIIdNLqoVfxf","lyrics":"(Whispered)\n\"Who there, who there.\"\n\"Ahh, Showtime, that's that little young maybe here man. I got all fuck goin' on everyday\nWhat you want man?\"\n\n\"Hey what's up O.G. showtime man?\n\"What's up homes.\"\n\"Hey man, I've been thinkin' man an' I'm-\"\n\"Been thinkin' about what.\"\n\"Hey I'm ready to get put down on this set.\"\n\"You ready to get put down on this set?\"\n\"I'm ready to represent shit\"\n\"On this one right here?\"\n\"Yes baby.\"\n\"You ready to die for this?\"\n\"I'm ready to die for this nigga.\"\n\"What you ready to do ni'\"\n\"An' I'm ready to put in.\"\n\"What you (Whack)ready to do! You ready to (Whack)GET yeah! GET IT! GET\nIT! (Slap!)Hmmm get it! Yeah. Hit 'im! What set you from now, huh?\nWord. What set you from...\"\n\nEvery nigga out there wanna be down with our crew\nSome ain't got enough heart let me ask you\nThis: Would you be down like a soldier\nLoyal an' do everything I told ya\nI can mold ya into a warrior down for you neighborhood\nGlockin' out, do a G with the flavor\nCriminal behavior on the mind\nWhen I got your back You know I got your crack each and every time\n\nThrow your set in the air - Come on!\nWave it around like you just don't care\nThrow your set in the air - Throw it up homes!\nWave it around like you just don't care\n\nIt's time to exit that buster nigga\nGet your hands out your pockets and your finger on the trigger\nLead will fly we don't die we multiply\nThrow your set up in the sky\nI asked you kid 'cause you can't fuck with this\nNigga, when I got the Glock ya better duck quick\n'Cause I ain't havin' it\nIf ya got your gatt You better start grabbin' it, I can handle it\nSoy numero uno Mero mero\nYou know I run with Muggs and the Perro\nFirin' up that heater\nWhen I'm givin' up my set I got my nina-millametre\nLos Scandalous, Killafornia: where I'm from\nDum diddy dum, diddy diddy dum dum\nI'm workin' on your ass now you know where I'm from\nDum diddy dum, diddy diddy dum dum\n\nThrow your set in the air - Come on!\nWave it around like you just don't care\nThrow your set in the air - Throw it up!\nWave it around like you just don't care\n\nThrow your set in the air - Throw up your hood homes!\nWave it around like you just don't care - Come, come on!\nThrow your set in the air - Give it up!\nWave it around like you just don't care\n\n\"Nigga throw your set in the air, nigga you know what I'm sayin', you\nScared, you be takin' your mothafuckin' punk ass to church, 'cause where\nI'm from nigga on the East side, every mothafuckin' day is a job, nigga\nYou gotta handle your business, because if you don't, your mothafuckin'\nGatt will get peeled back! And that ain't no bullshit. If you wanna test\nIt nigga, bring it on nigga, you know what I'm sayin'. Throw your\nMothafuckin' set up in the air.\"\n\nLet me take you to the dark side of the moon\nTell Mama that you won't be comin' home anytime soon\n'Cause I got ya under my thumb nigga, what's that you claimin'?\nBetter be the same set I'm claimin'\nTake a look around, count this amount of soldiers\nWhen I'm chillin' on the eastside of town\nAnd it won't stop 'till I'm done\nDum diddy dum, diddy diddy dum dum\n\nThrow your set in the air - Come on!\nWave it around like you just don't care\nThrow your set in the air - Throw it up!\nWave it around like you just don't care\n\nThrow your set in the air - Throw your hood up!\nWave it around like you just don't care\nThrow your set in the air - Get it up!\nWave it around like you just don't care\n\n\"Yeah, that's right. Straight givin' up the hood all day fool\nCypress Hill mo'fucker what you wanna do? Ah huh. Givin' my shit up in\nYour FACE fool!\""}