{"rank":"81","song_id":"19401","song_name":"Cell Therapy","artist_id":null,"display_artist":"Goodie Mob.","spotify_id":"1rJrDaAVtS9g5ij4T88Rj5","lyrics":"[Verse 1: Khujo]\nWhen the scene unfolds\nYoung girls 13 years old\nExpose themselves to any Tom, Dick, and Hank\nGot more stretch marks than these hoes\nHollin' they got rank\nSee SEGA ain't in this new world order\nDem experimenting in Atlanta, Georgia\nUnited Nations, overseas\nThey trained assassins to do search and seize\nAin't knocking or asking\nDem coming for niggas like me\nPo' white trash, like they\nTricks like her back in slavery\nConcentration camps lace with gas pipes lines\nInferno's outdoors like they had back\nWhen Adolf Hitler was living in 1945\nListen to me now, believe me later on\nIn the future look it up\nWhere they say it? Ain't no more Constitution\nIn the event of a race war\nPlaces like operation heartbreak hotel\nMoments tear until air tight vents seat off despair\nDem say expect no mercy\nFool you should be my least worries got to deal with\nWhere my W-2's, 1099's\nUnmarked black helicopters swoop down\nAnd try to put missiles in mines\n\n[Hook]\nWho's that peeking in my window?\nPOW nobody now\nWho's that peeking in my window?\nPOW nobody now\n\n[Verse 2: CeeLo Green]\nMe and my family moved in our apartment complex\nA gate with the serial code was put up next\nThe claim that this community is so drug free\nBut it don't look that way to me cause I can see\nThe young bloods hanging out at the sto 24/7\nJunkies looking, for a hit of the blow, it's powerful\nOh you know what else they tryin to do\nMake a curfew especially for me and you the\nTraces of the new world order\nTime is getting shorter if we don't get prepared\nPeople it's gone be a slaughter\nMy mind won't allow me to not be curious\nMy folk don't understand so they don't take it serious\nBut every now and then, I wonder\nIf the gate was put up to keep crime out or to\nKeep our ass in\n\n[Hook]\nWho's that peeking in my window?\nPOW nobody now\nWho's that peeking in my window?\nPOW nobody now\n\n[Verse 3: T-Mo]\nListen up little niggas I'm talking to you\nAbout what yo little ass need to be going through\nI fall a victim too and I know I shouldn't smoke so much\nBut I do with the crew everybody on the average 'bout 4 or 5\nI'm lucky to be alive at sunrise now I realize the cost\nAfter I lost my best friend Bean I recognize as a King\nWho am I to tell you to stop smokin\nNow you're open to disease and colds\nAnd ain't 16 years old, this shit has got to stop\nLet's take a walk through detox\nI want outta this hole I'm in a cell under attack\nLoc up folks they in the hood, got an eye on every move\nI make open your face to info you ain't know\nCause it's kept low how the new world plan\nReeks the planet without the black man\n\n[Verse 4: Big Gipp]\nSo what's your angle?\nTry to separate me from the blood\nIs disrespect like coming in my home and not\nWiping your feet on tha rug\nThe Citron Absolut has got me bucking no hang\nWith no phony\nLookout for the man with tha mask\nOn the white pony\nOn my back are bills staying off my toes\nAlways on my heels\nInsane, plain soldiers coming in the dark by plane\nTo enforce the new system by reign\nTag my skin with your computer chip\nRun your hand over tha scanner to buy you dish now\nNo more fishing for your fish\nKiss tha days of tha old days past ways gone\nMind blown, conception, protection\nMy name on your selections but I caught you\nComing POW!\n{​​Use that tool between your two shoulders.... brain.. cell.. therapy}​​"}