{"rank":"72","song_id":"19474","song_name":"Fu-Gee-La","artist_id":"302537","display_artist":"Fugees","spotify_id":"4G4WwlOsBK0UlhdPQM5Axt","lyrics":"We used to be number 10, now we're permanent one\nIn the battle lost my finger, Mic became my arm\nPistol nozzle hits your nasal, blood becomes lukewarm\nTell the woman be easy Naah squeeze the Charmin\nTest Wyclef, see death flesh get scorned\nBeat you so bad make you feel like you ain't wanna be born\nAnd tell your friends stay the hell out of my lawn\nChicken George became Dead George stealin' chickens\n>From my farm, damn, another dead pigeon\nIf your mafiosos then I'm bringin' on Haitian Sicilians\nNobody's shootin', my body's made of hand grenade\nGirl bled to death while she was tongue-kissing a razor blade\nThat sounds sick maybe one day I'll write a horror\nBlackula comes to the ghetto, jacks an ACURA\nStevie Wonder sees Crack Babies Be-Coming Enemies\nOf their own families, what's going on?\nArmageddon come you know we soon done\nGun by my side just in case I gotta rump\nA boy on the side of Babylon\nTrying to front like he's down with Mount Zion\n\n1-Oooh La La La,\n  It's the way that we rock when we're doing our thang\n  Oooh La La La,\n  It's the natural LA that the Refugees Bring\n  Oooh La La La La La La Lalala La Laaah,\n  Sweeeeet Thing\n\nYeah in saloons we drink Boone's and battle goons till high noon,\nBust rap toons on flat spoons, take no shorts like poon poon's.\nSee hoochies pop coochies, for Gucci's and Lucci\nFind me in my Mitsubishi, eatin' sushi, bumpin' Fugees.\nHey Hey Hey\nTry to take the crew and we don't play play\nSay say say\nLike Paul McCartney, not hardly,\nODD-ly enough\nI can see right through your bluff\nNiggas huff and they puff but they can't handle us, WE BUST\nCause we fortified, I could never hide, seen \"Cooley High\",\nCried when Cochise died.\nI'm twisted, black-listed by some other negroes,\nDon't remove my Polos on the first episode.\nHa Ha Ha Ha, You shouldn't diss refugees, and\nHa Ha Ha Ha, You whole sound set's bootie, and\nHa Ha Ha Ha, You have to respect JERSEY, cause I'm superfly when\nI'm super-high on the Fu-Gee-La.\n\n(repeat 1)\n\nI sit 90 degrees underneath palm trees,\nSmokin' beadies as I burn my calories,\nBrooklyn roof tops become Brooklyn tee-pees,\nWho that be, enemies, wanna see the death of me.\nFrom Hawaii to Hawthorne, I run marathons, like\nBuju Banton, I'm a true champion, like,\nFarakkhan reads his Daily Qu'ran it's a phenomenon,\nlyrics fast like Ramadan.\n\nWhat's goin' on\nArmageddon come you know we soon done\nGun by my side just in case I gotta rump\nA boy on the side of Babylon, trying to front like he's down with\nMount Zion.\n\n(repeat 1 twice)\n"}