{"song_name":"1, 2, 3, 4 (Sumpin' New)","artist_id":299639,"display_artist":"Coolio","spotify_id":"0mYAEKWeBayUtsRWAEZhGz","lyrics":"1-1-2-3-4 Get your woman on the floor\nGotta gotta get up to get down\nGotta gotta get up to get down\n\nWhat up everybody so glad you're here\nIt's Coolio with the flow back in your ear\nThis ain't a fantastic voyage\nBut I'm still on a mission to see if I can\nGet your attention\nNow I want drops some information\nJust a little additive to your education\nI live my life by the code of the funk\n600-watt AMP. 18s in the trunk\nWhen I'm on the streets ya gotta feel my beats\nSo throw your hands up if you're down with the C\nDouble O-L-I-O with the flow\nI'm lookin' for the party so let a brother know\n1-2-3-4 it's like A-B-C if hip-hop didn't pay\nI'd rap for free\n\n2-Slide Slide but that's the past\nI gotta sumpin' brand new for that ass\n(repeat 1, 1)\n\nIf ya got beef then fool eat a pork chop\nOnce I get it goin' ya know it don't stop\nI brake like anti-locks panties drop\nFrom hood to hood block to block\nHelp I need somebody\nTo get it goin' on in the party\nBaby you can do it take your time do it right\nWe can drink some yak and do it all damn night\nMy name ain't Wanda but I'll rock your world\nI get more bounce than a Jherry Curl\nToo many lookie-loos be lookin' for clues\nThere's a party goin' on now whatcha gonna do\nSo grab your partner do-see-do\nIf you done know who it is it's Coolio\n(repeat 2, 1...)\n\nPush, push in the bush\nBut don't step on the toes 'cause you might get\nsmushed\nIt's the brother from around the way\nAnd what I say I'm in the corner on three like Dr.\nDre\nComin' at 'em with a pattern and a fresh pair adams\nI hope he don't trip, 'cause\nI don't wanna have to gat 'em\nSo move your body, baby, drive the homies crazy\nThen when you sake that ass it's always amazin'\nAin't no party like a west coast party\n'Cause a west coast party don't stop\nSo when you see a young nigga\nIn a Chevy hittin' switches\nThen ya gotta give a nigga his props\nI got sides in my rides and motion for your ocean\nCoolio got the potion to get the party open\n(rpt. 2, 1...)"}