{"rank":"62","song_id":"19530","song_name":"Keep On, Keepin' On (From \"Sunset Park\")","artist_id":"276854","display_artist":"MC Lyte Featuring Xscape","spotify_id":"42aZFX1bcCDj75ue0KoNSd","lyrics":"B-Boy, where the fuck you at? \nI been looking for you're ass since a quarter past. \nHot peas and butter, baby, come and get your supper. \nBefore I make you suffer That's when you had enough-a \nCan I get hot when you hit the jackpot? \nSurely I can, if you the man. \nI get loose and produce large amounts of juice. \nCan you get used to that or do you need a boost of energy to enter me ang\nget it on. \nYou're gettin' warm. \nI can feel you getting closer. \nNow baby, down this Mimosa. \nYou better believe it's time to give a toast to. \nThe woman of the decade, too bad to be played. \nGet vex and I'm bound to throw shade. \nAll over your body. \nWho's body? \nYou're body. \nI can rock a party like nobody. \nLeavin' time to take home the loot. \nChoosy about who I let knock my boots. \nNow let me take sight while your lovin' the Lyte. \nLife ain't all that unless you're doing it right. \n\nCHORUS:\n\nKeep On' Keepin On, Cause you came and you changed my world. \nYour love so brand new. Keep on keep kickin' on. Doin it right, right,\nright... Ah, ah, ah....\n\nBeware of the stare when I step into peace. \nI come in peace but I got shit that need to be released.\nNow who from the chosen shall I choose? \nYeah, now you wish you was in his shoes. \nI found me a new nigga this year. \nThat know's how to handle this here. \nNow I look forward to goin' home at night. \nBrother does mo right. \nUnder the candlelight. \nWax upon my back, can I handle all of that? \nI guess I can. \nCan I, why not? \nIf I wanna guess I can. Can I? \nMore honey than a bumble-bee hive.\nPulling 69 ways in my archive. \nSweet like licorice. \nSugar for my booga. \nJuicy like Hi-C. Or an Icee. \nI got shit to make your ass write a bad check. \nCause like I said I ain't afraid of the sweat. \nBeat on my drum if you feel the need to.\nAs I procede to  Open up and feed you. \nI got a longing to put you where you wanna be. \nBeen I can, I get rid of all company.\n\nCHORUS\n\nMany have tried strict regulation. \nLazy motherfuckers get put on probation. \nThose that didn't perform well. \nThey gets no answer when they ring-a-ring-a my bell. \nYou're playing with my time. \nTrying to jerk me hurt me then dessert me. \nYou better work me. \nWhile you got the oppurtunity. \nTo be in the midst of the L-Y-T-E. \nOnly the strong survive. \nOnly the wise excel. \nOnce said by my born-in-hell.\nOnly the lonely die slowly. \nLeft all alone try to control me. \nEasy does it never ask how was it.\nNever speak my info why my sheets in the streets. \nCause that ain't cool. And that ain't cute. \nTo talk about who knocked the boots on a video shoot. \nBut it's all good, though you gotta get it when you want it. \nLike your prey, make your move and hop up on it. \nIt's natural. Never be ashamed. \nFuck the fame. Get the name, and kick the game.\n"}