{"rank":"65","song_id":"19548","song_name":"Amish Paradise","artist_id":"431263","display_artist":"Weird Al Yankovic","spotify_id":"6nofbMbadUdrtZmIsBHyYE","lyrics":"[Verse 1]\nAs I walk through the valley where I harvest my grain\nI take a look at my wife and realize she's very plain\nBut that's just perfect for an Amish like me\nYou know, I shun fancy things like electricity\nAt 4:30 in the mornin' I'm milkin' cows\nJebediah feeds the chickens and Jacob plows, fool\nAnd I've been milkin' and plowin' so long that\nEven Ezekiel thinks that my mind is gone\nI'm a man of the land, I'm into discipline\nGot a Bible in my hand and a beard on my chin\nBut if I finish all of my chores, and you finish thine\nThen tonight we're gonna party like it's 1699\n\n[Hook]\nWe been spending most our lives\nLiving in an Amish paradise\nI've churned butter once or twice\nLiving in an Amish paradise\nIt's hard work and sacrifice\nLiving in an Amish paradise\nWe sell quilts at discount price\nLiving in an Amish paradise\n\n[Verse 2]\nA local boy kicked me in the butt last week\nI just smiled at him and turned the other cheek\nI really don't care, in fact I wish him well\n'Cause I'll be laughing my head off when he's burning in Hell\nBut I ain't never punched a tourist even if he deserved it\nAn Amish with a 'tude? You know that's unheard of\nI never wear buttons but I got a cool hat\nAnd my homies agree, I really look good in black, fool\nIf you come to visit, you'll be bored to tears\nWe haven't even paid the phone bill in 300 years\nBut we ain't really quaint, so please don't point and stare\nWe're just technologically impaired\n\n[Bridge]\nThere's no phone, no lights, no motorcars\nNot a single luxury\nLike Robinson Crusoe\nIt's as primitive as can be\n\n[Hook]\nWe been spending most our lives\nLiving in an Amish paradise\nWe're just plain and simple guys\nLiving in an Amish paradise\nThere's no time for sin and vice\nLiving in an Amish paradise\nWe don't fight, we all play nice\nLiving in an Amish paradise\n\n\n[Verse 3]\nHitchin' up the buggy, churning lots of butter\nRaised a barn on Monday, soon I'll raise another\nThink you're really righteous? Think you're pure in heart?\nWell, I know I'm a million times as humble as thou art\nI'm the pious guy the little Amlettes wanna be like\nOn my knees day and night scoring points for the afterlife\nSo don't be vain and don't be whiny\nOr else, my brother, I might have to get medieval on your heinie\n\n[Hook]\nWe been spending most our lives\nLiving in an Amish paradise\nWe're all crazy Mennonites\nLiving in an Amish paradise\nThere's no cops and traffic lights\nLiving in an Amish paradise\nBut you'd probably think it bites\nLiving in an Amish paradise\n\n(Oooooh Ooooooh...yech!)"}