{"rank":"95","song_id":"19597","song_name":"Hoop In Yo Face (From \"Sunset Park\")","artist_id":"431979","display_artist":"69 Boyz Featuring Quad City DJ's","spotify_id":null,"lyrics":"69 Boyz & The Quad City Dj's letting ya know that yall ain't ready! yall ain't ain't ready!\nAin't ready so ya better belive that uhh yall ain't ready yall ain't ready\nSo act like ya know that yall ain't ready yall ain't ready what we gon do\nNow?\n\n[Hook]\nHoop all in yo face gonna hoop all in yo face yeah baby hoop all in yo\nFace gonna hoop all in yo face come on now hoop all in yo face gonna\nHoop\nAll in yo face one time gonna ho-o-o-o-p all in yo face!\n\n[Verse 1]\nSo you wanna go toe to toe but that ain't wise to do now I suggest that\nYou think this through and then go call your crew cause you 'gon need a\nLittle help, a matter of fact all the help you can getcause country folk\nFrom the dirty south ain't the folk to play with. now I'll admit sometimes\nSome folks just understand but on the real it appears to me you gon learn\nFist hand now if thats the deal on how you feel then name the time and\nThe place and me and my crew will be glad to hoop to da hoop all in yo\nFace baby\n\n[Hook]\nYall ain't ready yall ain't ready come on now yall ain't ready yall ain't\nReady so ya better belive that yall ain't ready yall ain't ready yeah baby\nYall ain't ready yall ain't ready one time!\n\n[Verse 2]\nWe ain't tryin to scare ya up yall we lettin' you know that it ain't no\nGames when it comes to the 65 plus 4. cause we take time to do it right\nUh and that there's for sure and once we do it you best belive it's not\nTo be done be no more cause we take pride in dustin' chumps off like it\nNo thang so if you and your little crew still belive yall can hang then\nDo just like I said before and time and the place and me and my boyz do\nThe do heee-oop in yo face\n\n[Hook]\n\n[Verse 3]\nDawg maybe you can explain cause I dont understand how you 'gon\nHang\nWhen you ain't even munch the man sittin' next to the man dont get me\nWrong you still get respect cause we were raised like that to get with\nThis crew and let me tell you it ain't no day like thar now I done said\nAll I'm gonna say and I won't sat nothin' else cause you got the facts\nAnd it's up to you on how you gonna play yourself but if you decide to\nGet with crew you better bring the base cause once we start we ain't 'gon\nStop till you get hooped up in yo face\n\n[Hook]\n\nThe ville wanna (hoop) o-town wanna (hoop) miami wanna (hoop) tampa\nWanna\n(hoop) atlanra wanna (hoop) chi-town wanna (hoop) new york wanna\n(hoop)\nL.A wanna (hoop) dallas wanna (hoop) alabama wanna (hoop) carolina\nWanna\n(hoop) milwalke wanna\n(hoop) memphis wanna (hoop) everybody wanna (hoop) come on now\n\n[Hook until the song ends]"}