{"rank":"91","song_id":"19646","song_name":"Paparazzi","artist_id":"431562","display_artist":"Xzibit","spotify_id":"4wg8lmav4EPBzh1xN2iTpN","lyrics":"[Intro]\nYes, 1996 marks the beginning of a new era\nThe dysfunctional member of the Alkaholiks family\nIt’s Xzibit!\n\n[Verse 1]\nSometimes I wonder if it’s all worth my while\nXzibit stay versatile, with million dollar lifestyle\nAnd I could feel it as a child growing up\nThe niggas that was real\nAnd the niggas that was scared as fuck\nThat's why Xzibit only roll with a chosen few\nYou ain't really real, I can tell when I look at you\nSo ease off the trigger-talk, you ain’t killin' shit\nIt’s not affecting me or the niggas that I'm chillin' with\nI don’t believe the hype or buy woof tickets\nNigga, you make a gang of noise and never seen, like a cricket\nI guess that’s why we never kick it\nA lot of niggas is soft and get tossed tryna fuck with the Likwit\nHow many niggas do you know like this?\nAlways claimin' that they ridin' but they really turned bitch\nIt don’t make sense, either you’re a soldier from the start\nOr an actor with a record deal tryna play the part—like that!\n\n[Hook]\nIt’s a shame, niggas in the rap game\nOnly for the money and the fame (Extra large!)\nIt’s a shame, niggas in the rap game\nOnly for the money and the fame (Paparazzi!)\n\n[Verse 2]\nSee, I don’t need no lights, no cameras; just action, goddamn it\nNever no superstar, I'm more like a planet\nSo my composure is kept while others start to sweat\nEmergin' from the fog with my fucked-up dialogue\nTryna live high on the hog leaves you bankrupt\nAnd niggas you spent it on would not give a fuck\nAnd that’s deep; how deep? It’s deeper than Atlantis\nHome of the scandalous: big bad Los Angeles\nDangerous, vandalous, yo, not to be trusted\nNow, how the fuck is you hard\nNot being scared by the boulevard?\nI'm pullin' that card, and saying \"Gin, mothafucka!\"\nFlowin' like liquid; soak it in, mothafucka!\nI'm breakin' it down, my sound surrounds like death\nFrom the West, puttin' whole counties to the test\nIt’s all in perspective, breaker 1-9 copy\nThis is for the niggas gettin' caught up in the paparazzi\n\n[Hook]\nIt’s a shame, niggas in the rap game\nOnly for the money and the fame (Extra large!)\nIt’s a shame, niggas in the rap game\nOnly for the money and the fame (Paparazzi!)\n\n[Verse 3]\nNiggas smoke stress and cross dress, but I just play the back\nOthers going through schemes and pipe dreams for a contract\nReal tightly rolled, fuck ’em all how I feel\nI made a cool half mill' before I had a record deal\nTherefore you look and stare like it’s magic\nBut too much of anything can make you an addict\nWhenever devils be startin' static, break out the automatic\nI set it off straight, I spread hate, then I vacate\nBut wait! Who dares to cross this path?\nYo, I do you like math, cut with glass, make a bloodbath\nSo on behalf of all niggas I get drunk with\nSmokin' blunts with, I dispose of your punk shit\nHe-he, and keep it all in perspective\nCarbon copies gettin' caught up in the paparazzi\nOnce again, it's the Likwidation crew\nAnd we return at you like this\n\n[Hook]\nIt’s a shame, niggas in the rap game\nOnly for the money and the fame (Extra large!)\nIt’s a shame, niggas in the rap game\nOnly for the money and the fame (Paparazzi!)"}