{"rank":"80","song_id":"19662","song_name":"Shake A Lil' Somethin'...","artist_id":"431856","display_artist":"The 2 Live Crew","spotify_id":"259BAEPWZHcJD4WIdXklm4","lyrics":"\"OK man, are you ready to go?\"\n\"I'm ready to go, now c'mon now, crank this motherfucker up!\"\n\nMr. Mixx:\nYEAH, IT'S YA BOYS BACK IN THE HOUSE!  WE WANT Y'ALL TO GET Y'ASS\nON THE MOTHERFUCKIN' DANCE FLOOR!\n\nBrother Marquis:\nAll you raggedy-ass hoes, GET Y'ASS OUUUUT!\n\nChorus(2x):  Mr. Mixx and Marquis\nPump, pump, pump, get it, get it\nShake, shake, shake, shake a lil' somethin'\nThat's the way (Yeaaaah)\nThat's the way (You go girl!)\n\nVerse 1:  Brother Marquis\nBitch, I wanna see you shake it\nBend on over, butt-ass naked\nNow pump pump pump, get it get it\nI got 135 beats a minute\nIt's your brother, Marquis, callin' all the freaks\nTo show the pink and the booty-cheeks\nStick from the bottom, stick from the top\nShow me a shot, lemme see what you got\nRub that ass and play with that clit\nI'm still with that freaky shit\nOne time for the girls in Georgia\nDetroit, Michigan and Miami, Florida\nThat's how we make our music fast\nCause the girls down South like to shake that ass!\nThey so fine, I can't take it\nThey gots to freak it, they gots to shake it\n\nChorus\n\nVerse 2:  Fresh Kid Ice\nI love the way the girls be shakin'\nEspecially when they butt-ass naked\nBend on over, show me what you got\nCause I'm down for a table-top\nSo work your body, strip left side\nMake me smile, get buck-wild\nCause Fresh Kid Ice got the flow\nAnd now is the time to come get yours\nFreaky shit is what I like\nEspecially when them bitches dykes\nSo shake that ass, and bitch, don't stop\nCome on, girl, just make me hot\nCause I'm down for the 69\nYou better get yours cause I gets mine\nShow what you got; bitch, stop frontin'\nDrop them draws and shake a lil' somethin'!\n\nChorus\n\nVerse 3:  Brother Marquis\nI love to see 'em in lingerie\nTattooed titties and a Boosty-A\nStacked on the back of a cutie pie\nBend over, let me see you do the butterfly\nSo impressin' when undressin'\nYou got me stressin', bitch, stop flexin'\nKeep shakin' that ass at me\nPop that coochie, freak so nasty\nDouble up on the table top\nHit them switches now make that ass drop\nGirl, get wide open\nUp and down with an in-and-out motion\nThem other kings, they ain't did nothin'\nYou wanna get freaky?  Lemme kiss your belly button\nYou're so fine, I can't take it\nYou gots to freak it, you gots to shake it!\n\nChorus\n\n[MM]  To the left...\n[BM]  Yeahhhhh!  Get it get it!\n[MM]  To the right y'all!\n[BM]  C'mon now, pump, pump, pump, pump, pump, pump ...\n[MM]  To the front ...\n[BM]  Heyyyy!  Get it, get it!\n[MM]  To the back y'all!  Make time!\n[BM]  Pump, pump, pump, get it, get it!\n\nChorus"}