{"rank":"97","song_id":"19695","song_name":"Jump On It","artist_id":"279483","display_artist":"Sir Mix-A-Lot","spotify_id":"3G1lmq2hDoJZlemVcJNFK0","lyrics":"Ho, Ho, Ho\n(I know I ain't hear somebody say\nnuthin about hoes up in here, sshhh, ooh lord)\n\nWhat's up Dallas, what's up (x2)\nDallas jump on it, jump on it, jump on it\nWhat's up San Antone, what's up (x2)\nSan Antonio jump on it, jump on it, jump on it\nWhat's up Austin, what's up (x2)\nAustin jump on it, jump on it, jump on it\nWhat's up Houston, what's up (x2)\nHouston jump on it, jump on it, jump on it (Ooh lord)\n\nWelcome to the 2 1 4\nBig B, D Texas\nLet mr. sexes flex this lexus\nAnd this where the cowboys play\nThey battle with my team from the bay\nFrisco\nNow I'm from the northwest\nBut I likes my soul food\nSo I'm calling up an old groove\nAnd I'm a brother with a gut\nSo, hello Keana, can ya take us out to Poppa Doughs\nAnd don't forget about San Antone\nThe last time I went thru\nI took three broads home\nAnd much love love to the brothers in Austin\nAnd the 5 1 2\nI'm flossin in Lawston\nA state that's as big as hell\nAnd I spot two bad ass girls in a tercel\nThey said what's up? And I said whassup? (We're going to Houston)\nAnd I said giddy up, U-turn\n\nWhat's up Phoenix, what's up (x2)\nPhoenix jump on it, jump on it, jump on it\nWhat's up Cali, what's up (x2)\nCalifornia jump on it, jump on it, jump on it\nWhat's up Vegas, what's up (x2)\nLas Vegas jump on it, jump on it, jump on it\nWhat's up Sea-town, what's up (x2)\nSeattle jump on it, jump on it, jump on it (Ooh lord)\n\nWelcome to the 6 0 2\nIt's a 105 in the shade\nAnd I'm sippin on a lemonade\nPhoenix Arizona puts the heat up on ya\nI should warn ya\nThe girls as fine as California\nSpeaking of Cali\nCheck your mack daddy\nHe gots game, and knocks dames from Redding to the Valley\nAnd I can pull'em on a TJ border\nI even knock mr. G's daughter\nAnd come on up to the 7 0 2\nWhere it's legal to gamble, and hoing is too\nThe kinda city I could run wit\nLas Vegas na vi dad, I love it\nBack to the 2 0 6\nDouble up my grits\nAnd Sea-town giving po po fits\nChasing the skirts like a playa supposed ta\n348 roasta HIT IT! (ho, ho, ho... ooh Lord)\n\nWhat's up Atlanta, what's up (x2)\nAtlanta jump on it, jump on it, jump on it\nWhat's up Orlando, what's up (x2)\nOrlando jump on it, jump on it, jump on it\nWhat's up Miami, what's up (x2)\nMiami jump on it, jump on it, jump on it\nWhat's up Tampa, what's up (x2)\nTampa jump on it, jump on it, jump on it\n\nComing thru the 4 0 4\nOlympic summer, Atlanta, so lets go\nCalling up my homeboy Daddy Ray\n(Aiy Ray, what's up with the girls in GA)\nAnd Ray got the situation handled\nWe gonna stack up six deep\nAnd ride to Orlando\nTo the 4 0 7\nCalling up Magic Mike, we rolls in about eleven\nThe gut getta gotta good ol' nine\nThe next dat I gotta mash to the 3 0 5\nI get G'd like I wanna in Miami\nYou undastand me, I put that on my grammie\nAnd swing on up to the 8 1 3\nAround Tampa, I'm dialing up Stephanie\nShe got me polished like chrome\nSittin on a throne\nI'm wore out know, I'm going home (Ooh lord)\n\nWhat's up K.C., what's up (x2)\nKansas City jump on it, jump on it, jump on it\nWhat's up Cleveland, what's up\nWhat's up Cincinnati, what's up\nColumbus jump on it, jump on it, jump on it\nWhat's up Little Rock, what's up (x2)\nLittle Rock jump on it, jump on it, jump on it\nWhat's up Denver, what's up (x2)\nDenver jump on it, jump on it, jump on it (Ooh lord)\nWhat's up Chicago, what's up (x2)\nChicago jump on it, jump on it, jump on it\nWhat's up Portland, what's up (x2)\nPortland jump on it, jump on it, jump on it\nWhat's up St. Louie, what's up\nWhat's up East Side, what's up\nSt. Louis jump on it, jump on it, jump on it\nWhat's up Tacoma, what's up (x2)\nTacoma jump on it, jump on it, jump on it"}