{"rank":"39","song_id":"19738","song_name":"Street Dreams","artist_id":"276998","display_artist":"Nas","spotify_id":"0QnGI4OgY8ReggLWvEXdgD","lyrics":"[Produced by Tracksmasters]\n\n[Hook]\nStreet dreams are made of these\nNiggas push Beamers and 300 E's\nA drug dealer's destiny is reaching a key\nEverybody's looking for something\nStreet dreams are made of these\nShorties on they knees, for niggas with big cheese\nWho am I to disagree?\nEverybody's looking for something\n\n[Verse 1]\nMy man put me up for the share, one-fourth of a square\nHeaded for Delaware with one change of gear\nNothing on my mind but the dime sack we blazed\nWith the glaze in my eye, that we find when we crave\nDollars and cents, a fugitive with two attempts\nJakes had no trace of the face, now they drew a print\nThough I'm innocent til proven guilty\nI'mma try to get filthy, purchase a club and start up a realty\nFor real G, I'mma fullfill my dream\nIf I conceal my scheme then precisely I'll build my cream\nThe first trip without the clique\nSent the bitch with the quarter brick this is it\nFresh face, NY plates got a crooked eye for the Jakes\nI want it all, ArmorAll Benz and endless papes\nGod sake, what a nigga got to do to make a half million\nWithout the FBI catching feelings\n\n[Hook]\nStreet dreams are made of these\nNiggas push Beamers and 300 E's\nA drug dealer's destiny is reaching a key\nEverybody's looking for something\nStreet dreams are made of these\nShorties on they knees, for niggas with big cheese\nWho am I to disagree?\nEverybody's looking for something\n\n[Verse 2]\nFrom Fat Cat to Pappy, niggas see the cat\nTwenty-five to flat, push a thousand feet back\nHolding gats wasn't making me fat, snitches on my back\nLiving with Moms, getting it on, flushing crack down the toilet\nTwo sips from being alcoholic\nNine hundred ninety nine thou from being rich but now I'm all for it\nMy man saw it like Dionne Warwick\nA wiser team, for a wiser dream we could all score with\nThe cartel Argentina coke with the nina\nUp in the hotel, smoking on Sessamina\nTrina got the fishscale between her\nThe way the bitch shook her ass yo the dogs never seen her\nShe got me back living sweeter, fresh Caesar\nGuess, David Robinson's, Wally moccasins\nBitches blow me while hopping in the drop-top BM\nWord is bond son, I had that bitch down on my shit like this\n\n[Hook]\nStreet dreams are made of these\nNiggas push Beamers and 300 E's\nA drug dealer's destiny is reaching a key\nEverybody's looking for something\nStreet dreams are made of these\nShorties on they knees, for niggas with big cheese\nWho am I to disagree?\nEverybody's looking for something\n\n[Verse 3]\nGrowing up project-struck, looking for luck, dreaming\nScoping the large niggas beaming, check what I'm seeing\nCars, ghetto stars pushing ill Europeans\nG'n, heard about them old timers OD'n\nYoung early 80's, throwing rocks at the crazy lady\nWorshipping every word them rope-rocking niggas gave me\nThe street raised me up giving a fuck\nI thought Jordans and a gold chain was living it up\nI knew the dopes, the pushers, the addicts, everybody\nCut out of class, just to smoke blunts and drink noddy\nAin't that funny, getting put on to crack money\nWith all the gunplay, painting the kettle black hungry\nA case of beers in the staircase I wasted years\nSome niggas went for theirs, flipping coke as they career\nBut I'm a rebel stressing, to pull out of the heat no doubt\nWith Jeeps tinted out, spending never holding out\n\n[Hook]\nStreet dreams are made of these\nNiggas push Beamers and 300 E's\nA drug dealer's destiny is reaching a key\nEverybody's looking for something\nStreet dreams are made of these\nShorties on they knees, for niggas with big cheese\nWho am I to disagree?\nEverybody's looking for something\nStreet dreams are made of these\nNiggas push Beamers and 300 E's\nA drug dealer's destiny is reaching a key\nEverybody's looking for something\nStreet dreams are made of these\nShorties on they knees, for niggas with big cheese\nWho am I to disagree?\nEverybody's looking for something"}