{"rank":"39","song_id":"19790","song_name":"Nothin  But The Cavi Hit (From \"Rhyme","artist_id":"276912","display_artist":"Mack 10","spotify_id":null,"lyrics":"(Blaze up)\n{Oh yeah}\nWorld wide, west side\nYo\nMack 10 with Tha Dogg Pound\nYeah, and the hits don't stop {Sucka}\n{Nothin but the cavi}\nHey, Daz {Sup}\nCheck this out, dog\n\n[Mack 10]\n\nNow when I come to ya'll hood, ya'll watch my back\nAnd when ya come to Inglewood I'm a front you a sack\nSo we can grind and get away with the cash like a caper\nCause it ain't about the set-trip, it's all about the paper\nMade the poverty cease, on the rise like yeast\nA parvay lex piece, and I keep my khaki's creased\nMack 10 is the lick, and ya know what my set be\nConnect gang from the west, nigga, where the best be\n\n[Dat Nigga Daz]\n\nIt ain't no questions asked\nYou down to blast for me?\nDown to ride for me?\nDown to die for me?\nI come through for these sucka-ass niggas who rep\nCome creepin up on shorty slowly, show him death\nPull out the Mack 90 automatic for static\nBlast a coupla niggas, leave em all panicked\nWe swirve and hit the curb, smoke some herb\nWe came up too much, and too tough, and too grub\n\n[Kurupt]\n\nWe in the war zone,\nWhere the war's on\nWhere ya gun, nigga?\nShow em where you're from, nigga\nRidin-ass young nigga\nArsenel equipped, hot enough to scorch\nWith the double fours on the hip rollin with the force\nHe's out to catch a body\nTalking, but I thought this was a gangsta party\nNow he's walking around smarter\nNow he's about to see, talking about who's jumpin\nI'm about to get the pump to pumpin and start dumpin on somethin\n\n[Chorus: Mack 10, Dat Nigga Daz (), Kurupt {}]\n\nFuck you over there\n(Party over here)\n{And if you wanna trip, we got the straps near}\n\nCause niggas like us do platnium every year\n(And if I ruled this sphere)\n{Your shit'd disappear}\n\nNow everybody in the house, throw your dubs in the air\nAnd wave em all around like ya just don't care\nWe're ridin dope, so, nigga, act like ya savvy\nMack 10 and the Pound, dog, cookin nothin but the cavi\n\n[Mack 10]\n\nI'm servin niggas like a host with the pound so take a toast\nDog, this west coast and our shit bump the most\nCause vine to vine I swing through the woods of Ingle\nAnd everything I make, fuck around and be a single\nFrom the who bangin hit, to the yes, yes, ya'lls\nNow all down my halls, got plaques on my walls\nWe might slow the roll, sit back and still kick it\nBut the shit don't stop till we hit a meal ticked\n\n[Dat Nigga Daz]\n\nI'll be goddamned\nI'm in it for a meal ticket\nAnd the goal's succesful\nI don't know who to prove a show\nUsual swirve a corner and hit a block back-to-back\nYa'll don't know us like that,\nWhere the gang-banger's hang at\nThey \"Daz, are you a rider?\"\nI reply \"Boy, hell yeah, I'm a rider!\"\nFrom the east side of Long Beach to the west side of Inglewood\nOn a cash mission bailin hood to hood\n\n[Kurupt]\n\nOnce upon a time in the early stages of my life, sacrifice,\nI feel like loose-shakin niggas like dice\nForever in the day\nSay what you say\nOn the mic I display, Philly to L.A.\nI've been all over from Crenshaw and Impearl\nTo 108th, I'm sure Mack got my back,\nIt's all about mashing, cashin heat in the stash\nWhen you're in the neigborhood of assassins\nWhat you say?\n\n[Chorus]\n\n[Outro: Dat Nigga Daz, Mack 10 ()]\n\nWhat do you consider fun? (Pass the bomb, pass the bomb)\nAll day night, and all night long\nWhen you wake up in the morining\nAnd you start to yawn\nAll day night, and all night long\nC'mon, C'mon\n\n(Yeah, dub S.C.G.\nD.P.G.C.\nHa ha ha,\nTake a picture, trick\nTake a picture, trick\nTake a picture, trick\nIt might make ya rich\nWesssydeee,\nBiatch)\nDeath Row"}