{"rank":"62","song_id":"19795","song_name":"Sittin  On Top Of The World","artist_id":"300055","display_artist":"Da Brat","spotify_id":"6NWZkG7pv1raYZB1FVWMKA","lyrics":"You wanna know what the fuck I heard, bitch? \n\nI heard you wanna carbon copy me, \nNot possible to succeed. \nBustin nigga's kneecaps, cuz greed is fuckin wit weed \nGimme more cheddar than Ellie, \nNo Hillbilly from Beverly \nHeavely sedated, still hated and Rated R \nYou the next victim, and if you flinch you fall \nI got that sure shot method Guaranteed to make a nigga pause. \nPeep the Cars I'm in. \nUncountable amount of Benjamin's, Benzes for all my friends \nIf it don't make dollars, you ain't makin no fucking sense \nGet relentless when it comes to stacking chips and shit \nTry to take mine to thy nine be the glory \nUnloaded at the end of the story, \nI'm on top of the world, nigga... \n\nCHORUS: \n\nSittin on top of the world \nSittin on top of the world \nWith 50 grand in my hand \nSteady puffin on a blunt \nSippin hennessy and coke, \nGimme what you won't. \n\nSittin on top of the world \nSittin on top of the world \nWith my legs swingin, jewelry jingling baby \nGo head baby. \nLemme hit you with some real PUMP PUMP \n\nIt's the number one contender \nSo So Def memeber known as Brat \nGirlfriend offender cuz they man's think I'm all that \nKrystal in my lap, chronic chokin me \nNigga's hopin we fall off \nBut we won't, we don't. \nAll we do is keep fuckin it up. \nWhile all you do is keep lookin at us. \nKnown evidence is that I dispense hits \nAnd make more house quakes than Prince leavin mother fuckers dense \nOne of the baddest bitches on the planet. \nAct like you know it's the funk bandit dammit, and you can't stand it. \nYou can run, but you can't hide \nFrom this bad mannered individu-AL Gal from the West Side \nHit em up. \nI can't quick stick like the bottom of an ostrich \nHung in your pants \nHotness from your bull-shit \nAnd it's written all over your face \nYou want my space but ain't got what it takes to take my place... \n\nCHORUS \n\nNow best believe I got more Trix up my sleeve \nThen that silly rabbit \nAll day dream about G's and how I gots to have it \nGotta weed habit, but I'm still on point, \none of the most wanted to rock off somebody's joint. \nIt be the B-R-A-T, the mind blower, \nThe rough rhyme thrower, mother fuckers can't see \nRiding drop top roadsters, fuck all that gold stuff \nOnly Triangles dangle when I bust. \nYou see, niggas round town called this and that, \nSaid I sound like the pound and my shit was wack. \nDropped the album Funkdafied and they thought it was bold, \n30 days later, the LP went gold, and I'm... \n\n"}