{"rank":"56","song_id":"19797","song_name":"Da  Dip","artist_id":"302429","display_artist":"Freak Nasty","spotify_id":"2h2V4peAb0UQDMBAP2H9Ys","lyrics":"Intro:\nThis goes out to all the women in the world, especially her.\nYou know it don't even matter your age; it don't even matter your color.\nYo, fellas, I ain't forgettin' 'bout y'all.\nThis is for everybody who like to dance.\nJust listen to what I'm sayin' and do it, and take a chance.\n\nChorus\nI put my hand upon your hip, when I dip, you dip, we dip\nYou put your hand upon my hip, when you dip, I dip, we dip\nI put my hand upon your hip, when I dip, you dip, we dip\nYou put yours, and I put mine, and we can dip down low and roll and grind!\n\nVerse 1:\nJust get on the floor like I said befo'\nY'all remember that \"Down Low\"!\nJust put a little dip wit' it,\nNow roll those hips wit' it\nPop it, push it, rock it, roll it\nCan't control it? I'll come hold it\nIt's all in fun so take a chance\nJust get on the floor and do that dance, y'all\nI know you like this so, don't try to fight it\nTurn around, baby, let me see you from the back\nYeah, I like it like that\nGet up now, roll those hips,\nDrop down, double-up on those dips\nFreak Nasty wanna see,\nCan y'all do this right here for me?\n\nChorus\n\nVerse 2:\nBack again with the second verse\nIt's all clean, so I'm not gonna curse\nDroppin' bass like a bad habit\nLove all women, 'cause I gotta have it\nComin' at y'all in stereo\nI'm ridin' that thing like a rodeo\nHang on, baby, 'cause the ride is rough, and ...\n[Don't stop till you get enough] {OOH!}\nI got my girls in the front\nNow a lady just bumpin' that rump\nRaise it up, let me see that brown\nSlap it, girl, make it jiggle around\nRound and round that rump goes\nWhere it stop, yo, no one knows, yeah\n\nCLICK ABOVE TO VISIT OUR SPONSORS\n\nFreak Nasty wanna see,\nCan y'all do this right here for me?\n\nChorus\n\nWell alright, y'all! If you ain't dippin', you must\nbe trippin'! If you ain't doin it Down Low, you gots\nto go! To the people thats movin' slow to the\ndance floor! Yo DJ! Pump it up some MO-O-O-O .....\n\nVerse 3:\nIt's off to the show in a limo\nBefore the show, I gotta get that dough\nPay them girls what they're worth,\nSlip that money under that skirt\nTake it off, baby, let me see\nYou might get a lil' mo' lucci\nG-string havin' oh so much fun\nPlayin' inside, between them buns\nShortie got it on like Marvin\nTeasin' me and you know I'm starvin'!\nLick you up, then lick you down\nI ain't finished; girl, turn around!\nLick you up and down your back\n'Cause I'm that freak, I'm freaky like that!\nFreak Nasty wanna see\nCan y'all do this right here for me?\n\nChorus\n\nVerse 4:\nI'm settin' it off to another level\nYou're diggin' Freak Nasty without a shovel\nThis is my world; I'm just a squirrel\nTryin' to get a nut, so wassup?\nYo, DJ, when the party's getting slow\nJoin this jam on and watch that floor\nGet taken over like in '94,\nWhen I had the whole world gettin' Down Low\nNew Orleans born, ATL livin'\nFreak Nasty's what I'm givin'\nMy juice is sweet like Georgia Peaches\nwomen suck it up like leeches\nUh-huh, if you're so good,\nYou must admit you like this shhhhhhhhhh\nYeah, y'all know the song\nSo come on won't you sing it with me?\n\nOurto (repeated till fade):\nI put my hand upon your hip\nWhen I dip you dip we dip\nYou put your hand upon my hip\nWhen you dip I dip we dip\n"}