{"rank":"96","song_id":"19828","song_name":"Whateva Man","artist_id":"364794","display_artist":"Redman","spotify_id":"0pSaDwrMLM7F82LWJg9v6s","lyrics":"*woman moans*\n[E Dub] Microphone check one two\n        Aiyyo, you ready to get down man?\n[Red]   Yo, whateva man\n[E Dub] You ready to get drunk as fuck?\n[Red]   Whateva man\n[E Dub] You, you sayin somethin?\n[Red]   Whateva man\n[E Dub] Aiyyo\n[Red]   Whateva man\n[E Dub] Check it, Kool V\n\n(I keeps it bangin, keep it swangin\n Mike type of sangin)  Ohh-la-la-la!  (So what cha sayin)\n\nVerse One: Redman, Sermon\n\nYo, I'm smokin herbals till it hurts you\nI keep your daughter way out past her curfew\nHard far from commercial\n(So what cha mean nigga)\n        We don't give a fuck when we smoked out\n        In the land that's doped out [it's like that?] no doubt\n        From this bomb weed, I cock from the streets\n        Get you open like buttcheeks, from girls who be freaks\n        Aiyyo, can I be SWV?\nYou the One nigga\n        Rap Shogun, yes E the one\nYo, I'm rollin with a forty pack of niggaz\nGet my weed from Branson cause his sack's bigger\nYo give me dap nigga\nWhat I clap lyrically tap call back\nFerocious causin comatoses to collapse\nSo chinky eyed I see people wavin on a map\nI make it hotter than your thermostats (beep beep beep beep)\nBomb MC's with rough megahertz so call me\nFunk Doctor verbal starburst, lyrical expert\nYour boombox better form a union\nCause I leave your circus overworked, word bond\nNiggaz front like they want it\nBut I be in the five hundred with E steadily gettin blunted\nDamn nigga you cool at what you spittin\nSo why you holdin the blunt so long politickin\nHuh, I ace them blunts with the technician\nof electrician, I don't got a pot to piss in\nBut still spend my last on hyrdroglycerin\nI keep it live no jive rollin Dutches\nthat's Masters like the Furious Five\nI, keep your crew chinky eyed, for bitches actin dog\n(Can you hit it from the back?)  Why not, while we toke on this\n\n*woman moaning* (ohhh daddy... aiyeee)\n[Sermon and Red harmonizing]\n\n[Red]   Yo, you ready to roll this weed up?\n[E Dub] Whateva man\n[Red]   You ready to knock this nigga out?\n[E Dub] Whateva man\n[Red]   Yo, you ready to get this chedda?\n[E Dub] Whateva man\n[Red]   You ready to start this shit off?\n[E Dub] Whateva man\n\nVerse Two: Redman\n\nI smoked with a lot of college, students\nMost of em, wasn't graduatin and they knew it\nYou know the weed slang?  Yeah boy I speak it fluent\nI light your college dorm with my entourage from Newark\nBigger they come, harder they fall\nThat goes for, knuckleheads, MC's, pussy walls and all\nI lit my first L before I started to crawl\nI got my ass whupped when I had my first brawl\nBut things changed since I was twelve years old\nI specialize in wreckin mics and area codes\nNow, PPP the kinda niggaz that'll bug witcha\nSmoke bud witcha, later on stick a sluginya\nEverything that's like green ain't the bomb bitch\nI got different forms to make you lose your calm bitch\nRead my lips, you ain't hittin unless you got\nTen on it, get on it, or get the fuck out my cypher\n\n[Red]   You ready to roll this weed up?\n[E Dub] Whateva man\n[Red]   You ready to rob this niga?\n[E Dub] Whateva man\n[Red]   You ready to fuck bitch?\n[E Dub] Whateva man\n[Red]   You ready to guzzle this liquor?\n[E Dub] Whateva man\n\n"}