{"song_name":"Here's Your Sign (Get The Picture)","artist_id":"null","display_artist":"Bill Engvall With Special Guest Travis Tritt","spotify_id":"7BDQ7lfI6JBLDr7ucZcScv","lyrics":"Bill Engvall: Intro\nI just hate stupid people\nThey should have to wear signs that just say I'm stupid\nThat way you wouldn't rely on them, would you?\nYou wouldn't ask them anything. It would be like, \"Excuse me...oops Never mind, I didn't see your sign.\"\nIt's like before my wife and I moved from Texas to California our house was full of boxes, there's a U-Haul truck in our driveway. My friend comes over and says, \"Hey, You moving?\"\n\"Nope, we just pack our stuff up once or twice a week. Just to see how many boxes it takes. \"Here's your sign.\"\n\nTravis Tritt - Chorus:\nWhy can't they get the picture, why don't they understand?\nWe're not dealing with the planet of apes, we're talking about the modern man\nSo you people with them itsy bitsy teensie weensie tiny minds, here's your sign, here's your sign\n\nBill Engvall:\n\"Last time I was home I was driving around, had a flat tire.  I pulled into one of these side of the road gas stations. The attendant walks out, looks at my truck, and I swear to God he said \"Tire go flat?\" I couldn't resist. I said nope, I was driving around and those other three just swelled right up on me, here's your sign\n\nChorus:\n\nBill Engvall:\nI was watching one of those animal shows on the Discovery Channel, there\nWas a guy inventing a shark bite suit. There's only one way to test that...\"Alright Jimmy, you got that shark suit on, it looks good...Now, they want you to jump\nInto this pool of sharks, and you tell us if it hurts when they bite you.\" \"Well alright, hold my sign, I don't wanna loose it.\"\n\nChorus:\nWe were trying to sell our car about a year ago, a guy come over to the house, drove the car around for about forty-five minutes. We get back to the house, he gets out of the car, reaches down and grabs the exhaust pipe, then goes, \"Damn, that's hot!\"\nSee...If he'd been wearing his sign, I could have stopped him\n\nChorus / Ourto"}