{"rank":"99","song_id":"19889","song_name":"Hip-Hopera","artist_id":null,"display_artist":"Bounty Killa featuring the Fugees","spotify_id":null,"lyrics":"Artist: Bounty Killer w/ Fugees\n\n \n\nIntro, Chorus:\n\nMichael Jackson brought you Thriller\n\nIt made all the gun-man hollar\n\nMack 11 guard your grilla\n\n \n\nFirst verse: Lauryn Hill, Bounty Killer\n\n( Lauryn )\n\nWhy you gwan, watch out for Babylon, MC's babble on and on I phenom,\n\nbomb like Ethiopians, not Italions, Queen Asheba, balance like a Libra,\n\nrain like meteor storms, that change forms like the pillars of Islam,\n\nmake the best rule, and fuck the rest who'll, it takes one drop of\n\npurity to clean the cess pool, the next crew, will be comprised of kings\n\nand queens wearing crowns and holiday scepters, facing Mecca, making\n\nrecords, raiding biblio-techas, I sip nectars with gods in the\n\nstreetapparel, keep the path straight and narrow while we bombin' on\n\nPharaoh, so Bounty Killer pour the sorrel let's make plans for tommorow,\n\n \n\n( Bounty Killer )\n\nCause if it's down a Sodom and Gommorah Refugees we nah go so\n\n \n\nChorus\n\n \n\nSecond verse: Bounty Killer, Wyclef\n\n ( Bounty Killer )\n\n So talk weel if you vex, try and jump in a mi chest, you Mr. Punk, well\n\ncome and do your next best, mi end you distress, mi lay you to rest,\n\naskel 45, Fugees dem tech.  Well talk well if you vex, try and jump inna\n\nmi chest, you Mr. Punk, well come and do your next best, mi end you\n\ndistress, mi lay you to rest, rappers from the east and rappers from the\n\nwest, well\n\n( Wyclef )\n\n Yo, five years old I heard shots out the window, I thought that it was\n\nZorro, driving in from Mexico, I asked my father Pablo who the hell is\n\nthis Paco, he said It's Bounty Killer, He's driving in from Montego.\n\n( Bounty Killer )\n\nThat's when shots start to echo from yah so and from deh so, well that\n\nis the life of a nigger from the ghetto, moving 40 kilo, from here to\n\nPuerto Rico, smoke my manifico, but i never do perico.\n\n( Wyclef )\n\n Yo, this is a sound clash, you ain't fit for the job, you're vagina,\n\nand you're making my cock hard, you wanna rap, here's presents, go rap\n\nit in a box, you versus me is like a mouse versus a ox, Wyclef,\n\npreacher's son, I sing a hym the lights get dim, reflection of the end,\n\nis your face facing a coffin, oops, to abstract so you kill me with\n\ngaps, figments of your imagination, you never delt with incarceration.\n\n( Bounty Killer )\n\n Thought i heard you want to be my rival, askel 45 a it a idol, them\n\nstart war end no seek survival, Refugees we gonna treat them\n\ndetrimental, Punks, fools.\n\n \n\nBridge: Wyclef, Bounty\n\nAnother sound boy dies, slow deth, Refugee Camp, Bounty Killer......\n\n \n\nChorus\n\n \n\nThird verse: Praz, Wyclef, Praz, Bounty Killer\n\n \n\n( Praz )\n\nThrough the temples of doom somehow we managed to bloom like blossoms,\n\nby any means necessary said Malcolm, nights before battle we play dead\n\nlike possums, mimimizing our losses like caution to the maximum,\n\nstratiges for the Refugees, how many mics do you trip, I say not to many\n\n \n\nYo, which man runs from my magnum,\n\n \n\nHaitian shot a man\n\n \n\nThem blame Jamaicans\n\n \n\nChorus\n\n \n\n( Bounty Killer )\n\nYeah, yeah yeah.....\n\n \n\nOutro: Bounty Killer, Wyclef\n\nWell talk well if you vex, try and jump in a mi chest, you Mr. Punk,\n\nwell come and do your next best, mi end you distress, mi lay you to\n\nrest, askel 45, New York gun take, well talk if you vex, try and jump in\n\na mi chest, so Mr. Punk, well come and do your next best, mi end you\n\ndistress, mi lay you to rest, askel 45, California take, well, well\n\n( Wyclef )\n\n Bounty Killer on the borderline, Refugee camp, Wyclef, L. Boogie,\n\nPrazwell and it don't stop."}