{"rank":"48","song_id":"19956","song_name":"We Trying To Stay Alive","artist_id":"431541","display_artist":"Wyclef Jean Featuring Refugee Allstars","spotify_id":"4wwRROf47MXBX5u5Knwixx","lyrics":"[Intro: Wyclef Jean]\nWe got the Refugee Allstars rub-a-dubbing in the club\nWyclef Jean, John Forte, Praswell\nNah mean, the streets are getting a little crazy\n\n[Verse 1: Wyclef Jean]\nLooka looka looka looka looka\nLooka looka looka here looka shorty got back\nShould I ask her for a dance? Hold on -- there's too many in the wolf pack\nAnd besides, Dirty Cash talking to her\nBuying her fake furs and taking her to The Fever\nQuiet as it's kept, that ain't even his Benz\nShe spends his Franklins at the malls with her friends\nMaterial girl, living in a material world\nBut it's all right cause it's Saturday night\nSo mister funkmaster, pump the Bee Gees\nAnd all you college students, play your Ouijas\nCheck the spelling: r-e-f-u-g-e-e, get the CD from Sam Goody, hee hee!\nYou ain't even close with the rhymes that you wrote\nDon't be mad cause you broke\nLet me clear my throat -- ah huh ah huh\nJohn Forte, grab the mic, let's sway this way\n\n[Verse 2: John Forte]\nI'm more than just a rhymer, you still a small timer\nHoping that the game treat that ass a little kinder\nEvery step tango'd\nYour beef don't concern me\nI'm eating mangoes in Trinidad with attorneys\nMy crew's slang flow worldwide like a current\nWith the every spot where nobody got insurance\nBrother, do the math -- you ain't half near exotic\nMy man's claim true; you -- forget about it\nPo-po just a nuisance, like my influence\nWell, recognize you a lie trying do it\nGot juice—told your lady\nOops! We Nutz Baby\nSmooth and charismatic, automatic\nYou gonna save me\nGod bless the day that my sons survive\nWe strive to teach the youth, baby, and stay alive\n\n[Verse 3: Pras]\nWell, you can tell by the way I roll, shorty, that I'm a ladies man\nA business man\nCondos down the shore\nMulti-million pension plan\nBut it ain't in my plan to make moves without the fam\nI keep it intact\nYo 'Clef, do the track\nJohn, play the mack while I pay the tax\nBusiness as usual\nWatching suspects steal my assets\nGet cut with Gillettes\nWe built this concept, connect like NYNEX\nDrinks at the bar, my American Express\n\n[Interlude: Wyclef Jean]\nYo I cook up cook up\nThe copper pull up pull up\nThen I cuff up cuff up\nYou who's calling bluff\nNow you shook up shook up\nCause you lock up lock up\nWhen I love up love up\nYou who's calling bluff\n\nHey yo, John is chilling\nDirty Cash dealing\nWhat more can I say, we living\nThat's what we got, we got it good\nAnd since you understood\nWe be...\n\n[Outro: Pras]\nYeah\nLive at the Carnival\n97 till infinity\nHa\nRefugee all-stars\nCan't stop the shining, can't stop the shining\nYou wanna stop the shining? You wanna stop the shining?\nCan't stop the shining, can't stop the shining"}