{"rank":"4","song_id":"19963","song_name":"Look Into My Eyes (From \"Batman & Robin\")","artist_id":"296202","display_artist":"Bone Thugs-N-Harmony","spotify_id":"4Ko8agkl6zgG3IhzjShRqa","lyrics":"[Intro: Krayzie Bone]\nWe thuggish ruggish niggas always, always\nAnd ready to bring the war up your way, if you hate\nWe thuggish ruggish niggas always, always\nAnd ready to bring the war up your way, if you hate\n\n[Chorus]\nLook into my eyes and tell me what it is you see in me\nWould you look into my eyes?\nLook into my eyes and tell me what it is you see in me\nCould you tell me what you see?\n\n[Verse One: Bizzy Bone]\nComin' through the door with my militia, why do they bring big niggas?\nFuck y'all, with a gang of bodyguards\nMy niggas is stone cold killas, peelas\nSteppin' out the limos the bitch soldiers maintain\nGivin' my babies all of my money, but my diamonds steady be shinin'\nMy gang, you know me. Homies got mo' love\nAnd I'm blessed, when I'm outta my sentence\nPump my fist to Mo Thug, gotta keep the Lord up over my shoulders\nJesus sent me his roll or loco, sober, load a revolver, hold up\nNow, buck 'em all to Hell, cause I'm showin' 'em\nAnd I seen that the bulletholes was too much, no luck\nYa get blowed up, all of you niggas goes out\nThe surgeons say that your body can not be sewed up\nHold up, and wait a minute\nIt's time for Bone Thugs, cause y'all think that you can really hate, nigga\n\n[Chorus]\nLook into my eyes and tell me what it is you see in me\nWould you look into my eyes?\nLook into my eyes and tell me what it is you see in me\nCould you tell me what you see?\n\n[Verse Two: Krayzie Bone]\nWhat makes a nigga think he can bite my shit and call his shit original?\nWhat's worse, tellin' people you made the style we put down three fuckin'\nYears ago\nAnd that's just like a nigga wanna take all the credit\nI bet it didn't even occur that we would eventually meet with ya, kid\nDon't crash, collide, lock up with the enemy\nAnd I don't wanna say a nigga's name and all that\nBut a y'all fin to get stomped, let 'em loose\nAnd they heard the news, ya run up, ya could get dead, oh\nUh-huh, hey, we murder muthafuckas in a deadly way -\nFully automatic when we let 'em lay\n\"Aw shit! Get down, Leatherface.\"\nFuck 'em all, if I can't get my respect\nCome on, now, put them to rest\nWhat a bloody, bloody mess, but nevertheless, we won't stress\nI figured this platinum got you actin' like you got to be me\nIt's all in your mind, but in time, you'll find we as real as we speak\n\n[Chorus]\nLook into my eyes and tell me what it is you see in me\nWould you look into my eyes?\nLook into my eyes and tell me what it is you see in me\nCould you tell me what you see?\n\n[Verse Three: Layzie Bone]\nAll I see is this soldier, pistol in holster, givin' you the most\nI toast to them thugs\nNigga, nothin' but the love of bud that we brought to the table\nAnd a nigga wanna test, catch slugs, put 'em in the mud\nHarmony smooth with the thug shit, mo murda to the fools that clone\nFive niggas loc'd out with the roughness, nigga\nAnd it's war when you craft these Bones we can get it on\nAnd I'm referrin' to all of y'all bitches\nY'all know who y'all are when y'all tried that\nRollin' with the E since ninety-three, shuttin'\nShit down in the industry, nigga, can you bite that?\nI know y'all niggas wanna roll with pros, and make friend of foes\nBut we chosen - God done blessed us with His potion\nPure devotion, freely spoken, baby\nNiggas can't see us never, stay together, my click too clever\nRidin' through the days of the stormy weather\nRemember: eternal, it means for everlastin'\n#1 Assassin blastin', bashin' on all you niggas's what I'm doin'\nAll of the heavens gonna be rulin' trues, when He come\nWe won't be losin', provin' 'em wrong\n\n[Chorus]\nLook into my eyes and tell me what it is you see in me\nWould you look into my eyes?\nLook into my eyes and tell me what it is you see in me\nCould you tell me what you see?\n\n[Verse Four: Wish Bone]\nI see five killa realer niggas ready to roll wherever I go\nTrue to pull the trigger, smother a nigga, put 'em in a river\nWe the killas, and that's for sure\nNiggas out there clownin' mine, you can't rhyme, the style you got is all mine\nAnd when I see you, bitch, I'm goin' in your pockets double-time\nAnd it's like that, you don't want that\nCome and get some pap, pap. Wanna sound like?\nWanna be like? Nigga, we can't have that\nWhy a nigga wanna bite the Bone shit? Platinum raps\nNigga bet that bitin' shit ain't doin' nothin', tryin' to make somethin'\nOutta nothin'\nFuck it, let's peel caps, buck 'em all down\nPut 'em in check, fuck 'em up with the 44 mag, I'm glad\nCause when you're fuckin' with Bone, we sendin' 'em home in a bodybag\nNow, look into my eyes, bet you see a realer killa thug puttin' it down with\nHarmony, harmony\n\n[Chorus]\nLook into my eyes and tell me what it is you see in me\nWould you look into my eyes?\nLook into my eyes and tell me what it is you see in me\nCould you tell me what you see?\nLook into my eyes and tell me what it is you see in me\nWould you look into my eyes?\nLook into my eyes and tell me what it is you see in me\nCould you tell me what you see?\n\n[Outro]\nBone thugs, bone thugs, bone thugs..."}