{"rank":"53","song_id":"20032","song_name":"Big Bad Mamma (From \"Def Jam's How To Be A Player\")","artist_id":"1496750","display_artist":"Foxy Brown Featuring Dru Hill","spotify_id":null,"lyrics":"Fox] Ahh, Trackmasters\nMy boo\n[Dru] Dru Hill, Foxy\n[Fox] Right\n[Dru] Ill na na na, Na Na\n[Fox] Na Na, uhh, that's the shit\n\nVerse One: Foxy Brown\nPlaya haters ery minute wanna stop my dough (uh-huh)\nAnd every other minute wanna rock my flow (you know)\nAnd every third minute, y'all wanna swerve in it\nCome quick like a virgin in it... aowwww!\nSo far, came through this year with no bra\nSheer shirt, shakin my Na Na, this head hurt\nGot em strung, let em know I'm like a Icee\nFor the best effect you got to use your tongue\nFind my G-Spot get me hot I'm ill\nFoxy, chocolate baby, Got Milk?\nShake that ass like you just don't care\nCause y'all just rookies to begin, what?\nWork niggas, like you one of the live niggas\nFly niggas, known to handle a pie nigga\nChick in a, off white pearl sticks\nOn the cellular, gettin them open like Girl 6\nIt's on\n\nChorus: Dru Hill (with variations)\nShe's a bad mamma jamma\nJust as Foxy as can be (as Foxy as can be)\nHeyyy, she's a bad mamma jamma\nJust as Foxy as can be (as Foxy as she can be)\n\nVerse Two: Foxy Brown\nPlayer haters ery minute wanna see your clothes (uh-huh)\nThen every other minute wanna know what you drove (uhhh)\nThen every third minute, wanna know if the fur's rented\nThat's why I got no time for hoes\nIt's the Brown Fox, surround blocks, sound nice\nSee me dressed, D-B-S, Brown rocks\nSee me just, play the low pro\nGot these rap chicks in a chokehold, biotch!\nBasically, you're wastin your time hatin me\nI'm like one point five, got to make it three\nMy name will forever ring\nGot em screamin \"Damn Fox!\" on erything, hell yeah\nFor the paper rip a hot draft\nOnly for the right dough shorty got that?\nStill in here\nI'll be down when you're goin broke, Ill Na Na\nMaster Tracks like Tone and Poke, and it's on\nChorus\n\nVerse Three: Foxy Brown\nPlaya haters ery minute wanna shit on wax (uh-huh)\nThen every other minute talk behind your back (uh-huh)\nThen every third minute wanna rock you Venice and Bourbon\nNah I ain't got time for dat... that's why\nI fakes no jacks, I got chips to gain\nI'm like Bo Jack baby, I'm hip to the game\nI know it well, rock Perotta over Chanel\nA H-Class hoe with the H. Findel\nRhyme deep in footwear, via Spiga\nLike Aaliyah, One in a Million\nThere's MC's in this rap shit comin in illin\nLike I did, laid the groundwork for five hits\nMember when I told y'all first week out\nShipped a half a mil, niggas freaked out\nLove yourself, put no one above thee\nCause ain't nobody gon' f*ck me like me, it's on\nChorus 2X\nDru Hill sings a bunch of na na na's and YAHOO!'s"}