{"rank":"56","song_id":"20044","song_name":"After 12, Before 6","artist_id":"277969","display_artist":"Sam Salter","spotify_id":null,"lyrics":"It's the remix\nSam Salter\n\n[Repeat 5x]\nGet your back up off the wall\nDance, c'mon\n\n[Repeat 2x]\nHow you gon' leave if you didn't give Sam a dance?\nGet your back up off the wall\n\n[Repeat 2x]\nYou wanna get up?\nWell then you gotta get down\n\nI heard the phone ring it's you\nTellin' me all I do is neglect you\nThe first thing that I don't wanna say\n\"You know I've been workin' hard all damn day baby\"\nI don't give a damn what your friends say\nCus you know they all want me anyway\nYou know that I'll be true to you\nMy love can't start until you get down\n\n[Hook x2]\nGet down on it, after 12 baby\nGet down on it, before 6 lady\nGet down on it, if you really want it\nGet down on it, get down on it\n\nAnd now that 12 o'clock is here\nI wanna please you and I'm being sincere\nThe rest of the night is yours and mine\nWe're gonna chill, relax and unwind baby\n\nI go to work tired each and every day\nCuase I spent the night before pleasin' my babe\nYou know that I am true to you\nBut love can't start until you get down\n\n[Hook]x1\n(Shekspeare)\nMe and my man, we make you all dance\nHow you gon' leave without my man Sam?\nWe can rock a party 'til the early light\nIf you come after 12 then it's on tonight\nHe gets props from coast to coast\nAnd if you gotta shorty, he'll love you both\nMy man Sam brings flav through the air\nRemix style for real, Jon and Shekspeare\n\n(Tricky)\nYa ni**a's try to front, like the red ain't crunk\nBut you keep it in the trunk cause you know it bumps\nThen you take it to the crib where your girl lives\nThen you set the mood right and you handle your biz\nAll night, every night, all the cuts you like\nWhen the crew, they bite but it ain't as tight\nIf you wanna be a baller, shot caller\nThen I guess you wanna be Sam Salter\n\n[Hook]x1\n[Repeat 4x]\nGet your back up off the wall\nDance, c'mon\n\n[Hook]x1 to fade"}