{"rank":"27","song_id":"20062","song_name":"I Miss My Homies","artist_id":"309928","display_artist":"Master P Featuring Pimp C And The Shocker","spotify_id":"53nmK2ARfSnBFvhYXxmgGc","lyrics":"I want ya'll to play this at funerals in the hood.\nTil all this black on black crime stop.\nSome say the blind lead the blind.\nBut in the ghetto you never know,\nWhen it's gon be yo time.\n\n[Sons of Funk, Mo B. Dick, O'dell]\nSittin at the ghetto thinkin bout\nAll my homies passed away (uuunnnggghhh!)\nCandy painted cadillacs and triple gold\nThat's how me and my boys rolled\nHow could it be?\nSomebody took my boy from me\nMy best friend's gone\nAnd I'm so all alone\nI really miss my homies\nEven though they gone away\nI know you in a better place\nAnd I hope to see ya soon someday\n\n[Master P]\nI used to hang with my boy even slang with my boy\nUsed to bang with my boy, goddam I miss my boy\nWe started out youngstas in the park throwin birds\nIn your hearse, damn it's sad to see my nigga in the dirt\nThe game got me workin, got me perkin, never jerkin\nStill blowin dolja fo ya cause I know you up there workin\nYa little baby's cool and ya baby's mama straight\nBut today's a sad day to see the t-shirt with ya face\nFrom the cradle to the grave, from the streets we used to fall\nIn the park you liked to ball, put yo name upon the wall\nIn the projects you's a legend on the street you was a star\nBut it's sad to see my homeboy ridin in that black car\nA lotta soldiers done died, a lotta mothers done cried\nYou done took yo piece of the pie but you was too young to retire\nWhy soldiers ride for yo name leave it vain\nSome Gs never change, damn they killed you for some change\nSmile for my homie Kevin Miller my boy Randall\nThe ghetto persons that lost they loved ones to these ghetto scandals\n\nTake a minute to smile for the dead (uuunnnggghhh!)\nSmile for the dead (RIP 2Pac, Makaveli)\nAll my homies who done made it to the crossroads\n(Biggie Smalls)\n\n[Sons, Mo B. O'dell]\nHow could it be?\nSomebody took my boy from me\n(It's like I can't believe you gone)\nMy best friend's gone\n(Sometimes I feel like I can't go on)\nAnd I'm so all alone\n(Everytime I see something you done left\nI really miss my homies\n(It just remind me, more and more of you, dawg)\nEven though they gone away\n(I just keep reminiscin)\nI know you in a better place\n(Cause I know you alright)\nAnd I hope to see ya soon someday\n(And I keep smilin, knowin I'm a see you in the crossroads]\n\n[Pimp C]\nWe used to grip on the grain and flip them candy toys\nBut I'd give up all that bullshit if I could get back my boy\nOff in the club smokin weed til 3, hollerin at the hoes\nSpendin $4000 on me on gators and clothes\nWhen I turned to rap, he had to chase the game\nNigga told me, \"C, leave that dope, cause rappin is yo thang\"\nI ain't gone even lie, some nights I ride and cry\nWonderin why the real niggas always the ones to die\nSo I just smoke my weed and try to clear my mind\nI wish that I had the power to turn back the hands of time\nI wonder if there's a heaven up there for real Gs\nFor all the niggas in the game that be sellin keys\nI keep my memories, try to keep my head strong\nBut baby it's hard to be strong, when yo main homie gone\n\n[Sons, Mo B. O'dell]\nEven though you gone away\n(Even though you gone, you ain't never gon be forgotten)\nI know you in a better place\n(Cause as long as I'm here\nYou gon live through me and other TRU playas)\nI really miss my homies\nEven though they gone away\nI know you in a better place\nAnd I hope to see ya soon someday\n\n[Silkk]\nI'm just sittin here dazed thinkin bout all the times we had\nThinkin the past, some was good and some was bad\nRemember Dante?\nIt was a group of us, just a group of five\nNow three dead, one in jail, it seem right now I'm the only one alive\nTo all my soldiers before me, may ya'll rest in peace\nWhen He took three, took my soul, just the bodies\nHe at the crossroads guide us out to the rest of me\nWishin I could rewind time like demos\nMe and you gettin girls, writin down numbers like memos\nMakin million dollar bets, makin all our money stretch like limos\nEven though I smile, it's sad, but they say gangstas can't cry\nBut if I close my eyes and visualize me together\nThen I suddenly wanna smile\nTo see you laid down when it's yo time, when your time was up\nYou never seen your child, but he's here to remind us\nEven though you was wrong, I never could belive that that was true\nYou was with me forever, you could check my rest in peace tattoos\nSee me and C and P forever gon be ridin and thuggin\nRest in peace to all the ones that didn't make it\nAnd rest in peace to my brother\nWe gon miss you\n\n(I love these fools)\nI know you in a better place\n(Every time I get on my knees)\nAnd I hope to see ya soon someday\n(I pray for you, I'm glad you in a better place\nI hope I see ya soon, ain't no more killin\nAin't no more fights, and ain't no more tears)\n"}