{"rank":"31","song_id":"20100","song_name":"If I Could Teach The World","artist_id":"296202","display_artist":"Bone Thugs-N-Harmony","spotify_id":null,"lyrics":"Why do I stay high? Why do I stay high?\n\n[Hook]\nIf I could teach the world (whole wide world)\nTo be a thug-n-harmony (harmony)\nThen I would teach the world (whole wide world)\nTo be a thugsta just like me (like me)\n\n[Krayzie]\nHow many mo days on this old earth can you see\nIt's a crime to me\nSo we should get ready for Armageddon\nCause I know God should be ready to roll\nDo away with all of the wicked shit like mr. police-man\nAnd duck if you want to pump ya fist in tha air\nAnd pray for the politicians freely; get an amen?\nThe last days of the last days\n\n[Bizzy]\nThat's why I get high, that's why I get high\nI'm holdin on to my soul\nBut nobody knows when it all unfolds\nThen when I don't go\nRemember the days cause I all I got\nI go on my own with BONE\nBONE BONE muggin runnin through your door\nHoes speakin of the last day its on with the plastic trial\nWhat do you know but I can't go wrong\nWhen I kick it wit my song\nI turn it up\nCause you love that Thuggish Ruggish Bone, Bone, Bone\nCrossroads what rules the world\nEnough to make it where we almost lost those\nWho meant so much why wasn't I chose?\nBut it will not stop BONE\nThose shots don't drop BONE\nNooooooo no\nIf I could teach the world to be a thug like me\nEverybody thuggin in heaven eternally\n\n[Layzie]\nEveryday the world goes round and round\nI see it's a small world after all\nCause I can go met n agree with my fans\nSmoke a little weed and have a little laugh at ch'yall\nBut every now and then I gets caught up in a playa hation\nLord what's wrong with the nation, erase em'\nBut if I could teach the world to be a thug just like me\nYou could live your lifestyle worry free\nIn the arms of the Lord eternally\nNo mystery, but check the essence of the story\nThe warrior wasteland warrior so true\nDivine, it's mine, east 19-99\nIt's where ya find'in all of my kind, every time\n\n[Hook]\n\n[Krayzie]\n(if I, if I)\nWe stand as united, but fall if divided\nMy thugsters the tightest\nCause God is our guidance, they don't need to define us\nAs killer and fighters, cuz the critics n writers\nBackstab when they typing our story\nThe wannabe warrior, that's for sure\nAnd as thugs we're more and more and more\n\n[Wish]\nI got, we got, too much shit to give, got shit to give\nExpensive but still understood by the older folks for the little kids\nCome on ah, follow me (Bone), way to go, we know the way to go\nFollow me follow me (Bone)\nAnd that's why I stay high cause I got shit to deal with\nThe government and these playa-haters out to kill Wish\nWanna hurt this but uhuh\nI got two mo thug niggas you just can't fuck with\nArtillery you can come with\nNigga betta let it rest shit (shit)\nTo the little boys and girls all over the world\nThe shit that we say is from the streets not for you to go and do\nUh or to repeat, please if we can no more murder\nHow must I say this, if we can no more murder\n\n[Hook]\n\nWhy do I stay high? Why do I stay high?"}