{"rank":"29","song_id":"20112","song_name":"Feel So Good","artist_id":"309877","display_artist":"Mase","spotify_id":"0jyyCvDkMCEza2SpBSvllh","lyrics":"You ready Mase?\nParty people\nIn the place to be, uh-huh\nIt's about that time\nFor us to aaahhh\nYeah, uh-huh\n\nFirst Verse:\n\nYo, what you know about goin out?  Head west, red Lex\nTV's all up in the headrest\nTryin' to live it up, ride into\nBigger truck, piece all glittered up, stick a kid\nNigga what? Jig with the cut, sip Cris, spit it up\nHoes ride, get your nut till I can't get it up\nI'm a big man, give this man room\nI'd a hit everything, from Cancun to Grant's Tomb\nWhy you standin' on the wall?  Hand on your balls\nLighting up drugs, always fightin in the club\nI'm the reason they made the dress code\nThey figure I wouldn't wild when I'm in my French clothes\nDress as I suppose, from my neck to my toes\nNeck full of gold, but gats in my Rolls\nWreck shows, collect those, extra O's\nBuy the E, get a key, to the Lex\nTo hold, East, West, every state come on, bury the hate\nMillions the only thing we in the hurry to make\nWith a friend or ex-friend, in a Lex or a Benz\nLet's begin, bring this BS to an end\nCome on\n\nChorus:\n\nBad, bad, bad, Bad Boy\nYou make me feel so good\nYou know you make me feel so good\nYou know you make me feel so good\nBad, bad, bad, Bad Boy\nI wouldn't change you if I could\nI wouldn't change you if I could\nI wouldn't change you if I could\n\nVerse Two:\n\nYou can't understand, we be\nWaikiki, sippin' DP\nTo the TV, look pretty\nLittle kids see me, way out in DC\nWith a Z3, chrome VB's\nThey wanna be me, niggaz talkin shit\nThey ought to quit, I'm fortunate\nThey don't see a fourth what I get\nAnd those be the same ones walkin while I whip\nJust started seeing cars, cause they alternate\nSo while you daydream, Mama's city gleam\nAnd I deal with hoes that pose in Maybeline\nOne time you had it all, I ain't mad at ya'll\nNow give me the catalogue, I'll show you how Daddy ball\nSix cars in power, the five big stars\nPhillip, C, O, Chaz smokin' on cigars, nigga\nIt's like ya'll be talkin funny\nI don't understand language in people with short money\nCome on\n\nChorus\n\nVerse Three:\n\nDo Mase got the ladies? Yeah, yeah\nDo Puff drive Mercedes? Yeah, yeah\nTake hits from the 80's? Yeah, yeah\nBut do it sound so crazy? Yeah, yeah\nWell me personally, it's nothin' personal\nI do what work for me, you do what work for you\nAnd I dress with what I was blessed with\nNever been arrested, for nothin' domestic\nAnd I chill, the way you let me\nWith a jet ski, attached to a SE\nSmoke my Nestle, no mad rap\nAsk Cat, where my check be?\nProblem with y'all I say it directly\nWent from hard to sweeps starved to eat\nFrom no hoes at shows to menage in suites\nNow I be the cat that be hard to meet\nGettin head from girls that used to hardly speak\nCome on\n\nChorus 5X\n"}