{"rank":"94","song_id":"20125","song_name":"The Joint","artist_id":"276034","display_artist":"EPMD","spotify_id":null,"lyrics":"Verse One: Erick Sermon\n\nI make a million buck\nevery six months and y'all\nhating my game, saying my name, they call\nme the E, wrong things\nknowing Im fly without wings\nwhile some of y'all have to pull strings.\nIn this era I maintain the freak upon the beats\nmaster basslines of Raphael Saadiq\nLyrical mastermind, a genius so dont snooze\nno missions impossible, ask Tom Cruise\nI keep a joint lit, when I have to spit\nI rough paragraph, laugh when I'm busting yo' ass, who want it?\nCome and see me, like 112\nand I'll rock that bell with Fox and L\nE-Dub, Mr Excitement, right\nThe poltergeist of rap so come to the light.\nYes, the recipient of this award goes to Moi,\nthe best qualified superstar.\n\nChorus: EPMD\n\nErick:  My squad stays on point like\n        Den en den den de den, It's the joint\nParish: Yeah my squad stay on point like,\nErick:  Den en den den de den, Its the joint.\nBoth:   New York I'm in your area, (Over here)\n        DC I'm in your area, (Over here)\n        New Jerse I'm in your area, (Over here)\n        EPMD, its a world premier\n\nVerse Two: Parrish Smith\n\nIts the joint, stay on point\nPlus I'm feelin it\nniggas killin shit tryin to duplicat the manuscript\nthats impossible, pray like the gospel\nover coming set backs, and jumping over obstacles\nLike Evil Kenevil, on point like a needle\nEPMDs' like the Beatles, back with another sequal\nto hip hop, check one two and you don't stop\nrap with mainstream R&B and pop\nnow the worlds shocked\nthe E-doubles back with Mic-Doc\nLike it or not we bout to turn it up another notch\nMy speeds put it down for my seeds\nRaw breeds, acres with the deeds, its the joint.\n\nChorus: (first part the same)\n\nBoth: VA I'm in your area, (Over here)\n      DA I'm in your area, (Over here)\n      Chi Town I'm in your area, (Over here)\n      EPMD, its a world premier\n\nVerse Three: EPMD\n\nE:  My styles digable, so I'm phat like that\nI got a benz too, and its black like that\nI got millions of chips, and they stack like that\nA five year spread, and now we back like that\nHow dare they, niggas sittin in they room with Brandy\nway pissed off thikin how the can't stand me\nHe rhyme Shawn for his Penn, talking\nnot lookin, shoocken, a dead man walking\n\nP:  You know me, from rippin shows wit my homie\nthe one and only, Ginuwine like Pony\nYou want a ride? Call me up when your lonely\nI'm Parish Smith and shit, Greaat like Tony\nI'm hittin hittin\n\nE:  Where from?\nP: From brentwood to San Quentin\nI'ma keep rhyming, still representing\nE:  Fro who?\nP:  For my niggas up north and in the ?Courts?\nand for the emcees taking no shorts, in this blood sport\n\nChorus: (first part the same)\n\nBoth: Detroit I'm in your area, (Over here)\n      Cali I'm in your area, (Over here)\n      Philly I'm in your area, (Over here)\n      EPMD, its a world premier\n"}