{"rank":"53","song_id":"20143","song_name":"Going Back To Cali","artist_id":"418733","display_artist":"The Notorious B.I.G.","spotify_id":"4j4f7WyMV9fkpgFenajDuI","lyrics":"[Produced by Easy Mo Bee]\n\n[Intro Skit: Biggie and Puff]\n[Dialing numbers]\n[Phone Rings]\nYo!\nYo Big, wake up, wake up baby\nMmm, yo...\nYo Big, wake yo' ass up c'mon\nI'm up! I'm up. I'm up , I'm up\nBig, wake up!\nI'm up Diddy, what the fuck, man? What's up?\nC'mon now it's a quarter to six we got the 7:30 flight\nMmm, (mumbling) yeah\nYo Big, Big, Big\nYeah I hear you dog, I hear you, alright, 7:30\nYo take down this information\nAin't no pen\nTell your girl then to remember it or somethin'. Can you do that?\nAight honey, yeah write this down\nAight, uhm, flight five-oh-four\nFive-oh-four\nLeaving Kennedy\nKennedy\nOn the L-A-X\nOh! Cali?\nNo doubt baby, you know we gotta get this paper\nAhh, no doubt, aight\nYou aight?\nI'm up, I'm up\nYo Big\nI'm up, man\nFlight five-oh-four\nAlright 7:30 I'ma meet you at the airport\nCalifornia\nYeh\n[Phone clicks]\n\n[Verse 1]\nWhen the la-la hits ya lyrics just splits ya\nHead so hard, that your hat can't fit you\nEither I'm with ya or against ya\nFormat venture, back through that maze I sent ya\nTalking to the rap inventor\nNigga with the game tight, fifth of that flame right\nSpell my name right, B-I, double-G, I-E\nIced out, lights out, me and Cease-a-Leo\nGetting head from some chick he know\nSee it's all about the cheddar, nobody do it better\nGoing back to Cali, strictly for the weather\nWomen and the weed - sticky green\nNo seeds bitch please, Poppa ain't soft\nDead up in the hood, ain't no love lost\nGot me mixed up, you drunk them licks up\nMad cause I got my dick sucked\nAnd my balls licked, forfeit, the game is mine\nI'ma spell my name one more time, check it\nIt's the, N-O, T-O, R-I, O\nU-S, you just, lay down, slow\nRecognize a real Don when you see one\nSipping on booze in the House of Blues\n\n[Chorus: The Notorious B.I.G. (Stevie J)]\nI'm going going, back back, to Cali Cali (going back to Cali)\nI'm going going, back back, to Cali Cali (going back to Cali)\nI'm going going, back back, to Cali Cali (going back to Cali)\nI'm going going, back back, to Cali Cali (going back to Cali)\n\n[Verse 2]\nIf I got to choose a coast I got to choose the East\nI live out there, so don't go there\nBut that don't mean a nigga can't rest in the West\nSee some nice breast in the West\nSmoke some nice sess in the West, y'all niggas is a mess\nThinking I'm gon stop, giving LA props\nAll I got is beef with those that violate me\nI shall annihilate thee\nCase closed, suitcase filled with clothes\nLinens and things, I begin things\nBeeper start to flash, 818's, 213's\n313's, B.I.G\nFrequently floss hoes at Roscoe's\nIf I wanna squirt her, take her to Fatburger\nSpend about a week on Venice Beach\nSippin Crist-o, with some freaks from Frisco\n\n[Chorus: The Notorious B.I.G. (Stevie J)]\nI'm going going, back back, to Cali Cali (going back to Cali)\nI'm going going, back back, to Cali Cali (going back to Cali)\nI'm going going, back back, to Cali Cali (going back to Cali)\nI'm going going, back back, to Cali Cali (going back to Cali)\n\n[Verse 3]\nCali got gunplay, models on the runway\nScream Biggie Biggie gimme One More Chance\nI be whipping on the freeway, the NYC way\nOn the celly-celly with my homeboy Lance\nPass hash from left to right\nOnly got five blunts left to light\nI'm set tonight\nMet a bitch at the Versace store\nSaid she suck it 'til I ain't got no more, only in L.A\nBust on bitches be-lly, rub it in they tummy\nLick it, say it's yummy, then fuck your man\nWhat's your plan, is it to rock the Tri-State\nAlmost gold, five Gs a show date\nOr do you wanna see about seven digits\nFuck hoes exquisite\nCali, great place to visit"}