{"rank":"67","song_id":"20154","song_name":"I Wonder If Heaven Got A Ghetto","artist_id":"431886","display_artist":"2Pac","spotify_id":"2dKxXi4c1Y8sbcxavCbkfb","lyrics":"[Hook]\nI wonder if Heaven got a ghetto\nI wonder if Heaven got a ghetto\nI wonder if Heaven got a ghetto\nI wonder if Heaven got a ghetto\n\n[Verse 1]\nI was raised, the little young nigga doin' bad shit\nTalk much shit, ‘cause I never had shit\nI could remember being whupped in class\nAnd if I didn't pass, Mama whupped my ass\nWas it my fault Papa didn't plan it out?\nBroke out, left me to be the man of the house\nI couldn't take it, had to make a profit\nFound a block, got a Glock, and I clock grips\nMakin' G's was my mission\nMovin' enough of this shit to get my mama out the kitchen\nAnd why must I sock a fella?\nJust to live large like Rockefeller?\nFirst you didn't give a fuck, but you're learnin' now\nIf you don't respect the town then we'll burn you down\nGoddamn, it's a motherfuckin' riot\nBlack people on a rage, police, so don't try it\nIf you're not from the town then don't pass through\n‘Cause some O.G. fools might blast you\nIt ain't right, but it's long overdue\nWe can't have peace 'til the niggas get a piece too\nI want G's so you label me a criminal\nAnd if I die, I wonder if Heaven got a ghetto\n\n[Hook]\nI wonder if Heaven got a ghetto\nI wonder if Heaven got a ghetto\nI wonder if Heaven got a ghetto\nI wonder if Heaven got a ghetto\n\n[Verse 2]\nHere on Earth, tell me what's a black life worth?\nA bottle of juice is no excuse, the truth hurts\nAnd even when you take the shit\nMove counties, get a lawyer, you can shake the shit\nAsk Rodney, Latasha, and many more\nIt's been going on for years, there's plenty more\nWhen they ask me, \"When will the violence cease?\"\nWhen your troops stop shootin' niggas down in the street\nNiggas had enough time to make a difference\nBear witness, on our own business\nFuck the guard, ‘cause it's hard tryin' to make ends meet\nFirst we couldn't afford shit, now everything's free\nSo we loot, please don't shoot when you see\nI'm takin' from them ‘cause for years they would take from me\nNow the tables have turned around\nYou didn't listen, until the niggas burned it down\nAnd now Bush can't stop the hit\nPredicted the shit in 2Pacalypse\nAnd for once I was down with niggas\nFelt good in the hood being around the niggas\nYeah, and for the first time everybody let go\nAnd the streets is death row, I wonder if Heaven got a ghetto\n\n[Hook]\nI wonder if Heaven got a ghetto\nI wonder if Heaven got a ghetto\nI wonder if Heaven got a ghetto\n(yeah), I wonder if Heaven got a ghetto\n\n[Verse 3]\nI see no changes, all I see is racist faces\nMisplaced hate makes disgrace to races\nWe under, I wonder what it take to make this\nOne better place, let's erase the wasted\nTake the evil out the people, they'll be actin' right\n‘Cause both black and white are smokin' crack tonight\nAnd only time we deal is when we kill each other\nIt takes skill to be real, time to heal each other\nAnd though it seems heaven-sent\nWe ain't ready to have a black President\nHuh, it ain't a secret, don't conceal the fact\nThe Penitentiary's packed, and it's filled with blacks\nI wake up in the mornin' and I ask myself\nIs life worth livin'? Should I blast myself?\nI'm tired of being poor and, even worse, I'm black\nMy stomach hurts, so I'm lookin' for a purse to snatch\nCops give a damn about a negro\nPull the trigger, kill a nigga, he's a hero\nMo' nigga, mo' nigga, mo' niggas\nRather I'd be dead than a po' nigga\nLet the Lord judge the criminals\nIf I die, I wonder if Heaven got a ghetto\n\n[Hook & (Ad-Lib)]\nI wonder if Heaven got a ghetto\nI wonder if Heaven got a ghetto\nAnd I wonder if Heaven got a ghetto\nI wonder if Heaven got a ghetto\nI wonder if Heaven got a ghetto\nI wonder if Heaven got a ghetto\nI wonder if Heaven got a ghetto\n(Just think if niggas decide to retaliate)\n(soldier in eye's)\nI wonder if Heaven got a ghetto\nI wonder if Heaven got a ghetto\nI wonder if Heaven got a ghetto\nI wonder if Heaven got a ghetto"}