{"rank":"89","song_id":"20159","song_name":"Man Behind The Music","artist_id":"277244","display_artist":"Queen Pen Featuring Teddy Riley","spotify_id":"2Vqb1abQCEt9LGmU300JRq","lyrics":"Featuring Teddy Riley\n\nChorus: Teddy Riley\nThis is how it should be done\nCause this style is identical to none\nHow can I make you dance some more\n(T.R.) That's what I came here for\nRepeat Chorus\nAnd nowwww... here's the magnificent...\nFunkyyyyyy momma!\n\nVerse One: Queen Pen\nLyrical flows like WHAT\nThe man behind the music'll make you JUMP\nNew Jack your Swing and make you SHAKE YOUR RUMP\nNo Diggi-ty tellin me this is WHAT YOU WANT, bass lines and snares\nThat'll make you hump, WHY\nIntimated by his fourteen year run, WELL\nIn ninety-seven he's a different kind of funk, FUNK FUNK FUNK\nWe pulls together like a perfect hand to tongue, HAH\nYou pressed your luck and now you faster shit be sunk, ZOOM\nBe combin through the future with your face punked, AND YOU\nForgot about the past, now what you want, platinum tracks\nTo put you on the map, NAH\nCause we gotta keep it in fam', YEAH\nYou had your chance to be down wit da man, UH-HUH\nSo busy playa-hatin perpetratin, frauds\nArticulatin, on his downfall, TRUE, you can't take it\nWhat the deal Ma?\nFunky Momma blaze the track so you can feel her\nI'm Miggidy I'm all about the dollar bills y'all, rock the Diamond Lex\nAll that shit behind my desk is signed in checks\n[Teddy Riley]\nDo you like hits baby, got em goin crazy on BlackStreet\nYou know it's plaque time when me and the track meet\nSave all your wack beats, Q.P. and T.R\nSo precise with mics we should be surgeons in E.R\nThe block knows (like that) baby girl be my diamond cause\nShe rocks shows (for Black) see my ones ain't no way that\nYou can stop those, Little Man got your breath together\nWith Queen Pen now it's hot to death, so take a look back (look back)\nWhat I did, what I'm doin, where I take this (take that)\nIt's kind of simple cause a n*gga just make hits (make tracks)\nPeep the facts, keep a stack, on the Streets of Black\nLadies scream he's the mack, cause\nI kick, sh*t to make a fly chick you with\nMy chick, and plus funds just ridiculous\nCause I'm rich, we are T.R. you see Q.P\nThat's we BlackStreet, gone!\n(You, can't, take, it)\nAnd nowwwwwwwww... here's the magnificent...\nFunkyyyyyy mommaaaaaah!\n[Queen Pen]\nNow Teddy, JAM, for me ONE TIME\nCross that thin line make my hips BUMP N GRIND\nWhat just happened, all this shadyness cause of platinum hits\nLittle Man be the sh*t, Funky Momma represent\nIt ain't never been no different plus WE GOT WITNESSES\nTo account for alla dis sh*t, test we\nAnd get your, block knocked off, UHH\nYou can keep yappin UNTIL YOU GET HOARSE\nIt don't matter, we don't, follow chit chatter\nWE MAKE HITS, and calls, when situations get thick\nASK SAINT NICK, about the repoitoire\nFor those in the past, they know who they are\nIf the shoe fits trust, WE GON WEAR IT\nAnd we beez the baddest click up on this planet\nWe paid the cost to be boss G*d [damn it]\nCause scared don't win money, NOW DROP IT\nChorus (to fade"}