{"rank":"39","song_id":"20183","song_name":"Make Em' Say Uhh!","artist_id":null,"display_artist":"Master P Feat. Fiend, Silkk The Shocker, Mia X & Mystikal","spotify_id":null,"lyrics":"[Intro]\n[Rappin 4-Tay] No Limit Studios, whassup?\n[Random Caller] Who dis is? Who dis is?\n[R4T] Nigga, this Rappin 4-Tay, who is this?\nOh this is P\n[R4T] P?!\nYeah this is P!\n[R4T] P?!\n(Yeah)\n[R4T] If this P lemme hear ya say ungggggggggggh\nUngnGNGYAHAHgngnnghh *voice cracking*\n[R4T] This ain't no motherfuckin P!\nMan, hang the phone up\n\n[Hook: Master P & No Limit]\nMake em say UNGGGGGGH (UNGGGGGGH)\nNa-nah na-nah (na-nah na-nah)\n\n[Verse 1: Master P]\nNigga, I'm the colonel of the motherfuckin tank\nY'all after big thangs, we after big bank\n3rd Ward hustlas, soldiers in combats\nConvicts and dealers, and killers with TRU tats\nNever gave a fuck bout no hoes on our riches\nAnd niggas come short, I'm diggin ditches\nM.P. pullin stripes, commander-in-chief\nAnd fools run up wrong, nigga I'm knockin out some teeth\nI'm down here slangin, rollin with these hustlers\nTryin to get rid of all you haters and you bustas\nSteppin on toes, break a niggas nose\nIn the projects niggas anything goes\nBreakin fools off cause I'm a No Limit soldier\nAt ease now salute, this pass me the doja\n\n[Hook]\n\n[Verse 2: Fiend]\nFiend exercisin his right of exorcism, bustin out the Expedition\nBullets choppin haters business to about the size of prisms our mission\nThey heard we scary, No Limit mercenary\nNo tellin how bad it get, because the worst'll vary\nI heard you make em worry, that this for the loot\nThey intimidated by the rounds that the tank shoot\nTank Dogs salute! Every robbery in store, cause they know\nEverything Fiend know, mean mo' money mo'\nLittle Fiend still want the greens, the cornbread and the cabbage\nIn your hood, remindin you bitches of who the baddest\nDefinitely the maddest, so the crime gon' stick em up\nMy UNGGGGGGH went twice (ungh, ungh)\nAnd ended with nine, get em\n\n[Hook]\n\n[Verse 3: Silkk the Shocker]\nP gon' make ya say UNGGGGGGH, I'mma make you say OWWWWWWWW\nI'm not Eric B. but guaranteed to move this motherfuckin crowd\nI stay on like light switches, money, cause I like riches\nHittin nothin but tight bitches, call me, I might hit ya\nNigga make em say nah-nah-nah, don't trip\nAfter I bust yo' shit, then after that say na-nah-nah-nah\nI hang with niggas, I do my thang with niggas (unggggh)\nThey wanna know if I gangbang, cause I hang with a whole gang of niggas\nSo when, we connect bitch better respect this, I step quick\nCause I got a, vicious right hand but ya know what? My left is quick too!\nSilkk, you the type of nigga that promotes violence? You might be right\nCause I'll step in the club and say somethin\nTo get that motherfucker start to, fightin!! (Bout it!!)\nBad as Vogues, I'm cold, extra see through\nBe G's fuckin knockin niggas cause I make em all see 3-D\nAnd P-D's the game that I spit, No Limit Soldiers got my back\nI run this motherfucker, TRU niggas\nAnd I betcha I'll make yall stay back!\n\n[Hook]\n\n[Verse 4: Mia X]\nWe capitalize and monopolize on everything we see keep pistols drawed\nAnd cocked, we got the industry locked, we can't be stopped, too hot\nCheck the spots that we got, on Billboard\nThis Tank can set up roadblocks, we fadin all you hoes\nWant some mo? Then let's go, stretch you out like elastic\nZip that ass up in plastic, have ya folks pickin caskets\nWe drastic, our tactics is homegrown in the ghetto\nSo feel the wrath of this sista, it's like you fightin 10 niggas\nForget the baby boys, it's the biggest mamma Mia\nThe Unlady Like diva, lyrical man eater, believe her\nOr see her, and get that ass embarrassed\nIf you're a decision maker, guaranteed you'll get carried away\nSo stay in yo' place, when ya hear mamma speakin\nCannon spray, clear the way, when ya see The Tank creepin\n\n[Hook]\n\n[Verse 5: Mystikal]\nI'm that nigga that rappers look up to when they won't know how to do it\nUsed to be the little bitty skinny motherfucker with the braids in his hair\nUsed to live on Tchoupitoulas\nI done paid my dues, but still played the blues\nNigga play me like you was scared to lose\nI'm still a fool, you ain't heard the news\nI was a No Limit nigga, makin major moves\nI won't stop now, bitch, I can't stop\nYou can't stop me, so bitch don't try we\nWe TRU soldiers, we don't die\nWe keep rollin, na-nah-nah-nah-nah\nAll aboard, bitch could get barely inside\nThe Riverboat Hallelujah\nNiggas goin to war, got to fightin and shootin inside Rumors\nBitches be sayin he there, we there, BEWARE!!!\nC there, Silkk there Fiend there, Mamma there, P there\nAin't no salary cap, on top of my dollars\nI roll with nothin, but them No Limit riders\nI gets down nigga, I hold my tank up high\nWatch how many bitches get wild, na-nah na-nah"}