{"rank":"3","song_id":"20217","song_name":"Gettin' Jiggy Wit It","artist_id":"431377","display_artist":"Will Smith","spotify_id":"0weAUscowxeqDtpCgtbpgp","lyrics":"[Verse 1]\nOn your mark ready set let's go, dance floor pro\nI know you know I go psycho\nWhen my new joint hit, just can't sit\nGot to get jiggy with it, ooh, that's it\nNow honey honey come ride, DKNY\nAll up in my eye, you got a Prada\nBag with a lot of stuff in it\nGive it to your friend let's spin, everybody looking at me\nGlancing the kid, wishing they was dancing a jig\nHere with this handsome kid, ciga-cigar\nRight from Cuba-Cuba, I just bite it\nIt's for the look, I don't light it\nIllway the an-may on the ance-day oor-flay\nGive it up jiggy make it feel like foreplay\nYo my cardio is infinite, ha-ha\nBig Willie style's all in it, getting jiggy with it\n\n[Hook]\nGetting jiggy with it\n\n[Verse 2]\nWhat you want to ball with the kid?\nWatch your step you might fall\nTrying to do what I did\nMama mama mama come closer\nIn the middle of the club with the rub-a-dub\nNo love for the haters, the haters\nMad cause I got floor seats at the Lakers\nSee me on the fifty yard line with the Raiders\nMet Ali he told me I'm the greatest\nI got the fever for the flavor of a crowd-pleaser\nDJ play another from the prince of this\nYour highness, only mad chicks ride in my whips\nSouth to the West to the East to the North\nBought my hits and watch them go off a go off\nAh, yes-yes y'all\nYa don't stop in the winter or the (Summertime)\nI makes it hot, getting jiggy with 'em\n\n[Hook]\n\n[Verse 3]\nEight-fifty I.S. if you need a lift\nWho's the kid in the drop? Who else Will Smith\nLiving that life some consider a myth\nRock from south street to one two fifth\nWomen used to tease me, give it to me now nice and easy\nSince I moved up like George and Weezie\nCream to the maximum I be asking 'em\nWould you like to bounce with the brother that's platinum?\nNever see Will attacking 'em\nRather play ball with Shaq and 'em, flatten 'em\nPsych, kidding\nThought I took a spill but I didn't\nTrust the lady of my life she hitting\nHit her with a drop top with the ribbon\nCrib for my mom on the outskirts of Philly\nYou trying to flex on me?\nDon't be silly, getting jiggy with it"}