{"rank":"35","song_id":"20258","song_name":"Second Round K.O.","artist_id":"298631","display_artist":"Canibus","spotify_id":"0xKmDKOEbwRSgH0BXA6IzX","lyrics":"[Intro: Mike Tyson]\nYo, Canibus, man, what's up, man?\nI caught you on that cut with Wyclef\nMan, you were booming\nBut I caught these foul slouch-ass niggas, you know I mean?\nTalking foul about you the other night\nOn the corner of the boulevard, man, I wasn't with that\nBut I ain't know you well enough to defend you though, right?\nBut you seem like you got true game\nBut peep game, man, they've been playing me all my life, man\nYou know I won the title a couple of times\nDig right, you know what I mean?\nBut they can't hurt us, man, we gonna do it\nGet up in this ring, man, put on these gloves\nLet me show how to handle yourself, man\nYou don't got nobody out there with you\nI gots to show you, man, get up in there, move that head, man\nCome on to me, man, but when you come, man\nYou gotta come for blood, man\nCome up to me, man, come on, bust that nigga whole\nMan, niggas talking that shit about you\nHey, Mike Tyson here speaking\nWith the Canibus man over here\nYo, Canibus your main objective out here\nIs to do nothing but eat, eat, eat, eat MC's for lunch, breakfast\nHey, man, they been playing me all my life, man\nYou know I won the title a couple of times, dig right?\nNo, but they can't hurt us, man\nWe gonna do it, get up in this ring man, put on these gloves\nLet me show you how to handle yourself, man\n\n[Verse 1: Canibus]\nSo I'ma let the world know the truth, you don't want me to shine\nYou studied my rhyme, then you laid your vocals after mine\nThat's a bitch move, something that a homo rapper would do\nSo when you say that you platinum, you only dropping clues\nI studied your background, read the book that you wrote\nResearched your footnotes about how you used to sniff coke\nFronting like a drug-free role model, you disgust me\nI know bitches that seen you smoke weed recently\nYou walk around showing off your body ‘cause it sells\nPlus to avoid the fact that you ain't got skills\nMad at me ‘cause I kick that shit real niggas feel\nWhile 99% of your fans wear high heels\nFrom Ice-T to Kool Moe Dee to Jay Z\nNow you want to fuck with me? You must be crazy\nYou dripping with wack juice, and you can't get it off\nYou better be prepared to finish what you start, nigga\n\n[Interlude: Mike Tyson]\nYo Canibus, man, you gotta hit harder than that man\nYou don't want no bitch-ass niggas hanging out with me, man\nWe're warriors man, when we go into battle\nWe come out or don't come out at all\n\n[Verse 2: Canibus]\nYou better give me the respect that I deserve or I'ma take it by force\nBlast you with a .45 Colt, make you somersault\nShock you with a couple hundred thousand volt thunderbolts\nBefore you wanted a war, now you wanna talk?\nIt's about who strikes the hardest, not who strikes first\nThat's why I laugh when I hear that wack ass verse\nThat shit was the worst rhyme I ever heard in my life\n‘Cause the greatest rapper of all time died on March 9th\nGod bless his soul, rest in peace, kid\nIt's because of him now at least I know what beef is\nIt's not what I would call this, see this is something different\nA faggot nigga tryna make a livin' off of dissin'\nSomebody that he gotta know is better than him\nBut he feeling himself ‘cause he got more cheddar than him\nWell, let me tell you something, you might got more cash then me\nBut you ain't got the skills to eat a nigga's ass like me\nAnd if you really want to show off, we can get it on\nLive in front of the cameras on your own sitcom\nI'll let you kick a verse, fuck it, I'll let you kick 'em all\nI'll even wait for the studio audience to applaud\nNow watch me rip the tat from your arm\nKick you in the groin, stick you for your Vanguard award\nIn front of your mom, your 1st, 2nd and 3rd-born\nMake your wife get on the horn, call Minister Farrakhan\nSo he could persuade me to squash it\nI say \"Naw, he started it, he forgot what a hardcore artist is\"\nA hardcore artist is a dangerous man\nSuch as myself, trained to run 20 miles in soft sand\nOn or off land, programmed to kick hundreds of bars offhand\nFrom a lost and forgotten land\nYou done did it, man, you done spitted some wack shit\nAnd probably thought that because it's been a minute I'll forget it? Fuck that!\n‘Cause like Common and Cube, I see the bitch in you\nAnd I'ma make the world see it too, motherfucker\n\n[Interlude: Referee]\nLadies and gentlemen, we have a new lyrical weight champion\nBy second round knock out\n3 minutes and 40 seconds, Can-i-bus\n\n[Outro: Mike Tyson]\nYo, Canibus man, you moving like Mike Tyson Jr\nMan, you in-and-out, and you're agile with your flow, man\nBut dig right, you got to eat, man\nThat's your name Canibus\nYour whole agenda is to eat these niggas, man\nThey have no business to be in the same stage with you\nHolding the mic with you, but dig right\nHey, Mike Tyson here speaking\nWith the Canibus man over here\nYo, Canibus, your main objective out here\nIs to do nothing but eat, eat, eat, eat MC's\nFor lunch, breakfast, dinner; that's your agenda, baby\nYour agenda to consume them\nTheir whole existence, they can't exist in your presence\nThe Canibus is here to rule forever, Mike Tyson, on the def"}