{"rank":"39","song_id":"20307","song_name":"Clock Strikes","artist_id":"429956","display_artist":"Timbaland","spotify_id":"5f9wLPYzgQurnUAHPRUemJ","lyrics":"[magoo]\nSee them other crews could not figure me\nIt's the mag and double ooh got that fat cd\nBuck a crystal hit a nigga with my blunt philly\nFake mc's getting assed like they eatin chili\nOnly way they seem to rap is if they got a philly\nMaybe i'm nicole brown cause you really kill me\nGot away with hittin me but you ain't o.j.\nI'm bout to shake up the world like cassius clay\nWhen i bumble watch your back cause i sting like bee\nThis ain't the wild wild west and you ain't kool moe dee\nWatch a movie now you think that you really joe pesci\nYou don't want beef with me, like a diaper i'm messy\n\n[timbaland]\nI'm that laid back brother they call timbaland\nI drive a 850 sometimes a 3-2 mazda van\nYou can catch me standin in my b-boy stance\nOr catch me at home watchin who's the man?\nThey call robber, cause i pack much heat\nDon't call me now, because they dig the way i speaks\nI'm like a genie, because i've been trapped in a bottle\nI've got more stunts, than that nigga desperado\nCome follow, a mad brother where'll there be no sun\nNo sun tomorrow, you be sayin, when can we meet? uhh uhh\nMy offices hours are nine to five\nAin't that right maganoo, maganoo? right... right\n\nChorus: magoo\n\nWhen the clock strikes, half past two, yeah\nThey'll be dancin, through the night\nDa-da-da, da, da (hey!)\nDa-da-da, da, da (ahh!)\nDa-da-da, da, da (hey!)\nDa da daahhhhhh! (ahh!)\n(repeat with hey's and ahh's added in regularly throughout)\n\n[timbaland]\nNow gimme that...\nAnd run with the... (ahh)\nParty people are you ready for tim and maganoo\nAs we come, rum & coke, won't you kick a verse too\n\n[magoo]\nYo i'm bout to get it started like i'm hammer then i farted\nYou retarded if you thinkin brandy really broken hearted\nI departed doin dirt, lookin up your girl's skirt\nKeep it steve martin style, bustin loose like jerk\nI get up like -town, gimme don't say no more\nGot them scars on my face cause my health be poor\nYou milli vanilli, i'm kurtis blow like eighty-fo'\nNo i don't want your girl she be suckin my big toe\nYou get death like row, i take a beanie then i jet\nPeace to tupac, cause he was dope as it get\nTwisted but you ain't keith sweat and shit got hot\nMake a block then make a circle then i rock that spot\nThe rappin don, i make a dyke go straight\nIf you think i'm cute, then you up too late\nMake no mistake, i'm a question with no answer\nRiddle me like the joker get burnt like jojo dancer\n\nChorus 2x\n\n(hey's and ahh's continue for a bit without magoo)\n\nChorus 1/2"}