{"rank":"89","song_id":"20346","song_name":"Party Ain t A Party","artist_id":"277244","display_artist":"Queen Pen Featuring Teddy Riley, Nutta Butta, Markell","spotify_id":"3plNsz0KQaJjtW75gYTMEn","lyrics":"[Queen Pen]\n\n1 - \tYo, a party ain't a party 'till it's ran all through\n\tAnd leave it to my crew, it's gon' be playa' proof\n\tAfter three rounds we gon' blow off this roof\n\tA party ain't a party 'til it's ran all through\n\nRepeat 1\n\nShorty, who you be, you're staring at me instantly\nAs I walk into this vide(o) I can feel you diggin' me\nWit' yo' glass of Rhemy, you had one too many\nBut still I'm impressed wit' cho' wild out Henney\nIt's a party and I got's to run all through\nBut maybe later on we can chat over booze\nSee I thought you knew, ain't no delaying what I'm saying\nWant me to rewind and collect on my track, it won't wait\nI said it's a party, I gots to run all through\nWe holding 20 plus we can follow if you choose\nSee ain't nothing changed, since the days of the Q\nExcept uh, elimination that wanna chew up my crew\nYes you, but you true I got to browse on through\nYou can catch me at the bar being shady to my old crew\nHow I do?  Make moves like I shoot\nCatch me on the rebound, make at the tunnel\nCatch me on the rebound, or maybe at the tummy\n\nRepeat 1\n\nRepeat 1\n\n[Mr Cheeks]\nI'm tipsy from the cab, down the whole bottle of Henney\nPeepin' shorties in my biz and seeing many\nBut there's something about you\nYou seem off the hook\nGivin' me that \"I want to say something\" look\nPlus that dress you wearin'\nGot my whole team starin',\nYou not bouncin' with me, I'm not hearin'\nLickin' the lips for real like you really want it\nIs you dealing with the cat that's blunted?\nStay forever real shorty Ra', is you down\nTo go home wit' the champ a whole round?  You see\nI had my eyes on you from way across the room\nYou looked so good from over here, I can smell your perfume\nI assume, if I got ta come and  get ya\nYa'd think I was only out to hit ya,\nSee, you's an intelligent chick\nWith that Nestle type of smile,\nHeld my temptations back for awhile\nTell my brother Tah Lee, I'll be back, yeah\nThat's Pretty Lou and Spigg Nice, so watch my jacket\nMake her touch to my lips, put the drink in my hand\n'Till the center my legs expand\nCuz\n\n[Freeky Tah]\nThat's how we do\nBetter forget her for me and you\nI give a shout out to my whole crew\nFrom New York City to Chicago too\n\nRepeat 1\n\nRepeat 1\n\n[Markell Riley]\n\nNow a party ain't a party until I run through it\nPick 'em stick 'em sick 'em, that how I do it\nMove it, get down keepin' ya'll movin'\nCertified game tight prove it, aight!\nDeala of the dancefloor, makin' all ya'll stomp and clap\nYa feelin' me?, damn sure\nI had the answers for ya dancers\nSince way back, puttin' it down like that\n\n[Nutta Butta]\n\nI came in the door, 20 or more\nWatch the dancefloor, cause we like it raw\nDom got my head spinnin' like a set of rims\nNutta Butta like a pair of Timbs\nWhat the deal shorty?, wanna rock with me\nTake ya back, do the wop wit' me\nSpend the cash like Monopoly\nWords slurred and my vision is blurred\nBut a party ain't a party 'til I slide with a bird, what?\n\nRepeat 1 until fade\n"}