{"rank":"59","song_id":"20354","song_name":"Black Ice (Sky High)","artist_id":"303015","display_artist":"Goodie Mob Featuring Outkast","spotify_id":"0Uu8BPsWQGZk5AiRN3uBwn","lyrics":"Do you ever see that stuff that be\nWhen it get cold that ice that you can't see?\nSee that shit happens sometimes\nYep, black ice\n\n[Verse 1: Gipp]\nNow you know and I know\nI done bumped every hole in the wall, y'all\nDid you catch that phone call?\nMost of y'all that met me thought I was tall\nGipp flipped like a dip, slipped, fell on the black ice\nDid you think twice? Homeslice came and he went\nSatisfied, got bent, bars ain't shit\nMeetin' coast to coast, yeah, I laughed and boast\nMan do-si-dos, too many comin' close to\n\n[Hook]\nTouch what I never touched befo', seen what I never seen befo'\nWoke up and seen the sun sky high, sky high\n\n[Verse 2]\nCirculate like a Sunday paper\nCapers caught long time, to cheap flicks, good picks\nPaid hard, watch the hard turn sideways\nPick the tale for real sales to those who lose cash\nPlayers keep your life for now\nFeeling good and warm, windows rolled tight\nThirty-five degrees, nippy tonight\nDon't forget the ChapStick, lips dry quick\nWhen the jack out, make you wanna act out\nTake the slack out, some people black out\nHibernatin' 'til we came back out\n\n[Hook]\nTouch what I never touched befo', seen what I never seen befo'\nWoke up and seen the sun sky high, sky high (Sky high)\nTouch what I never touched befo', seen what I never seen befo'\nWoke up and seen the sun sky high, sky high\n\n[Verse 3]\nI been in it for the past few days\nTighter than fades, I'm knowin' my plays\nNow can I rap? Can I adapt? Not really sure yet\nWho that lookin' over the shoulders of those writin' dreams?\nFiendin' for the taste of menthol\nMissed class, stayed in the hall\nLookin' for a squeeze play, better yet a holiday\nStayed away from the pyramid board game\nBroke it down to a neighborhood slang\nCash before fame\n\nSky high (Repeat 10X)\n\n[Verse 4: Big Boi]\nNow who done stepped in?\nThe nigga the B-I-G, the secret weapon, Boi\nSlicker than Black Ice, throwin' these flows like rice at weddings\nSo quit flexing, we speakin' about\nSomethin' that's refreshing to the earlobes\nPay for the room and still be in pimp mode\nLike Iceberg, Chryslers and Buicks\nSome niggas ain't on they jobs so them suckers here to lose it\nAbuse they privileges and now the whole villages been shot to pieces\n'Cause niggas are biting that same stupid shit, I mean that feces\nBoy, don't beep me, if you ain't got no work\nI'm strictly 'bout these verses like the ones you hear at church, boy, search, boy\nTalkin' about your dough is long like Lurch, boy\nEvery time I heard you rhymin' like a fucking jerk, boy; simp\nYeah!\n\n[Verse 5: Andre Benjamin]\nFriends, Romans, countrymen, lend me your eardrums\nIt was a beautiful day off in the neighborhood\nYellows and greens and blues and browns\nAnd greys and hues that ooze beneath dilapidated wood\nAin't a thing could explain what pertains\nTo cocaine and sustaining reign\nSee summer rolls around, niggas holla bout change\nThen they steady move them ki's like Bob James\n'Cause old man winter's arrived, the temperature dives\nNovember just died, December's alive\nThus it ain't no typical ride\nJust individual's way to bring home\nThe bacon when bacon was all gone\nMakin' it our own, takin' me all wrong\nWe've all indulged in the bulge of those no-no's\nNo, you ain't solo, there's even lower levels you can go\nTake sun people, put 'em in a land of snow\n\n[Hook]\nTouch what I never touched befo', seen what I never seen befo'\nWoke up and seen the sun sky high, sky high"}