{"rank":"61","song_id":"20371","song_name":"Woof Woof","artist_id":"431979","display_artist":"69 Boyz","spotify_id":null,"lyrics":"Better ride\nYou in tune to the sounds\nOf the dance floor giants, 69\nAnd we come to make you dance\nAnd I brought my dogs wit me\nCheck it out\n\nHold up, wait a minute\nY'all dance, who think I'm pretty?\nLoud man breakin' your town\nWe're the force to make ya get down\nKnow and a bigger mess in your plans\nIt beats nothing so I dance\n69 mic on the ground, breakin' it down\nWantin' more time\nBut this time, it's for my dogs\nSouth, North, all y'all\nThere's more little things in life to get (hot)\nWhat about the one's in your (what)\nThose that don't like huh?\nCuz me and my dogs are rightin' to get cool in it\nThen I cut and chit chat, y'all where ya at? Where ya at?\n\n1- Woof woof\nWhere ya at? Where ya at?\nWoof woof\nWhere ya at?  Where ya at?\nWoof woof\nWhere ya at?  Where ya at?  Where ya at?\n\nRepeat 1\nRepeat 1\nRepeat 1\n\nThis for the dogs in the lounge\nAnd all the dogs in the grill\nCan't be forgettin' the dogs in our town\nThat be keepin' it real\nAnd all the dogs that we've known\nThey bark is worse than their bite\nThis for the dogs to get (high)\nHere's one that I love\nSay, yo, ladies? (Yeah?)\nWhassup?  I know y'all 'bout to give up\nLight the 36 and tear the club up\nIf ya wit me dance a lil' bit\nI know y'all lad' come to chill\nSpecially if y'all up on the bill\nFrom the old up from A town\nCuz y'all like it cheaper right now\nAKA as I get on my roll\nWork that body down to the floor\nY'all just ain't afraid to vibrate\nShake it up 'till it breaks\nAnd if ya get bump come see the father\nLittle girl, you know that I gotcha\nAnd I want ya, like that\nBut for now, where ya at? Where ya at?\nWhere ya at girls?\n\nRepeat 1\nRepeat 1\nRepeat 1\nRepeat 1\n\nThis is for my dogs in Dakota\nAnd all my dogs in LA\nCan't forget my dogs in New Orleans\nLet's ride and ride it all day\nHands down, shake up, we all up in the mix\nAnd it's about time we all break it down\nAnd it goes a little something like this\n\nYo, dog, you see a little something you like?\nYou say, here kittie kittie, here kittie kittie kittie\nAnd she lookin' all good in the club tonight\nYou say here kittie kittie, here kittie kittie kittie\nIf you's a dog and you need a fix\nHere kittie kittie, here kittie kittie kittie\n\nWe've been trying to tell y'all for years\nThat you need to open your ears\nTake a trip down to the dirty south\nAnd find out what is woof woof about\nIt's just a word we get call\nNo time for hype beats and huh\nCris-cross it all to make ya join\nWit the way that I bump bump bump\nLadies down from state to state\nCuz like y'all dogs, we operate\nAnd when the bass of his glip\nWell, ya must be in tune to hear what we hear\nJust like ya ought to do\nBut inside of you\nIf not, we didn't come through\nKnowin' the South is all of that\nBut for now I wanna know where the dogs is at\n\nRepeat 1\nRepeat 1\nRepeat 1\nRepeat 1\n\nThis for the dogs in Virginia\nAnd the dogs in Indiana\nAnd for the dogs out in Texas\nTennessee and Alabama\nAnd for my dogs in Missouri\nAnd for my dogs in North Carolina\nAnd for my dogs in D.C\nAnd the ones in Mississippi\nI know you dogs in Nebraska\nNew Mexico and Arizona\nAnd the ones in Michigan\nMilwaukee and Oklahoma\nThis for my dogs\nWho got me riding out\nFrom the North to the East and West\nAgain, in the dirty South, come on\n\nWoof Woof...Where ya at?\nWoof Woof...Where ya at?\nWoof Woof...Where ya at? Where ya at? Where ya at? (x 4)\n\nWoof Woof (x 24)"}