{"rank":"13","song_id":"20401","song_name":"Daydreamin'","artist_id":"370836","display_artist":"Tatyana Ali","spotify_id":"0ALJZXgutuN6F680E8lQPs","lyrics":"All day long I think of you \nI can't even think of things to do\nWishin' all of my daydreams come true\nNow, baby, what am I to do?\n\nI think about yesterday\nSomebody was talkin' to me\nBut I couldn't understand a word they said\nNot that I was tryin' to be rude\nBut conversation couldn't make it through\nThe thoughts of love I had for you...\n\nBaby your face takes up my time\nBecause I can jus' see your face with mine\nI try to change my thoughts; it's a waste of time\nYou keep my mind occupied\n\nRefrain.\n\nTell me what am I to do?\nWhen I can only think of you\nEven when I have simple things to do\nLike talkin' on the telephone\nor watchin' TV when somethin's on\nIf it ain't about you then what's the use?\n\nRefrain.\n\nWhat's up girl? You all grown up now....\n\nDoin' ya singin' thing the charts sewed up now\nWell you know I do my rap thing, I'm holdin' it down\nAnd I knew that me and you was gon' connect some how\nYour people called for this track, it ain't no trouble to me\nI dreamt that you and me got married on the WB\nYou on channel 11; I carry the M-11\nRJ the reverened; it's a match made in heaven\nWhatever have you I let you know\nI'm from soundview\nDown til I found you\nI'm tryin' to be around you\nI'm still comin' up\nChasin' the fame and wealth\nI could spoil you with time; you got everything else\n\nI'm still New York to the heart\nBut got love for all\nWhen I first saw this girl\nThought I wanted to fall\nMean the hummer so stunnin'\nThat my bod was tense\nAnd I wishin everyday that I was fresh like Prince\nThen I came across my man RJ parlayin' in a 6\nWith Tatyana Ali playin'\nI heard Steely Dan \"Black Cow\" and went wild\nYou tell me how can I get down\nThat's when they threw me on the redeye to LA\nI dirtied my cash and peeps back\nAnd hit Shaq on the cellay\nCourtside seats so close that we could touch\nTatyana and Lord and Peter Gunz\n\n\nRefrain...\n"}