{"rank":"82","song_id":"20439","song_name":"Find A Way","artist_id":"275205","display_artist":"A Tribe Called Quest","spotify_id":"054hu8JJu9GAtiDaar2pKM","lyrics":"Chorus:\nNow you caught me heart for the evening\nKissed my cheek, moved in, you confuse things\nShould I just sit out or come harder?\nHelp me find my way\n\nQ-Tip:\nMessing me up, my whole head\nTeasing me, just like Tisha, did Martin\nNow look at what you're starting\nSchoolboy's crush and it ain't on the hush\nThe whole world sees it but you can't (uh)\nMy peoples they complain, sitt and rave and rant (come on)\nYour name is out my mouth like an ancient chant (say what?)\nGot me like a dog as I pause and pant...\n\nPhife:\nSpeaking of which, got a leash and I wish just to rock you miss (come on)\nMake a militant move, peep my strategy (what?)\nEnd of the day you're not mad at me (uh)\nNot dealing with nobody, now that's what you told me (what?)\nI said: \"hey yo, it's cool, we can just be friendly\" (come on)\n'Cause yo, picture me messing it up\nHer mind not corrupt with the ill C-Cups\nShit, I'm on my J.O. (come on)\nBullshitting, hoping that the day goes slow (what?)\nGot me like a friend, what confuses me though\nIs kisses when we greet, tell me what's the dill yo? (dill yo, yo, yo...)\n\nChorus (2x)\n\nQ-Tip:\nNow why you wanna go and do that, love, huh?\nMaking things for me towards you harder\nKilling me, just when I think we're there\nYou got the whole vibe and the flows in the air\nTelling me 'bout next man\nBut next man ain't the nigga with the plan\nWho got your heart in mind?\nIt's about time that you just unwind (come on)\n\nPhife:\nAnd let it just happen, make it front-free (uh)\nJust sweat me like Moneypenny (uh)\nDigging you, getting inside of your stee (what?)\nIt's the Quest that keeping you company\nForever, or however you want it\n\nQ-Tip:\nWord word, now wait a minute now before you jet it to the curb (yeah, yeah)\nStart to make affections, which is good not the hurt\nBut it, it aint me, and I, I ain't blurred (uh)\nI'ma still just chill with you\nMaybe things could change if you change your view (come on)\nIf not then I guess it is cool (yeah)\njust, to keep to yourself and adbide by the rules, right\n\ncheck it out now...\ncheck it out now...\nlike that now...\ncheck it out now...\nwha wha now...\ncheck it out now...\nyeah yeah now...\ncheck it out now...\ncheck it out now...\nit's like that now...\ncheck it out now...\nyeah yeah now...\ncheck it out now...\nwhat you say, what? what?\n\nChorus till fade out"}