{"rank":"48","song_id":"20436","song_name":"SuperThug (What What)","artist_id":"312415","display_artist":"Noreaga","spotify_id":"2Uvl2lg2PKadatoNJAjv88","lyrics":"I抦, I抦 actually waitin on the bus now\nHe said we have some kind of special assignment or something\nHe抯 supposed to be callin?me, like any minute now, any minute\nHold on, hold on, lemme get the phone\nHello? Jackson here\nYa, what? you found Manuel Noreaga?\nIn the Phillipines?\nHe has a mansion?\nOk, we on it, on it, right now... right\n\n(Noreaga and Neptunes)\nWhat, what, what, what, what, what, what,(what, what, what)\nWhat, what, what, what, what, what, what,(what, what, what)\nWhat, what, what, what, what, what, what,(what, what, what)\nWhat, what, what, what, what, what, what,(what, what, what)(superstar)\nWhat, what, what, what, what, what, what,(what, what, what)\nWhat, what, what, what, what, what, what,(what, what, what)\nWhat, what, what, what, what, what, what,(what, what, what)\nWhat, what, what, what, what, what, what,(what, what, what)(superstar)\n\n(Noreaga)\nVerse 1\nAiyyo, we light a candle\nRun laps around the english channel\nNeptunes, I got a cockerspaniel\nWe on the run now, yo, it ain抰 no fun now\nAnd where I go, you niggas can抰 even come now\nYou ain抰 the lord, nigga, break it, I don抰 care\nAnd when ya get caught, remember that I don抰 care\nN.O.R.E., nuthin but the atmosphere\nYo for now we on the run, yo if that ain抰 clear\nWeak niggas wanna stick, you but that ain抰 fair\nYou we down in vegas, money, skies too courageous\nAnd yo, I抦 on the run, but still rip stages\nAnd call me animal thug, when I抦 in cages\nI used to proof phrases, rolled dice with no aces\nNow I抦 just included in the oasis\nGotta take faces, no time  for car races\nCheck my sky, tell I got five pages\n\nCHORUS\n\nVerse 2:\nYo hit Lousiana, then Atlanta, Indiana\nForget a city slicker got country grammar\nAiyyo we goin places, where my sound scan ain抰 tough\nSo when I say I ain抰 Nore, yo it ain抰 that rough\nI leave the jake in my fake, askin all this stuff\nI gotta keep my mouth shut and don抰 say what, what\nBut yo its hard to, Netherlands got the heart to\nYo from New Orleans, L.A., V.A. to Queens\nThe I-95, now we hit the Phillipines\nBut now its different, we gotta stay sober\nYo, communicate, startech, motorola\nKeep it on the hush hush, don抰 talk to much\nThugged out entertainment, you know we touch\nAll our whips got navigation\nWhile you whips is just garbation\nIs you knowin what you facin?\n\nCHORUS\n\nVerse 3:\nThis is the life yo, of a superstar\nFly ass mansions, and a million cars\nGotta get the cash yo\nAnd its live or die\nThe Neptunes and Noreaga\nThe limit is the sky ...hit em?\nVerse 4:\nYo, lemme, do it again, do with the wind\nLast album was a eight, this one is a ten\nAnd when Capone come home, we gon?triple the cent\nYo I love my family, treat my folks of kin\nRockin air and better, like a Mexican\nShottin?at my pops, cause yo next to him\nHe told me every thug nigga is a gentlemen\nSo I took heed, take my time sitll won抰 speed\nYo a nigga got kids, so my family need\nA little more than they used to get\nReal, not the duplicate\nTakin no fours, makin y抋ll just recoupin?it\nDoin?it up, tell me whatcha wanna do wit?it\nCapone抯 plan, passport to foreign lands\nOverseas in  Japan, politickin with Chan\nYo, N-E-P-T-U-N-E-S\nThe way they lace a beat like on of the best, what?\n\nCHORUS\n\nRepeat Verse 3\n\nyo, N.O.R.E., Nore, sep?fo?now we on the run eatin\nyo, N.O.R.E., Nore, sep?fo?now we on the run eatin\nyo, N.O.R.E., Nore, sep?fo?now we on the run eatin\n"}