{"rank":"67","song_id":"20437","song_name":"Definition","artist_id":null,"display_artist":"Mos Def & Kweli Are Black Star","spotify_id":"4C7Ss9bTPOWJMh3rarF1mN","lyrics":"[Intro: Sample + Mos Def]\n\"Hello, everybody. Recording live from somewhere.\"\nLooooord... Lord have mercy\nAll nice and decent crew, follow me now, we say\nSay, Hi-Tek, yes, you're ruling hip-hop\nSay, J. Rawls, yes, you're ruling hip-hop\nRedefinition, say, you're ruling hip-hop\nSay, Black Star, come to rock it non\n\n[Verse 1: Mos Def]\nYo, from the first to the last of it, delivery is passionate\nThe whole and not the half of it, forecast and aftermath of it\nProjectile that them blasted with, accurate assassin shit\nMe and Kweli close like Bethlehem and Nazareth\nAfter this, you be pressing rewind on top your master disk\nShining like an asterisk for all those that be gathering\nConnecting like a roundhouse from the townhouse to the tenements\n'Cause all my Brooklyn residents, known as heavy regiments\nDon't believe, here the evidence—where Brooklyn? (Whoa)\nSee that? Bound to take it all, kid, believe that\nFrom where they sell they tree at, to where the police be at\nTalib Kweli, e-Kweli-ty, yo, tell 'em where we be at\n\n[Verse 2: Talib Kweli]\nBrooklyn, New York City, where they paint murals of Biggie\nIn cash we trust, 'cause it's ghetto fabulous, life look pretty\nWhat a pity—blunts is still fifty cents, it's intense\nTree scents is dominant, can't be covered with incense\nMy presence felt my name is Kweli from the Eternal Reflection\nPeople thinking MC is shorthand for misconception\nLet me meditate, set it straight, came to the conclusion\nThat most of these cats is featherweight, let me demonstrate\nWalking the streets is like battling, be careful with your body\nYou must know karate and think your soul is bulletproof like Sade\nStop actin' like a bitch already, be a visionary\nAnd maybe you can see your name in the column of obituaries\nThird grade teacher reading and talking about\n\"I knew he'd amount to nothing\"\nNeighbors like, \"He was the quiet type\nWho'd have thought they was fronting?\"\nTalking loud like you on RCA\nGet carted away with body parts and trays\nWhat a way to start your day, yo, it's like\n\n[Hook]\nOne, two, three\nMos Def and Talib Kweli\nWe came to rock it on to the tip-top\nBest alliance in hip-hop, Y-O\nI said one, two, three\nIt's kind of dangerous to be an MC\nThey shot 2Pac and Biggie\nToo much violence in hip-hop, Y-O\n\n[Verse 3: Mos Def]\nI said Manhattan keep on making it, Brooklyn keep on taking it\nSo relax we're taking it back, Red Hook where we're living at\nPlenty cats be struggling not hustling and bubbling\nIt ain't about production and – what else we discussing?\nWhen the cock crows, my crop grows, enable me to rock flows\nStriving for perfection ever since I was a snot-nose\nColossal! True original b-boy apostle\nStanding on the rooftop with the Zulu Gestapo\n\n[Verse 4: Talib Kweli]\nYou think you the shit\nSomebody in the wings'll force you to quit\nIt could be your crew or clique\nOr some random kid you smoked buddha with\nConsider me the entity within the industry without a history\nOf spitting the epitome of stupidity\nLiving my life, expressing my liberty, it gotta be done properly\nMy name is in the middle of equality\nPeople follow me, and other cats they hear 'em flow\nAnd assume I'm the real one with lyrics like I'm Cyrano\n\n[Verse 5: Mos Def]\nStill sipping wishing well water, imported from Pluto\nThree hundred and sixty milliliters for all the believers\nIn miles or kilometers, most cats, cannot proceed us\nIn the jungle with the leaders, we them lions, you the cheetahs\nOur cypher, will complete us as we come through your receivers\nYou can play us and repeat us and then take us home and read us\n(Line for line) Good Jesus! Mos Def and Kweli just\nMake a pussy freeze up; think it over, ease up\n\n[Hook]"}