{"rank":"3","song_id":"20448","song_name":"One Week","artist_id":"280685","display_artist":"Barenaked Ladies","spotify_id":"6R2QkjqfhsQhn3MsTYvMEz","lyrics":"[Verse 1]\nIt's been one week since you looked at me\nCocked your head to the side and said, \"I'm angry\"\nFive days since you laughed at me, saying\n\"Get back together, come back and save me\"\nThree days since the living room\nI realized it's all my fault, but couldn't tell you\nYesterday, you'd forgiven me\nBut it'll still be two days 'til I say I'm sorry\n\n[Verse 2: Ed Robertson]\nHold it now and watch the hoodwink\nAs I make you stop, think\nYou'll think you're looking at Aquaman\nI summon fish to the dish, although I like the Chalet Swiss\nI like the sushi 'cause it's never touched a frying pan\nHot like wasabi when I bust rhymes\nBig like LeAnn Rimes, because I'm all about value\nBert Kaempfert's got the mad hits\nYou try to match wits, you try to hold me but I bust through\nGonna make a break and take a fake\nI'd like a stinking aching shake\nI like vanilla, it's the finest of the flavours\nGotta see the show, 'cause then you'll know\nThe vertigo is gonna grow\n'Cause it's so dangerous, you'll have to sign a waiver\n\n[Chorus]\nHow can I help it if I think you're funny when you're mad?\nTrying hard not to smile, though I feel bad\nI'm the kind of guy who laughs at a funeral\nCan't understand what I mean? Well, you soon will\nI have a tendency to wear my mind on my sleeve\nI have a history of taking off my shirt\n\n[Verse 3]\nIt's been one week since you looked at me\nThrew your arms in the air and said, \"You're crazy\"\nFive days since you tackled me\nI've still got the rug burns on both my knees\nIt's been three days since the afternoon\nYou realized it's not my fault not a moment too soon\nYesterday, you'd forgiven me\nAnd now I sit back and wait til you say you're sorry\n\n[Verse 4: Ed Robertson]\nChickity China, the Chinese chicken\nYou have a drumstick and your brain stops tickin'\nWatching X-Files with no lights on\nWe're dans la maison\nI hope the Smoking Man's in this one\nLike Harrison Ford, I'm getting frantic\nLike Sting, I'm tantric\nLike Snickers, guaranteed to satisfy\nLike Kurasawa, I make mad films, okay, I don't make films\nBut if I did they'd have a Samurai\nGonna get a set of better clubs\nGonna find the kind with tiny nubs\nJust so my irons aren't always flying off the back-swing\nGotta get in tune with Sailor Moon\n'Cause that cartoon has got the boom anime babes\nThat make me think the wrong thing\n\n[Chorus]\nHow can I help it if I think you're funny when you're mad?\nTrying hard not to smile, though I feel bad\nI'm the kind of guy who laughs at a funeral\nCan't understand what I mean? Well, you soon will\nI have a tendency to wear my mind on my sleeve\nI have a history of losing my shirt\n\n[Verse 5]\nIt's been one week since you looked at me\nDropped your arms to your sides and said, \"I'm sorry\"\nFive days since I laughed at you and said\n\"You just did just what I thought you were gonna do\"\nThree days since the living room\nWe realized we're both to blame but what could we do?\nYesterday, you just smiled at me\n'Cause it'll still be two days 'til we say we're sorry\n\n[Outro]\nIt'll still be two days 'til we say we're sorry\nIt'll still be two days 'til we say \"Wasabi\"\nBirchmount Stadium, home of the Robbie"}