{"rank":"21","song_id":"20449","song_name":"Westside","artist_id":"277506","display_artist":"TQ","spotify_id":"6I3LsZncKrJG9mwv12FCEg","lyrics":"This is going out to the whole wide Westside,\nknow what I'm sayin, yeah,\nbrake it down for me,\nsteady mop rock, rock on\n\nI was just a young boy living the hood city (eastside Compton G)\nback in the days when Ice Cube and Eazy had every nigga talkin about\nboy you can't fuck with me remember Ice T had the power (oh,we)\nhear gunshots clickin by the hour\nWith Too $hort bumpin every supersport and\ntaught us all how to ride for the West coast\n\nTo my people's if you wit me where you at\nthrow your dubs in the air\nwave them like you just don't care\nFrom L.A. to the bay whatcha say\nall day every day any damn day\ntake a look around we got the whole world locked down\nGoing on and on and don't stop won't stop, can't stop the rideda\nThat's why I put it down for the Westside\n\nDidn't seem that long ago (oh,no)\nWe were stealin 40's out the liquor store(oh,no)\nmomma started trippin so it's time to go\nout to the park wit the locsters (huh)\neverybody broke smokin roaches.\nD.J. Quick was the shit had every nigga clamin\nhe was from the CPT\nya remember one time tried to clown\nwe had to burn this bitch on down.\n\nOne time for niggas in incarceration\nI blaze a dime for you for havin lots of patience\nTwo times for my sisters at the county building\nI got some westside love for all your ghetto children\nThree times for my niggas that have passed away\nI tip some gin for you and pray for better days\nOne day everything's going to be fine,\nbut until that day my only reply is Westside till I die.\n\nHook\nTo my people's if you wit me where you at\nthrow your dubs in the air and\nwave them like you just don't care\nFrom L.A. to the bay whatcha say\nall day every day any damn day\ntake a look around we got the whole world locked down\nGoing on and on and don't stop won't stop, can't stop the ride or die\nGot to give it up to the Westside.\n\nFrom Crenshaw to Foothill Blvd. all I see is\nrollers in my cars, datings in Five stars\nAll the true hogs is hittin switches and\nall the finest riches of course the bombest bitches don't get it\ntwisted.\nAsk me what's a real G, show me a nigga scraping back\nagainst the wall until his knuckles bleed. (knuckles bleed)\nScreaming death to all my enemies\nand those who don't believe\nWestcoast living be the shit to me\n\nOne time for niggas in incarceration\nI blaze a dime for you for havin lots of patience\nTwo times for my sisters at the county building\nI got some westside love for all your ghetto children\nThree times for my niggas that have passed away\nI tip some gin for you and pray for better days\nOne day everything's going to be fine,\nbut until that day my only reply is Westside till I die.\n\nTo my people's if you wit me where you at\nthrow your dubs in the air\nwave them like you just don't care\nFrom L.A. to the bay whatcha say\nall day every day any damn day\ntake a look around we got the whole world locked down\nGoing on and on (and on and on) and don't stop won't stop, can't stop\nthe ride or die, Gotta give it up to the Westsiiiiiddde\n\nDedicated to Eric \"Eazy E\" Wright, Tupac Shakur\nRest in Peace... homies.\n"}