{"rank":"20","song_id":"20459","song_name":"Just The Two Of Us","artist_id":"431377","display_artist":"Will Smith","spotify_id":"01F8B0dhzGdWvmcSO6vUdi","lyrics":"[Produced by Bass Brothers]\n\n[Intro]\nBaby, your dada loves you\nAnd I'ma always be here for you no matter what happens\nYou're all I got in this world\nI would never give you up for nothin'\nNobody in this world is ever gonna keep you from me\nI love you\n\n[Verse 1]\nC'mon Hai-Hai, we goin' to the beach\nGrab a couple of toys and let Dada strap you in the car seat\nOh, where's Mama? She's takin' a little nap in the trunk\nOh, that smell? Dada must've runned over a skunk\nNow, I know what you're thinkin', it's kind of late to go swimmin'\nBut you know your Mama, she's one of those type of women\nThat do crazy things, and if she don't get her way she'll throw a fit\nDon't play with Dada's toy knife, honey, let go of it! (no!)\nAnd don't look so upset, why you actin' bashful?\nDon't you wanna help Dada build a sandcastle? (yeah!)\nAnd Mama said she wants to show how far she can float\nAnd don't worry about that little boo-boo on her throat\nIt's just a little scratch – it don't hurt\nHer was eatin' dinner while you were sweepin'\nAnd spilled ketchup on her shirt\nMama's messy, ain't she? We'll let her wash off in the water\nAnd me and you can pway by ourselves, can't we?\n\n[Hook]\nJust the two of us, just the two of us\nAnd when we ride\nJust the two of us, just the two of us\nJust you and I\nJust the two of us, just the two of us\nAnd when we ride\nJust the two of us, just the two of us\nJust you and I\n\n[Verse 2]\nSee, honey, there's a place called Heaven and a place called Hell\nA place called prison and a place called jail\nAnd Dada's probably on his way to all of 'em except one\n‘Cause Mama's got a new husband and a stepson\nAnd you don't want a brother, do ya?\nMaybe when you're old enough\nTo understand a little better, I'll explain it to ya\nBut for now, we'll just say Mama was real, real bad\nShe was bein' mean to Dad and made him real, real mad\nBut I still feel sad that I put her on timeout\nSit back in your chair, honey, quit tryna climb out!\nI told you it's okay, Hai-Hai, want a ba-ba?\nTake a night-night? Nan-a-boo, goo-goo ga-ga?\nHer make poo-poo ca-ca? Dada change your didee\nClean the baby up so her can take a nighty-nighty\nYour dad'll wake her up as soon as we get to the water\n'97 Bonnie and Clyde: me and my daughter\n\n[Hook]\nJust the two of us, just the two of us\nAnd when we ride\nJust the two of us, just the two of us\nJust you and I\nJust the two of us, just the two of us\nAnd when we ride\nJust the two of us, just the two of us\nJust you and I\n\n\n[Verse 3]\nWake up, sweepyhead, we're here, before we pway\nWe're gonna take Mama for a wittle walk along the pier\nBaby, don't cry, honey, don't get the wrong idea\nMama's too sweepy to hear you screamin' in her ear  (Mama!)\nThat's why you can't get her to wake, but don't worry\nDada made a nice bed for Mommy at the bottom of the lake\nHere, you wanna help Dada tie a rope around this rock? (yea)\nWe'll tie it to her footsie then we'll roll her off the dock\nReady now, here we go, on the count of free\nOne, two, free — whee! (woosh!)\nThere goes Mama, spashin' in the water\nNo more fightin' with Dad, no more restrainin' order\nNo more stepdada, no more new brother\nBlow her kisses bye-bye, tell Mama you wuv her (Mommy!)\nNow we'll go play in the sand, build a castle and junk\nBut first, just help Dad with two more things out the trunk\n\n[Hook]\nJust the two of us, just the two of us\nAnd when we ride\nJust the two of us, just the two of us\nJust you and I\nJust the two of us, just the two of us\nAnd when we ride\nJust the two of us, just the two of us\nJust you and I\n\n[Outro]\nJust me and you, baby, is all we need in this world\nJust me and you\nYour dada will always be there for you\nYour dada's always gonna love you, remember that\nIf you ever need me I will always be here for you\nIf you ever need anything, just ask\nDada will be right there\nYour dada loves you — I love you, baby"}