{"rank":"63","song_id":"20481","song_name":"Don t Let It Go To Your Head","artist_id":"297065","display_artist":"Brand Nubian","spotify_id":"5wwLfjdiSHsgKyEO6V5rDe","lyrics":"[Grand Puba]\nNow a lot of people think this is easy as it looks\nBooks and books of rhyme concepts and hooks\nSession to session to get thoughts manifested\nStressin and stressin to hit the world with a blessin\nLot of people often ask, \"Puba how you givin' back?\"\nThe way I give back is through the knowledge of my raps\nLike a gem, for all my people caught out on a limb\nWho be givin in, caught out on a stem, who don't wanna win\n\"I'm feelin you I know you gettin down like that\nBut what I'm sayin Dog is let me hold a little somethin black!\nI'll hit you back!\" C'mon dead that, that's the tenth time\nI heard that—all you know is gimme I work hard for every penny\nThat I make—video and tape\nLP and CD, if I fall, you feedin me?\nNo dough to spread, always keep a level head\nLong as my seeds get fed, it won't go to my head, so..\n\n\"Don't let it go your head, no!\"\nEverybody love a star, when he on top\n\"Don't don't let it go your head, no!\"\nNobody comes around when the star start to drop\n\"Don't let it go your head, no!\"\nStrive to help others who help themselves\n\"Don't let it go your head, no no no no no!\"\nKnowledge of self, and good health and wealth\n\n[Sadat X]\nThe ladies a dame, no question but you can’t tell her that\nCuz sometimes she speed and put her hand out\nLike I'm that ATM nigga, drop me off at Chase\nEaring in her naval like she sex-u-al\nShe royalty but her whole loyalty to smoke\nGet wrecked in the kitchen like she run the cooking channel\nAnd then hide the heat in the car door\nGod damn she’s a mother to be, I’m hoping twins\nGive me a whole tribe\nAnd be as sexy as Janet was on the cover of Vibe\nShe slick talk, threaten to walk\nShe got a girlfriend I used to tap back when\nSo she always worry and bitches\nI tell her hold it down ma I give you high ranks\nSometimes you wild but I guess thats your style\nIf you lay up in my high-rise, will you stay wise?\nWill I slay thighs? Open your eyes, girl\n\n\"Don't let it go your head, no!\"\nDon't believe those jealous type cats\n\"Don't don't let it go your head, no!\"\nCause I'm the one makin some late night cash\n\"Don't let it go your head, no!\"\nI told you girl my home is my castle\n\"Don't let it go your head, no no no no no!\"\nUnderstand it won't be no hassle\n\n[Lord Jamar]\nI heard your single on the battle of the beats\nIt won five nights, I bet you had the time of your life\nWorkin so hard, and so long, to make a record\nFinally to make a song people respected\nCollect the dough at a show as you sip the Mo'\nNow you hittin the flo', you never hit befo'\nGot you trippin, how much better could it get?\nGot the leather with the work check, all up in the whip\nThey're all legitimate, callin it what it's really not\nThis is just one single you got, that's really hot\nTomorrow it could bust just like a blood clot\nLeave you in the dust with your body to rot\nAnother party to rock, if it's you or if it's me\nIt doesn't matter cause it just won't stop\nDon't let your gray matter pop\nCause when you release the album\nIf they don't cop, you gonna get dropped, so..\n\n\"Don't let it go your head, no!\"\nCause one single don't make you a hit\n\"Don't don't let it go your head, no!\"\nStay true to who you are don't never forget\n\"Don't let it go your head, no!\"\nKeep your feet on solid ground\n\"Don't let it go your head, no no no no no!\"\nCause what goes up, must come down, uhh\n\n\"Don't let it go your head, no!\"\n\"Don't don't let it go your head, no!\"\n\"Don't let it go your head, no!\"\n\"Don't let it go your head, no no no no no!\""}