{"rank":"55","song_id":"20556","song_name":"Changes","artist_id":"431886","display_artist":"2Pac","spotify_id":"00i2HU7TEzzftShjRrDSEF","lyrics":"[Verse 1: 2Pac]\nI see no changes, wake up in the morning and I ask myself\nIs life worth livin'? Should I blast myself?\nI'm tired of bein' poor and, even worse, I'm black\nMy stomach hurts so I'm lookin' for a purse to snatch\nCops give a damn about a negro\nPull the trigger, kill a nigga, he's a hero\n\"Give the crack to the kids, who the hell cares?\nOne less hungry mouth on the welfare!\"\nFirst ship 'em dope and let 'em deal to brothers\nGive 'em guns, step back, watch 'em kill each other\n\"It's time to fight back,\" that's what Huey said\nTwo shots in the dark, now Huey's dead\nI got love for my brother\nBut we can never go nowhere unless we share with each other\nWe gotta start makin' changes\nLearn to see me as a brother instead of two distant strangers\nAnd that's how it's supposed to be\nHow can the Devil take a brother if he's close to me?\nI'd love to go back to when we played as kids\nBut things change… and that's the way it is\n\n[Hook: Talent]\nThat's just the way it is\nThings'll never be the same\nThat's just the way it is, aww yeah\nThat's just the way it is\nThings'll never be the same\nThat's just the way it is, aww yeah\n\n[Verse 2: 2Pac]\nI see no changes, all I see is racist faces\nMisplaced hate makes disgrace to races\nWe under, I wonder what it takes to make this\nOne better place, let's erase the wasted\nTake the evil out the people, they'll be actin' right\n‘Cause both black and white are smokin' crack tonight\nAnd the only time we chill is when we kill each other\nIt takes skill to be real, time to heal each other\nAnd although it seems heaven-sent\nWe ain't ready to see a black president\nIt ain't a secret, don't conceal the fact\nThe penitentiary's packed, and it's filled with blacks\nBut some things will never change\nTry to show another way, but you stayin' in the dope game\nNow tell me, what's a mother to do?\nBein' real don't appeal to the brother in you\nYou gotta operate the easy way\n\"I made a G today,\" but you made it in a sleazy way\nSellin' crack to the kids\n\"I gotta get paid!\" — well hey, but that's the way it is\n\n[Hook: Talent]\nThat's just the way it is\nThings'll never be the same\nThat's just the way it is, aww yeah\nThat's just the way it is\nThings'll never be the same\nThat's just the way it is, aww yeah\n\n[Interlude: 2Pac]\nWe gotta make a change\nIt's time for us as a people to start makin' some changes\nLet's change the way we eat\nLet's change the way we live\nAnd let's change the way we treat each other\nYou see the old way wasn't workin'\nSo it's on us to do what we gotta do to survive\n\n[Verse 3: 2Pac]\nAnd still I see no changes; can't a brother get a little peace?\nIt's war on the streets and a war in the Middle East\nInstead of war on poverty\nThey got a war on drugs so the police can bother me\nAnd I ain't never did a crime I ain't have to do\nBut now I'm back with the facts, givin' it back to you\nDon't let 'em jack you up, back you up\nCrack you up and pimp-smack you up\nYou gotta learn to hold your own\nThey get jealous when they see you with your mobile phone\nBut tell the cops they can't touch this\nI don't trust this, when they try to rush I bust this\nThat's the sound of my tool\nYou say it ain't cool, my mama didn't raise no fool\nAnd as long as I stay black I gotta stay strapped\nAnd I never get to lay back\n‘Cause I always got to worry 'bout the payback\nSome buck that I roughed up way back\nComin' back after all these years\n\"Rat-a-tat-tat-tat-tat,\" that's the way it is\n\n[Hook: Talent]\nThat's just the way it is\nThings'll never be the same\nThat's just the way it is, aww yeah\n(You're my brother, you're my sister)\nThat's just the way it is\nThings'll never be the same\nThat's just the way it is, aww yeah\n\n[Outro: 2Pac]\nSome things'll never change"}