{"rank":"71","song_id":"20563","song_name":"Rosa Parks","artist_id":"321442","display_artist":"OutKast","spotify_id":"0shK5iZQppbHPQYiy60xs9","lyrics":"[Intro: André 3000 + Debra Killings]\nUh-huh, uh-huh, baby, yeah, yeah\nCut it up, oh, oh, oh!\nUh-huh, yeah, yeah, baby, uh-huh\nUh-cracka, lacka-lacka-lacka, cracka, lacka-lacka-lacka\nUh-huh, baby, uh-huh, yeah, yeah\nUh-cracka, lacka-lacka-lacka, cracka, lacka-lacka-lacka\nBaby, yeah, yeah, uh-huh, uh-huh\n\n[Hook: Big Boi]\nAh ha, hush that fuss\nEverybody move to the back of the bus\nDo you wanna bump and slump with us?\nWe the type of people make the club get crunk\nAh ha, hush that fuss\nEverybody move to the back of the bus\nDo you wanna bump and slump with us?\nWe the type of people make the club get crunk\n\n[Verse 1: Big Boi]\nMany a day has passed, the night has gone by\nBut still I find the time to put that bump off in your eye\nTotal chaos, for these playas, thought we was absent\nWe takin' another route to represent the Dungeon Family\nLike Great Day, me and my nigga decide to take the back way\nWe stabbin' every city then we headed to that Bat cave\nATL, Georgia, what do we do for ya?\nBulldoggin' hoes like them Georgetown Hoyas\nBoy, you sounding silly, think my Brougham ain't sittin' pretty\nDoing doughnuts 'round you suckas like them circles around titties\nDamn, we, the committee, gon' burn it down\nBut us gon' bust you in the mouth with the chorus now\n\n[Hook: Big Boi]\nAh ha, hush that fuss\nEverybody move to the back of the bus\nDo you wanna bump and slump with us?\nWe the type of people make the club get crunk\nAh ha, hush that fuss\nEverybody move to the back of the bus\nDo you wanna bump and slump with us?\nWe the type of people make the club get crunk\n\n[Verse 2: André 3000]\nI met a gypsy and she hipped me to some life game\nTo stimulate then activate the left and right brain\nSaid, \"Baby boy, you only funky as your last cut\nYou focus on the past, your ass'll be a 'has-what'\"\nThat's one to live by or either that's one to die to\nI try to just throw it at you, determine your own adventure\nAndre, got to her station, here's my destination\nShe got off the bus, the conversation lingered in my head for hours\nTook a shower, kinda sour 'cause my favorite group ain't comin' with it\nBut I'm witchya 'cause you probably goin' through it anyway\nBut anyhow, when in doubt, went on out and bought it\n'Cause I thought it would be jammin' but examine all the flawsky-wawsky\nAwfully sad and it's costly, but that's all she wrote\nAnd I hope I never have to float in that boat\nUp shit's creek, \"It's weak\" is the last quote\nThat I want to hear when I'm goin' down when all's said and done\nAnd we got a new joe in town\nWhen the record player get to skippin' and slowin' down\nAll y'all can say is, \"Them niggas earned that crown\", but until then\n\n[Hook: Big Boi]\nAh ha, hush that fuss\nEverybody move to the back of the bus\nDo you wanna bump and slump with us?\nWe the type of people make the club get crunk\nAh ha, hush that fuss\nEverybody move to the back of the bus\nDo you wanna bump and slump with us?\nWe the type of people make the club get crunk\n\n[Harmonica Solo: Pastor Robert Hodo]\n\n[Hook: Big Boi]\nAh ha, hush that fuss\nEverybody move to the back of the bus\nDo you wanna bump and slump with us?\nWe the type of people make the club get crunk\nAh ha, hush that fuss\nEverybody move to the back of the bus\nDo you wanna bump and slump with us?\nWe the type of people make the club get crunk\nAh ha, hush that fuss\nEverybody move to the back of the bus\nDo you wanna bump and slump with us?\nWe the type of people make the club get crunk\nAh ha, hush that fuss\nEverybody move to the back of the bus\nDo you wanna bump and slump with us?\nWe the type of people make the club get crunk\n\n[Skit: Raekwon + Outkast]\nIt's just major right here you know what I'm saying, yo son, my niggas, your niggas is on it man, straight up man\nWord man, glad we got together to do this, you know on time outs, everybody North, South, East, West, you know what we saying, we doing this thing straight up for hip-hop\nWe handling the earth right now you niggas don't even know\nFor sure\nYou know what I mean? If it wasn't for us tryna enlighten y'all niggas with all types of flows and flavors, the game wouldn't be the same\nYou gotta keep it innovative and new, creative. You know what I'm sayin'? Some people don't wanna hear the same thing old over and over\nNo doubt, you gotta come provocative nigga, know what I mean? Shit gotta be spine-tingling with mad styles and crazy dangerous, I mean, ball-busting, shit open beats you know what I mean? It's like yo, niggas don't even know, so we gon' play some funky shit for ya\nThat's right\nStraight up, pay up, pay up man\nFrom East Point to Shaolin, y'all better know that, yeah!\nHit this Henny"}