{"rank":"66","song_id":"20618","song_name":"Unsent","artist_id":"278329","display_artist":"Alanis Morissette","spotify_id":"1pLbd91sslN51VJL83pm51","lyrics":"Dear Matthew, I like you a lot.\nI realize you're in a relationship with someone \nright now,\nAnd I respect that.\nI would like you to know that if you're ever single in the future,\nAnd you want to come visit me in California,\nI would be open to spending time with you,\nAnd finding out how old you were when you wrote your first \nsong.\n\nDear Jonathan, I liked you too much.\nI used to be attracted to boys who would lie to me,\nAnd think solely about themselves,\nAnd you were plenty self-destructive for my taste at the time.\nI used to say the more tragic the better.\nThe truth is, whenever I think of the early 90's,\nYour face comes up with a vengeance like it was yesterday.\n\nDear Terrance, I love you muchly.\nYou've been nothing but open hearted,\nAnd emotionally available and supportive,\nAnd nurturing, and consummately there for me.\nI kept drawing you in and pushing you away,\nI remember how beautiful it was to fall asleep on your couch,\nAnd cry in front of you for the first time.\nYou were the best platform from which to jump beyond myself.\nWhat was wrong with me?\n\nDear Marcus, you rocked my world.\nYou had a charismatic way about you with the woman,\nAnd you got me seriously thinking about spirituality.\nAnd you wouldn't let me get away with kicking my own ass.\nBut I could never really feel relaxed,\nAnd looked out for around you, though,\nAnd that stopped us from going any further than we did.\nAnd it's kinda too bad,\nBecause we could've had much more fun.\n\nDear Lou, we learned so much.\nI realize we won't be able to talk for some time,\nAnd I understand that as I do you.\nThe long distance thing was the hardest,\nAnd we did as well as we could.\nWe were together during a very tumultuous time in our lives.\nI will always have your back and be curious about you,\nAbout your career,\nYour whereabouts."}