{"rank":"94","song_id":"20631","song_name":"Ruff Ryders  Anthem","artist_id":"300046","display_artist":"DMX","spotify_id":"32SFvZODywPBVDYSYtqxCj","lyrics":"[Produced by Swizz Beatz]\n\n[Hook]\nStop, drop, shut 'em down, open up shop\nOh, no, that's how Ruff Ryders roll\nStop, drop, shut 'em down, open up shop\nOh, no, that's how Ruff Ryders roll\n\n[Verse 1]\nNiggas wanna try, niggas wanna lie\nThen niggas wonder why niggas wanna die\nAll I know is pain, all I feel is rain\nHow can I maintain with that shit on my brain\nI resort to violence, my niggas move in silence\nLike you don't know what our style is\nNew York niggas the wildest\nMy niggas is with it; you want it, come and get it\nTook it, then we split it, you fuckin' right we did it\nWhat the fuck you gon' do when we run up on you?\nFuckin' with the wrong crew\nDon't know what we're goin' through\nI'ma have to show niggas how easily we blow niggas\nWhen you find out there's some mo' niggas\nThat's runnin' with yo' niggas\nNothin' we can't handle, break it up and dismantle\nLight it up like a candle, just ‘cause I can't stand you\nPut my shit on tapes like you bustin' grapes\nThink you holdin' weight, then you haven't met the apes\n\n[Hook]\nStop, drop, shut 'em down, open up shop\nOh, no, that's how Ruff Ryders roll\nStop, drop, shut 'em down, open up shop\nOh, no, that's how Ruff Ryders roll\n\n[Verse 2]\nIs y'all niggas crazy? I'll bust you and be Swayze\nStop actin' like a baby; mind your business, lady!\nNosy people get it too, when you see me spit at you\nYou know I'm tryin' to get rid of you, yeah I know, it's pitiful\nThat's how niggas get down, watch my niggas spit rounds\nMake y'all niggas kiss ground, just for talkin' shit, clown\nOh, you think it's funny? Then you don't know me, money\nIt's about to get ugly, fuck it, dawg, I'm hungry\nI guess you know what that mean, come up off that green\nRob niggas on ravine, don't make it a murder scene\nGive a dog a bone, leave a dog alone\nLet a dog roam and he'll find his way home\nHome of the brave, my home is a cage\nAyo, I'ma slave 'til my home is a grave\nI'ma pull capers, it’s all about the papers\nBitches caught the vapors, and now they wanna rape us\n\n[Hook]\nStop, drop, shut 'em down, open up shop\nOh, no, that's how Ruff Ryders roll\nStop, drop, shut 'em down, open up shop\nOh, no, that's how Ruff Ryders roll\n\n[Verse 3]\nLook what you done started, asked for it, you got it\nHad it, shoulda shot it, now you're dearly departed\nGet at me, dawg, did I rip shit? With this one here I flip shit\nNiggas know when I kick shit it's gon' be some slick shit\nWhat was that look for when I walked in the door?\nOh, you thought you was raw? BOOM! Not anymore\n‘Cause now you on the floor, wishin' you never saw\nMe walk through that door with that .44\nNow it's time for bed, two more to the head\nGot the floor red, yeah, that nigga's dead\nAnother unsolved mystery, it's goin' down in history\nNiggas ain't never did shit to me\nBitch-ass niggas can't get to me\nGots to make the move, got a point to prove\nGotta make them groove, got 'em all like, \"Ooh!\"\nSo to the next time you hear this nigga rhyme\nTry to keep your mind on gettin' pussy and crime\n\n[Hook]\nStop, drop, shut 'em down, open up shop\nOh, no, that's how Ruff Ryders roll\nStop, drop, shut 'em down, open up shop\nOh, no, that's how Ruff Ryders roll\n\n[Outro]\nTalk is cheap, mothafucka!"}