{"song_name":"If You (Lovin  Me)","artist_id":279311,"display_artist":"Silk","spotify_id":"null","lyrics":"Feelin' like lovin' me\nBeen checking you for so long and I feel\nGirl, you should let me know what the deal\nBeen peepin' out your vibe (vibe)\nAnd if you wanna let me slide (slide)\nSo what you need to do right now is keep it real\nI know you want me, girl, just like I want you (you)\nSo stop frontin' like you don't when you do (do)\nSo if you feelin' naughty-naughty\nAnd if you really bout it-bout it\nAnd if you keep me rowdy-rowdy\nMy love will make you shout it-shout it\n\nChorus:\nIf you (If you feelin' like lovin'me)\nIf you (If you feelin' like kissin' me)\nIf you (If you feelin' like lovin'me, holdin' me)\nFeelin' like lovin' me\nSo on those lonely nights girl, I'm here for you (you)\nLet me come satisfy you for an hour or two (two)\nBaby, don't be shy\n'Cause I'm not judging you\nI'm dyin' for your love so can we do it\nGirl, if I told you 'bout them things we can do (do)\nThen let's be about them things we can do (do)\nSo if you feelin' naughty-naughty\nAnd if you feelin' bout it-bout it\nWant cha' keep rowdy-rowdy\nMy love will make you shout it-shout it\n\nChorus:\nIf you (It's a silky, silky, silky thang)\nIf you (Silky, silky, silky, silky thang)\nIf you (No, no, no, no, no, no, no)\n(Yeah, yeah, yeah, yeah) Feelin' like lovin' me\n\nBridge:\nSee I got something for you, meet me in my bedroom\n(So we can love the night away) Ah yeah, Ah yeah\nI'm tryin' to be for real, wanna show you how I feel, inside (inside)\n'Cause I know that you feelin' like love\n('Cause I know that you feelin' like love)\nOhh, ohh, ohh...\n\nChorus:\nIf you (Baby yeah, yeah, yeah)\nIf you (If you feelin' like baby yeah)\nIf you (Lovin' me, lovin' me hey)\n(Let me hear you say yeah, yeah) If you\n(Yeah, yeah)\nOhh wee (Say yeah, eah, eah, eah)\n(Yeah, eah, eah, eah)\nOhh wee (Oh, if you feelin' like comin' home with Silk tonight, let me\nHear\nYou say yeah)\nOhh wee (Yeah)\n(Ye-ah, yeah, yeah)\n(Yeah, yeah)\nBreak:\nWe lovers have returned tonight, we wanna make love to you\nSo bring your sexy lips my dear, over here let me do the things I do\nIn my bed, I'm gonna love you down just like a playa would\nThen turn you out, my super star, make you feel real good\nI'll find out if you feelin' like lovin' me, sexin' me, holdin' me\nKissin'\nMe, squeezin' me ouuuuu\nSay yeah, yeah (Yeah. Yeah. Yeah. Yeah) (Repeat 4x's)"}