{"song_name":"Everybody s Free (To Wear Sunscreen)","artist_id":280803,"display_artist":"Baz Luhrmann","spotify_id":"null","lyrics":"Ladies and Gentlemen of the class of ’99.\nWear Sunscreen.\nIf I could offer you only one tip for the future, sunscreen would be\nit. The long term benefits of sunscreen have been proved by\nscientists whereas the rest of my advice has no basis more reliable\nthan my own meandering experience…\nI will dispense this advice now.\n\nEnjoy the power and beauty of your youth;\noh nevermind; you will not  understand the power and beauty of your youth until they have faded.\nBut trust me, in 20 years you’ll look back at photos of yourself\nand  recall in a way you can’t grasp now how much possibility lay before\nyou and how fabulous you really looked….\nYou are not as fat as you imagine.\n\nDon’t worry about the future; or worry, but know that worrying is as\neffective as trying to solve an algebra equation by chewing bubblegum.\nThe real troubles in your life are apt to be things that\nnever crossed your worried mind;\nthe kind that blindside you at 4pm on some idle Tuesday.\n\nDo one thing everyday that scares you\n\nSing\n\nDon’t be reckless with other people’s hearts,\ndon’t put up with people who are reckless with yours.\n\nFloss\n\nDon’t waste your time on jealousy; sometimes you’re ahead, sometimes you’re behind…\nthe race is long, and in the end, it’s only with yourself.\n\nRemember the compliments you receive, forget the insults;\nif you succeed in doing this, tell me how.\n\nKeep your old love letters, throw away your old bank statements.\n\nStretch\n\nDon’t feel guilty if you don’t know what you want to do with your life…\nthe most interesting people I know didn’t know at 22 what they wanted to do with their lives,\nsome of the most interesting 40 year olds I know still don’t.\n\nGet plenty of calcium.\n\nBe kind to your knees, you’ll miss them when they’re gone.\n\nMaybe you’ll marry, maybe you won’t,\nmaybe you’ll have children,maybe you won’t,\nmaybe you’ll divorce at 40, maybe you’ll dance the funky chicken on your 75th wedding anniversary…\nwhat ever you do, don’t congratulate yourself too much or berate yourself either –\nyour choices are half chance, so are everybody else’s.\nEnjoy your body,\nuse it every way you can…\ndon’t be afraid of it, or what other people think of it,\nit’s the greatest instrument you’ll ever own..\n\nDance…even if you have nowhere to do it but in your own living room.\n\nRead the directions, even if you don’t follow them.\n\nDo NOT read beauty magazines, they will only make you feel ugly.\n\nGet to know your parents, you never know when they’ll be gone for good.\n\nBe nice to your siblings;\nthey are the best link to your past\nand the people most likely to stick with you in the future.\n\nUnderstand that friends come and go,but for the precious few you should hold on.\nWork hard to bridge the gaps in geography and lifestyle\nbecause the older you get,\nthe more you need the people you knew when you were young.\n\nLive in New York City once, but leave before it makes you hard;\nlive in Northern California once, but leave before it makes you soft.\n\nTravel.\n\nAccept certain inalienable truths,\nprices will rise,\npoliticians will philander,\nyou too will get old, and when you do you’ll fantasize that when you were young\nprices were reasonable,\npoliticians were noble\nand children respected their elders.\n\nRespect your elders.\n\nDon’t expect anyone else to support you.\nMaybe you have a trust fund,\nmaybe you have a wealthy spouse;\nbut you never know when either one might run out.\n\nDon’t mess too much with your hair,\nor by the time you're 40, it will look 85.\n\nBe careful whose advice you buy, but,\nbe patient with those who supply it.\nAdvice is a form of nostalgia,\ndispensing it is a way of fishing the past from the disposal, wiping it off,\npainting over the ugly parts and recycling it for more than it’s worth.\n\nBut trust me on the sunscreen…\n"}