{"rank":"91","song_id":"20676","song_name":"Holla Holla","artist_id":"276599","display_artist":"Ja Rule","spotify_id":"76U2EPLkbB03KIvmrzDbnn","lyrics":"Chorus: (2X)\n(Holla Holla)\nAll my niggaz thats ready to get (Dollaz Dollaz)\nBitches know who can get em a little (Hotta Hotta)\nCome on, If you rollin' wit me (Folla Folla)\nIts Murda..\n\n[Ja Rule]\nThink you fuckin' wit Ja, Nada\nWatcha wanna go Dolla for Dolla??? (Holla Holla)\nMy niggaz is (Hotta Hotta)\nFucks plenty bitches, and dug bitches for petty niggaz\nYou look in me eyes and tell me they style aint ridiculous\n(Bitches Bitches) Pop da pussy and bounce like (Hit it Hit it)\nSure if your favorite is long (Get it Get it) Baby Baby\nDont you wanna leave tonight and fuck with me\nCause we really need to be freaking off at any cost\nIts on me, if you married, then get a divorce\nWhen I hits it, some women get twisted\nHave em' twitchin', like \"Damn look what the dick did\"\nI just wanna hit it the worst way, right after a long day\nAnd put the puss on lay-a-way, Heard me?\nIm that, Dirty nigga that get you hot, and heat it\nBaby girl if you wanted ass, why dont you eat it?\n\n[Chorus: x2]\n\n[Ja Rule]\nLet me holla at my true thugs\nIf niggas want war, bust slugs\nNigga, what? Im hotta hotta and just cant be touched\nPlus, anybody that fucks with me, gonna get felt\nHow many want it? Determines how the slugs get dealt\nCuz I (Spit em' Spit em')\nChoke them niggas like roaches and then (Clip em' Clip em)\nLong as Im alive, Ima (Hit em' Hit em')\nRespect mines, to the day of my demise\nDont fuck with me, cuz the flow's (Killa Killa)\nWhoever eva who wants it?\nIts yours, now your gonna (Get it Get it)\n(Feela Feela) Nigga full of holes\nTreat em' like hoes, and show no love to them homo thugs\nIts us you wanna fuck with\nAs soon as them slugs skip from body to body\nGo from grave to bit\nI dont respect it, plus niggas commited treason\nWho want it with Ja? Who ready to die breathing?\n\n[Chorus x2]\n\n[Ja Rule]\nJa baby, one of the many, many niggas who sip Henny\nWith the the two seaters, sittin on twenties\nI, I be wit running in, running out\nThen, thou bestow hit em' up, gun em' down\nNiggaz aint ready for Ja, any way, any how\nI give it give it to niggaz, claimin' that they live it\nReal (Niggaz Niggaz) brandish the iron and flash\nLike (Hold this Hold this) when you got nothing to live for\nNotice, niggaz be hot, and more explosive\nFocus, ready to rip em' up with the dope, this\nMy life, niggaz is frontin', and stuntin' for nothing\nBetter act right, fore' I spark and dim your lights\nIm a hazard, to niggaz, a bastard\nTo bitches, when in doubt, go for stealth, and clap the finish\nAnything movin' rightfully hit for wrong doin'\nI'ma follow and enourage all my niggaz to WHAT?!?\n\n[Chorus: Repeat til' end]\n"}