{"rank":"65","song_id":"20705","song_name":"No Pigeons","artist_id":"280215","display_artist":"Sporty Thievz Featuring Mr. Woods","spotify_id":"6r78MF6BFaeEG8rBw9Y5nQ","lyrics":"Nada, Franchise\nNada, Shotcallers\nYeah, Sporty Thievz, Sporty Thievz\n\nA Pigeon is a girl who be walkin' by\nMy rimmed up blue, brand new sparklin' five\nHer feet hurt so you know she want a ride\nBut she frontin' like she can't say hi\nWhat?\n\n1 - (Uh oh) Ya'll chicks ain't gettin' nada\n(Uh oh) Your pussy ain't worth the Ramada\n(Uh oh) Anyway your friend looks hotter\n(Uh oh) Game is somethin' we got alot a\n\n2 - (Uh oh) Cause I don't want no Pigeons\nThem be them girls who gets no dubs from me\nPlayin' the bar dumb broke wit her best friend's coat\nTryin' to holler at me\n\nI don't want no Pigeons\nThem be them girls who gets no dubs from me\nPlayin' the bar dumb broke wit her best friend's coat\nTryin' to holler at me\n\nIn front of the club I see this girl like, \"Yo love\"\nThought she said thug but she called me a scrub\nScrub? What? She musta talk me a joke\nBroke Pigeonhead freak, you lucky I spoke\nThis ain't my Benz there, it's my man's, yeah\nBut this ain't my car like that ain't your hair\n(Uh-Oh) Pigeon, take them fake jewels off\n(Uh-oh) Pigeon, take your friend's shoes off\n(Uh-Oh) Pigeon, the hell with that crazy shit\nYa'll make me sick, go home and fuckin' babysit\nMy big dogs gon' love this\nKing Kirk bitch, get a brush, and scrub this (right)\n\nYo, chill cousin, these birds is ill cousin\nCause they call me scrub like we can't even bill cousin\nTrick Ronald's, you ain't worth the McDonalds\nThrow you on the street team, make you shit vinyls\nHey yo Flex, shorty tried to flash me wrong\nHow she gonna wear sandals wit nasty corns?\nThat be wrong\nI wonder how you get hearts\nIn dirty Victoria draws with the skidmarks\nUh, ya flat ass gets enough laughs\nTake it to the salon, pluck ya mustache\nSo next time you shotgun, and that ho bitchin'\nHittin' you a scrub, call that bitch a Pigeon\n\nHey yo, I got two nuts bitch, choose a ball\nYou only walk Pigeon-toed cause ya shoes are small\nYou don't shop, you just cruise the mall\nNo dough, with Lee Press-Ons\nFrontin' with ya girlsfriend dress on\nYou birds wanna take over?\nGet some cash and a Jenny Jones makeover\nBroke Bitches, I hate Pigeons\nDirty braid Pigeons, medicaid Pigeons, Section Eight Pigeons\nGot me fed, burned I tell these birds Shutup\nAnd how my left ear be double her whole getup\nGo ahead with your lame ass, blow at night\nThrow a ripped dolla at her, tell her, \"Put that on your train pass\"\n\nIf you got more than one baby father\nOh yes girl, we's talkin to you\nIf you strip all week to go clubbin'\nOh yes girl, we's talkin to you\nBuy a dress to front and take it back to the store\nOh yes girl, we's talkin to you\nWanna smoke wit me, wit no money\nOh no, I don't want no\n\nNo Pigeons, No Pigeons\n\n[DJ Rhude]\nGreet your highness, Queen's finest\nGleam shin as three clip street fighters\nDeep dish Jeep riders\nOutlandish in they expanded rover\nPassenger in my own whip, yeah that's my chauffer\nI rap for ya, that's my culture\nWhen I holla holla like Ja Rule\nYou in a trance from the god's jewels\nGlance at my car, drool\nGrand like the Concourse\nWonderin' damn, how much the car cost?\nYa just another fan, applause, encores\nAnd when I fly through world tours on Concords\nDon't need no chicken drippin, save that for Lipton\nNo scrubs here, strictly Mo' Thugs, dear\nCheck the listings, no Pigeons\nFlat broke chicks, out to get rich off the next bro's shit\nInstead of TLC, you give us brotha's B.I.G. trouble\nWe're just Sporty Thievz, huddle game with the illest rebuttal"}