{"rank":"73","song_id":"20745","song_name":"The Secret Of Life","artist_id":"276160","display_artist":"Faith Hill","spotify_id":"5wYgJcEdKam1nYSybFuOIe","lyrics":"Couple of guys sittin' 'round drinking\r\ndown at the Starlight Bar.\r\nOne of em' says, \"You know I've been thinking...\"\r\nOther one says, \"That won't get you too far.\"\r\nHe says, \"This is your life, and welcome to it.\r\nIt's just working and drinking and dreams.\r\nAd on TV says 'Just Do It.'\r\nHell if I know what that means.\"\r\n\r\nThe secret of life is a good cup of coffee,\r\nthe secret of life is keep your eye on the ball.\r\nThe secret of life is a beautiful woman;\r\nMarilyn stares down from the barroom wall.\r\n\r\n\"You and me, we're just a couple of zeros,\r\njust a couple down an' outs.\r\nMovie stars and football heroes\r\nwhadda they got to be unhappy about? Yeah...\"\r\nSo they turn to the bartender,\r\n\"Sam, what do you think,\r\nwhat's the key that unlocks that door?\"\r\nSam don't say nothin', just wipes off the bar\r\nand he pours them a couple more.\r\n\r\nSecret of life is in Sam's martinis,\r\nthe secret of life is in Marilyn's eyes.\r\nThe secret of life is in Monday Night Football,\r\nRolling Stones' records, mom's apple pie.\r\n\r\nSam looks up from his Sunday paper\r\nsays \"Boys you're on the wrong track.\r\nThe secret of life is their ain't no secret,\r\nand you don't get your money back.\" Hey.\r\n\r\nThe secret of life is gettin' up early,\r\nthe secret of life is stayin' up late.\r\nThe secret of life is try not to hurry,\r\nbut don't wait.\r\nDon't wait.\r\n\r\nThe secret of life is a good cup of coffee,\r\nthe secret of life is keep your eye on the ball.\r\nThe secret of life is to find the right woman,\r\nthe secret of life is nothing at all.\r\n(Oh it's nothin' at all.)\r\nThe secret of life...\r\n\r\nCouple guys sittin' 'round drinking\r\ndown at the Starlight Bar.\r\nOne of 'em says, \"You know I've been thinking...\"\r\nOther one says \"That won't get you too far.\"\r\nThat won't get you too far."}