{"rank":"80","song_id":"20794","song_name":"Get Gone","artist_id":"276491","display_artist":"Ideal","spotify_id":"0CofintZCm8MhxiOMrauiT","lyrics":"[Intro]\nHey, come in here for a minute\nSit down\nCome here, cause we gotta talk, Okay\nWell, you just stay here for a little bit tonight\nMan, I don't even know where to start\nYo, I want you try to understand somethin', okay?\nNow, just listen\n\n[Verse 1]\nIn the beginning, you know I tried\nTo make it work for you and I\nSeems like I was always by myself\nLike you didn't ever, ever wanna help\nThe strain you put on me, you let me down\nCan you tell me why, after all I've done?\nFor you and us\nYou know I really hate to say it, but I gotta tell you som'\n\n[Chorus]\nI think I better leave (leave) you alone (alone)\nSo get your bags (yeah) and get the hell on (on)\nSee, because I don't want you no more\n(I don't want you no more)\nI think you better leave (leave) me alone (alone)\nSo get your bags (yeah), get the hell on (get gone)\nBecause love ain't here no more\n\n[Verse 2]\nI don't know if it hurts\nTo hear me say all of these words\nBut then again, I guess by now\nI really don't care\n(See I've waited much too long)\nAlways thought that it could work\nThought it could be, forever you and me\nTell me, what happened to us?\nWait a minute, don't speak\nRight now all I wanna do is see you leavin'\n\n[Chorus]\n(Leave) me alone (alone)\nGet your bags (yeah), get the hell on (on on)\nCause I don't want you no more\nSaid I think I better leave (leave) you alone (alone)\nGet your bags (yeah), get the hell on (get gone)\nCause love ain't here no more\n\n[Bridge]\nSee, I tried to do it right\nTried to make you see the light\nAll that I wanted, all that I needed, was you in my life\nHavin' broke down and for what?\nChanged so many times, forgot who the real me was\nBut it's alright, I said it's cool\nCause I'm getting rid of you\n\n[Chorus]\nI think it's time to leave (leave) me alone (alone)\nGet your bags (yeah), get the fuck on (on on)\nBecause love don't want you no more\nSaid I think it's time to leave (leave) me alone (alone)\nGet to steppin' (yeah), get the hell on (get gone)\nLove (love) ain't (ain't) here (here) no more (no more)\n\nOh leave (leave) me alone (alone)\nGet your bags (yeah), leave the keys on the table (on on)\nCause I don't want you no more\n(See I've waited much too long)\nSaid I think you better leave (leave) me alone (alone)\nGet to steppin' (yeah), get gone (get gone)\nCause love ain't here no more\n\n[Outro](Fades)\nYou better get on (get on), get on (get on)\nGet on (get on), you ain't takin' a thing (get on)\nJust get on (get on), get on\nGet on (get on), leave the credit cards with me"}