{"song_name":"Baby Don t Cry (Keep Ya Head Up II)","artist_id":431886,"display_artist":"2Pac + Outlawz","spotify_id":"3y5pef5Z472KoYxaSdig9I","lyrics":"[Produced by 2Pac and Karlin & Soulshock]\n\n[Intro: 2Pac & H.E.A.T.]\nI feel you (uhh), baby don't\nBut you can't, you can't give up\n(H.E.A.T., 2Pac with, Outlawz!)\n\n[Hook: 2Pac & H.E.A.T.]\nBaby don't cry! I hope you got your head up (Outlawz)\nEven when the road is hard, never give up!\nBaby don't cry! I hope you got your head up\nEven when the road is hard, never give up! (Keep ya head up)\n\n[Verse 1: 2Pac]\nNow here's a story 'bout a woman with dreams\nSo picture perfect at 13, an ebony queen\nBeneath the surface it was more than just a crooked smile\nNobody knew about her secret so it took a while\nI could see a tear fall slow down her black cheek\nSheddin' quiet tears in the back seat; so when she asked me\n\"What would you do if it was you?\"\nCouldn't answer such a horrible pain to live through\nI tried to trade places in the tragedy\nI couldn't picture three crazed niggas grabbin' me\nFor just a moment I was trapped in the pain\nLord, come and take me\nFour niggas violated, they chased and they raped me\nEven though it wasn't me, I could feel the grief\nThinkin' with your brains blown that would make the pain go\nNo! You got to find a way to survive\n‘Cause they win when your soul dies\n\n[Hook: 2Pac & H.E.A.T.]\nBaby please don't cry!, you got to keep your head up\nEven when the road is hard, never give up!\nBaby don't cry!, you got to keep your head up\nEven when the road is hard, never give up!\n(Baby don't cry!) baby don't cry!, I hope you got yo' head up\nEven when the road is hard, never give up! (keep ya head up)\nBaby don't cry!, I hope you got your head up (never give up)\nEven when the road is hard, never give up!\nBaby don't cry…\n\n[Verse 2: Edi Amin]\nForget him, girl, he ain't gon' never change\nI ain't no hater but that nigga lost in the game\nAfter the bright lights and big thangs\nHe probably could love you, but he in love with the struggle\nEveryday, his mind on gettin' mo'\nAnd never your feelings, he's chasin' millions for sho'\nUh oh, now you 'bout to have his baby?\nAnother wild-ass nigga that's gon' drive you crazy\nYou got too much mo' livin' to do – I'm spittin' this to you\n‘Cause you deserve more than what he givin' to you\nBeautiful, black, precious, and complicated\nA new millennium dime piece, so fine she\nGot 'em all stuck standin' still when she come through\nBaby, take a little mo' time, love'll find you\nAnd sho' as the sky's blue somebody other than me\nGon' give you everythin' you need, feel me? (Don't cry-ahh…)\n\n[Hook: 2Pac & H.E.A.T.]\n(Baby don't cry!) baby don't cry!, you got to keep your head up\nEven when the road is hard, never give up!\n(Baby don't cry!) baby don't cry!, you got to keep your head up\nEven when the road is hard, never give up! (you'll be alright)\n(Baby don't cry!) baby don't cry!, I hope you got your head up\nEven when the road is hard, never give up! (keep ya head up)\n(Baby don't cry!) baby don't cry!, I hope you got your head up (never give up)\nEven when the road is hard, never give up! (no no.. ohhhh)\nBaby don't cry…\n\n[Verse 3: Young Noble]\nI'm tryin' to do all that I can\nFrom jump, now you losin', you was choosin' the wrong man\nDealt the wrong hand, you was young and beautiful\nLost and turned out, what you let that nigga do to you?\nI knew her since elementary, she blew a kiss to me\nWrote me a note in crayon, wantin' to get with me\nWe was kids, now she got three kids\nThey see their father e'ryday, and they don't know who he is\nSeen him last night, homie roll a E-class\nMad cheese in the stash, still a deadbeat dad\nI bring her Pampers and food, just to stop through\nBut those ain't my seeds, nothin' really I could do\nI feel pity for you, you ain't even his wife\nSeventeen with three kids, locked down for life\nShould've chose me, she 'bout to OD from the pressure\nHell nah, I won't let her (BABY..)\n\n[Hook: 2Pac & H.E.A.T.]\n(Baby don't cry!) baby don't cry!, you got to keep your head up\nEven when the road is hard, never give up!\n(Baby  don't cry!) baby don't cry!, you got to keep your head up\nEven when the road is hard, never give up!\n(Baby don't cry!) baby don't cry!, I hope you got your head up\nEven when the road is hard, never give up!\n(Baby don't cry!) baby don't cry!, I hope you got your head up (never give up)\nEven when the road is hard, never give up!\n(Baby don't cry!) baby don't cry!, you got to keep your head up\nEven when the road is hard, never give up!\n(Baby  don't cry!) baby don't cry!, you got to keep your head up\nEven when the road is hard, never give up!\n(Baby don't cry!) baby don't cry!, I hope you got your head up\nEven when the road is hard, never give up! (keep ya head up)\n(Baby don't cry!) baby don't cry!, I hope you got your head up (never give up)\nEven when the road is hard, never give up! (no no.. ohhhh)\n(Baby don't cry!) baby don't cry!..\n(you'll be right)..\n(Baby don't cry!) baby don't cry!, I hope you got your head up\nEven when the road is hard, never give up! (keep ya head up)\n(Baby don't cry!) baby don't cry!, I hope you got your head up (never give up)\nEven when the road is hard, never give up!\nBaby don't cry\n\n[Outro: Edi Amin]\nFor all the ladies (Soulshock, Karlin)\nBaby don't cry! Got to keep your head up\n(Keep your head up)\nMakaveli lives on (head up) aight?"}