{"song_name":"Party Up (Up In Here)","artist_id":300046,"display_artist":"DMX","spotify_id":"4XSgaQfGgJ9FDCcvmOe404","lyrics":"[Hook: DMX]\nY'all gon' make me lose my mind\nUp in here, up in here\nY'all gon' make me go all out\nUp in here, up in here\nY'all gon' make me act a fool\nUp in here, up in here\nY'all gon' make me lose my cool\nUp in here, up in here\n\n[Verse 1: DMX]\nIf I gotsta bring it to you cowards, then it's gonna be quick\nAight, all your mans up in the jail before sucked my dick\nAnd all them other cats you run with\nGet done with, dumb quick\nHow the fuck you gonna cross the dog with some bum shit?\nAight, there go the gun click, 911 shit\nAll over some dumb shit; ain't that some shit?\nY'all niggas remind me of a strip club\n‘Cause every time you come around, it's like what?\nI just gotta get my dick sucked\nAnd I don't know who the fuck you think you talking to\nBut I'm not him, aight, Slim? So watch what you do!\nOr you gon' find yourself buried next to someone else\nAnd we all thought you loved yourself\nBut that couldn't have been the issue\nOr maybe they just saying that now ‘cause they miss you\nShit, a nigga tried to diss you\nThat's why you laying on your back\nLooking at the roof of the church\nPreacher telling the truth and it hurts\n\n[Hook: DMX]\nY'all gon' make me lose my mind\nUp in here, up in here\nY'all gon' make me go all out\nUp in here, up in here\nY'all gon' make me act a fool\nUp in here, up in here\nY'all gon' make me lose my cool\nUp in here, up in here\n\n[Verse 2: DMX]\nOff the chain, I leave niggas soft in the brain\n‘Cause niggas still want the fame, off the name\nFirst of all, you ain't rapped long enough\nTo be fucking with me; and you, you ain't strong enough\nSo whatever it is you puffin' on\nThat got you think that you Superman, I got the Kryptonite\nShould I smack him with my dick and the mic?\nY'all niggas is characters, not even good actors\nWhat's gon' be the outcome? Hmm, let's add up all the factors\nYou're wack, you're twisted, your girl's a ho\nYou're broke, the kid ain't yours, and e'rybody know\nYour old man say you stupid, you be like, \"So?\nI love my baby mother, I'll never let her go.\"\nI'm tired of weak ass niggas whining over puss\nThat don't belong to them, fuck is wrong with them?\nThey fuck it up for real niggas like my mans and them\nWho get it on, on the strength of the hands with them, man\n\n[Hook: DMX]\nY'all gon' make me lose my mind\nUp in here, up in here\nY'all gon' make me go all out\nUp in here, up in here\nY'all gon' make me act a fool\nUp in here, up in here\nY'all gon' make me lose my cool\nUp in here, up in here\n\n[Verse 3: DMX]\nI bring down rains so heavy it hurts the head\nNo more talking, put him in the dirt instead\nYou keep walking, lest you tryin' to end up red\n‘Cause if I end up fed, y'all end up dead\n‘Cause you's a soft type nigga\nFake up North type nigga, push like a soft white nigga\nDog is a dog, blood's thicker than water\nWe done been through the mud and we quicker to slaughter\nThe bigger the order, the more guns we brung out\nWe run up in there, e'rybody come out, don't nobody run out\nSun in to sun out, I'ma keep the gun out\nNigga running his mouth, I'ma blow his lung out\nListen! Your ass is about to be missin'\nYou know who gon' find you? Some old man fishin'\nGrandma wishin' your soul's at rest\nBut it's hard to digest with the size of the hole in your chest\n\n[Hook: DMX]\nY'all gon' make me lose my mind\nUp in here, up in here\nY'all gon' make me go all out\nUp in here, up in here\nY'all gon' make me act a fool\nUp in here, up in here\nY'all gon' make me lose my cool\nUp in here, up in here\n\n[Bridge: DMX]\nOne, two, meet me outside\nMeet me outside, meet me outside\nAll my Ruff Ryders gon' meet me outside\nMeet me outside, meet me outside\nAll my big ballers gon' meet me outside\nMeet me outside, meet me outside\nAll my fly ladies gon' meet me outside\nMeet me outside, meet me outside\nAll my street-street peoples, meet me outside\nMeet me outside, outside, motherfucker\n\n[Outro: Swizz Beatz]\nX has got y'all bouncin' again\nBouncin' again, bounce-bouncin' again\nDark Man X got y'all bouncin' again\nBouncin' again, bounce-bouncin' again\nSwizz Beatz got y'all bouncin' again\nBouncin' again, bounce-bouncin' again\nRuff Ryders got y'all bouncin' again\nBouncin' again, bounce-bouncin' again\nDark Man keep you bouncin' again\nBouncin' again, bounce-bouncin' again\nDark Man keep you bouncin' again\nBouncin' again, bounce-bouncin' again\nAll my streets, they bouncin' again\nBouncin' again, we're bouncin' again\nSwizz-Swizz Beatz, we're bouncin' again\nBouncin' again and we bouncin' again\nDouble R, keep it comin'\nAin't nothin' y'all, ain't nothin' y'all can do now"}