{"song_name":"Graduation (Friends Forever)","artist_id":431018,"display_artist":"Vitamin C","spotify_id":"1TAp8Bz2h7QEbzgS9ZI4ck","lyrics":"And so we talked all night about the rest of our lives\r\nWhere we're gonna be when we turn 25\r\nI keep thinking times will never change\r\nKeep on thinking things will always be the same\r\nBut when we leave this year we won't be coming back\r\nNo more hanging out cause we're on a different track\r\nAnd if you got something that you need to say\r\nYou better say it right now cause you don't have another day\r\nCause we're moving on and we can't slow down\r\nThese memories are playing like a film without sound\r\nAnd I keep thinking of that night in June\r\nI Didn't know much of love, but it came too soon\r\nAnd there was me and you, and then it got real blue\r\nStay at home talkin' on the telephone and\r\nWe would get so excited, we'd get so scared\r\nLaughing at our selves thinking life's not fair\r\nAnd this is how it feels\r\n\r\nChorus:\r\nAs we go on, we remember\r\nAll the times we had together\r\nAnd as our lives change, Come whatever\r\nWe will still be, friends forever\r\n\r\nSo if we get the big jobs and we make the big money\r\nWhen we look back now, will that joke still be funny?\r\nWill we still remember everything we learned in school?\r\nStill be trying to break every single rule\r\nWill little brainy Bobby be the stockbroker man?\r\nWill Heather find a job that won't interfere with her tan?\r\nI keep, I keep thinking that it's not goodbye\r\nKeep on thinking it's a time to fly\r\nAnd this is how it feels\r\n\r\n*Repeat chorus*\r\n\r\nLa, la, la, la; yeah, yeah, yeah\r\nLa, la, la, la, we will still be friends forever\r\n\r\nWill we think about tomorrow like we think about now?\r\nCan we survive it out there? Can we make it somehow?\r\nI guess I thought that this would never end\r\nAnd suddenly it's like we're women and men\r\nWill the past be a shadow that will follow us round?\r\nWill these memories fade when I leave this town\r\nI keep, I keep thinking that it's not goodbye\r\nKeep on thinking it's a time to fly\r\n\r\n*Repeat chorus 3x*"}