{"rank":"66","song_id":"21074","song_name":"Incomplete","artist_id":"279491","display_artist":"Sisqo","spotify_id":"4WSvrHZO1Qu65BumRM0ltY","lyrics":"Ooh, oh yeah, listen Bright lights, fancy restaurants\nEverything in this world that a man could want\nI got a bank account bigger than the law should allow\nStill I'm lonely now Pretty faces from the covers of a magazine\nFrom their covers to my covers wanna lay with me\nFame and Fortune still can't find, just a grown man running out of time\n\nChorus\n\neven though it seems I have everything I don’t wanna be a lonely fool\nAll of the women, all the expensive cars All of the money don't amount to you\nSo I can make believe I have everything But I can  pretend that I don't see\nThat without you girl my life is incomplete\n\n\nListen,\nYour perfume, your sexy lingerie Girl I remember it just like it was on yesterday\nA Thursday you told me you had fallen in love, I wasnt sure that I was\nIt's been a Year-Winter, Summer, Spring and Fall But being without you just ain’t livin' nothing at all\nIf I could travel back in time, I'd relive the days you were mine\n\neven though it seems i have everything i dont wanna be a lonley fool\nall of the women all the expensive cars. all the money dont amount to you.\n\ni can make believe i have everything. but i cant pretend that i dont see you\nthat without you girl my life is imcomplete. i just cant help loving you\nbut i loved you much too late. i'd give anything and everything to\nhear you'll say that you'll stay.\n\neven though it seems i have everything\ni dont wanna be a lonley fool. all of the women .\nall the expensive cars. all of the money dont amount to you\n(you can have it all)\n\ni can make believe i have everything but i cant pretend\nthat i dont see.\nthat without you girl mr life is incomplete\n\nWithout your girl, without you girl\nIn my life\nWithout you girl, my life, my life is incomplete\nWithout you girl my life is incomplete, oh yeah\nMy life is incomplete, oh yeah\n"}