{"rank":"69","song_id":"21100","song_name":"Wonderful","artist_id":"301958","display_artist":"Everclear","spotify_id":"5xcSi6kSAq1MfPXVuzC5gD","lyrics":"(spoken intro) Wonderful.....Isn't it wonderful now...\n\nI close my eyes when I get too sad\nI think thoughts that I know are bad\nClose my eyes and I count to ten\nHope it's over when I open them\n\nI want the things that I had before\nLike a Star Wars poster on my bedroom door\nI wish I could count to ten\nMake everything be wonderful again\n\nHope my mom and I hope my dad\nCan figure out why they get so mad\nHear them scream, I hear them fight\nThey say bad words and make me want to cry\n\nClose my eyes when I go to bed and I\nDream of angels who make me smile\nI feel better when I hear them say\nEverything will be wonderful some day\n\nPromises mean everything when you're little and the world's so big\nI just don't understand how you can smile with all those tears in your eye\nAnd tell me everything is wonderful now\n\nNa na nana........\nPlease don't tell me everthing is wonderful now\n\nGo to school and I run and play\nI tell the kids that it's all ok\nI laugh a lot so my friends wont know\nBut when the bell rings I just don't want to go home to  my room and I close my eyes\nI make believe I have a new life\nI don't believe you when you say\nEverything will be wonderful some day\n\nPromises mean everything when you're little and the world is so big (so big)\nI just don't understand how you can smile with all those tears\nin your eye when you tell me everything is wonderful now\n\nNa na nana........\nNo. No. I don't want to hear you tell me everything is wonderful now\nNo. No. I don't want to hear you tell me everything is wonderful now\nI don't to hear you say that I will understand some day\nNo. No. No. No.\nI don't want to hear you say both have grown in a different way\nNo. No. No.\nNo I don't want to meet your friend\nI don't want to start over again\nI just want my life to be the same\nJust like it used to be\nSomedays I hate everything\nI hate everything\nEveryone and everything\n\nPlease don't tell me everything is wonderful now..\nNa na nana....\n\nI don't want to hear you tell me everything is wonderful now...\n\nPlease don't tell me everything is wonderful now..\nNa nana..\nEverything is wonderful now...\n"}