{"rank":"90","song_id":"21131","song_name":"Shake Ya Ass","artist_id":"312008","display_artist":"Mystikal","spotify_id":"68jXxSRBO6lM4Ot6aBzhsS","lyrics":"Mmm! Mmm, mmm, mmm\nOooh-OOOH!\n\n[Hook]\nShake ya ass, but watch yourself\nShake ya ass, show me what you working with\n\n[Verse 1]\nI came here with my dick in my hand\nDon't make me leave here with my foot in yo' ass; be cool\nAnd don't worry bout how I'm ripping this shit\nWhen I'm flipping what I'm kicking nigga, that's just what I do\nI'm effervescent and I'm off that crescent\nNastier than a full grown German Shepherd; motherfucker keep stepping\nThey don't fuck with me and they don't\nY'all bitches can't catch me and you won't\nPay ya fare, fix your hair, throw that pussy\nGot a Prada for bonapalies, and Donna for my babooski\nYou think I'm tricking? Bitch, I ain't trippin\nI'm buyin if you got nice curves for your iceberg\nDrinkin Henn and acting like it do something to me\nHope this indecent proposal make you do somethin with me\nFuck a dollar girl, pick up fifty\nAnd fuck that coward, girl, you need a real nigga\nOff top knick-a-boxers hurting shit\nBend over ho; show me what you workin with!\n\n[Hook]\n\n[Bridge]\nAttention all y'all players and pimps\nRight now in the place to be (shake ya ass)\nI thought I told y'all niggas before\nY'all niggas can't fuck with me (watch yourself)\nNow this ain't for no small booties\nNo sir cause that won't pass (show me whatcha workin with)\nBut if you feel you got the biggest one\nThen momma come shake ya ass\n\n[Hook]\n\n[Verse 2]\nI like my women fire like CAY-ENNE!!\nChocolate and bowlegged - when I'm runnin up behind her!!\nGo head do your job, pop the lock, let the cock out\nFor girl don't lie you know you wanna go back to my house\n\"The Man Right Chea\" wanna get under that dress right there\nYou spicy cajun we gon' a good time over there\nYou better suck the head on them there crawfish\nAnd you gotta bend all the way over to dance off this\nHandle yo' business but I know you do it way better, you dead wrong\nSo if you talking bout how niggas make noise when you pass by\nGet yo' fine ass on the floor girl this yo' fuckin song!\nDo yo' thang dont be scared, cause you gon' get served\nYou get mine then you gon' get yours\nBout to make yo' ass love it\nRaise it up, show the G-string hustling hustling\n\n[Bridge]\n\n[Hook]\n\n[Verse 3]\nStop yo' cryin heffer, I don't need all that\nI got a job for you - the braided up pimp is back\nBreak them handcuffs, fuck you nigga move something\nAnd if they ask you what you doin say, \"Ooohh nuttin!\"\nAnd we been doin for the past 2 somethin\nAnd I've been beatin that pussy up not smooth fucking\nYou can betcha bottom dollar; if that pussy fire\nYou gon' holla Michael Tyler!\nSo don't act like you don't be backin that stuff up\nGirl in the club, cause that's what you got ass for\nWobble wobble I'm infatuated\nBitch ride a dick like she making a baby\nAnd I see that we gon' have to go to a quiet corner for just us two an'\nDon't worry about who looking, just keep on doing what you doing\nCause a nigga like me gon' get to work before I know the girl\nBitch what's happening, let 'em see, show the world!\n\n[Bridge]\n\n[Hook]\n\nUhh.. OOOH-WEE! Good lawd!\nDamn!"}