{"rank":"59","song_id":"21145","song_name":"The Way I Am","artist_id":"301722","display_artist":"Eminem","spotify_id":"2sGSId790ABFzGXx9VEdwl","lyrics":"[Produced by Eminem]\n\n[Intro]\n…Man, whatever\nDre, just let it run\nAyo, turn the beat up a little bit\nAyo, this song is for anyone\nFuck it, just shut up and listen, ayo\n\n[Verse 1]\nI sit back with this pack of Zig-Zag's and this bag\nOf this weed, it gives me the shit needed to be\nThe most meanest MC on this on this earth\nAnd since birth I've been cursed with this curse to just curse\nAnd just blurt this berserk and bizarre shit that works\nAnd it sells and it helps in itself to relieve all this tension\nDispensing these sentences, getting this stress\nThat's been eating me recently off of this chest\nAnd I rest again peacefully\nBut at least have the decency in you\nTo leave me alone, when you freaks see me out\nIn the streets when I'm eating or feeding my daughter\nTo not come and speak to me, I don't know you\nAnd no, I don't owe you a mothafuckin' thing\nI'm not Mr. N'Sync, I'm not what your friends think\nI'm not Mr. Friendly, I can be a prick if you tempt me\nMy tank is on empty, no patience is in me\nAnd if you offend me, I'm lifting you ten feet in the air\nI don't care who was there and who saw me just jaw you\nGo call you a lawyer, file you a lawsuit\nI'll smile in the courtroom and buy you a wardrobe\nI'm tired of all you, I don't mean to be mean\nBut that's all I can be, it's just me\n\n[Hook]\nAnd I am whatever you say I am\nIf I wasn't, then why would I say I am?\nIn the paper, the news, every day I am\nRadio won't even play my jam\n'Cause I am whatever you say I am\nIf I wasn't, then why would I say I am?\nIn the paper, the news, every day I am\nI don't know, it's just the way I am\n\n[Verse 2]\nSometimes I just feel like my father\nI hate to be bothered with all of this nonsense\nIt's constant, and, \"Oh, it's his lyrical content\nThe song 'Guilty Conscience' has gotten such rotten responses.\"\nAnd all of this controversy circles me\nAnd it seems like the media immediately points a finger at me\nSo I point one back at 'em, but not the index or pinkie\nOr the ring or the thumb, it's the one you put up\nWhen you don't give a fuck, when you won't just put up\nWith the bullshit they pull, 'cause they full of shit too\nWhen a dude's getting bullied and shoots up his school\nAnd they blame it on Marilyn and the heroin\nWhere were the parents at? And look where it's at!\nMiddle America, now it's a tragedy\nNow it's so sad to see, an upper-class city havin' this happening\nThen attack Eminem ‘cause I rap this way\nBut I'm glad, ‘cause they feed me the fuel that I need\nFor the fire to burn, and it's burning, and I have returned\n\n[Hook]\nAnd I am whatever you say I am\nIf I wasn't, then why would I say I am?\nIn the paper, the news, every day I am\nRadio won't even play my jam\n'Cause I am whatever you say I am\nIf I wasn't, then why would I say I am?\nIn the paper, the news, every day I am\nI don't know, it's just the way I am\n\n[Verse 3]\nI'm so sick and tired of being admired\nThat I wish that I would just die or get fired\nAnd dropped from my label, let's stop with the fables\nI'm not gonna be able to top on \"My Name Is\"\nAnd pigeon-holed into some poppy sensation\nTo cop me rotation at rock-n-roll stations\nAnd I just do not got the patience\nTo deal with these cocky Caucasians\nWho think I'm some wigger who just tries to be black\n‘Cause I talk with an accent and grab on my balls\nSo they always keep asking the same fucking questions\nWhat school did I go to, what hood I grew up in\nThe why, the who, what, when, the where and the how\n'Til I'm grabbing my hair and I'm tearin' it out\n‘Cause they driving me crazy, I can't take it\nI'm racin', I'm pacin', I stand and I sit\nAnd I'm thankful for every fan that I get\nBut I can't take a shit\nIn the bathroom without someone standing by it\nNo, I won't sign you an autograph\nYou can call me an asshole, I'm glad\n\n[Hook]\n'Cause I am whatever you say I am\nIf I wasn't, then why would I say I am?\nIn the paper, the news, every day I am\nRadio won't even play my jam\n'Cause I am whatever you say I am\nIf I wasn't, then why would I say I am?\nIn the paper, the news, every day I am\nI don't know, it's just the way I am"}