{"rank":"55","song_id":"21201","song_name":"Ms. Jackson","artist_id":"321442","display_artist":"OutKast","spotify_id":"0I3q5fE6wg7LIfHGngUTnV","lyrics":"[Intro: André 3000]\nYeah, this one right here goes out\nTo all the baby's mamas' mamas\nMamas, mamas, baby mamas' mamas\nYeah, go like this\n\n[Hook: André 3000]\nI'm sorry, Ms. Jackson, I am for real\nNever meant to make your daughter cry\nI apologize a trillion times\nI'm sorry, Ms. Jackson, I am for real\nNever meant to make your daughter cry\nI apologize a trillion times\n\n[Verse 1: Big Boi]\nMy baby drama mama don't like me\nShe be doin' things like havin' them boys come from her neighborhood to the studio, tryna fight me\nShe need to get a piece of the American pie and take her bite out\nThat's my house, I'll disconnect the cable and turn the lights out\nAnd let her know her grandchild is a baby and not a pay check\nPrivate school, daycare, shit, medical bills—I pay that\nI love your mom and everything\nBut see, I ain't the only one who laid down\nShe wanna rib you up to start a custody war\nMy lawyers stay down\nShit, you never got a chance to hear my side of the story\nWe was divided\nShe had fish fries and cookouts for my child's birthday\nI ain't invited, despite it\nI show her the utmost respect when I fall through\nAll you do is defend that lady when I call you, yeah\n\n[Hook]\nI'm sorry, Ms. Jackson, I am for real\nNever meant to make your daughter cry\nI apologize a trillion times\nI'm sorry, Ms. Jackson, I am for real\nNever meant to make your daughter cry\nI apologize a trillion times\n\n[Bridge: André 3000]\nMe and your daughter got a special thing goin' on\nYou say it's puppy love, we say it's full-grown\nHope that we feel this, feel this way forever\nYou can plan a pretty picnic\nBut you can't predict the weather, Ms. Jackson\n\n[Verse 2: André 3000]\nTen times out of nine, now if I'm lyin', find\nThe quickest muzzle, throw it on my mouth and I'll decline\nKing meets queen, then the puppy love thing\nTogether dream 'bout that crib with the Goodyear swing\nOn the oak tree, I hope we feel like this forever\nForever, forever ever, forever ever?\nForever never seems that long until you're grown\nAnd notice that the day-by-day ruler can't be too wrong\nMs. Jackson, my intentions were good, I wish I could\nBecome a magician to abracadabra all the sadder\nThoughts of me, thoughts of she, thoughts of he\nAskin' what happened to the feelin' that her and me had\nI pray so much about it, need some knee pads\nIt happened for a reason, one can't be mad\nSo know this, know that everything's cool\nAnd yes, I will be present on the first day of school\nAnd graduation\n\n[Hook]\nI'm sorry, Ms. Jackson, I am for real\nNever meant to make your daughter cry\nI apologize a trillion times\nI'm sorry, Ms. Jackson, I am for real\nNever meant to make your daughter cry\nI apologize a trillion times\n\n[Verse 3: Big Boi]\n\"Look at the way he treats me\"\nShit, look at the way you treat me\nYou see, your little nosy-ass homegirls\nDone got your ass sent up the creek, G\nWithout a paddle, you left to straddle and ride this thing on out\nAnd I knew you and your girl ain't speakin' no more\n‘Cause my dick all in her mouth\nKnow what I'm talkin' about?\nJealousy, infidelity, envy, cheating, beating\nIn the year two to the G, they be the same thing\nSo who you placin' the blame on?\nYou keep on singin' the same song\nLet bygones be bygones, you can go on and get the hell on\nYou and your mama\n\n[Hook]\nI'm sorry, Ms. Jackson, I am for real\nNever meant to make your daughter cry\nI apologize a trillion times\nI'm sorry, Ms. Jackson, I am for real\nNever meant to make your daughter cry\nI apologize a trillion times\nI'm sorry, Ms. Jackson, I am for real\nNever meant to make your daughter cry\nI apologize a trillion times\nI'm sorry, Ms. Jackson, I am for real\nNever meant to make your daughter cry\nI apologize a trillion times"}