{"rank":"24","song_id":"21239","song_name":"What's Your Fantasy","artist_id":"308504","display_artist":"Ludacris Featuring Shawna","spotify_id":"2PfrWOPGSxVyp3lnQaw79G","lyrics":"[Ludacris]\nYeah, yeah, yeah, yeah\nGive it to me now, give it to me now\nGive it to me now, give it to me now\n\n[Shawna]\nYeah, yeah, yeah, yeah\nGive it to me now, give it to me now\nGive it to me now (etc.)\n\n[Hook - Ludacris, then Shawna]\nI wanna, li-li-li-lick you from your head to your toes\nAnd I wanna, move from the bed down to the - down to the, to the flo'\nThen I wanna, \"ahh ahh\" - you make it so good I don't wanna leave\nBut I gotta kn-kn-kn-know: what-what's your fan-ta-ta-sy?\n\n[Verse 1 - Ludacris]\nI wanna get you in the Georgia Dome on the 50 yard line\nWhile the Dirty Birds kick for t'ree\nAnd if you like in the club, we can do it\nIn the DJ booth or in the back of the V.I.P\nWhipped cream with cherries and strawberries on top, lick it don't stop\nKeep the door locked, don't knock while the boat rock\nWe go-bots and robots, so they got to wait til the show stop\nOr how about on the beach with black sand?\nLick up your thigh then call me the Pac Man\nTable top or just give me a lap dance\nThe Rock to the Park to the Point to the Flatlands\nThat man Ludacris (woo!) in the public bathroom\nOr in back of the classroom\nHow ever you want it, lover-lover gonna tap that ass soon\nSee I cast em and I passed em\nGet a tight grip and I grasp em\nI flash em and outlast em\nAnd if ain't good then I trash em\nWhile you stash em, I'll let em free\nAnd they tell me what they fantasy\nLike up on the roof, roof\nTell your boyfriend not to be mad at me!\n\n[Hook]\n\n[Verse 2 - Ludacris]\nI wanna get you in the bath tub\nWith the candles lit; you give it up till they go out\nOr we can do it on stage at the Ludacris concert\nCause you know it got sold out!\nA red carpet dick it just roll out\nGo ahead and scream, you can't hold out\nWe can do it in the pouring rain\nRunning the train, when it's hot or when it's cold out\nHow about in the library on top of books?\nBut you can't be too loud!\nYou wanna make a brother beg for it\nGive me TLC cause you know I be too proud\nWe can do it in the White House\nTry to make them turn the lights out\nChampagne with my campaign\nLet me do the damn thing\nWhat's my name, what's my name, what's my name?\nA sauna, jacuzzi, in the back row at the movie\nYou can scratch my back and rule me\nYou can push me and just pull me\nOn hay in middle of the barn\nRose petals on the silk sheets\nEating fresh fruits, sweep your woman right off her feet\n\n[Hook]\n\n[Verse 3 - Ludacris]\nI wanna get you in the back seat, windows up\nThat's the way you like to fuck\nClogged up, fog alert\nRip the pants and rip the shirt\nRough sex: make it hurt\nIn the garden all in the dirt\nRoll around Georgia Brown: that's the way I like it, twerk\nLegs jerk, overworked\nUnderpaid, but don't be afraid\nIn the sun or up in the shade\nOn the top of my Escalade\nMaybe your girl and my friend can trade\nTag team, off the ropes!\nOn the ocean or in the boat!\nFactories or one hundred spokes!\nWhat about up in the candy store?\nThat chocolate, chocolate make it melt\nWhips and chains, handcuffs\nSmack a little booty up with my belt\nScream \"help!\" Play my game!\nDracula, man, I'll get my fangs\nHorseback and I'll get my reins\nSchool teacher, let me get my brains"}