{"rank":"91","song_id":"21294","song_name":"Snoop Dogg","artist_id":"279664","display_artist":"Snoop Dogg","spotify_id":"0R7YVi7w41Dr9jU5vblAok","lyrics":"{Intro]\nS-N-double-O-P D-O-double-giz-ee\nD-O-double-giz-ee\nD-O-double-giz-ee\n(repeat x2)\n\n[Snoop talks over Intro]\nIzzle kizzle, fo' schizzle\nMy nizzle, what you sizzle?\nFo' schizzle bizzle, ha ha\n\n(Snoop Dogg)\nMe and my partner, in my Impala\nPoppin our collars, tossin up dollars\nA truck on the side of with hoes that wanna follow\nBet a hundred dollars that they all wanna swallow\nDoggy Doggfather\nI do it to you real hard then it gets harder\nIt's nada - thang on mine, bang on mine\nI smoke an ounce and bounce at the same time\nIt's off the limbo with Timbo, you motherfuckin bimbo\nSo quit knockin at my window, you nympho\nManiac, bring it back, now shake it up\nPut it on the table, now break it up\nGive it to me, now put a lighter on the end of it\nIt really don't matter what you spent on it\nAs long as you're gettin what you paid for\nThat's what it's made for, ain't that what you stayed for?\n\n(chorus)\nWho's that dippin' in the Cadillac?\nSnoop Dogg\nSmoke till your eyes get cataracts\nSnoop Dogg\nWho got a girl layin' her on her back\nSnoop Dogg\nWho dat makin' that paper stack\nSnoop Dogg\n\n(Snoop)\nYou play me and I'll play you\nYou pay me and I'll pay you\nHold on boo, you got the game all wrong\nThis aint your thang, this my song\nMove on, we in the club, at the Shark Bar\nValet my keys, and park my car\nNo snap shots, cuz I might get popped\nAs I slide by security, givin 'em props\nFirst thing I do, when I get in\nLet me take you back to when I first slid in\nGrab my gin and, get my woman, put my bib in, no bullshittin\nWe be sittin', in the corner\nWith smoke comin' from up under us like we sittin in the sauna\nBurnin' up the charts, break a bitch off heart\nLittle mama don't you start\n\n(chorus)\n\nS-N-double-O-P D-O-double-giz-ee\nD-O-double-giz-ee\nD-O-double-giz-ee\n(x2)\n\n(Snoop)\nTick tock, the ice on my watch\nSlap me 'cross the face around 2 o'clock\nBut the party don't stop till we blow up\nNow every little bitch wanna show up\nManuev'in to this, groovin to this\nDippin to this, flippin to this, trippin to this\nAin't no skippin to this, trust this\nBust this, it's too hot to touch this\nHe say, she say, I say no way\nDon't need foreplay, ok, obey\nEverything that I say\nAnd every day'll be like a holiday\nI put you in the front seat of my car\nAnd roll you round town like a superstar\nRecline your seat and turn up the beat\nNumber one with a bullet, rollin down the mothafuckin backstreets\n\n(chorus x2)\n\n(Timbaland making vocal scratches to fade)\n\n"}