{"rank":"94","song_id":"21311","song_name":"Get Crunked Up","artist_id":"276486","display_artist":"Iconz Featuring Tony Manshino","spotify_id":null,"lyrics":"Comedy 2000 baby\nIconz, street money, yall ready?\nC'mon...\n\n(Chorus:)\nIf you smoke weed now\nIn this bitch hit you all wit a clown\nGot a drink that you can't put down?\nWhen a fight, will the shit go down?\nGet crunked up, (get crunked up)\nGet crunked up, (get crunked up)\nGet crunked up, (get crunked up)\nGet crunked up, (get crunked up)\n\nNigga who? look at all the shit we do\nComedy bless nigga with tracks im finecing the raps\nYou got a hundred dolla better\nMust confess in chaps\nSome labels spend a fuckin mill\nSee these still on the rack\nI got a, clique that nigga strapped ready for war\nWe prefer to ball then get bomb head from hoers\nYou know it's, all nigga when my click poll licka\nNigga shining too, make that ice look bigga\nOut of Detroit ??? out here bangin my nuts\nPerfect cut sumplying shise shit im just too much\nNiggas hand will feel the rush when they turn me up\nBitches pussy will bust a nut when my clique come up\nIconz\nPlaya we supposed 2 shine\nNigga fuck X and Co we gon blow your mine\nWe got some shit for that ass if you step out of line\nThe way comedy take control, yall gon fall behind\n\n(Chorus:)\nYo get crunked up, stay crunked up\nRoll to the club in a navigator truck\nFly out the bar like i dont give a what...\nWho you know out there stay fandied up\nPlus these classy chicks they sick of shit\nYou need more then Benz cool to taste this chick\nYall ballas in the club gon try to hit\nBut yall ain't even hear what shit (bitch what you say?)\nYo know my girls is gon clown\nGet towed down\nYall better know we ain't fucking around\nIconz super star like what...\nEverybody better get fucked up\n\n(Chorus:)\nGet crunked up (get crunked up)\nGet crunked up (get crunked up)\nGet crunked up (get crunked up)\nGet crunked up (get crunked up)\n\nHow the fuck you wanna be like us?\nYou ain't fly\nLike TLC, she got it from Left Eye\nWe from the streets, got boys you can't buy\nYou ever gon find, my niggas die high\nSip on this fith see here like Jimmy Keith\nYall pussy ass niggas can't ride with us\nBust guns with us\nGet money with us\nStill going around saying you bad as us\nPlaya we been on tracks\nWe been ??? ???\nYall half faggots getting hit from the back\nHow we bring the heat\nBut yall think yall hot\nWhile we live ontop\nAnd your crew does not\nMe while your bitch ready what we got\nYou heard she gave us head outside in the drop\nThen went home and tongue kiss you\nYour only reply was \"baby i miss you\"\nSee that's the difference between yalls and ours\nYall baby stretch ours from here to tomorrow (uh)\nFrom here to tomorrow (yall feel free to love that there)\n\n(Chrous:)\nGet crunked up (get crunked up)\nGet crunked up (get crunked up)\nGet crunked up (get crunked up)\nGet crunked up (get crunked up)\n\nIconz, comedy baby, get funked up\nGet tow up (get crunked up)\nLet's go (get crunked up)\nFo sho (get crunked up)\nUhu (get crunked up)\nC'mon (get crunked up)\nIconz (get crunked up)\nStreet money what (get crunked up)\nThe comedy baby (get crunked up)\nThat's right c'mon\nGet fucked up (get crunked up) That's right\nGet fucked up (get crunked up) The comedy nigga\nGet fucked up (get crunked up) Iconz nigga\nGet fucked up (get crunked up) Street money nigga\nGet fucked up (get crunked up) Where ya at huh?\nGet fucked up (get crunked up) Where ya at huh?\nGet fucked up (get crunked up) Where my dawgs huh?\nGet fucked up (get crunked up) Where my bitches huh?\nYo, c'mon\nStreet money\nIconz\nThe comedy\nRunnin shit (get crunked up)\n2000 (get crunked up, get crunked up)\nUhh, uhh (get crunked up)\nWhere ya at? ( get crunked up)\nNigga's where ya at? (get crunked up)\nBitches where ya at? (get crunked up)\nSomebody get crunked up what??\nIconz what? what?\nStreet money what? what?\nUhh, uhh\nThe comedy what?\nWhere ya at?\nGet crunked up\nJust get crunked up\nNiggas get crunked up\nHow many bitches in the club tonight?\nGonna get crunked up in this club tonight?\nHow many bitches...."}