{"rank":"56","song_id":"21360","song_name":"Until The End Of Time","artist_id":"431886","display_artist":"2Pac","spotify_id":"5avQSAKB1dOEeIQBqV4jgW","lyrics":"[Produced By: Johnny J & Trackmasters]\n\n[Verse 1: 2Pac]\nPerhaps I was addicted to the dark side\nSomewhere inside my childhood witnessed my heart die\nAnd even though we both came from the same places\nThe money and the fame made us all change places\nHow could it be? Through the misery that came to pass\nThe hard times make a true friend afraid to ask\nFor currency, but you could run to me when you need\nAnd I'll never leave, honestly\nSomeone to believe in, as you can see\nIt's a small thing to a true, what could I do?\nReal homies help you get through\nAnd come to knew he'd do the same thing if he could\n‘Cause in the hood, true homies make you feel good\nAnd half the times we be actin' up, call the cops\nBringin' a cease to the peace that was on my block\nIt never stops, when my mama ask me will I change\nI tell her yeah, but it's clear I'll always be the same\nUntil the end of time\n\n[Hook: R.L. Huggar]\nSo take these broken wings\nI need your hands to come and heal me once again\n(Until the end of time)\nSo I can fly away, until the end of time\nUntil the end of time, until the end of time\n\n[Verse 2: 2Pac]\nPlease, Lord, forgive me for my life of sin\nMy hard stare seem to scare all my sister's kids\nSo you know, I don't hang around the house much\nThis all-night money makin' got me outta touch\nShit, ain't flashed a smile in a long while\nAn unexpected birth worst of the ghetto childs\nMy attitude got me walkin' solo\nRide out alone in my lo-lo\nWatchin' the whole world move in slow-mo\nFor quiet times, disappear, listen to the ocean\nSmokin' Ports, think my thoughts, then it's back to coastin'\nWho can I trust in this cold world?\nMy phony homie had a baby by my old girl\nBut I ain't trippin', I'm a player, I ain't sweatin' him\nI sexed his sister, had her mumble like a Mexican\nHis next of kin, no remorse, it was meant to happen\nBesides rappin', the only thing I did good was scrappin'\nUntil the end of time\n\n[Hook: R.L. Huggar]\nSo take these broken wings\nI need your hands to come and heal me once again\n(Until the end of time)\nSo I can fly away, until the end of time\nUntil the end of time, until the end of time\n\n[Verse 3: 2Pac]\nNow who's to say if I was right or wrong\nTo live my life as an outlaw all along?\nRemain strong in this planet full of player haters\nThey conversate, but Death Row full of demonstrators\nAnd in the end, drinkin' Hennessy\nMade all my enemies envy me\nSo cold when I flow, eliminatin' easily\nFalls to they knees, they plead for they right to breathe\nWhile beggin' me to keep the peace (haha)\nWhen I conceive closer to achieve\nIn times of danger, don't freeze, time to be a G\nFollow my lead, I'll supply everything you need\nAn ounce of game and the training to make a G\nRemember me as an outcast Outlaw\nAnother album out, that's what I'm about: more\nGettin' raw 'til the day I see my casket\nBuried as a G while the whole world remembers me\nUntil the end of time\n\n[Hook: R.L. Huggar]\nSo take these broken wings\nI need your hands to come and heal me once again\n(Until the end of time)\nSo I can fly away, until the end of time\nUntil the end of time, until the end of time"}