{"rank":"19","song_id":"21383","song_name":"My Baby","artist_id":"307320","display_artist":"Lil' Romeo","spotify_id":"0s9A4pUBLw68E76vY8LU9K","lyrics":"(Hotline\nMay I request a song\nyeah\nMy Baby by lil Romeo\nYou got it)\n\noh Romeo give me a chance\nunt unh too young I don't need a girlfriend\nwalk me home from school anyway?\nha ha O.K.\noh Romi your the cutest boy I know\nI know I know\nso let me be your girlfriend?\n\nThey call me lil P, I represent the CP3\nCalliyo ya heard me, straight from New Orleans\nGotta Uncle named Silkk and a Uncle named C\nI been dribbling the ball since the age of 3\nI got game like Kobe, dunk it like Poppa P\nOnce I'm in the zone ain't no stoppin' me\nyou can jumpa baby humma girls be jockin' me\nP Miller wear NO Limit gear from head to feet\nBridge:\nIt's like that woeday (got me crazy)\nIt's like that woeday (wanna be your lady)\nIt's like that woeday (want you to be my baby)\nIt's like that woeday (can't no girl fade me)\nwe at the skatin rink\n\nOh, Romeo give me a chance\n(uh uh too youngI don't need a girlfriend)\nWalk me home from school anyway?\n(ha ha Okay)\nOh, Romeo the cutest boy I know\n(I know, I know)\nSo let me be your girlfriend?\n\n11 years old, makin' A's and B's\nand these lil mommy's can't keep their hands off me\nwhen you see in the streets holla what's up doc\nI gotta a bugs bunny chain wit a matchin' watch\nI make you jump like Kris Kross, bounce like Bow\nI'm the next generation, I came to lock it down\nI'm a little boy, but live a big man's life\nI got girls passin' up wanna be my wife\nGot grown women wanna be in my life\nby the time I'm 18 I'm not gon be nothin' nice\nI'm that R-O-M-E-O, after high school\nI'm goin' straight to the pro's (bounce,bounce)\n\nOh Romeo give me a chance?\n(un unh too youngI don't need a girlfriend)\nwalk me home from school anyway?\n(ha ha Okay)\nOh Romeo the cutest boy I know\n(I know, I know)\nSo let me be your girlfriend?\n\nboy want u to myself\nI don't want them girls around\nYour the flyest thing up in here boy\nand that's how it's goin down\nI heard they call you Romeo\nWell I'm your Juliet\nYou must be playing hide and seek\n'Cause boy you're hard to catch\n\nOh Romeo give me a chance\n(unt unh too young I don't need a girlfriend)\nwalk me home from school anyway\n(ha ha Okay)\nOh Romeo the cutest boy I know\n(I know I know)\nso let me be your girlfriend?\n\n(oh Romeo)\nwhy you boys make them elbows swing\nwhy you girls make them elbows swing\nrepeat 9x's\n\nRomeo boy do dat thang, Romeo boy do dat thang\nRomeo boy do dat thang, Romeo boy do dat thang\n\n(throw em up get em up throw em up get em up throw em up get em up what)\n(Master P while saying this is for the fly girls......)\nwhy you boys make them elbow swing why u girls make them elbows swing)\n\n(Girls)\nthis is for the fly girls that punk it\n(Boys)\nthis is for the fly boys that punk it\n\n(Girls)\nthis is for the fly girls that's bout it bout it\n(Boys)\nthis is for the fly boys that's bout it bout it\n\n(Together)\nMake em sweat,make em sweat\nmake em sweat,make em sweat\nmake em sweat,make em sweat\nThat's all folks\n"}