{"song_name":"Let's Get Dirty (I Can't Get In Da Club)","artist_id":364794,"display_artist":"Redman Featuring DJ Kool","spotify_id":"5BlLqiaTwttKiqzLhBrN1v","lyrics":"Attention, all you niggaz, all you bitches\r\nTime to put down the Cristal, time to take off the ice for a minute\r\nTime to throw a little mud in this motherfucker..\r\n\r\nTurn me up some\r\nYo\r\n\r\n[Red as an old woman]\r\nOhh shit! Who those motherfuckers comin in here?\r\nNo, it can't be! Ahhhhhhhhhhhhhhh!\r\n\r\n[Redman]\r\nYo.. yo, gimme some room I'm throwin elbows\r\nTimberland boots, Air Force and shell-toes, who the fuck is them?\r\nIf I gotta pay to get in the club\r\nI'ma go pop the trunk and turn the street volume up to ten\r\nI ain't on the guest list, I ain't V.I.P.\r\nI snuck in the exit, learned to D-I-P\r\nMy dress code is all black when I'm makin the moves\r\nSimilar to the new Playstation 2\r\nI can't help it if the club only packin a G\r\nAnd the fire marshal wanna shut it down in 3\r\nAnd you ballin ass niggaz, whose dressed to kill\r\nfor the hoes showin the toes with extra heels (man!)\r\nI gotta get in, I drove here\r\nwith a carLOAD of bitches charged on Belvedere\r\nMy niggaz hit the cells if the line is thick\r\nSo I drive the 500, through the door of the bitch\r\n\r\n[DJ Kool]\r\nYo Red, wassup man?\r\nAiy they ain't tryin to let you in the club!\r\nYo, DJ Kool to the rescue!\r\nWe gon' break this joint down!\r\nAiyyo.. a-huh, a-huh, ahh!\r\n\r\n[Chorus: DJ Kool + Redman]\r\nIf you pumpin this one in your truck (let's get dirty)\r\nSay let's get dirty (l-let's get dirty)\r\nIf you really don't give a WHAT? (l-let's get dirty)\r\nSay let's get dirty (l-let's get dirty)\r\nEverybody get your hands up (l-let's get dirty)\r\nSay let's get dirty (l-let's get dirty)\r\nIf you ain't come to party SHUT UP! (l-let's get dirty)\r\nSay let's get dirty..\r\n\r\n[Redman]\r\nYo, security pattin my legs and waist\r\nbut if I vacate the place, it'll be {*gunfire, \"stay down!\"*}\r\nAll my niggaz in the huddle, on the count of three\r\nwe gonna bumrush The Tunnel, with a pound of weed\r\nCut the light on, you see it's Brick City in here\r\nBlazin like Biggie passed us a semi in here\r\nDon't sleep, stay wide awoke\r\nYou dialed Doc, not dial-a-joke\r\nCrawl or you'll die in smoke\r\nI keep it heated when the hawk is out\r\nSeated low Tahoe, beat it when the dark is out\r\nI'm outside of the line and I'm actin a fool\r\nlike a three o'clock bully, waitin after school\r\n(Punks!) I've been in this line for hours\r\nI even killed the time by helpin my man pass out fliers\r\nNow all I wanna do is get in where I fit in\r\nShake my ass with the baddest pidgeon with her wig in\r\nJUMP, MOVE, CRASH, SMOKE, DRINK\r\nShake that ass stank, the fuck you think?\r\nPoppa Bear at the table, and the porridge is pourin\r\nSince +Def+ is the label I belong in a morgue!\r\nI'm walkin half-dead, actin senile\r\nwith bigga niggaz from jail than the one on \"Green Mile\"\r\nI'll huff and puff, blow the club down\r\nI'll snuff a duck, I'm headed Uptown\r\n\r\n[DJ Kool]\r\nYeah that's right! We up in this joint now\r\nAiyyo we gettin ready to take over\r\nFreddie, you grab the mic, I'ma grab the turntables\r\nWe gon' rock this joint baby! - a-huh, a-huh, ahh!\r\n\r\n[Chorus: DJ Kool + Redman]\r\nIf you got up in the club free (let's get dirty)\r\nSay let's get dirty (let's get dirty)\r\nAnd you drunk up in the V.I.P. (let's get dirty)\r\nSay let's get dirty (let's get dirty)\r\nIf you swingin from them club lights (let's get dirty)\r\nSay let's get dirty (let's get dirty)\r\nAnd you like to start them club fights (let's get dirty)\r\nSay let's get dirty..\r\n\r\nEverybody wave your hands now (let's get dirty)\r\nSay let's get dirty (let's get dirty)\r\nEverybody jump up and down (let's get dirty)\r\nSay let's get dirty (let's get dirty)\r\nEverybody come to wild out (let's get dirty)\r\nSay let's get dirty (let's get dirty)\r\nIf you a big dog no doubt (let's get dirty)\r\nSay let's get dirty..\r\n\r\nEverybody wave your hands now (let's get dirty)\r\nSay let's get dirty (let's get dirty)\r\nEverybody jump up and down (let's get dirty)\r\nSay let's get dirty (let's get dirty)\r\nEverybody keep it goin now (let's get dirty)\r\nSay let's get dirty (let's get dirty)\r\nJust a little bit louder now (let's get dirty)\r\nSay let's get dirty.. c'mon, c'mon!\r\n\r\n(let's get dirty)\r\nA-huh, a-huh, ahh-huh! (let's get dirty)\r\nKeep it goin now (let's get dirty)"}