{"rank":"41","song_id":"21403","song_name":"Fill Me In","artist_id":"299719","display_artist":"Craig David","spotify_id":"2LJ58vWuLhFQ2bJPqzhveL","lyrics":"I've got something to say\nAll right (can you fill me in?) come on\n(watcha want watcha want me to do baby?)\nCan you fill me in?\n(let's talk about it - check it out)\n\n\nI was checking this girl next door when her parents went out\nShe'd phone say hey boy come on right around\nSo I knock at the door you were standing with a bottle of red wine \nready to pour\nDressed in long black satin lace to the floor\nSo I went in then we sat down start kissing, caressing\nTold me 'bout jacuzzi sounded interesting so we jumped right in\nAll calls diverted to answer phone\nPlease leave a message after the tone\nI mean me and her parent were kinda cool\nBut they were the fine line between me and you\nWe were just doing things young people in love do\nParents trying to find out what we were up to saying\n\n\nWhy were you creeping round late last night?\nWhy could I see two shadows moving in your bedroom light?\nNow you're dressed in black when I left you were dressed in white\nCan you fill me in?\nCalls diverted to answer phone\nRed wine bottle half the contents gone\nMidnight return jacuzzi turned on\nCan you fill me in?\n(It's another one, it's another one)\n\n\nWhenever the cost was clear and she'd ask me to come out\nI'd say hey girl come right around\nSo she knocked at the door I was standing with the keys\nin my hand to the 4x4\nJumped in my ride checking that nobody saw\nThe club we went in got bounce bounce to the rhythm\nSaw it was early morning though we'd better be leaving\nSo I gave you my jacket for you to hold\nTold you to wear 'cos you felt cold\nI mean me and her didn't mean to break the rules\nI weren't trying to play your mum and dad for fools\nWe were just doing things young people in love do\nParents trying to find out what we were up to saying\n\n\nWhy can't you keep your promises no more? \nSaying you'll be home by 12 come strolling in at 4\nOut with the girls but leaving with the boy next door\nCan you fill me in?\nWearing a jacket who's property?\nSaid you'd be queuing for a taxi\nBut you left all your money on the TV\nCan you fill me in? (can you fill me in?) \n\n\nAll they seem to do\nIs be checking up on you baby\nWatching in our every move\nThink someday they might approve maybe"}