{"rank":"89","song_id":"21422","song_name":"Midwest Swing","artist_id":"280256","display_artist":"St. Lunatics","spotify_id":"00mJ9I0iyXv8VJY2fWvUHQ","lyrics":"[Hook]\nIt's a Midwest thang, y'all - and they ain't got a clue\nWhy my Cutlass blue\nAnd I got them thangs on that muh'fucker too\nIt's a Midwest swang, y'all - and they ain't gotta trip\nWhile we swing and dip\nCause we do big thangs on the muh'fuckin hip\nIt's a Midwest thang\n\n[Verse 1 - Nelly]\nWhat you think we live on a farm? Nigga be for real!\nWe got Benz's Rovers' and Jag's, Hummer's and Deville's\nGot a green S-Class, ain't broke the door seal\nShit ain't been the same since I signed Fo' Reel\nThis shit got ill, when I hit 4 mill\nFive and counting, dirty six at will\nDid seven on the slide, 8 worldwide\nI'll be on my third Bentley by the time I'm at 9\nI hear 'em crying, \"You gon' sell out?\" Ya damn right!\nI done sold out before and re-comped the same night\nStraight hopped the next flight, too *Icey* for sunlight\nDunkin without Sprite, yea you heard me dirty\nI'm from the Show-Me State, show me seven I'll show you eight\nCarats in one ring, heavily starched jeans\nRepresentin St. Louis everytime I breathe\nIn the city I touch down and I bob and weave, ay\n\n[Hook]\n\n[Verse 2 - Murphy Lee]\nI sport my beeper on my boots, that's why I be a buzz when I kick\nMaybe it's on my lips, it's chaos when I spit\nQuarter man, quarter schoolboy, half Lunatic\nQuarter rubber, quarter dick, other half in yo' chick\nKeep a quarter of some sheeeiit, I'm the Pooky of the backyard\nAll colors and all types like a junkyard\nHot young boy with hot young ways\nCause I connect three blunts and be high for three daysys\nYou can tell by the way I walk I ain't from 'round hurr (here)\nProbably couldn't tell cuz I ain't walkin nowhurr (nowhere)\nI got a old-school Cutlass, with a hole in the urr (air)\nTV's urrwhurr (everywhere) wood grain to sturr (stare)\nI don't curr (care), hell naw I ain't cuttin my hurr (hair)\nTen and a half in them Airforce 1's, gimme two purr (pair) ugh\nI'm from the Lou' and what I do is a Lou' thang\nOne rapper, two rings and three chains\n\n[Verse 3 - Kyjuan]\nNothing but some ole country boys that ride V-12 horses\nSaddle up and put spurs on my Airforce's\nBack porches made for hide and go seek\nWe got space out hurr, we can ride and chief\nAin't gotta worry 'bout nobody approachin' us\nBy the time they catchin' up, we smoked it up\nAnd my eyes be red, my lips a lil' dark\nThe Lou is more than the Rams, Cards and lil' Arch\nMy dirty's love to spark, and love to sparkle\nLove homies *Vokal* coats with matchin' car do's (doors)\nWe racin down Skinker, see how fast our car go\nGranny be like \"Ay-yi-yi\" like Ricky Ricardo\nI know you wanna know why we do what we do\nYou cats ain't got a clue why the Cutlass blue\nBrand new twenty-two's on new UV's\nWith one, two, three, four, five TV's\n\n[Hook]\n\n[Verse 4 - Big Lee A.K.A. Ali]\nI'm sittin' on the front porch, writin a hood rhyme\nWaitin on my connect to deliver that good line\nWish I would find, one seed in my weed\nSticks and shit, if I do somebody bleed\nPull right here, eight pounds of Chinamen\nTwo stay hittin some blunts and Heineken\nHidin in the back with the po' po'\nKicked in my do'do', man they some ho' hooo's\nThey put the gun to my earr, you know the Lord don't fear\nNann nigga, nann ho, let's keep that bullshit clearr\nThey had me face down in the skreet\nErrbody watchin, thinkin I'mma pull the heat\nAnd leave the D-tects with a leak in the skreet\nAnd that - pussy ass nigga that set me up my peeps\nGon' give it to this nigga like NYPD\nBeat the K, fuck coke, now I'm back on my granny porch hustlin"}