{"rank":"54","song_id":"21426","song_name":"Contagious","artist_id":"416425","display_artist":"The Isley Brothers Featuring Ronald Isley AKA Mr. Biggs","spotify_id":null,"lyrics":"(r kelly)\nHere is a story,\nabout a man.. coming in,\nand found his woman in bed with..\nwell.. listen.\n\n(ron isely)\nIts 2am just gettin' in about to check my message\nNo one has called but my homies and some bill collecters\nSay your love brings somebody wants to borrow money\nI two way her-she don't hit me back something is funny\nSo I called her mother's house and asked her had she seen my baby (Oh I)\nRolled my 6 around lookin' for that missin' lady\nGot back in turned the TV on and caught the news\nThen I put my hand on my head cuz im so confused\nand then i turned the TV down (TV down) cuz I thought i heard a squeaky sound\nMm something's goin on upstairs (yeah) cuz I know nobody else lives here\n\nAs I get closer 2 da stairways all i hear\n~n~ then i hear my baby's voice\nin my ear sreamin' out\n\n(CHORUS)\nyour contagious\ntouch me baby\ngive me what you got\n(then a man says)\nsexy lady\ndrive me crazy\ndrive me wild\n~n~ i can't believe this shit\n\nI ran downstairs looked in the closet lookin for the whooo\nSaid a prayer only god knows what im gonna dooo\nWhat I saw was enough to drive a preacher wild\nI'm in the hall contemplating not in my own damn house\nWho woulda thought she was creepin' with another man\nThe downlow had happened to me all over again\nAnd then I turned the TV down, (TV down) cuz I know I heard a squeaky sound\nSomethings goin on there upstairs cuz i know it no one else lives here\n\n*Bum*Bum*Bum*\nAs I get closer to the stairways all I hear\nAnd then I hear my baby's voice in my ear screamin' out\n\n(Chorus)\n\n(ron isely)\n\"What the hell is goin on between the sheets in my home\"\n(chante moore)\n\"Baby wait let me explain before you start to point your cane\"\n(ron isely)\n\"Girl im about to have a fit\"\n(r kelly)\n\"Oh its about to be some shit,\nhow did i get into this shoulda never came home with this bitch\"\n(ron isely)\n\"You low down dirty woman, back to where you come from?\"\n(chante moore)\n\"But baby wait\"\n(isley brother)\n\"But wait my ass hit the streets your ass is grass\"\n(r kelly)\n\"Now Mr. Biggs before your done\"\n(ron isely)\n\"Wait, how you know my name son?\"\n(chante moore)\n\"Honey wait I was gonna tell you\"\n(ron isely)\n\"Ooo this cat looks real familiar, hm now don't I know\nyou from somewhere from a long time ago?\"\n(r kelly)\n\"No no, I don't think so\"\n(ron isley)\n\"Yeah yeah., I feel I know you brother very well\"\n(r kelly)\n\"No no, you mistaken me for somebody else\"\n(chante moore)\n\"Frank!\"\n(ron isely)\n\"Shut up! Can't you see 2 men are talkin'\"\n(chante moore)\n\"But..\"\n(ron isely)\n\"Thought I told your ass to get a walkin,\nnow I think you better leave this place, cuz im about to catch a case\".....\n\n(chorus)\n\"Your contagious touch me baby give me what you got\"\n\"Sexy lady, drive me crazy, drive me wild\"\n\"Your contagious touch me baby give me what you got\"\n\"Sexy lady, drive me crazy, drive me wild\"\n\"Your contagious touch me baby give me what you got\"\n\"Sexy lady, drive me crazy, drive me wild\"\n"}