{"rank":"74","song_id":"21443","song_name":"The Rock Show","artist_id":"298592","display_artist":"Blink-182","spotify_id":"797BTM0lyTWh1Bpmg5UzFC","lyrics":"Hanging out behind the club on the weekend\nActing stupid, getting drunk with my best friends\nI couldn't wait for the summer and the Warped Tour\nI remember it's the first time that i saw her...there\n\nShe's getting kicked out of school cause she's failing\nI'm kinda nervous, cause I think all her friends hate me\nShe's the one, she'll always be there\nShe took my hand and that made it, i swear\n\nBecause I fell in love with the girl at the rock show\nShe said \"what?\" and I told her that I didn't know\nShe's so cool, I'm gona sneak in through her window\nEverything's better when she's around\nI can't wait til her parents go out of town\nI fell in love with the girl at the rock show\n\nWhen we said we were gonna move to Vegas\nI remember the look her mother gave us\n17 without a purpose or direction\nWe don't owe anyone a fuckin explanation\n\nI fell in love with the girl at the rock show\nShe said \"what?\" and I told her that I didn't know\nShe's so cool, im gona sneak in through her window\nEverything's better when she's around\nI can't wait til her parents go out of town\nI fell in love with the girl at the rock show\n\nBlack and white picture of her on my wall\nI waited for her call, she always kept me waiting\nAnd if I ever got another chance I'd still ask her to dance\nBecause she kept me waiting\n\nI fell in love with the girl at the rock show\nShe said \"what?\" and I told her that I didn't know\nShe's so cool, I'm gonna sneak in through her window\nEverything's better when she's around\nI can't wait til her parents go out of town\nI fell in love with the girl at the rock show\n\nI'll never forget tonight (with the girl at the rock show)\nI'll never forget tonight (with the girl at the rock show)\nI'll never forget tonight (with the girl at the rock show)\nI'll never forget tonight (with the girl at the rock show)\n[repeat 'til fades]"}