{"rank":"60","song_id":"21440","song_name":"Bad Boy For Life","artist_id":null,"display_artist":"P. Diddy, Black Rob & Mark Curry","spotify_id":"2eOuL8KesslTLQERQPu11D","lyrics":"[P. Diddy]\r\nAiyyo, you ready?\r\nLet's do it [music starts]\r\nMmm, yeah, uhh..\r\nYeah, uhh.. c'mon\r\n\r\nI'm the definition of half man, half drugs\r\nAsk the clubs, Bad Boy - that's whassup\r\nAfter bucks, crush cruise after us\r\nNo gaze, we ain't laughin much\r\nNothin but big thangs, check the hitlist\r\nHow we twist shit, what change but the name?\r\nWe still here, you rockin wit the best\r\nDon't worry if I write rhymes, I write checks (ahh!)\r\nWho's the boss? Dudes is lost\r\nDon't think cause I'm iced out, I'ma cool off\r\nWho else but me? (who else?) And if you don't feel me\r\nthat mean you can't touch me, it's ugly, trust me\r\nGet it right dawg, we ain't ever left\r\nWe just, moved in silence and rep to the death (yeah)\r\nIt's official, I survived what I been through\r\nY'all got drama, \"The Saga Continues...\"\r\n\r\n[Chorus]\r\nWe ain't, go-in nowhere, we ain't, goin nowhere\r\nWe can't be stopped now, cause it's Bad Boy for life\r\nWe ain't, go-in nowhere, we ain't, goin nowhere\r\nWe can't be stopped now, cause it's Bad Boy for life\r\n\r\n[Black Rob]\r\nAiyyo strait from the Harlem streets\r\nI don't play, I push it down wit the Harlem Heat (uh-huh)\r\nAll a sudden niggaz got a problem wit me (Black, what happened?)\r\nThey run around actin like the black don't care eat\r\nAnd you know what? (what?) For some strange reason (uhh)\r\nI want this medication full of deranged eatin\r\nFor y'all to put the word out (c'mon, c'mon) we ain't leavin\r\nWe tryin to be rich before we go and stop breathin\r\nTherefor (what?) we kinda hustle lanes\r\nStay layin down on muscle games (c'mon)\r\nStill turn niggaz dreams to flames (yeah) you got the wire,\r\nIf not I ain't sayin no more names, you soon expire;\r\n(heh) No pain (nuh-uh) I feel remorse,\r\nthe shit causes me and Diddy up first Racin Porsches\r\nwit the beat swing vaul exhausters [screeching] (yeah)\r\nOn the cover of ya five (hehe) XXL's or (yeah) Source's (c'mon) bitch\r\n\r\n[Chorus]\r\n\r\n[Mark Curry]\r\nYeah, yeah, yo, yeah\r\nIt ain't shit changed, since the Notorious (We miss you B.I.G.)\r\nSee everything still glorious (yeah)\r\nWe still got Oreos, still be the victorious (that's right)\r\nSee it's a lot of them, but it's more of us\r\nStill got cash to blow, raps that flow\r\nStill them cats that know, pack ya flow, that's fo' sho',\r\nBottles that pop, joints that rock,\r\nPlay the background hand 'em a jock, hold 'em a glock (hahaha)\r\nMoney to get (yeah), cars to flip (uhh)\r\nBars to sit at and sip Cogniac wit Jews that drink (c'mon)\r\nHoes to see (uhh), make sure they knowin it's me (they know ya shit)\r\nDrop that beat, can't believe that I MC (haha)\r\nBad Boy 'til the casket drop (Bad Boy) Gotta love it,\r\nplace nuttin above it (nuttin) It's on like that (c'mon),\r\ndon't believe, we ain't goin like that\r\nFor always gonna be here (yeah), be there (uhh) every (what?) motherfucking year!\r\n\r\n[Chorus - 2X]\r\n\r\n[P. Diddy over Chorus]\r\nBad Boy.. we ain't goin nowhere\r\nUh-huh.. uh-huh.. what?\r\nWe ain't goin nowhere.. we gon' stay right here\r\nFor ever, and ever, and ever, and ever.. c'mon\r\nWe ain't goin nowhere.. we gon' stay right here\r\nWe ain't goin nowhere.. we gon' stay right here\r\nYeah, uh-huh.. uh-huh, uh-huh\r\nCause it's Bad Boy for life!"}