{"rank":"74","song_id":"21452","song_name":"Set It Off","artist_id":"1493176","display_artist":"Juvenile","spotify_id":"36xt9ffufm7femJLLsMRJs","lyrics":"KICK ASS!\n(Mmm-hmm) C'mon\n(Uh-huh, mm-hmm)\nY'all boys don't know NUTTIN bout me (mm-hmm, uh-huh)\nYa heard? .. \"Ladies and gentlemen!\"\n\n[Juvenile]\nI'mma T.C. soldier, New Orleans stunna\nIf a bitch leave me, I'mma take everything from her\nLeave while ya can, or ya mom will pick ya rum up\nI'mma find me some new pussy, and buy a Four-Runner\nI walk with a limp, cause my nuts heavy\nAnd I like it from the back so hold your butt steady\nI know I got some big lips, but I ain't trippin\nAnd momma I love pussy, but I ain't lickin\nNow prepare yourself for a smooth dickin\nYou don't want it girl? You don't know, what you missin\nI'm the baddest boss nigga walkin, you ain't heard?\nI got a team of head busters waitin to give 'em the word\nI gotta few in the East Coast, a few in the West\nDown-South to Mid-W, whattup to the rest\nCan't forget about the ghetto where they strugglin in debt\nNo matter what I do dawg, I love my set - \"Ladies and gentlemen!\"\n\n[Hook: Juvenile]\nWoadie, Wassup, Wodette, Wassup, Wodie, Wassup\nSet it off in this motherfucker\nWodie, Wassup, Wodette, Wassup, Wodie, Wassup\nSet it off in this motherfucker\nWodie, Wassup, Wodette, Wassup, Wodie, Wassup\nSet it off in this motherfucker\nWodie, Wassup, Wodette, Wassup, Wodie, Wassup\nSet it off in this motherfucker\n\n[Juvenile]\nThe niggidy niggidy Nile's in this bitch, get right\nFuck what you heard on the street it's CMR for life\nStill ridin on dubs, sippin brown and white\nJump stupid if you want bitch we gon' clown tonite\nWe got twenty-five choppers in the V.I.P\nCristal and 40 yack and a pound of weed\nI know you wait for me to get drunk, and follow me home\nPicture what I'mma give you though - a shot to yo' dome\nFuck it if your boys gon' be talkin they gon' get hit too\nI'm really not givin a fuck, long as I get you\nJamie, Fresh, Joe, Bubba\nYa gotta admit ha, Juvie a motherfucker\nI'mma general, executin the plan\nGot a vision of the 3rd Ward, rulinn the land\nRunnin up on hoes, tellin them to jump in the van\nMommy please come break off just me and my man\n\n[Hook]\n\n[Juvenile]\n55% of these niggas is fake\nThe other 45% be handlin they weight\n55% of these women is hoes\nThe other 45% be playin they role\nMr. Officer, Mr. Officer\nTake these motherfuckin cuffs off of us\nWe ain't kill nobody in this car, for us\nAnd ridin on 20's is the law for us\nI ain't from France, but excuse my french\nFuck ya if ya hatin, nigga save that then\nI been dealin wit you bitches from way back then\nPlus I kept a fire duck off the lay back in\nYou say my momma played me and J be tight\nCause Juvie takin care, so everything alright\nBitches see the sliver seraph wit them phat ass pipes\nBein followed by some niggas on some bad ass bikes\n\n[Hook]"}