{"rank":"66","song_id":"21472","song_name":"Fat Lip","artist_id":"280955","display_artist":"Sum 41","spotify_id":"4KacUpvbA3Mfo05gttTjhN","lyrics":"Storming through the party like my name was El Niño\nWhen I'm hangin' out drinking in the back of an El Camino\nAs a kid, I was a skid and no one knew me by \nname.\nI trashed my own house party cause nobody came.\n\nI know I'm not the one you thought you knew back in high school\nNever going, ever showing up when we had to.\nIs it attention that we crave don't tell us to behave,\nI'm sick of always hearing act your age.\n\nI don't wanna waste my time\nBecome another casualty of society.\nI'll never fall in line\nBecome another victim of your conformity \nAnd back down.\n\nBecause you don't \nKnow us at all we laugh when old people fall.\nBut what would you expect with a conscience so small.\nHeavy metal and mullets it's how we were raised.\nMaiden and Priest were the gods that we praised\n\nCause we like having fun at other peoples expense and,\nCutting people down is just a minor offence then,\nIt's none of your concern, I guess I'll never learn.\nI'm sick of being told to wait my turn.\n\nI don't wanna waste my time\nAnd become another casualty of society.\nI'll never fall in line\nBecome another victim of your conformity \nAnd back down.\n\nDon't count on me, to let you know when.\nDon't count on me, I'll do it again.\nDon't count on me, it's the point you're missing.\nDon't count on me, cause I'm not listening.\n\nWell I'm a no-goodnick lower middle class brat,\nBack packed and I don't give a shit about nothing.\nYou be standing on the corner talking all that kufuffin.\nBut you don't make sense from all the gas you be huffing.\nThen if the egg don't stain you'll be ringing off the hook,\nYou're on the hit list wanted in the telephone book.\nI like songs with distortion, to drink in proportion.\nThe doctor said my mom should have had an abortion.\n \nI don't wanna waste my time\nBecome another casualty of society.\nI'll never fall in line\nBecome another victim of your conformity \nAnd back down.\nWaste my time with them\nCasualty of society.\nWaste my time again,\nVictim of your conformity \nAnd back down."}