{"rank":"71","song_id":"21495","song_name":"What Am I Gonna Do","artist_id":"430663","display_artist":"Tyrese","spotify_id":"7FFQsnjzumC6eyCXRFPQ2f","lyrics":"Yeah, heh, all these years I've wanting you in my life,\nAnd now I finally have you. \nI'mma do everything in my strength to keep you near.\nI care about you, I just want to make you smile.\n\nAll the many days you were on my mind,\nVisions of me with you, all the time.\nYou wasn't looking for a man, you made it clear(clear to me).\nAnd now I'm ever so glad that I have you near.\nHere in my life, just you and I.\nWe can do whatever we want to.\nI'm living my life with you by my side,\nOne day I'm a make you my wife, baby.\n\nI was excited, cause I was falling, falling in love with you.\nNow that I've fallen, what am I gonna do?\nI was excited, cause I was falling, falling in love with you.\nNow that I've fallen, what am I gonna do?\n\nI'll do whatever puts a smile on my baby's face.\nGirl you're my best friend and you can never be replaced.\nThere's nothing in this world I wouldn't do, do for you.\nYou were one of my baby dreams and I'm so glad that it came\ntrue.\nHere in my life, just you and I.\nWe can go anywhere we want to baby.\nI'm living my life with you by myside,\nOne day I'mma make you my wife, yes I am.\n\nI was excited, cause I was falling, falling in love with you.\nNow that I've fallen, what am I gonna do?\nI was excited, cause I was falling, falling in love with you.\nNow that I've fallen, what am I gonna do?\n\nSince I gave you all my trust (and you never take my trust for\ngranted),\nAnd you given so much love (and you've given me so much love,\nbaby).\nYou're everything I want and need (everything that I want and I\nneed, baby)\nGirl you got the best of me (oh, you got the best of me)\nBreak it down, oh, oh I was falling in love.\nI don't know what to do, I just love you.\nEvery inch of my body, falling in love.\nWe'll just take it one day at a time.\n\nI was excited, cause I was falling, falling in love with you.\n(I don't wanna rush into romance)\nNow that I've fallen, what am I gonna do.\n(Oh, I just want you in my arms)\nI was excited, cause I was falling, falling in love with you.\n(when I see you, I wanna touch you)\nNow that I've fallen, what am I gonna do.\n(And feel you, and hold you babe, baby, baby)\nI was excited(oh, it feels so good, to be in love),\nNow that I've fallento get loved in return),\nI was excited, cause I was falling, falling in love with\nyou(cause it feels good, oh cause it feels good),\nNow that I've fallen, what am I gonna do.\nI was excited, cause I was falling(said it feels so good),\nfalling in love with you(having your arms around.\nNow that I've fallen, what am I gonna do(feeling so complete\nbaby, that's what I feel)."}