{"rank":"61","song_id":"21498","song_name":"You Gets No Love","artist_id":"276159","display_artist":"Faith Evans","spotify_id":"61kG6g3btiapbSVEj3D0Hb","lyrics":"Intro: Faith Evans (P. Diddy)\nUh, uh-uh, (There's another one)\nWhat-what (And another one)\nThis is the remix (There's another one) Ha ha\nI know it's not too ghetto (And another one, Bad Boy)\nI know it's not too ghetto\nPedigree (Pedigree baby) I said I know it's not to ghetto\nDonaway (Faith, Faithfully, the remix)\nYou better, check yourself respect yourself\nYou better go for self because I flow for self\n\n(Verse 1: Faith Evans)\nI'll tell you why there's no love, simply you're not cool enough\nFor what we had between us, don't you know you lost my trust(YEAH)\nPeople ask me where you've been (Where you've been)\nAnd I tell them were just friends (Tell them we're just friends)\nCause it's so obvious that it's never gonna work for us\nNo no oh no (No)\n\n(Chorus)\nPlayed with my emotions (Played)\nYou gets no devotion (And you gets no love, gets no love)\nYou can'y get no love from me(NO LOVE FROM ME)\nYou can't even be my friend (Be my friend)\nAnd you gets no love again\nWhatever you do it will come back to you\n(You gets no love from me)\n\n(Verse 2: Faith Evans)\nTell you why we can't hook up (You gets no love)\nCause I had about enough (You gets no love)\nOf hearin all the lies you tell (You gets no love)\nBoy I thought I knew you well(well)\nPeople think that your my man ( my man)\nThey don't even understand (They don't even understand yea)\nJust because I let you get some (uh-huh)that don't make you the one\nWe ain't even in love (You know that you played with my....)\n\n(Chorus: Faith Evans)\nPlayed with my emotions You gets no devotion\nYou gets no love, you can get no love from me (No love from me)\nYou can't even be my friend (Can't be my friend)\nAnd you gets no love again\nWhatever you get will come back to you\n\nBridge: Faith Evans (P. Diddy)\n(P.Diddy: Yo! Faith Let em know!!)\n\nCLICK ABOVE TO VISIT OUR SPONSORS\n\nYou better, rock my shit don't knock my shit\nBecause I got the shit that make you cop my shit\nI know y'all sick of this Badboy diva\nThat blows and plus got flows ridiculous\nYou better, rock my shit don't knock my shit\nBecause I got the shit that make you cop my shit\nIt's the chick from the bricks that got the hot shit\nLeft you sick from the single now check the remix\nBoy you had a clue, thought we had a cool relationship(but you no no)\nBut you couldn't handle it (You couldn't handle it)\n\n(Verse 3: G. Dep) (P.Diddy)\nYo! At the end of the day what a playa 'gon do? (Badboy)\nYou got love for me, It's how supposed to be\nSame love I'm a land on you (Come on)\nRight back at you it's only natural\nSo what I'm gonna do? Me\nEverything love ain't always lovely\nLeave it all up to me, I'll be livin in luxury, sucker free\nWithout no lies without no ties to those that patronize\nThat's why I don't socialize\nI eat, shit, even sleep with open eyes\nJust, give me that gasoline\nI'll move in the jag few bags of green\nCouple ads in the magazine\nAll freezy and I'm easy G Deezy one\n\n(Chorus)\nPlayed with my emotions, you gets no devotion\nWhatever you do it will come back to you bitch\nYou can't even be my friend, cause you gets no love again\nCan't even be my friend, and you gets no love again\n\n(Outro)\nYou played with my emotions and you gets no devotion\nCan't even be my friend, and you gets no love again\nYou played with my emotions and you gets no devotion\nCan't even be my friend, and you gets no love again\n\n(Chorus: Faith Evans)\nPlayed with my emotions You gets no devotion\nYou gets no love, you can get no love from me (No love from me)\nYou can't even be my friend (Can't be my friend)\nAnd you gets no love again\nWhatever you get will come back to you"}