{"song_name":"Where Were You (When The World Stopped Turning)","artist_id":278315,"display_artist":"Alan Jackson","spotify_id":"3eSwvMfSA0Fyku6Ak5JEw0","lyrics":"Where were you when the world stopped turning\nOn that September day?\nOut in the yard with your wife and children\nOr working on some stage in L.A.?\nDid you stand there in shock at the sight of that black smoke\nRising against that blue sky?\nDid you shout out in anger, in fear for your neighbor\nOr did you just sit down and cry?\n\nDid you weep for the children who lost their dear loved ones\nAnd pray for the ones who don't know?\nDid you rejoice for the people who walked from the rubble\nAnd sob for the ones left below?\nDid you burst out in pride for the red, white and blue\nAnd the heroes who died just doin' what they do?\nDid you look up to heaven for some kind of answer\nAnd look at yourself and what really matters?\n\nI'm just a singer of simple songs\nI'm not a real political man\nI watch CNN but I'm not sure I could\nTell you the difference in Iraq and Iran\nBut I know Jesus and I talk to God\nAnd I remember this from when I was young\nFaith, hope and love are some good things He gave us\nAnd the greatest is love\n\nWhere were you when the world stopped turning\nOn that September day?\nTeaching a class full of innocent children\nOr driving down some cold interstate?\nDid you feel guilty 'cause you're a survivor\nIn a crowded room did you feel alone?\nDid you call up your mother and tell her you loved her?\nDid you dust off that bible at home?\n\nDid you open your eyes, hope it never happened\nAnd you close your eyes and not go to sleep?\nDid you notice the sunset the first time in ages\nOr speak to some stranger on the street?\nDid you lay down at night and think of tomorrow\nGo out and buy you a gun?\nDid you turn off that violent old movie you're watchin'\nAnd turn on \"I Love Lucy\" reruns?\n\nDid you go to a church and hold hands with some strangers\nStand in line and give your own blood?\nDid you just stay home and cling tight to your family\nThank God you had somebody to love?\n\nI'm just a singer of simple songs\nI'm not a real political man\nI watch CNN but I'm not sure I could\nTell you the difference in Iraq and Iran\nBut I know Jesus and I talk to God\nAnd I remember this from when I was young\nFaith, hope and love are some good things He gave us\nAnd the greatest is love"}