{"rank":"74","song_id":"21564","song_name":"Uh Huh","artist_id":"275500","display_artist":"B2K","spotify_id":"4bJ02dcoGEkcSJOhNbx0tp","lyrics":"Yeah\nHey yo trick\nHow you gonna come up wit something like this, man?\nYeah\nWhen this come on\nThey'll be like \"Uh huh\"\nHaha\nRed zone\nYo B2K\nYo, where you at?\n\nGirl you messed up when you let me in\nTold your best friend that you wanted me\nThen she called me up and hipped me to your steez\nTold me that you were lookin' for a guy like me\nSo I said hold on, I ain't the one\nUnless shorty really wanna have some fun\nThen she said that you told her I was what you want\nWhen I call you don't try to front(uh huh)\n\nI'm the guy in your dreams (that you had last night)\nI'm the benz wit tha 20'z (that you wanna drive)\nI'm tha thug in your life (that'll treat you right)\nGot ya hooked cuz I'm bringing everything you like\n\nChorus\nUh huh\nI know that you wantin' this\nUh huh\nTell me can you handle it?\nUh huh\nShow me how you work dem hips\nUh huh\nAnd maybe you can roll wit it\nUh huh\nI know that you wantin' this\nUh huh\nTell me can you handle it?\nUh huh\nShow me how you work dem hips\nUh huh\nAnd maybe we can roll wit it\n\nNow we're all out in the open\nEverybody knows about you and me\nAin't no more need for you and me to creep\nI want you so bad I don't care who sees\nSo girl hold on, I got what you want\nI know you ain't scared to go n have some fun\nSo let your girlfriends know that you found someone\nWho'll be keepin' you tight and sprung (uh huh)\n\nI'm tha guy in your dreams (that you had last night)\nI'm benz wit tha 20's (that you wanna drive)\nI'm tha thug in your life (that'll treat you right)\nGot ya hooked coz I'm bringing everything you like\n\nChorus\n\nTwo months of conversation\nMan it's a major\nSplit tha game undercover\nI'm lethal like Danny Glover\nGot you runnin' to your mother\nMakin' plans for life\nYo, I'm only 15 what I need wit a wife?\nWe can walk through tha mall while I hold ya hips\nOr you can hang out tha drop while I'm pushin' tha whip\nTake you on a ride you will never forget\nRunnin' home, tellin' your friends lil' Fizz is it\nGot ya hooked by tha way that I lick my lips\nAnd I got many dimes, I ain't sweatin' dis chick\nYo, I run these girls from coast to coast\nDropin' game so sick I got 'em doin' tha most (uh huh)\n\nChorus (x2)"}