{"song_name":"Hey Luv (Anything)","artist_id":311598,"display_artist":"Mobb Deep Featuring 112","spotify_id":"4zKmKUes1vLQJqrC9l0Wbm","lyrics":"To let it ride...\n\n[Prodigy (Slim)]\nTssh, shorty come here (112)\nListen, listen, listen, I know, I know (Ooooh)\n(Love you) God damn\n(Need you) Hear me out though\n(Let's ride..) Yo (Let's ride..)\n\nHey love, I wanna hold you and talk to you\nPut my arm around ya shoulder and walk witchu\nBe that one that'll serve you, my word to you\nI know that nigga don't be doin what he 'sposed to do\nI got much more to give than homie do\nAnd you so fine, I just wanna roll witchu\nYou a Queen bitch, you need a king close to you\nYou need a nigga like P to just flow witchu\nAnd I gotta try, cuz anything's possible\nAnd you just might see things the way I do\nI just wanna get next to you, friends witchu\nBurn hundreds, wake up in the bed witchu\nI love when you walk, how that body move\nPardon my mouth, I'm just being honest boo\nI will pay for airtime just to vibe witchu\nKisses and hugs until the next time you swing through\n\n[Chorus: 112]\nSo many things that I wanna do\nWanna kiss, wanna touch, wanna taste, never teasing you\nOooh baby, cuz I only wanna be with you\nGirl you know, anything that you need, I got it\nMillion dollar shoppin spree, I got it\nAnything that you want, I got it\nYou know, I got it, ask me, I got it\n\n[Havoc]\nMa I want you in the worst way, and I ain't thirsty or nothin\nBut when I see somethin boo, I go hard for the one\nHit my cell, I'ma take you out to eat\nAnd kill any misconception that you got of Mobb Deep\nThrow that bug in ya ear, and it's about time\nCuz a nigga like me, been wantin you for years\nBumped heads here and there, but never got the chance\nBest to those who wait, once I get up in them pants,\nain't no one minute man\n'Posed to be with him? Better change those plans\nAnything you gotsta do, lotta screw\nMust be out his monkey-ass mind\nHow the hell he gettin tired of you?\nLemme light that fire that ya body desire\nGet you back to being sexy, single, \"Free\" like Mya\nCuz I treats 'em right, you know how I rock it\nWhereever you at girl I'm on the next flight\n\n[Chorus]\n\n[Prodigy]\nSit back, I got this baby girl you straight\nFor sure, rest asure you in the arms of strength\nBaby I'll die for my loved ones, make no mistake\nI'm not that man, I keep my gun on bait\n\n[Havoc]\nAnd it's a cold world, ya man don't understand ya pain\nAnd I know you gettin tired of the same ol' same\nHe expect to keep you locked with that five karat ring?\nLet's cop that old real while 112 sing\n\n[112]\nAnything you want, and anything you need \nJust pick up the phone, and call me\nOooh anything, anything you want (anything you want)\nand anything you need\nOoooh.. I'll come running!\n\n[Chorus: 2x]\n\nYeah.. 112...\nMobb Deep... (let's rock this)\nLet's go.. (Prodigy)\nDa-da-da-da-da.. (Havoc)\nOhhh.. Let's go..\nLet's ride... (That's right..)\n"}