{"rank":"92","song_id":"21597","song_name":"Any Other Night","artist_id":"278940","display_artist":"Sharissa","spotify_id":"41NDb9MBo9kItuWAwFk5cs","lyrics":"Any other night, you woulda been somewhere with your friends\nAny other night, youda had thangs to do (ooh)\nAny other night, I woulda been home alone in my bed\nAny other night, I would want to see you\nBoy you picked the wrong time 'cuz I got company\nBoy you picked the wrong time, yeah I got another nig layin' up wit me\nBoy you picked the wrong time and it coulda been you but ya too busy\nBoy you picked the wrong time\nWhat's a woman to do when she's feelin' lonely?\nAny other night, I'da had to page you more than once\nAny other night, I'da been waitin' for ya call yeah\nAnd any other night, you're too damn busy for me\nAnd any other night, it woulda been good but not tonight\nBoy you picked the wrong time 'cuz I got company\nBoy you picked the wrong time, and it woulda been you with me\nBoy you picked the wrong time, layin' in my bed, in my bed, in my bed\nBoy you picked the wrong time\nWhat's a shorty to do when she's feelin' lonely?\nDon't be surprised boy, you should have know that I\nWould not just keep on chasin' you around\nI called you 'cuz I wanted to see you but you said\nThat you were too busy, so I found someone else\nBoy you picked the wrong time\n(Boy you picked a fine time to show up)\nBoy you picked the wrong time\n(Did you get my two way? You didn't answer ya phone at home)\nBoy you picked the wrong time\n(No, yeah)\nBoy you picked the wrong time\n(What's a girl to do?)\n(Nigga any other night, it woulda been cool to chill wit Ri)\nBoy you picked the wrong time\nBoy you picked the wrong time\n(And any other night, you coulda been makin' love to me)\nBoy you picked the wrong time\n(But not tonight, it's his night, it's his night)\nBoy you picked the wrong time\n(Any other night, woulda been your night)\nBoy you picked the wrong time\nBoy you picked the wrong time\nBoy you picked the wrong time\nBoy you picked the wrong time\nBoy you picked the wrong time\nBoy you picked the wrong time"}