{"rank":"89","song_id":"21619","song_name":"Awnaw","artist_id":"276993","display_artist":"Nappy Roots","spotify_id":"37RC87Ce8jeeKmnpYNExhP","lyrics":"Yeah, haha Nappy Roots\nAwwnaw!\n\n[Hook]\nAwnaw! Hell naw! Man\nY'all done up and done it\nAwnaw! Hell naw! Boy\nY'all done up and done it\nAwnaw! Hell naw! Boy\nY'all done up and done it\nAh, y'all done up and done it\nMan y'all done up and done it\n\n[Fish Scales]\nMy first song was like forty-eight bars with no hook\nYou hear me flippin thru my pages out my favorite notebook\nThe microphone was in the closet (What?) No headphones, we lost it\nNiggas scared to get some water, roaches hangin over the faucets\nNo AC, Tez'll break a sweat just tryin to make beats\nE-Double's been the hustler,\nall play with all his customers, and flat broke,\nNappy smokin grass out on the back po'ch\nI'm thinkin I got everything a country boy could ask for\n\n[Big V]\nNow what we do to get here? (Say dat boy!!)\nLay it down and bring it to ya raw (Say dat boy!!)\nHey now we hurt some, suffered for more, takes what we work for\nHated for for the cussin, but the hatred it made us cuss more\nHeld on, but it was hard - stepped up, took charge\nRan thru what we scared up, but what was we afraid for?\nLook what we made of, heart that what made us\nBeing here is alright, but MUST believe we won't fall!\n\nThem country boys on the ride!\nWith them big fat wheels on the side!\nPeep the vertical grills on the ride!\nAnd aw-awww-awww-awwwww!\n\n{Repeat Hook over this part}\nThem country boys\nWith them big fat wheels\nPeep the vertical grills\nAnd awwwwwwww!\n\n[Saan]\nMy llel gon' be hogwild,\nbet that from that roota to that toota-file\nHell naw, them country boys ain't headed south for six miles\nKentucky mah, them kinfolk, twankies with them hundred-spokes\nSkullied on that front po'ch, cuz you know they got 'dro\nSeventy-nine coupe DeVille purdy cal patty grill\nInterstate 65 headin down to Cashfield\nGlass filled, to the tippy-top, back-seat Benz\nSpent my last cent on the rent, left with pocket lints\nA damn shame, gotta grind anythang and everythang\nJimmy Crack Corn, cross the county line with Mary Jane\nA long time, a gravel road, to cash and fame and sold my soul\nTo Hell and back, and back and forth, with same jeans and nappy 'fro\n\n[R Prophit]\nI might, hop off the Harley, spoke mine like Bob Marley\nNot parties with charties, wallin like they swallowin Bacardi\nThem butter-skin, probably gutted like kin\nUnderstand you 'bout to lose ya life fuckin with Deion\n\nThem country boys on the ride!\nWith them big fat wheels on the side!\nPeep the vertical grills on the ride!\nAnd aw-awww-awww-awwwww!\n\n{Repeat Hook over this part}\nThem country boys\nWith them big fat wheels\nPeep the vertical grills\nAnd awwwwwwww!\n\nThem country boys\nWith them big fat wheels\nPeep the vertical grills\nAnd awwwwwwww!\n[Repeat]\n\nThem country boys on the ride!\nWith them big fat wheels on the side!\nPeep the vertical grills on the ride!\nAnd aw-awww-awww-awwwww!\nThem country boys\nWith them big fat wheels\nPeep the vertical grills\n"}