{"song_name":"I Need A Girl (Part One)","artist_id":"null","display_artist":"P. Diddy Featuring Usher & Loon","spotify_id":"null","lyrics":"P. Diddy - I Need A Girl (part One)\nby Feat. Usher & Loon\n\n\n[P. Diddy]\nYeah, Yeah\nI need a, I want a\n\n[Usher]\nI need a girl to ride, ride, ride\nI need a girl to make my wife\nI need a girl who's mine oh mine\nI need a girl in my life\n\n[P. Diddy]\nYo, I'm internationally known on the microphone\nI got it all, but I really need a wife at home\nI don't really like the zone, never spend the night alone\nI got a few, you would like to bone\nBut, chicks don't romance me, don't tickle my fancy\nOnly Tiffany, Nancy; that's not what my plans be\nI need a girl that could stand me, raise me a family\nGo to trips at the Lancy, trip to the Grammy's cause\nMost of these girls be confusin me\nI don't know if they really love me or they usin me\nHere's the money, or maybe you ain't used to me\nCause you was depressed and now you're abusin me\nThat's why I need a girl that be true to me\nKnow bout the game, and know how to do to me\nWithout a girl on my side, shit I ruin me\nForget the word, it's just you and me\n\n[P. Diddy & Usher]\nNow let's ride.....\n\n[Chorus: Usher]\nI need a girl to ride, ride, ride\nI need a girl to make my wife\nI need a girl who's mine oh mine\nI need a girl in my life\nI need a girl to ride, ride, ride\nI need a girl to be my wife\nNobody else cuz she's all mine\nI need a girl in my life\n\n[Loon]\nYo, now I have had a lot of women in my lifetime\nBut see it's not a lot of women that got the right mind\nI done had pretty chicks with all the right features\nAnd hoodrat chicks that only rock sneakers\nCellphones and beepers, and know how to treat ya\nYou break her heart, she'll walk out and leave ya\nI find a girl, I'ma keep her\nCuz now I'm gettin money and the game gettin deeper\nI want some real shit, I need somebody I can chill with\nI need somebody I can build with\nI need somebody I can hold tight\nWith the time and no full limits, no right\nAnytime we together would feel so right\nYou the girl I've been lookin for my whole life\nGod bless me, I'm glad I got the insight\nIt's cuz of you girl, now I understand life\n\n[Loon & Usher]\nI need a girl...\n\n[Chorus: Usher]\nI need a girl to ride, ride, ride\nI need a girl to make my wife\nI need a girl who's mine oh mine\nI need a girl in my life\nI need a girl to ride, ride, ride\nI need a girl to be my wife\nNobody else cuz she's all mine\nI need a girl in my life\n\n[P. Diddy]\nI had a girl that would've died for me\nDidnt 'preciate her so I made her cry for me\nEvery night she had tears in her eyes for me\nQuarter K's, shorty took the whole ride for me\nFirst we were friends then became lovers\nYou was more than my girl, we were like brothers\nAll night we would play fight under covers\nNow you're gone, can't love you like I really wanna\nBut everytime I think about your pretty smile\nAnd how we're used to drive the whole city wild\nDamn I wish you would've had my child\nA pretty little girl wit Diddy's smile\nThis shit is wild\nAll dem days that I reminisce\nAbout the way I use to kiss dem pretty lips\nBut as long as you happy, I'ma tell you this\nI love you girl and you're the one that I will always miss\nI love you, yeah\n\n[Chorus: Usher]\nI need a girl to ride, ride, ride\nI need a girl to make my wife\nI need a girl who's mine oh mine\nI need a girl in my life\nI need a girl to ride, ride, ride\nI need a girl to be my wife\nNobody else cuz she's all mine\nI need a girl in my life\nI need a girl to ride, ride, ride\nI need a girl to make my wife\nI need a girl who's mine oh mine\nI need a girl in my life\nI need a girl to ride, ride, ride\nI need a girl to be my wife\nNobody else cuz she's all mine\nI need a girl in my life\nI need a girl to ride, ride, ride\nI need a girl to make my wife\nI need a girl who's mine oh mine\nI need a girl in my life\nI need a girl to ride, ride, ride\nI need a girl to be my wife\nNobody else cuz she's all mine\nI need a girl in my life"}