{"rank":"80","song_id":"21637","song_name":"Feels Good (Don't Worry Bout A Thing)","artist_id":"312066","display_artist":"Naughty By Nature Featuring 3LW","spotify_id":"3uh7YcFzAWHGg7spVzPfqP","lyrics":"(3LW)\nOhh...Hey Naughty...\n\n(Treach)\nOh where's my kitty kat, where's my kitty kat at\nWelcome to our party, sexy like Ashanti\nWritten on your hit and licking lot from my Bacardi\nRub on my body, kiss and twist and barley\nAsk da damn dadda der, do dat song, while I ooh-ah, ooh-ah\nHow I do that so long? On the DL world baby\nSwellin' dub crazy, DJ rewind that Naughty with that 3L-Dub baby\nI move simple, just as sooth mix'll move gentle\nI give ya mother-mm-mm, goose pimples(2x's)\nAin't the last brother passed over\nI be the bachler of the year or that cab punch a back brother\nN..A..U..G..H-T..Y......B..Y...Na, Na, Na, Nature, not cuz I hate ya\nMaster the matress, flip, I go backwards, a little kiss on your cheek\nWill make you back with the Treach, it...\n\n(Chorus)\nIt feels good to ya\nLet me see how you rock wit it\nBout the beat baby, drop wit it\nAnd don't worry bout a damn thing\nIt feels good to ya\nLet me see how you rock wit it\nDo your thing, come close wit it\nAnd don't worry bout a damn thing\nIt feels good...\n\n(Vinnie)\nHey, ever since back in the day\nFrom O.P.P. down to Hip Hop Hooray\nWho invented party anthems that ease stress away?\nYou got drama, never mind that\nNaughty by Nature, 3L-Dub on star tracks\nWe got that flavor that make your hands clap, toes tap\nAnd cross the culture on the generation age gap, never can you fade that\nWe make your body like, rock to this\nEverybody's block parties gonna walk to this\nTo the family, here's a number one\nAnd all those haters who ain't thinking we still having fun\nBetter throw your towel in son\nHow many years have we proved we can do this?\nHow many people we inspired to pursue this?\nWell if you wanna test the man to the truth is\nNaughty by Nature makes that Feel Good music\n\n(Chorus)\n(Treach)\nPu-tang, tang, I don't wanna go to the party\nAin't a party if it ain't...Naughty\nBody to body dance...Naughty\nOh lordie, its IIcon and Naughty\nIts the groove move more of us hate\nC'mon and stroll with us\nWhen everybody smiles it makes the whole day glorious\nSlide left, slide right, throw your hands high, I know thats right!\nThe I strong, we ride strong, double IIcons\nYou wanna stop hate,better let by-gones be by-gones\nSlide left, slide right, lets just find out, why let me find out?\nOoh-ah Ooh-ah, outdoor with indo'\nHeyyy-yo, drop the keys out the window\nWe got to party, with my yardies we partying\nCuz after the party its the after-party\n\n(Chorus)\n(3LW)\nFeels good, feels good, baby clap your hands (Hey, Hey)\nFeels good, feels good, baby clap your hands\nFeels good, feels good, baby clap your hands (Hey, Hey)\nFeels good, feels good, baby clap your hands\nHey, don't worry bout a damn thang\n\nIt feels good to ya\nRock wit it\nDrop wit it\nAnd don't worry bout a damn thing\n\nIt feels good to ya\nRock wit it\nCome close wit it\nAnd don't worry bout a damn thing\n\n(Chorus)"}