{"rank":"92","song_id":"21639","song_name":"Feel The Girl","artist_id":"311915","display_artist":"Ms. Jade","spotify_id":"1ONo2x3Lv4vhWoEd5A7U4q","lyrics":"[Intro Timbaland (Ms. Jaded)]\nLadies and gentlemen\nLadies and gentlemen\n(Ms. Jade) Lay lay lay ladies and gentlemen\n(Ms. Jade) Ladies and gentlemen\n(Ms. Jade) Ladies and gentlemen\n(Ms. Jade) Lay ladies and gentlemen\n(Ms. Jade) Skrip skirt skrip lay lay\n(Ms. Jade) La la la lay\nEarr err err\n\n[Verse 1 Ms. Jade]\nMs. Jade's the name comin' to ruin the game\nBringin' the thunder and rain, bus or a train or a plane\nMe and my girls shrivel all over the world\nMakin' you stumble and hurl, braids, ponytails and the curls\nI got them folk pumpin' and movin' around\nJumpin' and gettin' it down, sweatin' and workin' it now\nNo question, gonna throw on them clothes tonight\nSo set them bows tonight, engines gon' hum on the bikes\nNo matter if he black, peurto rican or white\nStiletto heels tonight, free chicken wings and some rice\nI got your dude lickin' my toes and stuff\nWhat wha wha wha what, light the chronic up!\nI know y'all gonna love when I do it\nI do it professional like Duro and Clue\nDoin' it all for the loot\nY'all better get ya'll asses up out the seats\nSweat runnin' down your cheeks, virgins turn into freaks\n\n[Chorus Timbaland (Ms.Jade)]\nFricka fa frick feel the girl\n(Ms. Jaaaaaaade)\nFricka fa frick fa frick feel the girl\n(Ms. Jaaaaaaade)\nFrickida frick fa frick feel the girl she'll\n(Ms. Jaaaaaaade)\nLight the chronic up!\n[2x]\n\n[Verse 2 Ms. Jade]\nYa bet was lost, time to set it off\nShoppin' at the mall, don't care what it cost\nConcerned about who be in my sheets\nYou got beef with me? Then don't speak to me\nLike how my flow different kinda pace\nGarbage and the waste, please get out my face\nYou wanna taste? Miss me like I'm Mase\nYou wanna taste? Lick me William H.\nI'm leavin y'all toothless like Gerome\nRollin' on the chromes, two ways and the phones\nThis Philly chick ain't wit this silly shit\nBlunts and dutches licked, scrapin' up for rent\nRat smugg-el-in', like the government\nKeep 'em bub-bel-in', take it on the chin\nSo now they all duckin' from the slugs\nkisses and the hugs, just cut up the rug!\n\n[Chorus (x2)]\n\n[Verse 3 Ms. Jade]\nI ain't gon' stop, 'til I'm satisfied\nChain hangin' like Nas, see right through the lies\nY'all never knew a dame could be so tight\nkillin' and feelin' it right, gettin' it on tonight\nWe keep it real, type of chicks we are\nGettin nice at the bar, bang it loud in your car\nI'm from the town, niggas gon' hold me down\nLost but now I'm found, watch me snatch the crown\nI clear my throat, ladies spit what I wrote\nTakin' off my coat, stuntin' tryin to poke\nWe in the back, countin' and peelin' the stacks\nCombin' and brushin' the tracks, y'all can't hold me back\nI'm comin out switchin' and changin' your route\nTakin' it to the house, bills and large amounts\nI got the club bouncin' and shakin' they frames\nGlass fillin', puff and then pass, if your feelin' in Philly then dance\n\n[Chorus (x4)]\n\n[Outro Timbaland]\nFrid fra frick fra feel the girl\nFrid fra freaky freaky feel the girl\nFreh freh freh feel feel feel the girl\nShh doha doha digga doha doha fra fricky fricky feel the girl\nFra fridicka feel the girl\nFra freh freh freh freh freh feel feel feel feel\nFra fra freaky feel\n"}