{"rank":"81","song_id":"21638","song_name":"Take You Home With Me a.k.a. Body","artist_id":null,"display_artist":"R. Kelly & Jay-Z","spotify_id":null,"lyrics":"Uh, uhh uhh, Kel's\nYoung, M, X, tra, money, let's go\n\n[Chorus: x2]\nGirl you know you got a body-adi-adi (do you like it?)\nWhere you get your little body-adi-adi (do you want it?)\nGirl I wanna freak your body-adi-adi (what you want it?)\nI just wanna take you home with me\nShe get it from her momma\nYou can't tie a sweater over that ass, or hide it in pajamas\nWe lay back, blowin' ganja\nDVD, she make it hard to watch a flat TV, whoa\nI crept up behind her\nMami threw it like a quarterback, I caught that like Rice\nI call mami Montana, bandana\nTied her hands up, this is gangsta love\nThrew on a rap CD, we gangsta fucked\nThis ain't R&B smooth, I ain't a R&B dude\nPoured a glass of Army, got mama in the mood\nThen she stripped for me like the \"Moulin Rouge\"\nI think I might wife her\nY'know, powder blue Roc-a-Wear suit, white Nike her\nAdd mami to the cypher\nR.O.C. for life cuz, the gang motherfucker\n\n[Chorus]\nI make ya hotter than the next bitch, no need\nFor you to ever sweat the next bitch, with speed\nI make the next bitch see the exit, indeed\nGotta know you're ver-ily respected, by me\nYou get the keys to the Lexus, but no drive\nYou get your own 2002, she through ridin'\nKeep yo' ass tighter than Versace\nThat's why you gotta watch yo' friends\nYou gotta watch me, they connivin' shit\nSee I just wanna freak your body-adi-adi\nI know you don't do this for everybody-adi\nBut everybody ain't as horny as me\nAnd your body's, callin', me\n\n[Chorus]\nUhh, yeah\nMami shot through the pad with the Mark Jacobs bag\nThe thick stitched seam and her favorite ass jeans\nY'all know the first date wearers\nTo make objects bigger than they appear like a rear view mirror\nOh her shoe game is real\nShe gave 'em the Christian Libountins(?) with the four inch heels\nBut honestly my favorite type of gear\nIs a scrungy for her hair and LaPearla underwear, clear?\nGirl I hear you callin', let's stop stallin'\nDo what we came to do\nGirl I hear you callin', let's stop stallin'\nBaby I want you, yeah\n\n[Chorus]"}