{"rank":"98","song_id":"21644","song_name":"Closet Freak","artist_id":null,"display_artist":"Cee-Lo","spotify_id":"16MclLstnjTSTbnQOW2kLR","lyrics":"Yeah.. ooh..\nYou so freaky..\nYou so freaky shorty..\nOoh you so freaky..\nShit, you so freaky shorty..\nUh uh, you so freaky..\nOoh Lord, you so freaky..\nMmm uh, you so freaky shorty..\nHAH HAH!!\n\n[Cee-Lo]\nNow everybody that's grown got skeleton bones they got hidden away\nYes y'all there's a freak in us all, yet some choose not to say\nYou can't let those who ain't yet, make you they lil' ball of clay\nBe free and express yourself, nastiness comes naturally\nListen to me now\nIt could be the way I wanna freak a song, tattoos, or the way I dress\nOr it could be; I wanna walk my way and refusin to follow the rest\nOr when people haven't been where you been\nand they say you still going too far\nOr when you wit ya girl and\nPull over and fuck somethin in the back of the car\n\n[Hook]\nI'm a freak!\nA closet freak!\nA freak!\nAwwww a freak!\n\n[Cee-Lo after each pause in hook]\nI'm so excited, go on and say it\nOh I'm a freak, yes I'm a freak, and just can't fight it\nI'm so excited, go on and say it\nIf you a freak, say you a freak, don't try to fight it\n\n[Cee-Lo]\nYou got to let the music freak your mind\nAll the way, if yo' brain leavin don't mind\nYou know a boyfriend thing is hard to find\nGet on the floor mama and bump and grind\nAin't nuttin wrong wit - You only gon' get\nBut it ain't no fun if you been freakin all mo'nin\nI'll turn you on to it - if you want you gon' do it\nAll you got to do is find somebody like you\n\n[Hook]\nA freak!\nA closet freak!\nA freak!\nAwwww a freak!\n\n[Cee-Lo after each pause in hook]\nI'm so excited, go on and say it\nOh I'm a freak, yes I'm a freak, and just can't hide it\nI'm so excited, go on and say it\nIf you a freak, say you a freak\n(Wait a minute, where the God-damn horns?)\n\n{music plays with Cee-Lo vocalizing and singing}\n\n[Cee-Lo]\nLa-la-la-la-la-la, la-la-la-la-la\nLa-la-la-la-la-la-la, la-la-la-la-la\nLa-la-la-la-la-la, la-la-la-la-la\nLa-la-la-la-la-la-la, la-la-la-la-laaaaah!\n\nFREAK! - Sometimes I like freakin in the mornin\nFREAK! - Sometimes I like freakin at night\nFREAK! - Some people like freakin just lightly\nFREAK! - Some people think freakin ain't right\nFREAK! - Some people like freakin outside now\nFREAK! - Some people like freakin in the club\nFREAK! - Some people like freakin on the express-way\nFREAK! - Some people keen doin it in public\nFREAK! - Some people like freakin with the lights out\nFREAK! - Some people hell just don't care\nFREAK! - Some people like freakin 'bout money\nFREAK! - Some people freak anywhere\nFREAK! - You a freak?\nFREAK! - Are you a freak?\nFREAK! - I'm a freak\nFREAK! - Big ol' freak\n\n{music plays till fade}"}