{"rank":"70","song_id":"21652","song_name":"One Mic","artist_id":"276998","display_artist":"Nas","spotify_id":"0FoNL2JohSdDhABW82QJMc","lyrics":"[Produced by Chucky Thompson and Nas]\n\n[Intro]\nOne time.. yeah.. yeah..\n\n[Verse 1]\nAll I need is one mic, one beat, one stage\nOne nigga front, my face on the front page\nOnly if I had one gun, one girl and one crib\nOne God to show me how to do things his son did\nPure, like a cup of virgin blood\nMixed with 151, one sip'll make a nigga flip\nWritin' names on my hollow tips, plottin' shit\nMad violence, who I'm gon' body? This hood politics\nAcknowledge it, leave bodies chopped up in garbages\nSeeds watch us, grow up and try to follow us\nPolice watch us {*siren*} , roll up and try knockin' us\nOne knee I ducked, could it be my time is up?\nBut my luck, I got up, the cop shot again\nBus stop glass bursts, a fiend drops his Heineken\nRicochetin' between the spots that I'm hidin' in\nBlackin' out as I shoot back – fuck gettin' hit! {*more sirens*}\nThis is my hood, I'ma rep to the death of it\n'Til everybody come home, little niggas is grown\nHoodrats, don't abortion your womb\nWe need more warriors soon\nSent from the stars, sun and the moon\nIn this life of police chases, street sweepers and coppers\nStick-up kids with no conscience, leavin' victims with doctors\nIF YOU REALLY THINK YOU READY TO DIE, WITH 9's OUT\nTHIS IS WHAT NAS IS 'BOUT, NIGGA, THE TIME IS NOW!\n\n[Hook]\nYo, all I need is one mic..\nAll I need is one mic.. (that's all I need)\nAll I need is one mic.. (all I need niggas)\nAll I need is one mic.. (yeah)\n\n[Verse 2]\nAll I need is one blunt, one page and one pen\nOne prayer; tell God forgive me for one sin\nMatter of fact, maybe more than one\nLook back at all the hatred against me – fuck all of them!\nJesus died at age 33, there's 33 shots\nFrom twin Glocks, there's 16 apiece, that's 32\nWhich means one of my guns was holdin' 17\n27 hit your crew, six went into you\nEverybody gotta die sometime, hope your funeral\nNever gets shot up, bullets tear through the innocent\nNothin' is fair, niggas roll up, shootin' from wheelchairs\nMy heart is racin', tastin' revenge in the air\nI let this shit slide for too many years, too many times\nNow I'm strapped with a couple of MAC's, too many 9's\nIf y'all niggas really with me, get busy, load up the semi's\nDo more than just hold it, explode the clip until you empty\nThere's nothin' in our way: they bust, we bust\nThey rush, we rush, lead flyin', feel it? I feel it in my gut\nTHAT WE TAKE THESE BITCHES TO WAR, LIE 'EM DOWN\nCAUSE WE STRONGER NOW, MY NIGGA, THE TIME IS NOW!\n\n[Hook]\nAll I need is one mic.. (that's all I need niggas, that's all I need)\nAll I need is one mic.. (there's nuttin else in the world)\nAll I need is one mic.. (that's all a nigga need to do his thing y'know)\nAll I need is one mic.. (this is all I need...)\n\n[Verse 3]\nALL I NEED IS ONE LIFE, ONE TRY, ONE BREATH, I'M ONE MAN\nWHAT I STAND FOR SPEAKS FOR ITSELF\nTHEY DON'T UNDERSTAND\nDon't wanna see me on top, too egotistical\nTalkin' all that slick shit the same way these bitches do\nWonder what my secrets is\nNiggas'll move on you, only if they know what your weakness is\nI have none – too late to grab guns\nI'm blastin' ‘cause I'm a cool nigga\nThought I wouldn't have that ass done? Fooled you niggas\nWhat you call an infinite brawl, eternal souls clashin'\nWar gets deep, some beef is everlastin'\nComplete with thick scars\nBrothers knifin' each other up in prison yards\nDrama, where does it start?\nYou know the block was ill as a youngster\nEvery night it was like a cop would get killed\nBody found in the dumpster\nFor real a hustler, purchased my Range\nNiggas throwin' dirt on my name\nJealous ‘cause fiends got they work and complain\nBitches left me ‘cause they thought I was finished\nShoulda knew she wasn't true\nShe came to me when her man caught a sentence\nDiamonds are blindin', I never make the same mistakes\nMovin' with a change of pace\nLighter load, see now the king is straight\nSwellin' my melon, ‘cause none of these niggas real\nHeard they were tellin' police, how can a kingpin squeal?\nThis is crazy, I'm on the right track, I'm finally found\nYou need some soul-searchin', the time is now\n\n[Hook]\nAll I need is one mic.. (yeah, yeah yeah yeah)\nAll I need is one mic.. (that's all I ever needed in this world, fuck cash)\nAll I need is one mic.. (fuck the cars, the jewelry)\nAll I need is one mic.. (to spread my voice to the whole world, baby, uh)"}