{"rank":"94","song_id":"21667","song_name":"I Told Y'all","artist_id":"331209","display_artist":"Petey Pablo","spotify_id":"2T5wKTa1NEkxwXwtxh7xvu","lyrics":"Ah.. \nHih.. \nHa...\nPetey Pablo... \nMmm Hmm...\n\n[Chorus:]\nI told y'all (told y'all) \nIt was gunna happen, Y'all wouldn't listen to me (I told y'all)\nNow you see it poppin off, got you in the club dancing your ass off (I told \ny'all)\nBreak it down...Break it down for me (for me) (I told y'all)\nBreak it down...Break it down...Break it down for me (for me)\n(I told y'all) Break it down for me (for me)\n\nIf y'all ready get your lighter put your fire in the air\ni'm bout to blow this up (Oh yeah!)\nIts a....It's a on now\nPetey Pab done and graduated\nBroke a loose, Shook em' off (Ha!)\nTwisted the game\n(chooga-chooga-chooga-choog) train comin'\n(Full speed!) Aint nuthin stopin this muthafucker\nPuttin it down....(ti-ti-ti-train) for my home town\n(My niggas keep picking me up) I got em' rockin at the show\nAll y'all muthafuckers stompin on the floor (Boom! Boom!)\nLosing control (Eyes closed)\nHands up (poppin the dome)\nAnd you can call it what ya wanna if ya wanna\nBut you better keep your eyes on it\nI'd a told ya over and over\nI dont feel like talking no more\nIt's about to go down (Yea like i told ya!)\n\n[Chorus]\n\n(Move Over!) Makin em' diesel\n(Fuled Up!) Jesus (Muuuahh!)\nClear the road, block it off, hold it back, make a path\n(I'm a creeper!) Carolina's street sweeper\nMy brother keep her, you better believe her\nGood as a bag of Afghanastan reefa\nI can't fuck with me and y'all can't either\nTo hear me rock you need bulletproof speakers\n(My Impact!) It'll Kill 79 people (Ha!)\nThe levels start jumping on the meter\nThen...(The sparks) start shootin out the speaker\nThe DJ ju just can't catch the needle\nThe clubs call it fever for the flavor of the Petey!\n\n[Chorus]\n\nWhen they ask me were I'm from I say Greenville and Raleigh, \nDurham, Chapel Hill, Greensboro, Charlotte!\nFayetville, Rocky Mount, and Tarboro!\nPine Top, Lil Washington, Farmville\nNew Bern, Kinston, Snow Hill, Faulkland!\nPlease don't get me started\nI can call em' out till tomorrow\nCarolina list alone is 16 long\nI'm a make a row call, calling out, all out\n(Timbaland! please report to the office)\nYou can't miss kickoff, Watching these niggas get there shit off\nSending a adrenaline rush through the whole park\nDusk to dawn, from club to the barn\nFrom port to port (Nigga!) from yard to yard\nI'd a brought from the far beyond\nStated claim, Gutta name, Got it painted and framed!\n(Mutherfucker I told y'all!)\n\n"}