{"rank":"76","song_id":"21683","song_name":"Nothin'","artist_id":"276932","display_artist":"N.O.R.E.","spotify_id":"5ZKVNTG7yu7gbX4vryqS2X","lyrics":"[Intro: Pharell]\r\nOh! (Militainment) Oh! (Militainment) Oh! (Militainment) Come on\r\n(Militainment) Oh! (Militainment) This one is the hot one!\r\n(Militainment) Aiyyo! (Militainment)\r\n\r\n[Chorus: Pharell]\r\nHomeboy, I came to party, your girl was lookin' at me\r\nShe's a haggler naw I'm not taggin' her\r\nBut you don't want them boys to come over and start askin' ya\r\nWhat you wanna do, nigga? (Nothin')\r\nWhat you trynna do, nigga? (Nothin')\r\nWhat you wanna do, nigga? (Nothin')\r\nWhat you trynna do\r\n\r\nNoreaga:\r\n\r\nYo N-O-R papi say what, that nigga's the man\r\nWith his manager Chris and the label that Jams\r\nStill flossin', showin' your rocks\r\nAin't you dudes heard &amp;quot;Grimey&amp;quot; man we stoled your watch\r\nIt goes Indian style, he's bent in dashiki\r\nStrapped with the veritek baby tec B.T.\r\nTrue she at the bar lookin' good in the brown dress\r\nFour to six shots and them things ain't around yet\r\nPersona all thugged out loud and clear\r\nSayin' fuck the straight Henny, just grab me a beer\r\nYou see I'm reppin' now, and my mami's I got a weapon now\r\nShoot at them clowns at they feet, they high steppin' now\r\nLeft that wack label cause I don't like pricks\r\nI'm like a hammer that you hold on your hand, I make hits\r\nAt the white boy club whylin' buyin the bar\r\nThey like hey now, you're an all star, it go\r\n\r\nChorus\r\n\r\n\r\nNoreaga:\r\n\r\nI spit mack millimeter rhymes, kill a liter in line\r\nMy nigga Peter got a heater of mines\r\nNiggas still lyin', in they wack ass bars\r\nOnly time they seen jail, when they watchin' Oz\r\nI'm in the club pissy drunk like ahhhdadidaaaaa!!!!!!\r\nAnd mami took her papa like dadadidaaaaa!!!!!!\r\nAdios kill your soul then we body your ghost\r\nThey call me gordo, sip champagne and sip porto\r\nPlayin' Captain Clue (Man you ain't nappy too!!!)\r\nI like when chocha be nappy too\r\nI treat life like a fast car, low on my speed\r\nI try and chill, and sell more records than Creed\r\nBeen a hustler (What? what?) way before &amp;quot;Melvin Flynt&amp;quot;\r\nA criminal, don't need no prints\r\nThese dudes gave me a brick and they ain't seen me since\r\nCoulda woulda, had them dudes straight hoppin' the fence, it go\r\n\r\n(Chorus)\r\n\r\n[Bridge]\r\nLa la la la la la la la la (Oh!) (8x)\r\n\r\n\r\nNoreaga:\r\n\r\nWell oops I dunn dunna again, I got another one\r\nI keep it hid in my pocket I got another one\r\nFast and furious, dunn dunn dunn tudunn\r\nStill be in, Miami and jet skiin'\r\nIn the ocean where the sharks be at, just O.D.'n\r\nAdebesi, want a brick to pay double easy\r\nI got them thangs that a move easy\r\nAnd I told the lawyer, I sold blow to old Goya\r\nI'm half Spanish, you see I cook coke to Goya\r\nHalf spanish, all day arroz con polla\r\nRecognize, when I'm runnin' the game, before me\r\nChickens wasn't even messin' wit brain, because me\r\nNow you started gettin' head on the westside highway\r\nSo recognize my nigga you did it my way\r\nIce rockin', brick choppin' and gun shoppin'\r\nI did it all beat cases without Cochran\r\n\r\n(Chorus)\r\n\r\n[Outro]\r\nLa la la la la la la la la (Oh!) (8x)"}