{"rank":"42","song_id":"21696","song_name":"The Good Stuff","artist_id":"305717","display_artist":"Kenny Chesney","spotify_id":"1EKiQ1InQXuodp4M1idrng","lyrics":"Well, me an' my lady had our first big fight,\nSo I drove around 'til I saw the neon light.\nA corner bar, an it just seemed right.\nSo I pulled up.\n\nNot a soul around but the old bar keep,\nDown at the end an' looking half asleep.\nAn he walked up, an' said : \"What'll it be?\"\nI said: \"The good stuff.\"\n\nHe didn't reach around for the whiskey;\nHe didn't pour me a beer.\nHis blue eyes kinda went misty,\nHe said: \"You can't find that here.\n\n\"'Cos it's the first long kiss on a second date.\nMomma's all worried when you get home late.\nAnd droppin' the ring in the spaghetti plate,\n'Cos your hands are shakin' so much.\nAn' it's the way that she looks with the rice in her hair.\nEatin' burnt suppers, the whole first year,\nAn' askin' for seconds to keep her from tearin' up.\nYeah, man, that's the good stuff.\"\n\nHe grabbed a carton of milk an' he poured a glass.\nAn' I smiled an' said: \"I'll have some of that.\"\nWe sat there an' talked as an hour passed,\nLike old friends.\n\nI saw a black an' white picture an' it caught my stare,\nIt was a pretty girl with bouffant hair.\nHe said: \"That's my Bonnie,\n\"Taken 'bout a year after we were wed.\"\n\nHe said: \"Spent five years in the bottle,\n\"When the cancer took her from me.\n\"But I've been sober three years now,\n\"'Cos the one thing stronger than the whiskey:\n\n\"Was the sight of her holdin' my baby girl.\n\"The way she adored that string of pearls,\n\"I gave her the day that our youngest boy, Earl,\n\"Married his high school love.\"\n\"An' it's a new tee-shirt saying: 'I'm a Grandpa'.\n\"Bein' right there as our time got small,\n\"An' holdin' her hand, when the Good Lord called her up,\n\"Yeah, man, that's the good stuff.\"\n\nHe said: \"When you get home, she'll start to cry.\n\"When she says: 'I'm sorry,' say: 'So am I.'\n\"An' look into those eyes, so deep in love,\n\"An' drink it up.\n\"'Cos that's the good stuff.\n"}