{"rank":"40","song_id":"21707","song_name":"Down 4 U","artist_id":null,"display_artist":"Irv Gotti Presents The INC. Featuring Ja Rule, Ashanti, Charli Baltimore & Vita","spotify_id":null,"lyrics":"New...\n\nJa Rule, Vita, Charlie Baltimore, Ashanti...\n\nFat Joe, All Murder Inc...\n\nIrv Gotti, Chris, TNT...\n\nWhaaaat......\n\n[Chorus:]\nI wanna be your chick\n\nI wanna be down for you\n\n(Do ya trust me?) Yeah\n\n(Love me?) Yeah\n\n(You're puttin' it on me Ya must be)\n\nYa down ass chick\n\nI wanna be your chick\n\n(It ain't only for the RULE baby)\n\nI ride for u, Down for u\n\nDo anything ya want me to\n\nI be ya down ass chick\n\n[Ja Rule:]\n\nThis chick no intentions of bein' offensive\n\nThe women by callin ya'll bitches\n\nMy down ass bitches\n\nStill my queen bitch's cut look clean\n\nOn ya finger next to the finger ya flipped at me\n\nAnd this no in between me and you\n\nOnly me and you\n\nWho else gon' put it on me like the RULE\n\nGod only looks after children and foo's\n\nAnd you not so who gon' look after you\n\nIt's RULE baby\n\n[Vita:]\n\nTrue baby\n\nIt's only for you baby\n\nVita thighs only divide if you beside\n\n'cause I love the way you touch me\n\nNobody can get it\n\nAnd if it's comin' and gunnin'\n\nJust come in it and spit it\n\nSo when ya gone for a minute\n\nI just fantasize like if it's you It's all in it\n\nThen I'm satisfied til' you come back to me\n\nHoldin stack and jewels\n\nV-i-t-a and my nigga J-a RULE baby\n\n[Chorus:]\n[Ashanti:]\n\nI'm gonna be here when ya need\n\nRULE baby can always count on me\n\nNo you don't ever have to worry\n\nYou know I'll make it in a hurry\n\nI'm here for ya\n\nAnd I won't never leave tears for ya\n\n'cause boy ya got to me\n\nNobody ever come before me\n\nYou'll always be my one and only\n\n[Ja Rule (Ashanti):]\n\nBabygirl would ya bust ya gun with me? (Yeah yeah)\n\nLie to the feds to come get me? (Yeah Yeah)\n\nAnd if I died Kill for me? (Yeah Yeah)\n\nAre you trustin me? (Yeah Yeah)\n\nAre you lovin me? (Yeah Yeah Yeah)\n\nYeah let's get it grinnin\n\nLike we asked for the Simpsons or Ike and Anna Mehoe\n\nOn one their good days\n\nYou smile like sun rays 5'5 with brown eyes and thick legs\n\nOnly for the RULE baby\n\n[Chorus:]\n[Charlie Baltimore:]\n\nNow baby I told you I can show you better than I can tell you\n\nDon't try to bring conversey and mail\n\nJust sweet words and naked photos\n\nI'm still that pretty down down ass 2 cars behind ya 6\n\nAnd I diss any clown ass rockin my brown ass only a down ass\n\nAnd it's all for you\n\nI'm grown a tad bit since we been at like rare bitches\n\nTo move a little bumper and it's\n\n([Ja Rule:] AND IT'S ALL FOR RULE)\n\nShit Who gon' love you like that?\n\nThug with you wit a stack to the ceilin\n\nAnd spilt in the dub with you\n\n'cause I played my position with KO-D's, O G's\n\nUntil that blood shed blood red and we O-Ded\n\nRemember every word that ya told me\n\n([Ja Rule:] SHOWED ME HOLD ME)\n\nAll you need in your life is Chuck, drugs, and dubs on 22's\n\nNow tell me who the hunny for you\n\nCHUCK\n\n[Chorus x2]"}