{"rank":"54","song_id":"21735","song_name":"Cleanin' Out My Closet","artist_id":"301722","display_artist":"Eminem","spotify_id":"7BMO7O7ImjV8HNTH74Tshv","lyrics":"[Intro]\nWhere's my snare?\nI have no snare in my headphones\nThere you go, yeah, yo, yo\n\n[Verse 1]\nHave you ever been hated or discriminated against?\nI have: I've been protested and demonstrated against\nPicket signs for my wicked rhymes, look at the times\nSick as the mind of the motherfuckin' kid that's behind\nAll this commotion, emotions run deep as oceans, explodin'\nTempers flarin' from parents, just blow 'em off and keep goin'\nNot takin' nothin' from no one, give 'em hell long as I'm breathin'\nKeep kickin' ass in the morning and takin' names in the evenin'\nLeave 'em with a taste as sour as vinegar in they mouth\nSee, they can trigger me, but they'll never figure me out\nLook at me now! I bet you're probably sick of me now\nAin't you, Momma? I'ma make you look so ridiculous now!\n\n[Hook]\nI'm sorry, Momma, I never meant to hurt you\nI never meant to make you cry\nBut tonight I'm cleanin' out my closet\n(One more time!)\nI said I'm sorry, Momma, I never meant to hurt you\nI never meant to make you cry\nBut tonight I'm cleanin' out my closet\n\n[Verse 2]\nI got some skeletons in my closet\nAnd I don't know if no one knows it\nSo before they throw me inside my coffin and close it\nI'ma expose it; I'll take you back to '73\nBefore I ever had a multi-platinum-selling CD\nI was a baby, maybe I was just a couple of months\nMy faggot father must have had his panties up in a bunch\n‘Cause he split, I wonder if he even kissed me goodbye\nNo, I don't, on second thought, I just fuckin' wished he would die\nI look at Hailie, and I couldn't picture leavin' her side\nEven if I hated Kim, I'd grit my teeth and I'd try\nTo make it work with her at least for Hailie's sake\nI maybe made some mistakes\nBut I'm only human, but I'm man enough to face 'em today\nWhat I did was stupid, no doubt it was dumb\nBut the smartest shit I did was take the bullets out of that gun\n‘Cause I'da killed him, shit, I woulda shot Kim and him both\nIt's my life, I'd like to welcome y'all to The Eminem Show\n\n[Hook]\nI'm sorry, Momma, I never meant to hurt you\nI never meant to make you cry\nBut tonight I'm cleanin' out my closet\n(One more time!)\nI said I'm sorry, Momma, I never meant to hurt you\nI never meant to make you cry\nBut tonight I'm cleanin' out my closet\n\n[Verse 3]\nNow, I would never diss my own momma just to get recognition\nTake a second to listen 'fore you think this record is dissin'\nBut put yourself in my position, just try to envision\nWitnessin' your momma poppin' prescription pills in the kitchen\nBitchin' that someone's always goin' through her purse and shit's missin', goin' through public housing systems\nVictim of Münchausen's Syndrome\nMy whole life I was made to believe I was sick when I wasn't\n'Til I grew up, now I blew up\nIt makes you sick to your stomach, doesn't it?\nWasn't it the reason you made that CD for me, Ma?\nSo you could try to justify the way you treated me, Ma?\nBut guess what, you're gettin' older now\nAnd it's cold when you're lonely, and Nathan's growin' up so quick he's gonna know that you're phony\nAnd Hailie's gettin' so big now, you should see her, she's beautiful\nBut you'll never see her—she won't even be at your funeral!\nSee, what hurts me the most is you won't admit you was wrong\nBitch, do your song, keep tellin' yourself that you was a mom!\nBut how dare you try to take what you didn't help me to get?\nYou selfish bitch, I hope you fuckin' burn in hell for this shit!\nRemember when Ronnie died and you said you wished it was me?\nWell, guess what, I am dead—dead to you as can be!\n\n[Hook]\nI'm sorry, Momma, I never meant to hurt you\nI never meant to make you cry\nBut tonight I'm cleanin' out my closet\n(One more time!)\nI said I'm sorry, Momma, I never meant to hurt you\nI never meant to make you cry\nBut tonight I'm cleanin' out my closet"}