{"rank":"87","song_id":"21825","song_name":"From Tha Chuuuch To Da Palace","artist_id":"279664","display_artist":"Snoop Dogg","spotify_id":"3dVRdoxPN20V8w0KDxWtIC","lyrics":"Fa shizzle dizzle, it's the big neptizzle\r\nWith the snoopy d-o-double jizzle!\r\n...(snoop dogg! snoop dogg!)\r\n...c-walk to this (snoop dogg! snoop dogg!)\r\n...hehe, yeah, c-walk to this (snoop dogg! snoop dogg!)\r\n...ahaha, c-walk to this (snoop dogg! snoop dogg!)\r\n\r\n[verse 1]\r\nBam, boom, watchoo gone do 'cause?\r\nGuess I'm rollin in with them baby blue chucks\r\nAnd I still got my khakis creased\r\nIm still rockin on these beats, and got a bad rep on the streets\r\nIts the s-n-double-o-p, and, biggest dogg of 'em all\r\nAnd youse a flea, and\r\nAnd since I got time to drop it for you, I guess I must\r\nAnd give it to you mother f**kas like bust-a-bust\r\nI keep the heat on deck, but in God we trust\r\nAnd cant none of yall, f**k wit us\r\nBut you can run up on the g but thats not thinkin wisely\r\nThese pullas are contagious, just like ron isley\r\n(what the hell is goin on? someone's sleepin in my home)\r\nSnoop to the d-o-double g\r\nGet in, where you fit in... follow me\r\n\r\n[chorus]\r\nWhos the man with that dance? (snoop dogg! snoop dogg!)\r\nWho kick the khakis from his pants? (snoop dogg! snoop dogg!)\r\nGet the dro' low anything will stand (snoop dogg! snoop dogg!)\r\nStill rock the gin n juice in hand (snoop dogg! snoop dogg!)\r\n\r\n[verse 2]\r\nI do it for the g's, and I do it for the hustlaz\r\nHere to annihilate you mark-ass bustas\r\nF**k the police 'cause all they wanna do is cuff us\r\nThe one nigga is chilly, as if his name was usher\r\nBut I'm still ridin in macks, makin 'em g stacks\r\nAnd got them corn rows to the back\r\nI ain't really tryin to be picky\r\nBut if you give me somethin, it's got to be the sticky\r\n\r\n\r\nDoin by the ounces, lo' lo's bouncin\r\nNinety doin fakin with kissin on the couchin\r\nBoo to the ouchin, more a fountain\r\nBut thats how we get anotha doggy dogg housin\r\nThis year we ain't f**k wih thousands\r\nWe clean with millions and we fly as a falcon\r\nPull up to the doggy dogg pound, with a car fulla bitches\r\nF**kin grits like alice\r\n\r\n[chorus]\r\n\r\n[verse 3]\r\nThree 14 inch rims is runnin on the side (they riding on the side? )\r\nYeah they runnin on the side!\r\nThree 14 inch rims is running on the side (they riding on the side? )\r\nYeah they runnin on the side!\r\nThree 14 inch rims is running on the side (they riding on the side? )\r\nYeah they runnin on the side!\r\nThree 14 inch rims is running on the side (they riding on the side? )\r\nYeah they runnin on the side!\r\nTake two and pass it, it will not burn you\r\nFrom the long beach chronicles to the wall street journal\r\nThey all know the g with the cut in his coupe\r\nAsk bill gates (yeah I know the homie snoop)\r\nYeah I'm still loaded, hangin wit my folk and\r\nFollow rakim cause \"i ain't no joke\"\r\nCause I done seen so much, enuff to have your felons touched\r\nWhen the gunshots ratta, all ya boys scatta'\r\nCheck up on ya homies but they gave ya bad data\r\nNigga f**kin stop breathin\r\nThat is so relievin', and now ya bitches are leavin'\r\nWhat I say 'cause what I say is so real\r\nHomie you don' wanna see da, steel\r\nYou don't wanna catch a body, you cant hear the party!\r\nNow thats what you should do, now wheres my baby-boo?\r\n\r\n[chorus]\r\n[fade out]"}