{"rank":"57","song_id":"21837","song_name":"Thug Lovin'","artist_id":"276599","display_artist":"Ja Rule Featuring Bobby Brown","spotify_id":"1kcs5yiRXarUJ8biBJYkxo","lyrics":"It's on and poppin' baby! The Last Temptation! He's Back! Y'all know who\nI'm talking bout! \n\nChorus:Bobby Brown\nAnd I know you're gettin bored\nDealin with him,\nI know you miss my lovin, my thuggin\nThug Lovin'\n\nVerse 1:Ja Rule\nI know you're livin your life, faithfully\nSafe from me, away from me, but you miss being next to me\nDon't you-don't let our love haunt you\nLust for what you want and go for your guns\nAnd back out on anyone tries to interfere or intervene\nWith me peelin your wide body outta them tight jeans\nWrist on freeze, seats on lean, shoes 19\nComin through in that Bentley thang\nThe top of the town, the keys to the city\nYou and I make headlines like Lo, and Diddy\nBob and Whitney\nI'm here cuz the Lord sent me, pound push like a fugilist \nBut I'm real devilish and freak that bad bitches, shit\nBut you-a different story and I know your\ngettin bored and\nAnd he ain't gettin you horny no more, is he?\nWhen it's all said and done, it's me\nLovin, thuggin and I know you're\n\n[Chorus 2x]\n\nSweet thang livin' it\nWon't you let me let you live it a little bit\nI know a stressful relationship is hard to deal with\nBut here's how you deal with it\nOn your weekly visits, use a code name\nTo protect the innocent\nMaybe I'm too generous\nGenerally believin that all women want me\nThey don't wanna get even\nBut who do you believe in?\nIs it money or God?\nBetrayal or trust, sustain your vows\nSecretly or sacred\nCuz I love it when you pop your body-body\nMove your body-body\nDrink up all the Bacardi\nAnd roll up alongside me\nI love too see you wild and free\nBut occasionally you get cold wet feet\nAnd all that it means to me is that you need my heat\nCause when it's said and done you're gonna want me\nLovin', thuggin' and I know you...\n\n[Chorus 2x]\n\nBaby, here I'm holdin' your love hostage\nThe ransom for you, sugar, be priceless\nCause you been gettin' at me in many a ways\nNow tell your man to watch his back and duck them strays\nCause I been in a rage lately\nHopin' God'll forgive me for all the sin and all the woman\nAll the drama I been in and it's just the beginnin'\nI hope your watching so you could see that nigga ain't built\nlike me!! \nThe black sheep of my family\nBut we one in the same, that's why we get along\nFreak off and get it on\nWhen we make love lookin' somethin' like soft porn\nTell me, baby, do you really wanna go home to him??\nBut the brightest of your days just goin' look dim\nCause you fuckin' with a loser, baby, you can't win\nWhen it's said and done you're gonna need me\nLovin', thuggin' and I know you....\n\n[Chorus 2x]\n\nYeah, yeah, I.G, Ja Rule\nB. Brown Murder Inc.\nDef Jam, Sony\nThis is what we buildin' here\nMurder Inc.\nHa-ha-ha\nBobby Brown\nMurder\nHa-ha\nIt's that real\nRule, baby\nBring it back my, niggaz\nB. Brown, ha-ha\n\nAnd I know you're gettin' bored\n"}