{"rank":"50","song_id":"21846","song_name":"Thugz Mansion","artist_id":"431886","display_artist":"2Pac","spotify_id":"3nXh2gWpgtjBw4HTBSgZ3e","lyrics":"[Intro: 2Pac]\nShit, tired of gettin' shot at\nTired of gettin' chased by the police and arrested\nNiggas need a spot where we can kick it\nA spot where we belong, that's just for us\nNiggas ain't gotta get all dressed up and be Hollywood\nY'knahmean? Where do niggas go when we die?\nAin't no heaven for a thug nigga\nThat's why we go to thug mansion\nThat's the only place where thugs get in free\nAnd you gotta be a G, at thug mansion\n\n[Verse 1: 2Pac]\nA place to spend my quiet nights, time to unwind\nSo much pressure in this life of mine, I cry at times\nI once contemplated suicide, and woulda tried\nBut when I held that 9, all I could see was my mama's eyes\nNo one knows my struggle, they only see the trouble\nNot knowin' it's hard to carry on when no one loves you\nPicture me inside the misery of poverty\nNo man alive has ever witnessed struggles I survived\nPrayin' hard for better days, promise to hold on\nMe and my dawgs ain't have a choice but to roll on\nWe found a finally spot to kick it\nWhere we can drink liquor and no one bickers over trick shit\nA spot where we can smoke in peace, and even though we G's\nWe still visualize places that we can roll in peace\nAnd in my mind's eye, I see this place the players go and pass it\nI got a spot for us all, so we can ball, at thug's mansion\n\n[Hook: Anthony Hamilton]\nAin't no place I'd rather be\nChillin' with homies and family\nSky high, iced out, paradise in the sky\nAin't no place I'd rather be\nOnly place that's right for me\nChromed-out, mansion in paradise, in the sky\n\n[Verse 2: 2Pac]\nWill I survive all the fights and the darkness?\nTrouble sparks, they tell me: \"Home is where the heart is.\"\nDear departed, I shed tattooed tears\nAnd couldn't sleep good for multiple years\nWitness peers catch gunshots; nobody cares\nSeen the politicians ban us, they'd rather see us locked in chains\nPlease explain why they can't stand us\nIs there a way for me to change?\nOr am I just a victim of things I did to maintain?\nI need a place to rest my head\nWith the little bit of homeboys that remains\n‘Cause all the rest dead; is there a spot for us to roll?\nIf you find it, I'll be right behind ya, show me and I'll go\nHow can I be peaceful? I'm comin' from the bottom\nWatch my daddy scream \"Peace!\" while the other man shot him\nI need a house that's full of love, when I need to escape\nThe deadly places slingin' drugs, in thug's mansion\n\n[Hook: Anthony Hamilton]\nAin't no place I'd rather be\nChillin' with homies and family\nSky high, iced out, paradise in the sky\nAin't no place I'd rather be\nOnly place that's right for me\nChromed-out, mansion in paradise, in the sky\n\n[Verse 3: 2Pac]\nDear Mama, don't cry, your baby boy's doin' good\nTell the homies I'm in Heaven and they ain't got hoods\nSeen a show with Marvin Gaye last night, it had me shook\nDrinkin' peppermint Schnapps, with Jackie Wilson and Sam Cooke\nThen some lady named Billie Holiday sang\nSittin' there kickin' it with Malcolm 'til the day came\nLittle Latasha sho' grown\nTell the lady in the liquor store that she's forgiven, so come home\nMaybe in time you'll understand\nOnly God can save us, when Miles Davis cuttin' lose with the band\nJust think of all the people that you knew in the past\nThat passed on, they in Heaven, found peace at last\nPicture a place that they exist, together\nThere has to be a place better than this, in Heaven\nSo right before I sleep, dear God, what I'm askin'\nRemember this face, save me a place in thug's mansion\n\n[Hook: Anthony Hamilton & (2Pac)]\nAin't no place I'd rather be\nChillin' with homies and family\nSky high, iced out, paradise in the sky (in thugs mansion)\nAin't no place I'd rather be\nOnly place that's right for me\nChromed-out, mansion in paradise, in the sky (thugs mansion)\nAin't no place I'd rather be\nChillin' with homies and family\nSky high, iced out, paradise, in the sky (in thugs mansion)\nAin't no place I'd rather be\nOnly place that's right for me\nChromed-out, mansion in paradise, in the sky"}