{"rank":"57","song_id":"21840","song_name":"Satisfaction","artist_id":"301945","display_artist":"Eve","spotify_id":"0klzutEUO6IX3QSmtRDFrq","lyrics":"[Verse 1]\nNow I'ma do this thing like it ain't done before\nNever leave the game stranded, I had to give more\nI'ma give you what you want, what you waitin' for?\nMake the music that the people can't ignore\nA lotta niggas is bitches, a lotta bitches be trippin'\nA lotta them be wishin' that they was in my position\nA lotta niggas be cowards and most chicks be chickens\nFuck 'bout the CLUCK! CLUCK! Eve ain't trippin'\nMost dudes is okay (Half of the rest ain't)\nTalkin' 'bout what they wanna do (Reality they can't)\nAsk 'em what they life worth, watch 'em draw a blank\nI really ain't got no interest if it don't involve the bank\nMost of the time I'm nice to 'em (Half the time I'm not)\nIt ain't nothin' new though (Learned it from off the block)\nPeople think I changed much 'cuz I'm livin' good\nNow they get my voicemail, hear them callin' me rude?\nSometimes I feel bad (Most of the time I don't)\n'Cuz if I don't protect my shit (Other niggas won't)\nSome want me to neglect my shit (Take it for a joke?!)\nBut I'm stayin' on the grind (Never goin' back to broke)\n\n[Chorus]\nAnything I want\nI'ma get it 'cuz I know I need it\nIt's Evey comin' and I know you heated\nAnything I need\nGotta have it, bet I'm gonna grab it\nAin't nothin' better than the satisfaction\nEverything I am\nJust because I had to make it happen\nThey never thought that I would make it rappin'\nAnything I need\nGotta have it, bet I'm gonna grab it\nAin't nothin' better than the satisfaction\n\n[Verse 2]\nNow I'ma do this thing like it ain't done before\nNever leave the game stranded, I had to give more\nI'ma give you what you want, what you waitin' for?\nMake the music that the people can't ignore\nSee how we do this thing dog, here we go again\nDre and Bombshell, don't you love how it blend?\nRadio stations, DJ's they spin\nTold y'all determined to win\nYou tryina enter through the back door?\nAin't nothin' happenin', this whole shit is my shit bitch and I'm the captian\nCan't beat me join me baby then get to clappin'\nBang it in ya whip to get ya neck snappin'\nI know you hopin' that I rest so you can breathe\nStressed when we in the same places 'till I leave\nWhisper to they friends what they wanna do to me\nWish they could erase me, take away the air I breathe\nAnd I feed 'cuz that shit only give me hunger pains\nNever let you muhfuckas put out my flame\nReady for whatever, was trained to maintain\nAnd I always been a savage 'bout the fame\nSeparate the girls from the women and the winnin'\nAlways knew the thrill was worth it from the beginnin'\nBaby what's the deal I'm hurtin' 'em how I'm livin'\nI gotta conquer it all now the world's my wishin'\n\n[Chorus]\nAnything I want\nI'ma get it 'cuz I know I need it\nIt's Evey comin' and I know you heated\nAnything I need\nGotta have it, bet I'm gonna grab it\nAin't nothin' better than the satisfaction\nEverything I am\nJust because I had to make it happen\nThey never thought that I would make it rappin'\nAnything I need\nGotta have it, bet I'm gonna grab it\nAin't nothin' better than the satisfaction\n\n[Verse 3]\nAin't nothin' hotter than this heat y'all, it's like a magnet\nI don't really mess wit too many 'cuz they be plastic\nThat's it enjoy it boy, it's like magic\nAnything less than a banger will not have it\nStill I Ruff Ryde but I got my team\nAnd we ain't goin' nowhere 'till we lock the game\nBut in the mean time ball while we live the dream\nAnd now I need to hear y'all sing\n\n[Chorus 2x]\nAnything I want\nI'ma get it 'cuz I know I need it\nIt's Evey comin' and I know you heated\nAnything I need\nGotta have it, bet I'm gonna grab it\nAin't nothin' better than the satisfaction\nEverything I am\nJust because I had to make it happen\nThey never thought that I would make it rappin'\nAnything I need\nGotta have it, bet I'm gonna grab it\nAin't nothin' better than the satisfaction\n\n\n"}