{"rank":"58","song_id":"21859","song_name":"Made You Look","artist_id":"276998","display_artist":"Nas","spotify_id":"7Ivn1AgtIVM708UdwKASbc","lyrics":"[Produced by Salaam Remi]\n\n[Intro]\nBravehearts, Bravehearts, Bravehearts…\n\n[Verse 1]\nNow let's get it all in perspective\nFor all y'all enjoyment, a song y'all can step with\nY'all appointed me to bring rap justice\nBut I ain't five-O, y'all know it's Nas, yo\nGrey Goose and a whole lot of hydro\nOnly describe us as soldier survivors\nStay laced in the best, well-dressed\nWith finesse in a white tee, lookin' for wifey\nThug girl who fly and talks so nicely\nPut her in the coupe so she can feel the nice breeze\nWe can drive through the city, no doubt\nBut don't say my car's topless, say the titties is out\nNewness, here's the anthem\nPut your hand up that you shoot with, count your loot with\nPush the pool stick in your new crib\nSame hand that you hoop with, swing around like you stupid\nKing of the town? Yeah, I been that\nYou know I click-clack — where you and your mens at?\nDo the Smurf, do the Wop, Baseball Bat\nRooftop like we bringin' '88 back\n\n[Hook]\nThey shootin'! Aw, made you look\nYou a slave to a page in my rhyme book\nGettin' big money, playboy, your time's up\nWhere them gangstas? Where them dimes at?\nThey shootin'! Aw, made you look\nYou a slave to a page in my rhyme book\nGettin' big money, playboy, your time's up\nWhere them gangstas? Where them dimes at?\n\n[Verse 2]\nThis ain't rappin', this is Street Hop\nNow get up off yo' ass like your seat's hot\nMy live niggas lit up the reefer\nTrunk of the car, we got the streetsweeper\nDon't start none, won't be none\nNo reason for your mans to panic\nYou don't wanna see no ambulances\nKnock a pimp's drink down in his pimp cup\nThat's the way you get Timberland'd up\nLet the music diffuse all the tension\nBaller convention, free admission\nHustlers, dealers and killers can move swift\nGirls get close, you can feel where the tool's kept\nAll my just-comin' homies, parolees\nGet money, leave the beef alone slowly\nGet out my face, you people so phony\nPull out my waist, the Eagle four-forty\n\n[Hook]\nThey shootin'! Aw, made you look\nYou a slave to a page in my rhyme book\nGettin' big money, playboy, your time's up\nWhere them gangstas? Where them dimes at?\nThey shootin'! Aw, made you look\nYou a slave to a page in my rhyme book\nGettin' big money, playboy, your time's up\nWhere them gangstas? Where them dimes at?\n\n[Verse 3]\nI see niggas runnin', yo, my mood is real rude\nI lay you out, show you what steel do\nMobsters don't box, my pump shot obliges\nEvery invitation to fight you punk-asses\nLike Pun said: you ain't even en mi clasa\nMaybach Benz, back seat, TV plasma\nLadies lookin' for athletes or rappers\nWhatever you choose, whatever you do\nMake sure he a thug and intelligent too\nLike a real thoroughbred is\nShow me love, let me feel how the head is\nFemales who's the sexiest is always the nastiest\n\n[Outro]\nAnd I like a little sassiness\nA lot of class; Mami, reach in your bag, pass the fifth\nI'm a leader at last, this a don you with\nMy 9's will spit, niggas lose consciousness"}