{"rank":"53","song_id":"21896","song_name":"Excuse Me Miss","artist_id":"304305","display_artist":"Jay-Z","spotify_id":"0ZHu7jkSSrT0eK4OxuG4O5","lyrics":"[Intro: Jay-Z]\nYou can't roll a blunt to this one\nYou gotta, you gotta well, ya gotta light a J\nYou gotta puff a J on this one {*inhales*}\nYou can't even drink Crist-OWL on this one\nYou gotta drink Crist-ALL\nBuy some red wine, a little Gaja 9-7\nThis is for the grown and sexy, uhh\n\n[Pharrell - over the end of Jay-Z's intro]\nYou're so contagious, I can't take it\nHave my baby, let's just make it\nExcuse me; what's your name?\n\n[Jay-Z]\nYeah, can I get my grown man on for one second?\nCause I see some ladies tonight\nThat should be hangin' with Jay-Z, Jay-Z\n(Pharrell: So hot to trot, lady!)\nExcuse me miss, what's your name?\nCan you come, hang with me?\nPossibly, can I take you out, tonight\n\n[Verse 1: Jay Z]\nYou already know what it's hittin' for\nMa I got whatever outside and you know what I'm sittin' on\n50/50 venture with them S Dots kickin' off\nArmadale poppin' now, only bring a nigga more\nOnly thing missin' is a Missus\nYou ain't even gotta do the dishes, got two dishwashers\nGot one chef, one maid, all I need is a partner\nTo play spades with the cards up, ALL TRUST\nWho else you gon' run with, the truth is us\nOnly dudes movin' units - Em, Pimp Juice and us\n..it's the Roc in here!\nMaybach outside, got rocks in ears\nPJ's on the runway, Young got air\nI don't land at an airport, I call it the clearport\nTherefore, I don't wanna hear more\nBack and forth about who's hot as Young, holla!\n\n[Ph.W.] Sexcuse me... damn!\n[Ph.W.] You're so contagious, I can't take it\n[Ph.W.] Have my baby, let's just make it\n[Jay-Z] I got my Gaja 9-7 on right now\n[Ph.W.] Lady\n[Jay-Z] You gotta puff a J to this one\n[Jay-Z] Can't roll a blunt up to this one boy\n[Ph.W.] You're so contagious, I can't take it\n[Ph.W.] Have my baby, let's just make it\n[Ph.W.] Excuse me; what's your name? (AOWW!)\n[Jay-Z] Cause I see some ladies tonight\nThat should be rollin' wit Jay-Z, Jay-Z\n[Ph.W.] So hot to trot, lady, what's your name?\n[Jay-Z] Cause I see some ladies tonight\nThat should be rollin' wit Jay-Z, Jay-Z\n[Ph.W.] You're so foxy girl.. you're so hot to trot\n\n[Verse 2: Jay Z]\nEverybody's like, \"He's no item! Please don't like him\nHe don't wife 'em, he one nights 'em!\"\nNow she don't like him, she never met him\nGroupies try to take advantage of him, he won't let 'em\nHe don't need 'em, so he treats 'em like he treats 'em\nBetter them than me, she don't agree with him\nShe's mad at that, he's not havin' that\nSo those opposites attract like mag-a-nets\nShe sees more than the Benz wagon, the friends taggin' along\nWith a flashy nigga braggin' on the song\nShe gets a glimpse of Shawn and she likes that\nHe 2-ways her, so she writes back\nSmiley faces after all of her phrases\nEither she the one or I'm caught in \"The Matrix\"\nBut fuck it, let the Fishburne\nRed or green pill, you live and you learn, c'mon!\n\n[Ph.W.] Sex-cuse me, damn!\n[Jay-Z] You gotta throw on your fine linens for this one\n[Ph.W.] You're so contagious, I can't take it\n[Ph.W.] Have my baby, let's just make it\n[Jay-Z] You might go, you mighta gotta go get you some Scooby Doo's\n[Ph.W.] Lady\n[Jay-Z] Gotta throw on ya Scooby Doo's; those are shoes by the way\n[Ph.W.] You're so contagious, I can't take it\n[Jay-Z] Gotta throw on Scooby Doo's, hehehehe\n[Ph.W.] Have my baby, let's just make it\n[Ph.W.] Excuse me; what's your name?\n[Jay-Z] This for the grown and sexy, only for the grown and sexy\n[Ph.W.] So hot to trot, lady, what's your name?\n[Jay-Z] Woo!\n[Ph.W.] You're so foxy girl, you're so hot to trot\n\n[Verse 3: Jay Z]\nLove let's go half on a son, I know my past ain't one\nYou can easily get past, but that chapter is done\n...but I'm done readin' for now\nRemember spades face up, you can believe him for now\nBut ma you got a f'real f'serious role\nI'm 'bout to give you all the keys and security codes\n'bout to show you where the cheese, let you know I ain't playin'\nBut, before I jump out the window, what's your name?\n\n[Outro: Pharrell]\nSex-cuse me, damn!\nYou're so contagious, I can't take it\nHave my baby, let's just make it\nLady\nYou're so contagious, I can't take it\nHave my baby, let's just make it\nExcuse me; what's your name?\nSo hot to trot, lady! What's your name?\nYou're so foxy girl, you're so hot to trot"}