{"rank":"57","song_id":"21904","song_name":"Hell Yeah","artist_id":"302859","display_artist":"Ginuwine Featuring Baby","spotify_id":"1p149YJfXkHkSzYp4UZUxV","lyrics":"(Intro)\nWoo, we gon' do it like MJ used to do it\nYou know what I'm sayin', I'm like that kind\nWoo, Woo, Woo\nCheck me out!\n\n(Chorus)\nHave you ever seen the thug in the club with a bottle turned up\nHead bobbin' like HELL YEAH!\nHave you ever seen the chick in the club with a drinkin the cup\nBooty shakin' like HELL YEAH!\nHave you seen those Big Tymers pull up in the front of the club\n24's like HELL YEAH!\nHave you ever seen 50 thousand strong with their hands in the air\nUp and down like HELL YEAH!\n\n(Baby)\nSo fresh, so fly, so sweet, so polite\nSo much, too many, but we ridin' tonight\nWell, it's that pimp talk that ain't that pimp walk\nIt's big pimpin' over here, player, that just started\nSee, we fresh with Air Ones, Lexus and big drums\n(Chips, Plenty Chicks, Plenty crisp, big fun)\nMa, you worry none, the minks come with the guns\nPrada, the Gucci, it's all in Bird fun\n\n(Ginuwine)\nI'm sittin' in my truck, snakin' the club out\nKill this sip then go wild the f*** out\nUp in the club with my hands in the air\nThere's so much shit in the atmosphere\nSo girl, quit frontin' and get you're a** over here\nAnd get yourself a cup of this Crown and Belvedere\nI'm all off in the corner with honeys takin' pics\nThey be in the VIP with lots of chicks\nI'm pimped out now, low cut, and a pick\nG and Big Tymers together, that's what I'm talkin'\n\n(Chorus)\n(Ginuwine)\nSo fresh, so clean, so shiny, on a beam\nGirl, you're so mean, why you're doin' a damn thing\nAny more room for me in those jeans\nUh-huh, uh-huh\nWe got so many rooms in the Swiss like we were Swiss sailors\nMami, givin' me head like she's a brain doner\nA pool party in my crib up in Daytona\nHosted by Sonia and Monya, ooh\n\n(Baby)\nMami, walkin' up the beach, so fly, so neat\nIt's me and Ginuwine, 23's on our feet\nSay mami, you look good, mami, you're so fly\nYou need a D-Boy, come over here and get superfly\n\n(Chorus)\n(Ginuwine)\nSaid we love them cars and we love them chicks\nAnd we love them parties and we love that Cris'\nAnd we love them houses and we love that ice\nAnd when we rollin' through your hood we love to shoot that dice\n\n(Chorus 2X)"}