{"rank":"60","song_id":"22000","song_name":"P.I.M.P.","artist_id":"431969","display_artist":"50 Cent","spotify_id":"2D1hlMwWWXpkc3CZJ5U351","lyrics":"[Produced by Mr. Porter]\n\n[Hook]\nI don't know what you heard about me\nBut a bitch can't get a dollar out of me\nNo Cadillac, no perms, you can't see\nThat I'm a motherfuckin' P-I-M-P\n\n[Verse 1]\nNow, shorty, she in the club, she dancin' for dollars\nShe got a thing for that Gucci, that Fendi, that Prada\nThat BCBG, Burberry, Dolce and Gabbana\nShe feed them foolish fantasies\nThey pay her, ‘cause they want her\nI spit a little G, man, and my game got her\nA hour later have that ass up in the Ramada\nThem trick niggas in her ear sayin' they think about her\nI got the bitch by the bar tryin' to get a drink up out her\nShe like my style, she like my smile, she like the way I talk\nShe from the country\nThink she like me ‘cause I'm from New York\nI ain't that nigga tryin' to holla ‘cause I want some head\nI'm that nigga tryin' to holla ‘cause I want some bread\nI could care less how she perform when she in the bed\nBitch, hit that track, catch a date, and come and pay the kid!\nLook, baby, this is simple, you can't see\nYou fuckin' with me, you fuckin' with a P-I-M-P\n\n[Hook]\nI don't know what you heard about me\nBut a bitch can't get a dollar out of me\nNo Cadillac, no perms, you can't see\nThat I'm a motherfuckin' P-I-M-P\n\n[Verse 2]\nI'm 'bout my money, you see, girl, you can holla at me\nIf you fuckin' with me, I'm a P-I-M-P\nNot what you see on TV, no Cadillac, no greasy\nHead full of hair, bitch, I'm a P-I-M-P\nCome get money with me if you curious to see\nHow it feels to be with a P-I-M-P\nRoll in the Benz with me, you could watch TV\nFrom the backseat of my V, I'm a P-I-M-P\nGirl, we could pop some Champagne and we could have a ball\nWe could toast to the good life, girl, we could have it all\nWe could really splurge, girl, and tear up the mall\nIf ever you needed someone I'm the one you should call\nI'll be there to pick you up if ever you should fall\nIf you got problems I can solve 'em, they big or they small\nThat other nigga you be with ain't 'bout shit\nI'm your friend, your father, and confidant, bitch\n\n[Hook]\nI don't know what you heard about me\nBut a bitch can't get a dollar out of me\nNo Cadillac, no perms, you can't see\nThat I'm a motherfuckin' P-I-M-P\n\n[Verse 3]\nI told you fools before, I stay with the tools\nI keep a Benz, some rims, and some jewels\nI holla at a ho 'til I got a bitch confused\nShe got on Payless; me? I got on gator shoes\nI'm shoppin' for chinchillas in the summer, they cheaper\nMan, this ho, you can have her\nWhen I'm done I ain't gon' keep her\nMan, bitches come and go, every nigga pimpin' know\nYou sayin' it's secret, but you ain't gotta keep it on the low\nBitch, choose on me, I'll have you strippin' in the street\nPut my other hoes down, you get your ass beat\nNow Niki my bottom bitch\nShe always come up with my bread\nThe last nigga she was with put stitches in her head\nGet your ho out of pocket, I'll put a charge on a bitch\n‘Cause I need four TV's and AMG's for the six\nHo make a pimp rich, I ain't payin', bitch\nCatch a date, suck a dick, shit, trick\n\n[Outro]\nYeah, in Hollywoood they say\n\"There's no b'ness like show b'ness.\"\nIn the hood they say\n\"There's no b'ness like hoe b'ness,\" you know?\nThey say I talk a little fast\nBut if you listen a little faster\nI ain't got to slow down for you to catch up, bitch"}