{"rank":"69","song_id":"22051","song_name":"Light Your Ass On Fire","artist_id":"298558","display_artist":"Busta Rhymes","spotify_id":null,"lyrics":"Clones..\n\n(Pharrell)\nWhat you say your name was? Well, um, lookin' real sexy right now. You and your girls, are lookin good. Look, why don't y'all take off y'all jackets? What's your name baby? Word? Okay. Tell your friend right here this, this my man Busta\n\n(Busta Rhymes)\nHah\nI know you starving for this shit, baby, I'm feeling your hunger\nI'm so clean, call a nigga Felix Ungar\nSo what if I said it, baby? I'm still gon' tell ya\nI hope your ass bigger than Willona and Thelma\nListen, it's Busta Rhymes, bitch, I ain't never fail ya\nYour ass all over like paraphernalia, hmm\nSee the police gon' jail ya for walking around\nWit the kind of ass that'll kill ya now\nDon't worry 'bout it, I got money to bill ya\nShorty stacking like a mule, type of shit that'll scare ya\nHeadboard bang, bump the side of ya head\nWatch how ya ass spread, spill all off the side of the bed now, hmm\nNow, what you do to the dread? Baby, your ass really changed\nWhat he initially said because a nigga dead, but, fuck 'em\n'Cause now we vibing and talking and shit\nI love to hear your ass go \"ba-ba-boom\" when you walking and shit\n\n(chorus) (Pharrell)\nMove, girl, like your ass on fire\nLike your ass on fire\nMove, girl, like your ass on fire\nLike your ass on fire\nMove, girl, I'll light your ass on fire\nI'll light your ass on fire\nMove, girl, I'll light your ass on fire\nBitch, I'll light that ass on fire\nMove, girl, I'll light your ass on fire\n\n(Busta Rhymes)\nBust it\nBaby, I know you probably really need a tablecloth to cover your ass\nDigging in your pocket while you rubbing yo ass\nShit so big, just put the club in yo ass\nPrep the H2, park it right in front of yo ass\nI see your little gap between your cunt and yo ass\nAnd make you jump inside the whip and smoke a blunt wit yo ass\nI'm saying, hmm, the shit'll spread like a rash\nThe way they ass wiggles see I got the shit on a smash\nNow, listen, I light the L smell a wiff of the hash\nAnd bag all the bitches, now watch you see me zip in a flash\nI'm saying hmm, now I'ma put you on blast\nJust like a tint window when you put your shit on the glass\nBust right through the window, then it sit on the dash\nAnd have a nigga driving wreckless till you making him crash\n(Hah, cmon) we making money and shit\nNow, pop your muffin while we be watching you shaking your shit\n\n(chorus)\n\n(Bridge)\nWelcome to hot in Hazyville\nIt make you wanna dance 'till you break your heels\nI know you love the way the God make your feel\nNow watch me get deeper than a Navy Seal\n(Navy Seal?) It got a crazy feel\nShit feel like you in a danger field\nHypnotize, stuck it in her, daze for real\nThat's exactly why we call this one Hazyville\n(Hazyville)\n\n(Busta Rhymes)\nBaby, just shake ya ass 'till you spread on the floor\nI noticed that your ass too big for your draws\nYou need a, a chiropractor just to marry yo ass\nTo tell the truth you need a tractor just to carry yo ass\nFo reala, you motherfuckers probably think that I'm playing\nAll bitches love to talk and all that other shit I be saying\nAnd going hmm, see how you putting it down\nI love the way you shake it throw it around\n\n(Chorus)\n\n(Bridge)"}