{"rank":"59","song_id":"22087","song_name":"Stand Up","artist_id":"308504","display_artist":"Ludacris Featuring Shawnna","spotify_id":"2CtCwQhY0ZLvr8L2l8Bo6e","lyrics":"[Intro: Ludacris (w/Shawnna)]\nStand up! (ah) Stand up! (yeah)\nStand up! (ah) Stand up! (uh)\n\n[Hook: Ludacris (w/ Shawnna)]\nWhen I move, you move (just like that?)\nWhen I move, you move (just like that?)\nWhen I move, you move (just like that?)\nHell yeah, hey DJ bring that back\n(When I move, you move) just like that?\n(When I move, you move) just like that?\n(When I move, you move) just like that?\n(Hell yeah, hey DJ bring that back)\n\n[Verse 1: Ludacris]\nHow you ain't gone fuck?, bitch I'm me\nI'm the goddamn reason you in V.I.P\nCEO, you don't have to see ID\nI'm young, wild, and strapped like Chi-Ali\nBLAOW, we ain't got nothing to worry about\nWhoop ass, let security carry them out\nWatch out for the medallion, my diamonds are reckless\nIt feels like a midget is hanging from my necklace\nI pulled up with a million trucks\nLooking, smelling, feeling like a million bucks, ahh\nPass the bottles, the heat is on\nWe in the huddle all smoking that Cheech & Chong\nWhat's wrong? The club and the moon is full\nAnd I'm looking for a thick, young lady to pull\nOne sure shot way to get them out of them pants\nTake note to the brand new dance\nLike this\n\n[Hook]\n\n[Verse 2: Ludacris]\nGo on with your big ass, let me see something\nTell your little friend he can quit mean mugging\nI'm lit and I don't care what no one thinks\nBut where the fuck is the waitress at with my drinks?\nMy people outside and they can't get in\nWe gon' rush the back door & break them in\nThe owner already pissed cause we sort of late\nBut our time and our clothes, got to coordinate\nMost girls looking right, some looking a mess\nThat's why they spilling drinks all over your dress\nBut Louis Vuitton bras all over your breasts\nGot me wanting to put hickeys all over your chest\nAhh, come on we gon' party tonight\nY'all use mouth to mouth bring the party to life\nDon't be scared, show another part of your life\nThe more drinks in your system, the harder the fight\n\n[Hook]\n\n[Bridge - Ludacris]\nStand up! Stand up!\nStand up! Stand up!\n\n[Verse 3: Ludacris]\nDamn right, the fire marshal wanna shut us down\nGet us out, so someone can gun us down\nWe was two songs away from getting so cut up\nNow we one song away from tearing the club up\nMove over; Luda got something to say\nDo it now cause tomorrow ain't promised today\nWork with me, let's become one with the beat\nAnd don't worry about me stepping all over your feet\n\n[Hook]\n\n[Outro: Ludacris]\nStand up! Stand up!\nStand up! Stand up!"}