{"rank":"97","song_id":"22083","song_name":"Roun' The Globe","artist_id":"276993","display_artist":"Nappy Roots","spotify_id":"15ysm6oaBXHmNVFD5oZNUq","lyrics":"The whole damn world is country...\nThe whole damn world is country...\n\n[Skinny DeVille]\nYeah...\nAww man, the grass done got green on the other side of the fence\nSo I hopped my ass over to see if I was convinced\nFast paced city life, but country livin's the sense\nCop me a Caddy say to hell with a Benz\nBenz, Benz, twenty inch rims\nI can't leave the vertical grill back at the ranch\nGot a \"Phat\" farm with with cows and whole lotta land\nTwenty acres (???)\n\n[B. Stille]\nMeanwhile up in the D where they hollowin up dope\nAnd thugs blow weed in the park when the club close\nIn Mil-waukee the beats it petro\nOff in D.C., the streets is ghetto\nLet's roll - to Cali where they chief the best 'dro\nAnd drive cars so big you can't reach the pedal\nNever had a glass of purple juice for breakfast\nUntil I took my ass to Houston, Texas, that's country!\n\n[Chorus]\nThe whole damn world is country\nBeen all around the globe from Monday to Sunday\nY'all the same folk we see in Kentucky (it must mean)\nThe whole damn world is country\nBeen all around the globe from Monday to Sunday\nY'all the same folk we see in Kentucky (it must mean)\nThe whole damn world is country\n\n[Big V]\n(???) they was sportin, Jordans and Waltons\nWent in for the cage, and winded up staying\nIn Kentucky it was meth but Miami they was basing\nRap my ass off then I'll see ya at the Bassment\nHit VA, where they do nothing but cook\nCarolina, Indiana, Alabama, Savannah\nBoston, Denver, and all points between\nTennesse, Florida, ain't nothing love for ya\n\n[R. Prophit]\nNow shake it, bounce, sit back and let ya hair blow\nSpanish chicas waving, hasta luego\nPearl white drop, weather's bueno\nThey say opposites attract, I'm a moreno\n(whispered: ???) so clear\n(whispered: ???) my clear\n(???) girl, all she wanna do is (???)\nTop of the hill, take the breath from her lungs\n(Country boys been overseas)\nToppin it off, London, Germany\n\n[Chorus]\n\n[R. Prophit]\nNow shake it, bounce, sit back and let ya hair blow\nLadies make ya hands clap like bueno\nNow shake it, bounce, sit back and let ya hair blow\nHolla atcha boy, hasta luego...\n\n[Scales]\nI'll prolly say a prayer for those that come back\nMight could throw somethin on the grill when you come back\nMight could take a trip to the 'Ville and then back\nWe can all get loose on the 'Ports, and of course\nHit Churchill Downs and throw some on a horse\nOr we can hit them Saint Claire waters\nYou ain't seen country till you been through Georgia\nGod durn, they still got girls with perms (dang)\nBig cars, big wheels is the biggest concern\n\n[Ron Clutch]\nMy old Kentucky home, I was\nborn and raised on catfish and corn, collard greens and fatback\nIt's country than a mug, don't care where ya stay\nYa got country in ya blood if ya love 'em and that's that\nCircled the globe, met the important and paid\nNow I know for a fact that...\n\n[Chorus] 2X"}