{"rank":"82","song_id":"22100","song_name":"Knock Knock","artist_id":"311759","display_artist":"Monica","spotify_id":"6Ln2tBK4EnNtMLtYyAZhr7","lyrics":"Its funny how the tables turn turn turn turn\n\n[Missy]\nso upset\nThis that hot new\nUh huh\nYeah\nNew Monica\n\n[Monica]\nIts funny how the tables turn now its you running after me \nDidn’t wanna spent quality time, didn’t think I would ever leave \nYou got way to comfortable, now you say you want me in your life \nCuz I picked up all my shit and im moving in my new place tonight \nSo don’t you come\n\nKnock Knock Knock\nStop knocking don’t come knocking at my door \nRing Ring Ring \nLet the phone stop I don’t want you calling me no more \n\nBoy it’s a dangerours game to try and play a chick like me \nWanna go out and do your thang I will be out for ya count to three\nSo do just what you want, anytime that you really like \nI put a payment on my place, you be sleeping alone tonight \nSo don’t you come knocking \n\nKnock Knock Knock\nStop knocking don’t come knocking at my door \nRing Ring Ring \nLet the phone stop I don’t want you calling me no more \n\n[Monica Rap]\nI used to be so gone \nYou were some one I could lean on\nMy life support system \nAnd I thought I couldn’t breathe ah ah \nWhen you used to leave yep yep\nI see you put yo clean on\nBig chains gold teeth and yo gleam on \nAll night wanna be gone \nWanna tell me stay home like I got a ah ring on \nNow you say im not your wife right right \nSo why should I be chillin goodnight goodnight\nNow pack up my things for a flight \nI got a place and fixed up nice\nSo don’t come knocking at my door\nI got company comin around four \nSo wo wo\n\nI don’t want you calling me no more \nKnock Knock Knock\nStop knocking don’t come knocking at my door \nRing Ring Ring \nLet the phone stop I don’t want you calling me no more\n\nChanged my locks \nTook my things \nCant come in\nChanged my locks \nTook my things \nCant come in\nI don’t want you calling me no more \n\n[Monica:] Hey this Monica leave a number after the beep \n[Missy:] Aye yo Mo pick up the phone man, this old raggedy cellular phone sound like an old alarm clock old switch board line\nphone. Do you even have call waiting on this joint. Call me back ya late for the studio, this Miss.\n"}