{"rank":"67","song_id":"22111","song_name":"Wat Da Hook Gon Be","artist_id":"311945","display_artist":"Murphy Lee Featuring Jermaine Dupri","spotify_id":"6njG8EYG1lrROn8P6q46eq","lyrics":"[Verse 1: Murphy Lee]\nNow what goes up must come down\nBut we ain't coming down, it be them same old clowns\nAiming your pound pretending they proud\nBut when you leave town they go around\nThey running they mouth (maaann)\nThey something like a hater man\nTalking bad about a playa as if\nI'm not gonna see ya later man\nYou constantly fronting until you confronted on\nIf you don't like whats going on\nGo on to another song\nCause I keep a hater guilty\nMy cars and my money all alike man\nBoth them filthy (get it?)\nFrom skimpy and empty to fuel on full\nSee I be high when my Cago Bulls\nObey no rules to school you fools\nSchoolboy's err'y where, we're Young Dude news\nSt. Louis like Louis D. Miles and Larry Hughes\nAnd the Young Dude done paid young dudes' dues dude\n\n[Hook (with Jermaine Dupri)]\n[JD:] But yo, what the hook gonna be?\n[ML:] See I don't need no fucking hook on this beat!\nAll I need is the track in the background\nMy headphones loud\nKeep the blunt going 'round and I'mma rip\n\n[Verse 2: Murphy Lee]\n\"The sun'll come out tomorrow\nAnd I will never have to borrow!\"\nGot my first car when I turned 16\nOnly drove at home, outta town limousines\nPlus we was broke with a deal but nobody could tell\nSo we did what we had to do for \"Country Grammar\" to sell\nI stay on my own melodies\nPlus I like my Booties and my Boobs like a capital letter 'B'\nThat's how it is, how it better be\nI preferably rather have 2 or 3 girls in the bed with me\nClose your ears, ma, you ain't heard nothing!\nI always pay ma, let a brother hold something\nI'm basically coming from nothing to something\nWhen I say nothing meaning pocket full of lint and buttons\n(We all we got!) Used to be creative on Halloween (how you gon?)\nStop a hotter team? Went from nada to a lot of things\n\n[Hook]\n\n[Verse 3: Murphy Lee]\nPeople always saying man it must be nice\nNo hi no nothing not a simple how's life\nUnderstand the money's good, but I'm still from the hood\nSo don't be asking for no inch and be expecting a foot\nUnless you want a foot!\nI know a few crooks that can place you where you need to be put\nAnd it might not cost me, playa\nGot a Benz pepper interior, paint salty playa\nAnd we all push it, but me I push it real good\nBrains blown out, chromed-out, wheel real wood\nCatch me on your local durrty\nOr in the studio doing vocals durrty\nI'm the same dude that came through with my crew\nLet the girls do me while you do you\nAnd um, all I need is JD beat to be banging\nAnd I'll come up wit these verses that I'm usually slanging\nI be ripping man"}