{"rank":"55","song_id":"22125","song_name":"Clap Back","artist_id":"276599","display_artist":"Ja Rule","spotify_id":"7GG80qG8X7tiKHnFw7oKjX","lyrics":"Ja Rule - Clap Back\n\n[Intro - Ja Rule]\n\nYeah, yeah.. haha yeah!\nI gotta get my headphones\nAll my gangsta niggas is in the building on this one!\nYou know! Yeah yeah ya know\nIt's real!! Hussein what's happ'nin nigga?\nI see you, aight Shadow what's poppin BLAT!\nHaha haha, yeah my nigga O-1 in the motherfucking house\nJody in the house (Jody Mack!)\nMy nigga Cadillac, Gotti what up!\nBlackchild what up!\nI'd like to welcome all my niggas\nTo the world famous Murda Inc. Show\nBig shout to all my Queens niggas in Staten Island\nNiggas in Uptown, niggas in Brooklyn niggas\nAll my Bronx niggas yeah, all my Jersey niggas! you know?\nWe doing it real big right here! all my money niggas\nThis shit commentated on the one's and two's!\nThey call me the Mighty Rule! how ya living?\nThis real shit we talking\nI wanna ask all my gangsta niggas a real question (holla back)\nWhat do you do - when niggas spit at you?\n\n[Chorus - Ja Rule]\nClap back, we gon' clap back\nWe gon' clap back, we gon' clap back\n(Let's take 'em to war niggas!)\nWe gon' clap back, we gon' clap back\nWe gon' clap back, we gon' clap back\n(Let's take 'em to war niggas)\nWe gon' clap back, we gon' clap back\nWe gon' clap back, we gon' clap back\n(Let's take 'em to war niggas!)\nWe gon' clap back, we gon' clap back\nWe gon' clap back, we gon' clap back\n(Let's take 'em to war niggas)\nWe gon' clap back, we gon' clap back\n\n[Verse 1 - Ja Rule]\nFuck if they holl'in about Rule nigga, here's the real\nI'll pop ya top like Champagne bottles that chill\nWear nothing but ice, smiles tinted up to The Greatest\nTell em I'm nice too, plus push them nice coupes\nThe Inc roll like duece man, I'm ol' G Bobby J\nAnd we slinging soccer fields of yay\nThey don't respect that, don't get your mind around\nYou'll get it pushed back, y'all don't want that\nI send em to the morgue while keepin my bitches bouncin fa sho\n\"In Da Club\" with no gun, got em taking it off\nCan't help that, I'm the nigga that puts it down\nOnce I hit that, that's if I'm up in the Maybach\nFasten them holding the throwback, West 44 Lakers\nLet's make no mistakes when these F's take place\nWe'll still proceed you with a gun in your face\nWhen you got one in your waist, let's cock back nigga air out the space!\n(C'mon!) We gon'\n\n[Chorus]\n\n[Verse 2 - Ja Rule]\nThe Rule be \"In Da Club\" rude motherfucker poppin the bubbly\nWhen shit get ugly I hug the snub closely\nBut usually we still see your bitches\nDancin on some freak shit, trying to ride my dick\nI can't handle it, lower their manners\nTo get they ass infront of my dick to dance, to B.I.G.'s \"One More Chance\"\nCatching hate from a glance, but I'm a giant\nThese niggas is mere ants, I'll stomp 'em wit a shank\nGive bitches the back hand, pimp shit, it's not realistic\nThe game is helpless, let's not get it twisted\nI'm young, wrapped, and gifted, but still at the bottom\nAnd stuck somewhere between Gomorrah and Saddam\nI'm here to make this rap shit hotter than Harlem\nFuck the Dog beware of Rule, cause I'm the problem\nWe'll still proceed you with a gun in your face\nWhen you got one in your waist, let's cock back nigga air out the space!\n(C'mon!) We gon'\n\n[Chorus]\n\n[Verse 3 - Ja Rule]\nLike Bush and Saddam, I'm a find out\nWhere Em Laden's hiding and bomb him first\nIt could be much worse, I could be hotter than yo scrubs\nMask and glove, gun hot from burnin ass up\nI'd rather be bossed up, wit a bunch of broads\nThe preachers daughter screaming out \"Fuck the law!\"\nI may have struck a chord, wit the Christians\nBut y'all got the freakiest bitches out of all the religions\nAnd God gave me his blessings to handle my business\nAll these wanksta snitches, let the nina blow kisses\nIf she some how misses, he gon' meet the mistress\nAnd \"Clap that boy\" like Birdman and Clipse\nI got these niggas all over my dick, like hoes\nI'm the star at these shows, I must be as hot as they come\nWe'll still proceed you with a gun in your face\nWhen you got one in your waist, let's cock back nigga air out the space!\n(C'mon!) We gon'\n\n[Chorus]\n\n[Outro]\n[Ja Rule] Yeah, my nigga Zino in this motherfucker\n[Benzino] That's how we do it, know what I mean\n[Benzino] Buck '89 what's up baby, I see you\n[Ja Rule] Break 'em down nigga! break 'em down!\n[Benzino] Bring them birds, in the motherfucking house\n[Benzino] It's not a game no mo'\n[Ja Rule] Queens in this motherfucker\n[Benzino] You know\n[Ja Rule] All my Jersey niggas, all my Boston niggas\n[Ja Rule] All my Brooklyn niggas, Brooklyn sir what up!\n[Ja Rule] Haha, yeah, holla at me man"}