{"rank":"60","song_id":"22182","song_name":"Splash Waterfalls","artist_id":"308504","display_artist":"Ludacris","spotify_id":"2T8hXV9LUZMDBKR5RALGEa","lyrics":"Luda\nOh, oh, oh, say it\n\nGirl\nMake love to me\n\nLuda\nOh, oh, oh, wut?\n\nGirl\nFuck me\n\nLuda\nOh, oh, oh, say it\n\nGirl\nMake love to me\n\nLuda\nOh, oh, oh, wut?\n\nGirl\nFuck me\n\n(HOOK)\n\nLuda\nIm bout to throw some game, they both wantin tha same\nCupidz tha one to blame, say it, (Girl) Make love to me\nIm bout to shed some light, cuz each and every night\nYou've got to do it right, wut? (Girl) Fuck me\n(Repeat)\n\nLuda\nThey want it nice and slow, kiss them from head to toe\nRelax and let it go, say it, (Girl) Make love to me\nThey want it now and fast, grabbin and smackin ass\nYou gotta make it lazt, wut? (Girl) Fuck me\nTogether holdin handz, you out there spendin grandz\nAnd makin family planz, say it (Girl) Make love to me\nDon't have to straighten factz, don't want no stringz attached\nJuzt scratchez on yo back, wut? (Girl) Fuck me\nEx'z aint actin right, and you so glad to fight\nDinnerz by candlelight, say it, (Girl) Make love to me\nShe got a nigga whipped, down to your fingertipz\nTryin that freaky shit, wut? (Girl) Fuck me\nTurn on some baby face, Juzt for your lady'z sake\nYou call her baby cakez, say it, (Girl) Make love to me\nKnow how to mack a broad, she'z on your sack and ballz\nYou call her jabber jawz, wut? (Girl) Fuck me\n\n(HOOK)\n\nLuda\nYou bout to buy a ring, she wantz tha finer thangz\nGucci designer framez, say it, (Girl) Make love to me\nPurchaze a nazty flick, wrap up and tie her quick\nKnow how to drive a stick, wut? (Girl) Fuck me\nYou both unite az one, you tha moon and she'z your sun\nYour heart'z a beatin drum, say it, (Girl) Make love to me\nYou better novacaine, she wanna feel tha pain\nThen hear her scream ya name, wut? (Girl) Fuck me\nFollow thiz dictionary, you both some vizionariez\nAnd doin missionariez, say it, (Girl) Make love to me\nI hear him call tha wild, and do it all tha while\nDoggy and boggy style, wut? (Girl) Fuck me\nYou in-between tha sheetz, lickin and eatin sweetz\nAnd wutchu find you keep, say it (Girl) Make love to me\nYou do it standin up, orgasimz hand em up\nYall juzt don't give a fuck, wut? (Girl) Fuck me\n\n(HOOK)\n\nLuda\nYou wanna tell tha world, that she'z your favorite girl\nYour diamond and your pearl, say it, (Girl) Make love to me\nNobody haz to know, juzt keep it on tha low\nAnd leave em righted fo, wut? (Girl) Fuck me\nNothin but fightz and fussin, pluz there'z a lot of cussin\nJuzt grab a hold of somethin, say it, (Girl) Make love to me\nYall do that bad stuff, she like it rammed up\nRopez and handcuffz, wut? (Girl) Fuck me\n\n(HOOK)\n\n"}