{"rank":"63","song_id":"22234","song_name":"Don't Take Your Love Away","artist_id":"1483217","display_artist":"Avant","spotify_id":"1O138eHbYPa2oODCCaCGcK","lyrics":"(Verse I)\nAfter the hoping and the praying and the wishing\nGirl your right here in my face\nI never been the one to bite my tongue, no, no...\nI have not one word to say\nI'm mesmerized by your sexy eyes and\nYour soft and lovely skin\nI want this fiasco to end\nSo baby we can start all over again\n\n(Listen)\n(I wanna be able...) I wanna be able to love you, oh I...\n(I wanna be able...) And let me be the one to please you, oh I...\nAs sure as the sun shines all over the earth\nYou're one of god's most precious works\nSee, I'm a man and we make mistakes\nBut please don't take your love away, oh I...\n\n(Chorus)\nDon't take your love away. (Don't take...)\nBaby, don't take your love away from me, I need you, girl. (I need you girl.)\nDon't take your love away. (Oh.)\nDon't take your love away\nDon't take your love away (Don't take...)\nBaby don't take your love away from me I need you girl (From me, my baby, baby)\nDon't take your love away, baby\n\n(Verse II)\nMama said, 'Don't put your hands in the cookie jar.'\nShe said, 'Son, have control.'\nShe said everything that's sweet and good for you, NO. (That what she said.)\nAnd everything that glitters ain't gold\nAnd now that your gone, I realized, (Yes, I do.) I've lost my soul. (Preach.)\nAnd I don't want to pass the torch\nBaby can you give me one more, one more, chance?\n\n(I wanna be able) Able to do everything I didn't do before for ya, baby\n(I wanna be able) Listen. I wanna love ya, over, over and over again\nGotta hold myself together and stay strong\nBaby, you been gone too long\nSee, I'm a man and we make mistakes\nSo baby, baby, baby, don't take your love away\n\n(Chorus)\nDon't take your love away (I'll get down on my hands and knees,)\nBaby, don't take your love away from me, I need you, girl. (Beggin', beggin' you please.)\nDon't take your love away, (Don't, don't leave me now.)\nDon't take your love away. (I need you right here with me.)\nDon't take your love away, (Please, please, please, please, please, yeah.)\nBaby, don't take your love away from me, I need you, girl. (Don't take your love away.)\n\n(Bridge)\nSee, girl I know that I hurt you so, (Girl, I know...)\nWith all of those girls that were in my world. (In my world.)\nNow Stacy and Kim, damn all of them\nGirl, I wanna give you everything I can. (Every day, yeah.)\nI know your tired of my game, (Of my games...) tired of my lies, (Of my lies...)\nBaby, this time I promise it'll be alright\nNo longer will you be left astray, (No, no, no, no, no.)\nBaby, listen to the words I say!\n\n(Chorus)\nDon't take your love away (Yeah, yeah!)\nBaby, don't take your love away from me, I need you girl. (Yes, Don't take your love, no.)\nDon't take your love away, (I've been searching here and there, everywhere,)\nDon't take your love away. (And can't find no one like you, girl.)\nDon't take your love away, (Don't take your love away.)\nBaby, don't take your love away from me, I need you, girl. (Listen to me, lady, lady, lady.)\nDon't take your love...\n\n(crying sounds)"}