{"rank":"98","song_id":"22256","song_name":"Baby I Love U","artist_id":"304444","display_artist":"Jennifer Lopez","spotify_id":"3adU6Jes8lnvOLnmYYVJgr","lyrics":"[Intro]\nBaby I love you (I love you too )\nYou know I need you\nGotta have you ( what )\nCan't be without you ( J.Lo )\n\n[R. Kelly]\nIt's like downtown New York in the middle of traffic jams\nAll I really want you to know is who I am\nFind me low key in the back of the club\nOr with some fine females, rollin on dubs\nYou and me big pimpin on a shopping spree in L.A.\nPapparatzis and critics who give a damn what they say\n\n[J.Lo]\nBoy I never knew I could feel they way I felt\nWhen I met you I could never forget you \nAnd boy when you look my way I realize more and more \nI adore your pretty eyes\nWhat I wanna know from you is \nDo you wanna share my love's bliss \nI long for the day when I'm feeling your kiss \nCan you love me for a lifetime for just in one night\nI'm helpless for you \nBaby but it's alright\n\n[chorus]\nBaby I love you (love you)\nBaby I need you (need you)\nI gotta have you (I gotta have you babe) \nCan't be without you (be without you)\nBaby I love you, (yeaahhh)\nBaby I need you (need you)\nI gotta have you, (I gotta have you babe)\nCan't be without you \n\n[J.Lo]\nPapi, I got something to say to you\nBlessed and cursed on the day that \nI felt the power of you inside me \nIt was strong and I loved it,\nAnd there comes a time in our lifes when things change\nIt's a brand new day\nAnd baby I'll spend it with you\nWhat I wanna know from you is \nDo you wanna share my love's bliss\nI long for the day when I'm feeling your kiss\nCan you love me for a lifetime but just in one night \nI'm helpless for you \nBaby but it's alright\n\n[chorus]\n\nBaby I love you (I love you too)\nYou know I need you (J.Lo)\nGotta have you (pied piper)\nCan't be without you (J.Lo )\n\n[T. Kelly]\nIt's like downtown New York in the middle of traffic jams\nAll I really want you to know is who I am\nFind me low key in the back of the club\nOr with some fine females, rollin on dubs\nYou and me big pimpin on a shopping spree in L.A.\nPapparatzis and critics who give a damn what they say\nRear-drop-top bentley on somebody's highway, \nWho let me jump in some club on his vallet\nGot a little smoke, got a little drinks sittin in v.i.p\n\nGot a little buzz on my hands up honey's feeling me\nGot that criss sittin' on ice like a gansta lean\nHands surrounding them dice like security\nAt the party in the Ritz Carlton's penthouse suite\nAll my thugs and me breath smelling like Hennesey\nGot a few friends flying in from San Diego\nIt's a suprise party for my homie J.Lo\nI need you (baby, I love you)\nI gotta have you babe (baby, I need you)\nBaby I love you (I gotta have you)\nOoo I swear I do (can't be without you)\n(baby I love you)\nOooo (baby I need you)\nLadies do you know what I'm talking about \nWhen a man gets inside yo soul\nAnd he takes it and won't let go"}