{"rank":"62","song_id":"22286","song_name":"Jesus Walks","artist_id":"276709","display_artist":"Kanye West","spotify_id":"62r62ArmWq38cu6QCVgyTc","lyrics":"[Intro]\nWe at war\nWe at war with terrorism, racism\nBut most of all we at war with ourselves\n\n[Hook]\n(Jesus walk)\nGod show me the way because the Devil tryna break me down\n(Jesus walk with me)\n\n[Verse 1]\nYou know what the Midwest is? Young and restless\nWhere restless (niggas) might snatch your necklace\nAnd next these (niggas) might jack your Lexus\nSomebody tell these (niggas) who Kanye West is\nI walk through the valley of the Chi where death is\nTop floor the view alone will leave you breathless *gasps*\nTry to catch it *gasps* it's kinda hard\nGetting choked by detectives, yeah, yeah, now check the method\nThey be askin' us questions, harass and arrest us\nSayin' \"We eat pieces of shit like you for breakfast\"\nHuh? Y'all eat pieces of shit? What's the basis?\nWe ain't going nowhere but got suits and cases\nA trunk full of coke, rental car from Avis\nMy mama used to say only Jesus can save us\nWell mama I know I act a fool\nBut I'll be gone 'til November, I got packs to move\nI hope\n\n[Hook]\n(Jesus walk)\nGod show me the way because the Devil's tryna break me down\n(Jesus walk with me)\nThe only thing that I pray is that my feet don't fail me now\n(Jesus walk)\nAnd I don't think there's nothin' I can do now to right my wrongs\n(Jesus walk with me)\nI wanna talk to God but I'm afraid cause we ain't spoke in so long\n(Jesus walk)\nGod show me the way because the Devil's tryna break me down\n(Jesus walk with me)\nThe only thing that I pray is that my feet don't fail me now\n(Jesus walk)\nAnd I don't think there's nothin' I can do now to right my wrongs\n(Jesus walk with me)\nI wanna talk to God but I'm afraid cause we ain't spoke in so long\nSo long, so long\n(Jesus walk with me)\n\n[Verse 2]\nTo the hustlers, killers, murderers, drug dealers, even the scrippers\n(Jesus walks for them)\nTo the victims of welfare feel we livin' in Hell here, hell yeah\n(Jesus walks for them)\nNow, hear ye, hear ye, want to see Thee more clearly\nI know he hear me when my feet get weary\nCause we're the almost nearly extinct\nWe rappers is role models: we rap, we don't think\nI ain't here to argue about his facial features\nOr here to convert atheists into believers\nI'm just tryna say the way school need teachers\nThe way Kathie Lee needed Regis, that's the way I need Jesus\nSo here go my single dog, radio needs this\nThey say you can rap about anything except for Jesus\nThat means guns, sex, lies, videotape\nBut if I talk about God my record won't get played, huh?\nWell if this take away from my spins\nWhich'll probably take away from my ends\nThen I hope this take away from my sins\nAnd bring the day that I'm dreamin' about\nNext time I'm in the club, everybody screamin' out\n\n[Hook]\n(Jesus walk)\nGod show me the way because the Devil's tryna break me down\n(Jesus walk with me)\nThe only thing that I pray is that my feet don't fail me now\n\n[Produced by Kanye West]"}