{"rank":"52","song_id":"22327","song_name":"Lean Back","artist_id":"375751","display_artist":"Terror Squad","spotify_id":"0rZAuePyZoXTxaXPDsH0tG","lyrics":"[Intro: Fat Joe]\nOwwwwww!!! Yeah! My niggas!\nThrow your hands in the air right now, man!\nFeel this shit right here! Scott Storch, nigga!\nYeah, Khaled, I see you, nigga\nShow Big Pun love! Uh! Yeah! Uh! Yo!\n\n[Verse 1: Fat Joe]\nI don't give a fuck about your faults or mishappens\nNigga, we from the Bronx, New York; shit happens\nKids clappin', love to spark the place\nHalf the niggas in the Squad got a scar on their face\nIt's a cold world and this is ice\nHalf a mill' for the charm, nigga, this is life\nGot the Phantom in front of the building, Trinity Ave\nTen years been legit, they still figure me bad\nAs a youngin, was too much to cope with\nWhy you think muhfuckers nicknamed me Cook Coke shit?\nShould've been called Armed Robbery\nExtortion, or maybe Grand Larceny\nI did it all, I put the pieces to the puzzle\nJust as long, I knew me and my peoples was gon' bubble\nCame out the gate on some Flo-Jo shit\nFat nigga with the shotty was the logo, kid\n\n[Hook: Fat Joe]\nI said my niggas don't dance\nWe just pull up our pants\nAnd do the rockaway\nNow lean back, lean back\nLean back, lean back\nI said, my niggas don't dance\nWe just pull up our pants\nAnd do the rockaway\nNow lean back, lean back\nLean back, lean back (Come on!)\n\n[Verse 2: Remy Martin]\nR to the Ezzy, M to the Yzzy\nMy arms stay breezy, the Don stay flizzy\nGot a date at 8, I'm in the 7-4-fizzive\nAnd I just bought a bike so I can ride 'til I die\nWith a matchin' jacket, 'bout to cop me a mansion\nMy niggas in the club, but you know they not dancin'\nWe gangsta, and gangstas don't dance, we boogie\nSo never mind how we got in here with burners and hoodies\nListen, we don't pay admission\nAnd the bouncers don't check us\nAnd we walk around the metal detectors\nAnd there really ain't a need for a VIP section\nIn the middle of the dance floor reckless, check it\nSaid he liked my necklace, started relaxin'\nNow that's what the fuck I call a chain reaction\nSee, Money Ain't a Thing, nigga\nWe still the same niggas, flows just changed\nNow we 'bout to change the game, nigga\n\n[Hook: Fat Joe]\nI said my niggas don't dance\nWe just pull up our pants\nAnd do the rockaway\nNow lean back, lean back\nLean back, lean back\nI said, my niggas don't dance\nWe just pull up our pants\nAnd do the rockaway\nNow lean back, lean back\nLean back, lean back (Come on!)\n\n[Verse 3: Fat Joe]\nNow, we living better now, Coogi sweater now\nAnd that G4 can fly through any weather now\nSee, niggas get tight when you worth some millions\nThis is why I sport the chinchilla: to hurt they feelings\nYou can find Joe Crack at all type of shit\nOut in Vegas front row to all the fights and shit\nIf 5-0 boy come, then they'd proudly squeal\n‘Cause half these rappers, they blow, like Derek Foreal\nIf you cross the line, damn right I'm gon' hurt you\nThese faggot niggas even made gang signs commercial\nEven Lil' Bow Wow throwin' it up\nB2K crip walkin', like, \"That's what's up!\"\nKay keep tellin' me to speak about the Rucker\nMatter of fact, I don't wanna speak about the Rucker\nNot even Pee Wee Kirkland could imagine this\nMy niggas didn't have to play to win the championship\n\n[Hook: Fat Joe]\nI said my niggas don't dance\nWe just pull up our pants\nAnd do the rockaway\nNow lean back, lean back\nLean back, lean back\nI said, my niggas don't dance\nWe just pull up our pants\nAnd do the rockaway\nNow lean back, lean back\nLean back, lean back (Come on!)"}