{"rank":"82","song_id":"22345","song_name":"Let's Get Away","artist_id":"277486","display_artist":"T.I.","spotify_id":"6JkXBZm2NDnQETTHeBclgQ","lyrics":"[Hook] (T.I.)\n[Jazze Pha] Hey, let's get away and get a room on the other side of town\nHey shawty, I was feenin' for you\n(Was you thinkin' of me, ay, ay...)\n[Girl] Hey, let's get a room, shawty we can freak somethin' if you down\n(Whachu would do?)\nHey daddy, I was feenin' for you\n\n[Verse 1]\nBet they be like \"I know he tired of the nightlife\nHe want a wife, he just lookin' for the right type\"\nYea right, I be ridin' through the city lights\nMy hat bent, gettin' high behind the 'lac tint\nI'm chilllin' with Brazilian women, heavy accents\nThey black friends translatin', got'em all ass naked, adjacent\nHave relations wit'em many places\nLeavin' semen in they pretty faces\nMake'em kiss they partners with it in they faces\nYoung pimpin' sprung women 'cross the 50 states\nGot young ladies requestin' \"What's Yo Name\" on 50 stations\nAskin' me what's a pussy popper, want a demonstration\nBut I ain't waitin' til the second date, I'm so impatient\nRelieve'em of they aggravation, take'em rollerskatin'\nOn them Dayton's, tell'em \"Baby, stick with me, you goin' places\"\nGo replace'em, draw erase'em out my memory\nMoist panties and wet sheets when they think of me\n\n[Hook] (T.I.)\n[Girl] Hey, let's get away and a room on the other side of town\nHey daddy, I was feenin' for you\n(Was you thinkin' of me? Ay, sing it for me, pimpin')\n[Jazze Pha] Hey, let's get a room, shawty we can freak somethin' if you down\n(Tell'em shawty)\nYea baby, I was feenin' for you\n\n[Verse 2]\nYo, yo... uh..\nFrom Miami to Cali, from Vegas to Jersey\nGot'em in Houston, Virginia, New Orleans, ya heard me?\nAll the classy ones like to act like they a virgin\nAnd the nasty ones like when I talk to'em dirty\nBut I'm breakin' the ice, got'em laughin' and flirtin'\nThey be, removin' they skirts when they hop in the 'burban\nOnce the flick start playin' and the E start kickin' in\nHer girlfriend lickin' and she beggin' me to stick it in\nThat's why, I like chillin' with women who like women\nLightskinned... Asians, Jamaicans and white women\nIndians, Italians, Haitians and Puerto Ricans\nThey be itchin' for they chance and waitin' in me to freak'em\nThey say..\n\n[Hook] (T.I.)\n[Girl] Hey, let's get away and a room on the other side of town\nHey daddy, I was feenin' for you\n(Was you thinkin' of me? Ay, tell'em for me, pimpin')\n[Jazze Pha] Hey, let's get a room, shawty we can freak somethin' if you down\n(Ay, listen to me)\nYea baby, I was feenin' for you\n(Was you thinkin' of me?)\n\n[Verse 3]\nExcuse me shawty, but I been watchin' you now for a while\nYo whole style, from yo toes to the way that you smile\nAnd I hope you ain't offended by the way that this sounds\nBut uhh... all I keep thinkin' bout is layin' you down\nAnd I'm, keepin' it pimpin', I ain't playin' around\nAin't got that kinda time cuz this the only day I'm in town\nSo come and, chill in the cut if you willin' to cut\nAnd when you, give me a hug I be feelin' yo butt\nNow so while for while we talkin', I'm fillin' yo cup\nWe killin' the bottle, wake up in dirty linen tomorrow\nBut tell me would it trouble you if we ended up at the W-\nSippin' on a malibu pine apple juice and a blunt or two\nNow whachu wanna do? Opportunity's right in front of you\nKnow you used to meetin' dudes, dodgin'em for a month or two\nBut young pimpin' spit linen to the young women\nI'm T.I.P., known as pussy popper to some women\n\n[Hook] (T.I.)\n[Jazze Pha] Hey, let's get away and get a room on the other side of town\nHey shawty, I was feenin' for you\n(Was you thinkin' of me... ay, ay...)\n[Girl] Hey, let's get a room, shawty we can freak somethin' if you down\nHey daddy, I was feenin' for you\n(Oh yea... c'mon, tell'em)\n[Girl] Hey, let's get away and get a room on the other side of town\nHey daddy, I was feenin' for you\n(Shit I'm on my way)\n[Jazze Pha] Hey, let's get a room, shawty we can freak somethin' if you down\nYea baby, I was feenin' for you\n\n[Jazze Pha talking]\nWhoa whoa whoa..\nLadies and gentlemen\nThis... is a Jazze Phizzle, T.I. collaborangelle..\nKing of the south! Oh boy!\nJazze Phizzle, T.I., Grand Hustle daddy!\nSo smooth... futuristic..\nPimps up daddy!"}