{"rank":"54","song_id":"22356","song_name":"Let Me In","artist_id":"431667","display_artist":"Young Buck","spotify_id":"6qkZ6D3ogNyW2YDWsz7e3z","lyrics":"\"Let Me In\"\n(feat. 50 Cent)\n\n[50 cent]\nYeah, Its 50 cent, Young Buck\nG-g-g-g-g-G-UNIT!\nWe get the club jumpin' from beginning to the end\nGo shawty, we back up in this bitch again\nWe party, harder than you can imagine\nYou can run wit losers, or run wit winners and win\n\n[Verse 1]\n[Young Buck]\nI feel attention when I walk in the club\nG-unit to the socks, bitches all on a thug\nGimme a henny on the rocks, and a bottle of bub\nI dont need security, this Gorilla enough\nI came to ball wit ya'll, pop the bar and all\nSo bitches call ya hoes, n niggaz call ya dogs\nIf you love ya wife keep her at home tonight\nShe might neva come home again nigga, aight!\nTeeth, neck, wrists all lights my lifes like\nRidin' in Ca$hville runnin all stop lights\nHomie is that real, I pray I keep livin\nMy momma jus hadda dream of seein me in prison\nMy daddys a dope fein, n i dont really miss him\nAint seen him in 10 years n a nigga still livin\nTha same ol' 2 step we move to a rhythm\n50 holla get em' Buck, you know im gunna get em'\nRaaaaa!\n\n[Chorus x2]\nI know you gonna let me shine n get mine\nI know you gonna let me in wit this nine\nI know you gonna smoke on my weed\nI know you gonna let me drink wit no I.D\n\n[verse 2]\n[Young Buck]\nI know im sinnin but im winnin at tha same time\nTake a couple shots from a nigga tryin ta take mine\nI'm back on tha block, wit a choppa n a tech nine\nNiggaz shootin cops n the hood runnin stop signs\nG-UNIT, The Game! Bitches doin wat tha thugs do\nG's, D's, Vice, Lords, Crips n the Blooz too\nMove lemme come through \nAint a pair of handcuffs, can hold me\nI'm ridin' in the ol' school listenin to some oldies\nMy goals keep shinin, Them hoes keep cryin\nThe handle of my 45 outlined in diamonds\nJust left Ca$hville, bout to fly to Miami\nHopin Yayo watchin Eminem, preform at the Grammys\nNiggaz like Eric Benet, prolly cant stand me\nI know money will make Halle Berry come outa them panties\nBitch!\n\n[Hook]\nYa'll niggaz in trouble they shoulda neva let me in (in)\n\n[Chorus x2]\n\n[verse 3]\nBet ya I can make them bounce back\nTeach em' how to stunt, teach em' how to counts stacks (yeah)\nNow where ya hood at? Buck\nIf you want to, we 50 deep up in here watchu gonna do\nWho want beif, I aint come for no name callin\nDont be mad cuz we is n you aint ballin'\nGettin' money is my motto for you broke folks\nCan't spend ya whole life payin on ya car notes\nIt's alright if you still on the block boy\nSee ima cold young thug, not a hot boy\nYou know I do this for the streets, n my peeps thas behind bars\nAs soon as they come home, I'll go n buy them all cars\nYoung Buck!\n\n[chorus x2]\n\n[50 cent]\nWe get the club jumpin' from beginning to the end\nGo shawty, we back up in this bitch again\nWe party, harder than you can imagine\nYou can run wit losers, or run wit winners that win\nAHH!"}