{"rank":"57","song_id":"22400","song_name":"Let's Go (2004)","artist_id":"430432","display_artist":"Trick Daddy","spotify_id":"1fLibtVj3MrNTwRZq5yUOs","lyrics":"[Lil Jon:]\nYeah (Yeaaaahhhh!)\nTheres a lotta fuck niggas in the club tonight,\n(fuck em, fuck em, fuck em)\nbut its gonna be aight, (yeah, yeah, yeah, yeah)\ncuz me and my clique we dont give a fuck nigga.\nTrick Daddy, Jim Johnson, Big D, Lil Jon\n\n[Hook:]\nLets Gooooo! (Lets Gooooo!)\nIf you want it you can get it let me know (let me know),\nI'm bout to fuck a nigga up, Lets Gooooo! (Lets Gooooo!)\nIf you want it you can get it let me know (let me know),\nI'm bout to fuck a nigga up, Lets Gooooo! (Lets Gooooo!)\n\n[Trick Daddy:]\nIf you want some, come get some,\ncuz where I'm from we tote big guns,\nAnd everybody know somebody that\nknow somebody that know somethin bout it,\nAnd I want answers now who, what, where,\nwhen and why,\nsee, a lotta dudes like to act a fool\nand all get all loud but that aint my style,\nand he who he gonna get and what he gonna do,\nrun up on me if he want to,\nOut there impressin his homies,\nbut he stood up in front of his mama,\nI mop up the flo wit em,\nAnd I kick in the door and let the .44 get em,\nI got fools that'll go get em,\nThat's for him, his crew and the dudes that run wit em.\n\n[Hook]\n\n[Twista:]\ngotta spit for the murderas and the\nkillas and the thugstas,\nthat be fuckin up the ballas and\nthe dealas and the hustlas,\ngot me comin at you bokas in the\nV.I. while they bumpin lil jon I'm a brush ya,\nIts the psycho nigga twista from\nChicago rollin with the Miami nigga that'll crush ya,\nWe already been lookin for drama\nif a nigga try to get it to then we still gotta get em,\nFeelin fury from my tough shit that cant never be true\nAnd the penicillin\nI'm telling you Trick of in and still em\nGot me swingin crysie and hennessy bottles,\nin the club with my thug homies goin for the skrilla,\nDon't get it twisted with that\novernight celebrity you better be scared\nof me in my city I'm a killa.\n\n[Hook]\n\n[Trick Daddy:]\nI ain't that rappin type arright,\nand I that actin type arright,\nthis sulphane in my script,\nI'm a play on you and you just a square,\nsee, once that hennessy into\nme the whole industry is my enemy,\nIf you aint no ten to me or friend to me,\nbitch don't pretend to be,\nI'm strictly for the thugs,\nI'm part of the streets and straight out the hood,\nThat moments ghetto (ghetto),\nGot me deep in gats for you wheezly cats,\nI'm straight out the county of Dade,\nplayed on fire nigga M-I-A,\nnever gone south of the border,\namericas most wanted you gonna get slaughtered.\n\n[Hook 2x]\n\n[Trick Daddy:]\nThe AK go chop, chop, chop, chop\nThe SK go fire, fire, fire, fire\nThe AK go chop, chop, chop, chop\nThe SK go fire, fire, fire, fire"}