{"rank":"81","song_id":"22441","song_name":"I Smoke, I Drank","artist_id":"295790","display_artist":"Body Head Bangerz Featuring YoungBloodz","spotify_id":"67rUFgFCFqRde4xF2doH7D","lyrics":"(Mr. Magic Intro)\nB-Doctor!\nLet's welcome em to the Vault baby\nDo it big nigga!\nDo it big nigga!\nDo it big nigga!\nStupid ass nigga\n\n(Chorus: Magic Repeat 2x)\nI smoke (Yea!), I drank (Yea!)\nI'm supposed to stop but I can't (Uh-huh)\nI'ma dog (Yea!), I love hoes (Yea!)\nAnd I'm addicted to money, cars and clothes\nDo it big then\n\nI do it big nigga (3x)\n\n(Verse 1: Young Bleed)\nSo many ways to get paid\nBetter, keep, fake, i.d\nSure yall don't try me\nIt's murder, I'm a server\nLyric life sentence\nRelentless, a menace to society\nFull of robberies so **** it\nI hop in the bubble\nWrap the Beretta wit a rag\nThat Glock in the Cutlass\nNigga I'm always hustlin\nAnd yea, round the Cadillacs\nThe alibam's a must (Uh-huh, yea yea)\nCrimey and grimey weed smuckers (Uh-huh, yea yea)\nMoney and weed, you know my mind see on the Don Don P\nWith Mr. Magic and Traffic blowin some bomb weed (Uh-huh, yea yea)\nIn your mind, I call my pistol cause it stay by me (Uh-huh)\nThat's like my brother, lucky mothers\nWe ain't nothin to see (Uh-huh)\nOr like my nigga Pete, but Uncle Pete\nOr my partner Moe Pete, and Low Key\nNigga, you know me man\nIt ain't no thang to cock it back and make you shake thug bang\nGrab the weed, rhyming the coke name nigga, what's up\n\n(Chorus Repeat 2x)\nI smoke (Yea!), I drank (Yea!)\nI'm supposed to stop but I can't (Uh-huh)\nI'ma dog (Yea!), I love hoes (Yea!)\nAnd I'm addicted to money, cars and clothes\nDo it big then\n\nI do it big nigga (3x)\n\n(Verse 2: Mr. Magic)\nI ain't got nuthin but dick for you hoes\nI won't trick, I ain't sick for you hoes\nI ain't got nuthin to give to no nigga\nDeal wit no nigga, chill wit no nigga\nI'ma keep a stack of that funny smelling tobacco\nPistol in my hand, nigga ready to act a\nGod damn fool, ignorant muthafucka bout to lose my cool\nLet me smoke a goose so I can calm my nerves\nFind me a duck, get some head in the Burb\nI'ma fool on them hoes nigga\nThat's my word, show me a dime and I'm bet I'm gettin served\nEverybody know me probably saw me half-cocked\nDrunk, high in the club bout to get it hot\nLouisiana nigga, down here we getting bucked (Bucked!)\nAnd if we ain't fighting, it's probably cause we too fucked up!\n\n(Chorus Repeat 2x)\nI smoke (Yea!), I drank (Yea!)\nI'm supposed to stop but I can't (Uh-huh)\nI'ma dog (Yea!), I love hoes (Yea!)\nAnd I'm addicted to money, cars and clothes\nDo it big then\n\nI do it big nigga (3x)\n\n(Boosie Talking)\nI do it big\nLil Boosie do it big boy\nFeel this here, check this out\nLook\n\n(Verse 3: Lil Boosie)\nI smoke, I drank, I tote that iron (That iron)\nEyes stay red, and my guhl stay fine\nI'ma problem child, I know you heard\nI ain't no turtle, I'ma crocodile (Crocodile!)\nAnd I'll serve ya\nSee Lil Boosie from that South Side (That South Side!)\nIn they mouth got bout five\nGot them Tees with dem Ree's wit dem black and white cowel (Cowel!)\nI want Ashanti, Beyonce and Trina\nSo I could hit her from the back, like I do my black nina\nI miss my nigga Soulja Slim (Rest In Peace), and that's for real\nSo in your memory I pop a pill, cock the steel\nIf you don't like it you could take it to that level\nThat go the mo light, mo won't you come and meet the Devil\nLook, I'na put two labels on my back and start walking (Start walking!)\nAnd it ain't in six states now I got everybody talking\nLook, and I thug (I thug), with my thugs (My thugs)\nWe getting paid from the block to the club\nThat's what's up nigga\n\n(Chorus Repeat 2x)\nI smoke (Yea!), I drank (Yea!)\nI'm supposed to stop but I can't (Uh-huh)\nI'ma dog (Yea!), I love hoes (Yea!)\nAnd I'm addicted to money, cars and clothes\nDo it big then\n\nI do it big nigga (3x)"}