{"rank":"64","song_id":"22490","song_name":"Mockingbird","artist_id":"301722","display_artist":"Eminem","spotify_id":"561jH07mF1jHuk7KlaeF0s","lyrics":"[Intro]\n\"Yeah, I know sometimes things may not always make sense to you right now. But hey, what'd Daddy always tell you? Straighten up, little soldier, stiffen up that upper lip! What you cryin' about? You got me.\"\n\n[Verse 1]\nHailie, I know you miss your mom, and I know you miss your dad\nWhen I'm gone, but I'm tryin' to give you the life that I never had\nI can see you're sad, even when you smile, even when you laugh\nI can see it in your eyes, deep inside you wanna cry\n'Cause you're scared, I ain't there\nDaddy's with you in your prayers\nNo more crying, wipe them tears\nDaddy's here, no more nightmares\nWe gon' pull together through it\nWe gon' do it, Lainie—Uncle's crazy, ain't he?\nYeah, but he loves you, girl, and you better know it\nWe're all we got in this world, when it spins, when it swirls\nWhen it whirls, when it twirls, two little beautiful girls\nLooking puzzled, in a daze, I know it's confusing you\nDaddy's always on the move, Momma's always on the news\nI try to keep you sheltered from it, but somehow it seems\nThe harder that I try to do that, the more it backfires on me\nAll the things growing up as Daddy that he had to see\nDaddy don't want you to see, but you see just as much as he did\nWe did not plan it to be this way, your mother and me\nBut things have got so bad between us, I don't see us ever being\nTogether ever again, like we used to be when we was teenagers\nBut then, of course, everything always happens for a reason\nI guess it was never meant to be, but it's just something\nWe have no control over, and that's what destiny is\nBut no more worries, rest your head and go to sleep\nMaybe one day we'll wake up and this'll all just be a dream\n\n[Hook]\nNow hush, little baby, don't you cry\nEverything's gonna be alright\nStiffen that upper lip up, little lady, I told ya\nDaddy's here to hold ya through the night\nI know Mommy's not here right now, and we don't know why\nWe fear how we feel inside\nIt may seem a little crazy, pretty baby\nBut I promise, Momma's gon' be alright\n(Heh, it's funny)\n\n[Verse 2]\nI remember back one year when Daddy had no money\nMommy wrapped the Christmas presents up and stuck 'em under the tree\nAnd said some of 'em were from me 'cause Daddy couldn't buy 'em\nI'll never forget that Christmas, I sat up the whole night cryin'\n'Cause Daddy felt like a bum—see, Daddy had a job\nBut his job was to keep the food on the table for you and Mom\nAnd at the time, every house that we lived in\nEither kept gettin' broken into and robbed or shot up on the block\nAnd your mom was saving money for you in a jar\nTryin' to start a piggy bank for you so you could go to college\nAlmost had a thousand dollars, 'til someone broke in and stole it\nAnd I know it hurt so bad it broke your momma's heart\nAnd it seemed like everything was just starting to fall apart\nMom and Dad was arguing a lot, so Momma moved back\nOn to Chalmers in the flat, one bedroom apartment\nAnd Dad moved back to the other side of 8 Mile on Novara\nAnd that's when Daddy went to California with his CD\nAnd met Dr. Dre and flew you and Momma out to see me\nBut Daddy had to work, you and Momma had to leave me\nThen you started seein' Daddy on the TV, and Momma didn't like it\nAnd you and Lainie were too young to understand it\nPapa was a rolling stone, Momma developed a habit\nAnd it all happened too fast for either one of us to grab it\nI'm just sorry you were there and had to witness it first hand\n'Cause all I ever wanted to do was just make you proud\nNow I'm sittin' in this empty house\nJust reminiscin', lookin' at your baby pictures, it just trips me out\nTo see how much you both have grown, it's almost like you're sisters now\nWow, guess you pretty much are, and Daddy's still here\nLainie, I'm talking to you too, Daddy's still here\nI like the sound of that, yeah, it's got a ring to it, don't it?\nSshh! Momma's only gone for the moment\n\n[Hook]\nNow hush, little baby, don't you cry\nEverything's gonna be alright\nStiffen that upper lip up, little lady, I told ya\nDaddy's here to hold ya through the night\nI know Mommy's not here right now, and we don't know why\nWe fear how we feel inside\nIt may seem a little crazy, pretty baby\nBut I promise, Momma's gon' be alright\n\n[Hook 2]\nAnd if you ask me to, Daddy's gonna buy you a mockingbird\nI'ma give you the world\nI'ma buy a diamond ring for you, I'ma sing for you\nI'll do anything for you to see you smile\nAnd if that mockingbird don't sing and that ring don't shine\nI'ma break that birdie's neck\nI'll go back to the jeweler who sold it to ya\nAnd make him eat every carat, don't fuck with Dad! (ha ha)"}