{"rank":"75","song_id":"22496","song_name":"Let's Get Blown","artist_id":"279664","display_artist":"Snoop Dogg","spotify_id":"0NdxbFFknA7kQ4E2zvJfey","lyrics":"[Pharrell] Yesssirrr!\r\n\r\n[Chorus - Pharrell Williams &amp;amp; Vanessa Marquez]\r\n[V] Can I get my thrills?\r\n[P] You know you want some more girl, so come on\r\n[V] Can I get my thrills?\r\n[P] You know you want some more girl, so come on\r\nLet's get bloooooowwwnnnn.. let's get blooooooowwwnnnn..\r\n\r\n[Verse - Snoop Dogg]\r\nLooking at the ladies, all of them fly\r\nI don't know which one I want dawg\r\nI can't make up my mind, girl\r\nSo won't you make it easy on me?\r\nTake this drink, then hit this weed\r\nTwo step wit me, let's slip to the dance floor\r\nOn and on and on and on we go\r\nI'll dip you if you want me to\r\nYou see I really wanna get a little front wit you, bigidy bump wit you\r\nA nigga wanna hump you and then just comfort you\r\nAnd then I'll pop the top and lay you on the cot, and get you nice and hot\r\nYeah yeah, it's all to the real\r\nWe could do it like Guy, c'mon girl &amp;quot;Let's Chill&amp;quot;\r\n\r\n[Chorus]\r\n\r\n[Verse - Snoop Dogg]\r\nNow you can fly the friendly skies\r\nWith the S-N double O-P D-O double G-Y\r\nNow don't ask why, just keep looking good in the hood\r\nDamn girl, you so fly! We could do what you want to\r\nYou say you drink Alize or was is it Malibu? It don't really matter though\r\nYou remind me of the time when I had a hoe\r\nShe kept telling me Doggy Dogg I gotta go\r\nSo I let her get in the wind and co-macked her friend\r\n2 plus 2, it equals 4, this is some shit that could last forever more\r\nI'm trying to put my bid in, naw I'm just kidding\r\nCome on ma get in, and don't ask where we going\r\nPimping and hoeing, drink pouring and weed blowing, you know it c'mon!\r\n\r\n[Chorus]\r\n\r\n[Verse - Snoop Dogg]\r\nI've been looking at you, from the corner of my eyes\r\nChecking out your hips, lips, tits and your thighs\r\nI've been wanting to do you, for a mighty long time\r\nYou make a pimp wanna sing I - I - I\r\nWe'll head to the hills, your dreams I'll fulfill\r\nWe could do it how you want, cause I'm oh so real\r\nTell me you, naw I won't squeal\r\nYou wit Da Big Bo$$ Dogg so seal the deal\r\nPharrell got the Babyface and Dogg got the Whip Appeal, so name the place\r\nThis love I bring to you, on the real baby girl\r\nWon't you do me a favor and sing for Snoop\r\n\r\n[Chorus]\r\n\r\n[Outro - Pharrell &amp;amp; Snoop]\r\nYou know you want it!! (if I got it I'm a give it to you)\r\nSo come and get it!! (if I got it I'm a give it to you)\r\nIf I got it (if I got it I'm a give it to you)\r\n(Then you can get it) Ya know! Hey!!! Oh!!\r\n(End - Vannessa)\r\nCan I get my thrills? .. Can I get my thrills?"}