{"song_name":"Wait (The Whisper Song)","artist_id":431622,"display_artist":"Ying Yang Twins","spotify_id":"5Y78yINSOCW6xbOfGWNBg4","lyrics":"Hey how you doin lil mama? lemme whisper in your ear\r\nTell you sumthing that you might like to hear\r\nYou got a sexy ass body and your ass look soft\r\nMind if I touch it? and see if its soft\r\nNaw I'm jus playin' unless you say I can\r\nAnd im known to be a real nasty man\r\nAnd they say a closed mouth dont get fed\r\nSo I don't mind asking for head\r\nYou heard what I said, we need to make our way to the bed\r\nAnd you can start usin' yo head\r\nYou like to fuck, have yo legs open all in da butt\r\nDo it up slappin ass cuz the sex gets rough\r\nSwitch the positions and ready to get down to business\r\nSo you can see what you've been missin'\r\nYou might had some but you never had none like this\r\nJust wait til you see my dick\r\n\r\nAy bitch! wait til you see my dick\r\nWait til you see my dick\r\nAy bitch! wait til you see my dick\r\nImma beat dat pussy up\r\nAy bitch! wait til you see my dick\r\nWait you see my dick\r\nAy bitch! wait til you see my dick\r\nImma beat dat pussy up\r\n\r\nLike B-AM, B-AM, B-AM, B-AM, B-AM, B-AM, B-AM, B-AM, B-AM, B-AM, B-AM, B-AM, B-AM, B-AM, B-AM, B-AM\r\n\r\nBeat da pussy up, Beat da pussy up, Beat da pussy up, Beat da pussy up, Beat da pussy up, Beat da pussy up, Beat da pussy\r\nUp, Beat da pussy up\r\n\r\n[verse 2]\r\n\r\nYou fine, but I aint gone sweat ya\r\nSee I wanna fuck, tell me whats up\r\nWalk around the club with yo thumb in ya mouth\r\nPut my dick in, take your thumb out\r\nThere might be a lil kosher to deal with\r\nWet fat hoe's crunk up they dont spill shit\r\nI keep a hoe hot when I'm puttin' in work\r\nWanna skeet skeet you bout to get your feelin's hurt\r\nCuz I'll beat dat cat with a dog\r\nAnd knock da walls of a broad til she scrawl\r\nLike (OOOOOH!)\r\nYea something like that, but it depends on the swing of the baseball bat\r\nFuck a bitch on da counter make the\r\nPlates fall Back\r\nOn the floor she aint screamin she a nut so they crack\r\nCrack...crack\r\nFuck that bend over imma give you the dick\r\n\r\nAy bitch! wait til you see my dick\r\nWait til you see my dick\r\nAy bitch! wait til you see my dick\r\nImma beat dat pussy up\r\nAy bitch! wait til you see my dick\r\nWait you see my dick\r\nAy bitch! wait til you see my dick\r\nImma beat dat pussy up\r\n\r\nLike B-AM, B-AM, B-AM, B-AM, B-AM, B-AM, B-AM, B-AM, B-AM, B-AM, B-AM, B-AM, B-AM, B-AM, B-AM, B-AM\r\n\r\nBeat da pussy up, Beat da pussy up, Beat da pussy up, Beat da pussy up, Beat da pussy up, Beat da pussy up, Beat da pussy\r\nUp, Beat da pussy up\r\n\r\n(OOOOOOOH!)"}