{"rank":"43","song_id":"22553","song_name":"Number One Spot","artist_id":"308504","display_artist":"Ludacris","spotify_id":"5SV9SnHkuHMh446QsgQtry","lyrics":"[Ludacris - imitating Austin Powers]\nYeahhhh baby, heh heh, yeahh!\n\n[Ludacris]\nBack again (that's right) Luda! Ha ha ha ha (Feel this)\nIt gets meaner and meaner each time baby\nFeelin real good too (holla at 'em man) What up Uncle 'Face! (Yeah)\nI'm a bull in this industry man (tell 'em)\nSome would rather run down and get one cow (nah)\nI think I'd rather walk down and get 'em all\nYou know what I'm talkin 'bout right? Look\n \n[Verse 1]\nI'm never goin nowhere so don't try me\nMy music sticks in fans veins like an IV\nFlows poison like Ivy, oh they grimy\nAlready offers on my 6th album from labels tryin to sign me\nRespected highly, HIIII MR. O'REILLY\nHope all is well, kiss the plantiff and the wifey\nDrove through the window, the industry super sized me\nNow the girls see me and a river's what they cry me\nI'm on the rise, so many people despise me\nGot party ammunition for those tryin to surprise me (surprise!)\nIt's a celebration and everyone should invite me\nRoll with the crew or meet the bottom of our Nikes (blaow!)\nExplorer like Dora these swipers can't swipe me\nMy whole aura's so MEAN in my white tee\nNobody light-skinded reppin harder since Ice-T\nYou disagree, take the Tyson approach and bite me!\n \n[Chorus]\nWhoa! Don't slip up or get got! (Why not man?)\nI'm comin for that number one spot! (Alright)\nRappers swearin they on top! (Nuh uh, uh uh)\nBut I'm comin' for they number one spot! (Alright man)\nScheme scheme, plot plot (say WHAT?)\nI'm comin for that number one spot! (Woo, hey)\nKeep it goin it won't stop! (What you doin man?)\nI'm comin for that number one spot!\n \n[Verse 2]\nYes indeed, Ludacris I'm hotter than Nevada\nReady to break the steerin column on yo' Impala\nIf I get caught, bail out, po'-po' I tell 'em holla\nIn court I never show up, like Austin Powers fa-zha\nFather, father, and hey I love gold\nBut can buy anything I want from the records I've sold\nJacuzzi's hot, Cristal is so cold\nNeighbors catch contacts, from the blunts that I've rolled\nA pig in a blanket, a smoke and a pancake\nDrop albums non-stop once a year for my fans sake\nI crush mics until my hand breaks\nThen shag now and shag later 'til these women can't stand straight\nThe Luda-meister got 'em feelin so randy\nI'm +XXL+ so I call 'em my +Eye Candy+\nBrush my shoulder and I, pop my collar\nCause I'm worth a million ga-zillion fa-fillion dollars\n \n[Chorus]\n \n[Verse 3]\nCausin lyrical disasters, it's the master\nMake music for Mini-Me's, models and Fat Bastards\nThese women tryin yo get me out my Pelle Pelle\nThey strip off my clothes and tell me, \"Get in my belly!\"\nStay on the track, hit the ground runnin like Flo-Jo\nSent back in time and I've never lost my mojo\nLadies and gentlemen ahh, boys and girls\nLudacris sent down to take over the whole world!\n \n[Chorus]"}