{"rank":"60","song_id":"22651","song_name":"Ass Like That","artist_id":"301722","display_artist":"Eminem","spotify_id":"4gXdMZkBN1neE9nX6yRALa","lyrics":"Reporter: Eminem, Eminem, over here, over here, so how do you feel about your album?\nTriumph: Yes, I have a question, as a dog I must know what does Dr. Dre's ass smell like? You're so cute and small, no wonder Elton John loves you, your head comes up to his waist!\nEminem: Yeah fuck off, so anyway--\nTriumph: Do you kiss 50 Cent with that mouth?\nTriumph: I'm not your wife!\n\n[Hook]\nAw, baby\nThe way you shake it, I can't believe it\nI ain't never seen an ass like that\nThe way you move it, you make my pee-pee go\nDo-doing, doing, doing\nI don't believe it, it's almost too good to be true\nI ain't never seen an ass like that\nThe way you move it, you make my pee-pee go\nDo-doing, doing, doing\n\n[Verse 1]\nThe way she moves, she's like a belly-dancer\nShe's shaking that ass to the new Nelly jams\nI think someone's at the door but I don't think I'mma answer\nPolice saying 'freeze!': do-doing, doing, doing\nWhat do you mean, 'freeze'? Please, I'm a human being!\nI have needs! I'm NOT done, not 'til I'm finished peeing\nI am not resisting arrest, I am agreeing\nMr. Officer! I'm already on my knees\nI can't get on the ground any further, it's impossible for me\nAnd do not treat me like a murderer, I just like to pee\nPee, pee, yes, I make R&B, I sing song\nIt go ring-a-chong, a-ching-chong-chong-chong-ching\nPsych! I joke, I joke! I keed, I keed!\nIf I offend, I'm sorry! Please, please, forgive!\nFor I am Triumph the Puppet Dog, I am a mere puppet\nI can get away with anything I say and you will love it! (You will love it)\n\n[Hook]\nThe way you shake it, I can't believe it\nI ain't never seen an ass like that\nThe way you move it, you make my pee-pee go\nDo-doing, doing, doing\nJessica Simpson looks oh so tempting\nNick, I ain't never seen an ass like that\nEvery time I see that show on MTV, my pee-pee goes\nDo-doing, doing, doing\n\n[Verse 2]\nMary-Kate and Ashley used to be so wholesome\nNow they getting older, they're starting to grow bum-bums\nI go to the movies and sit down with my popcorn\nPolice saying 'freeze!': do-doing, doing, doing\nWhat do you mean, 'freeze'? Geez, I just got my seat!\nI have ticket, look, I put it away, my zipper's zipped!\nPlease do not remove me from this movie theater, please\nI did not even get to see Mary-Kate's shower scene\nI didn't mean to be obscene or make a great big scene\nAnd don't treat me like I'm Pee-wee Herman, this movie's PG\nMr. Officer, I demand to see my attorney\nI will simply plead innocent, cop a plea, and be free\nFree, yes free, right back on the streets\nWhat you mean my lawyer's with Michael, he's too busy?\nI am Triumph, Britney Spears has shoulders like a man\nAnd I can say that and you'll laugh\n'Cause there's a puppet on my hand (ha-ha)\n\n[Hook]\nThe way you shake it, I can't believe it\nI ain't never seen an ass like that\nThe way you move it, you make my pee-pee go\nDo-doing, doing, doing\nHilary Duff is not quite old enough, so\nI ain't never seen her butt like that\nMaybe next year, I'll say ass and she'll make my pee-pee go\nDo-doing, doing, doing\n\n[Verse 3]\nThe way she moves, she dances like a go-go\nIn that video, she sings, \"Get out, you bozo\nI need a new boyfriend!\" Hi, my name is JoJo\nPolice saying 'freeze!': do-doing, doing, doing\nWhat do you mean, 'freeze'? My computers will be seized\nAnd my keys, to my ranch, I just bake cookies\nMr. Officer, lookie, take a whiff of this\nHere, I make Jesus juice, take a sip of this\nNobody is safe from me! No, not even me\nI don't even know if I can say the word 'pee-pee'\nPee, on the radio but I think I did\nJanet, is that a breast? I think I just saw a tit!\nPsych! I joke, I joke, I keed, I keed\nI don't think my joke is working, I must flee quick!\nGet to the chopper, everybody get out\nI am not Triumph, I am Arnold, get down!\n\n[Hook]\nThe way you shake it, I can't believe it\nI ain't never seen an ass like that\nThe way you move it, you make my pee-pee go\nDo-doing, doing, doing\nSo Gwen Stefani, will you pee-pee on me, please?\nI ain't never seen an ass like that\n'Cause the way you move it, you make my pee-pee go\nDo-doing, doing, doing\n\nDr. Dre: The fuck is wrong witchu?\nEminem: Ha! Ha!\nTriumph: Hey blondie, I saved your peroxide ass again!"}