{"rank":"99","song_id":"22675","song_name":"The Talkin' Song Repair Blues","artist_id":"278315","display_artist":"Alan Jackson","spotify_id":"2NKXcEKxgJFLW79EpjofqI","lyrics":"The mechanic raised up from under my hood\nHe shook his head and said, \"This ain't good\nYour timin' belt's done, shrunk one size too small\nThose spark plug wires are a little too long\nAnd your main prodsponder's nearly gone\nYour injector ports are stripped and that ain't all.\"\n\n\"The torque converter's runnin' low on torque\nAnd that water pump's nearly down a quart\nBut we caught it all in time so you're in luck\"\nHe said, \"I've got the time and I've got the parts\nJust give me the word and I'm ready to start\nI think we can bring her in for eight hundred bucks.\"\n\nBut don't be downhearted, I can fix it for you, sonny\nIt won't take too long, it'll just take money\nThen he said, \"Ain't you that songwriter guy?\"\nI said, \"Yes, I am,\" he said, \"So am I.\"\n\nAnd he sat down and played me a song by the grease rack\nWhen he finished singin' he gave me a smile\nAnd I closed my eyes and pondered awhile\nAnd he said, \"What do you think? Now don't hold nothin' back.\"\n\nWell, I gave him my most sorrowful look\nAnd I said, \"This song's got a broken hook\nI can order you a new one from Nashville but it won't be cheap\nAnd I know you've been using a cut-rate thesaurus\n'Cause your adverbs have backed up into your chorus\nNow your verse is runnin' on verbs that are way too weak.\"\n\nBut don't be downhearted, I can fix it for you, sonny\nIt won't take too long, it'll just take money\nAnd I said, \"Hold on friend now I'm not through\nI hate to be the one to give you the news\n\nBut your whole melodic structure's worked itself loose\nIt's got so many dotted eighth notes in it\nI'd keep her under fifty beats per minute\nI mean, that's just me talkin', it's really up to you.\"\n\nAnd you've got a bad safety problem with\nThat dominant chord with the augmented fifth\nJust see how dangerously high it raises you up\nSo just go on over there and work on my car\nI'll sit here by the fan and chances are\nI can straighten this thing out for eig...nine hundred bucks.\"\n\nBut don't be downhearted, I can fix it for you, sonny\nIt won't take too long\nYou guessed it\nIt may be a hit\nI like it..."}