{"rank":"64","song_id":"22796","song_name":"Window Shopper","artist_id":"431969","display_artist":"50 Cent","spotify_id":"3hwwIr2pcL2IWBpEUj5Hya","lyrics":"[Intro]\nOhh!\nThe top feel so much better than the bottom\nSo much better\n\n[Hook]\nJa, you's a window shopper\nMad at me, I think I know why\nJada, you's a window shopper\nIn the jewelry store lookin' at shit you can't buy\nJoe, you's a window shopper\nIn the dealership tryin' to get a test drive\nNas, you's a window shopper\nMad as fuck when you see me ride by\n\n[Verse 1]\nSummertime, white Porsche Carrera is milky\nI'm on the grind, let my paper stack but I'm filthy\nIt's funny how niggas get to screw-facin' at me\nAnyhow they ain't got the heart to get at me\nI'll get down, Southside's the hood that I come from\nSo I don't cruise through nobody hood without my gun\nThey know the kid ain't gon' fall for all that bullshit\nTry and stick me, I'ma let off a full clip\nIt ain't my fault you done fucked up your re-up\nAt the dice game, who told you put a G up?\nEverybody mad when they paper don't stack right\nBut when I come around y'all niggas better act right\nWhen we got the tops down, you can hear the systems thump\nNigga, when we rollin', rollin', rollin'\nShut your block down, quick to put a hole in a chump\nNigga, when we rollin', rollin', rollin'\n\n[Hook]\nJa, you's a window shopper\nMad at me, I think I know why\nJada, you's a window shopper\nIn the jewelry store lookin' at shit you can't buy\nJoe, you's a window shopper\nIn the dealership tryin' to get a test drive\nNas, you's a window shopper\nMad as fuck when you see me ride by\n\n[Verse 2]\nNiggas love me in L.A. as soon as I pop in\nThey come to scoop me up at LAX and I hop in\nNow when it comes to bad bitches you know I got them\nSome from Long Beach, some from Watts and from Compton\nYou know a nigga wanna see how Cali girls freak off\nAfter that five hour flight from New York\nI start spittin' G at a bitch like a pimp, mane\nTell her, \"Meet me at the Mondrian so we can do our thang.\"\nShe can bring the lingerie with her, I sup-pose\nThen we can go from fully dressed to just havin' no clothes\nThen she can run and tell her best friend 'bout my sex game\nThen her best friend could potentially be next, mane\nListen mane, shit changed, I came up, I'm doin' my thang\nHomie, I'm holdin', holdin', holdin'\nOh shit, mane, the store owner watchin' you\nBefore somethin' get stolen, stolen, stolen\n\n[Hook]\nJa, you's a window shopper\nMad at me, I think I know why\nJada, you's a window shopper\nIn the jewelry store lookin' at shit you can't buy\nJoe, you's a window shopper\nIn the dealership tryin' to get a test drive\nNas, you's a window shopper\nMad as fuck when you see me ride by"}