{"rank":"100","song_id":"22828","song_name":"Welcome 2 Detroit","artist_id":"430434","display_artist":"Trick-Trick Featuring Eminem","spotify_id":null,"lyrics":"[Intro: Trick Trick & Eminem]\nWelcome to motherfuckin' Detroit, god damn it\nWonder boy, shit\nYeah, yeah, Tricky\nLet's show 'em some love!\nWelcome to Detroit!\n\n[Chorus: Eminem]\nWhere's my gangstas and all my thugs?\nThrow them hands up and show some love\nAnd I welcome you to Detroit city\nI said welcome to Detroit city\nEvery place, everywhere we go\nMan, we deep everywhere we roll\nAsk around and they all know Tricky\nAsk what's good, man, they all say Tricky\n\n[Verse 1: Eminem]\nClick click boom, just as soon as we hit the room\nYou can hear 'em holla \"Goon Sqwad!\" in this bitch\nLet me hear you holla \"Goon Sqwad!\" in this bitch\nLet me hear you holla \"Runyon Ave!\" in this bitch\nSo who am I gonna call on when I ain't got them boys with me\nAnd the situation gets a little sticky?\nI'ma dial 911 like a motherfuckin' punk\nFuck that, bla bla, I'ma call that rude boy from Detroit\nTrick Trick, quick, come pick me up!\nBring them guns, come to the club, meet me out front\nThere's some chump up in this bitch\nPoppin' some junk ‘cause he's drunk\nAnd we may have to fuck his ass up\n‘Cause uh, somethin' smells a lil fishy\nAnd I don't like the way his boys keep lookin' at me\nSo homie, come get me, Wonder Boys, what up doe, I see you\nRock Bottom, yeah I see you, all my Detroit people\nWhere you at? Man, let me see them hands in the sky\nDetroit, motherfuckers, till we die\n\n[Chorus: Eminem]\nWhere's my gangstas and all my thugs?\nThrow them hands up and show some love\nAnd I welcome you to Detroit city\nI said welcome to Detroit city\nEvery place, everywhere we go\nMan, we deep everywhere we roll\nAsk around and they all know Tricky\nAsk what's good, man, they all say Tricky\n\n[Verse 2: Trick Trick]\nHomie, it's been a long time comin' and I'm straight with that\nMarshall done called me to five-four and laced the track\nThis beat, you hear it bangin', he produced it himself\nMy bad, almost forgot to introduce myself\nMy name is Trick Trick, head of the Goon Sqwad and gangsta\nBeen bangin' the underground since ninety-five, we're bangin'\nElected to be the villain and certified a menace\nHoldin' it down since I paroled up outta prison\nYou heard about me, you just didn't know it was me\nAll the treacherous, evil deeds of the D you never see\nPickin' that kid up in the game, I just wasn't chasin' the fame\nI been chasin' the paper product and givin' lames the pain\nAccusations of violence, you know you done heard of that\nA quarter of a million dollars for beatin' a murder rap\nAnd my boy holdin' me up, Shady done put it out\nTrick Trick and Eminem, Detroit back in the house\n\n[Chorus: Eminem]\nWhere's my gangstas and all my thugs?\nThrow them hands up and show some love\nAnd I welcome you to Detroit city\nI said welcome to Detroit city\nEvery place, everywhere we go\nMan, we deep everywhere we roll\nAsk around and they all know Tricky\nAsk what's good, man, they all say Tricky\n\n[Verse 3: Trick Trick]\nAyo Em, you ever need one of these weapons, come get it\nFrom now on every beef that you get in, homie, I'm in it\nI been ridin' for this city, whether wrong or right\nI been whippin' on motherfuckers for the longest time\nSo it's evident, it's time for Trick to get it fast\nThe public, see, they appreciate my criminal past\nAuthorities tried to stop me, but they couldn't keep up\nGot a fan-base that's bigger then an average star\nI'm satisfied with it being my time to shine\nAnd I freak from the precinct for violent crimes\nI ain't sayin' the shit that I'm sayin' so girls can feel me\nOnly speakin' on what I know so the world can hear me\nSo peace to Jimmy and Dre for signin' my nigga\nHe reached back to Detroit and grabbed a winner\nSo the gangstas and thugs, we embrace with love\nAnd beat the hell outta anybody that fucks with us\n\n[Chorus: Eminem]\nWhere's my gangstas and all my thugs?\nThrow them hands up and show some love\nAnd I welcome you to Detroit city\nI said welcome to Detroit city\nEvery place, everywhere we go\nMan, we deep everywhere we roll\nAsk around and they all know Tricky\nAsk what's good, man, they all say Tricky\n\n[Outro: Trick Trick & Eminem]\nYeah, Trick Trick\nEminem, Wonder boy, Shady\nIt's going down, baby\nAyo Em, I got yo' back, my nigga\nDamn right I said \"my nigga\"\nThat's my nigga\nTricky\nI pull this mothafucka' out right here\nMothafuckas' don't wanna talk out no more\nNiggas come out with them nines and shit\nWhen I come back this mothafucka'\nAnd crack them bitch one good time\nNiggas don't wanna talk no more, neutral\nHell nah, every time, please believe it\nThe mothafucka' said it right there\nHa-ha-ha-ha-ha-ha\nWelcome to Detroit\nCome back soon\nSorry we missed you\nTrick Trick"}