{"rank":"67","song_id":"22846","song_name":"Lean Wit It, Rock Wit It","artist_id":"300740","display_artist":"Dem Franchize Boyz Featuring Lil Peanut & Charlay","spotify_id":"0YsNWdVVmu2fTq8iRNIePT","lyrics":"[Repeat 8X]\nLean wit it, rock wit it!\n\n[Verse 1]\nI bounce in the club so the hoes call me Rocky\nPosted in the cut, and I'm looking for a blockhead\nYup in my white tee\nI break a bitch back\nAnd I keep a big bank\nOh I think they like that\nBefore I leave the house I'm slizzard on the goose\nAnd I'm higher than a plane so a nigga really loose\nAnd I can lean wit it (lean wit it)\nAnd I can rock wit it (rock wit it)\nAnd if you gotta friend\nShe gotta suck a cock wit it!\n\n[Verse 2]\nAy gon and rock wit it (gon rock wit it)\nGon and lean wit it (gon lean wit it)\nRock so damn hard, you break your spleen wit it (you break your spleen wit it)\nPull up ya jeans wit it (pull up ya jeans wit it)\nSmoke some green wit it (smoke some green wit it)\nAnd the spot ain't crunk bitch if we ain't in it\nIf you don't wanna do it, then I'll make you dance\nPerfect example watch me make your face beat up my hands\nWhen you see me hit the spot, betta watch that boy\nCharlay, from the road wit Dem Franchize Boyz\n\n[Repeat 8X]\nLean wit it, rock wit it!\n\n[Verse 3]\nI'm too clean to wanna pop lock\nFrom left to right a nigga lean\nVibing to the beat, check my feet\nYou ain't got these\nI rock then bend my knees\nEverytime the beat drop\nLean wit it Rock wit me\nFreeze befo' your fingers pop\nPurple leen purple green grams in my sock\nWhat the fuck you mean\nYou ain't seen buddy on the block\nThey call me Doctor Doc\nI prescribe what a nigga need\nMake 'em lean and rock\nOld school people pat cha feet\n\n[Verse 4]\nShit I'm pimpin in the club\nTil the hoes start to act up\nCuz they see my chain\nAnd a nigga throwing them stacks up\nI keep a full clip and my pistol in my pants\nI'm in the middle of the flo'\nThey screaming 'Nigga do your dance'!\nYou can roll yo arms (roll yo arms)\nAnd just put 'em in rotation (rotation)\nGo side to side\nAnd snap yo fingers like temptations\nDog I'm all out of state\nDoin a dance they never seen that\nI ain't Fat Joe\nBut snap your fingers then you lean back\n\n[Repeat 8X]\nLean wit it, rock wit it!\n\n[Verse 5]\nRock left then snap your fingers, rock right then snap your fingers\nAy what's happenin', lean wit me, rock wit me\nGotta pill pop wit me, go on take a shot wit me\nCall me Teddy, I got grams don't hate, nigga shop wit me\nD.F.B So So Def, hell yeah we known bitch\nFranchize ain't got no money? Shit hold on hold on bitch\nRock left Rock right, You can get that (Shit)\nLean back like Fat Joe and snap your wrist back\n\n[Verse 6]\nGangsters don't dance (Naw) They lean wit it rock wit it\nGlock wit me Pop quickly\nGangsters gon rock wit it\n1,2 pop and bring it cross the chest wit it\nGet nasty flashy Go on flex wit it\nDo it how you wanna\nSlow it up do the Matrix\nPlay wit it straight hit it\nGet all in their face wit it\nThis dance for the killers, the dealers, the cut throats\nYou already know\nThe chillen, the grown folk\n\n[Repeat 8X]\nLean wit it, rock wit it!"}