{"rank":"86","song_id":"22862","song_name":"King Without A Crown","artist_id":"309981","display_artist":"Matisyahu","spotify_id":"3NkIfsiFHnljGrlXSD2AJ3","lyrics":"[Verse 1]\nYou're all that I have and you're all that I need\nEach and every day I pray to get to know you, please\nI want to be close to you, yes I'm so hungry\nYou're like water for my soul when it gets thirsty\nWithout you there's no me\nYou're the air that I breathe\nSometimes the world is dark and I just can't see\nWith these, demons surround all around to bring me down to negativity\nBut I believe, yes I believe, I said I believe\nI'll stand on my own two feet\nWon't be brought down on one knee\nFight with all of my might and get these demons to flee\nHaShem's rays fire blaze burn bright and I believe\nHaShem's rays fire blaze burn bright and I believe\nOut of darkness comes light, twilight unto the heights\nCrown Heights burnin' up all through till twilight\nSaid thank you to my God, now I finally got it right\nAnd I'll fight with all of my heart, and all a' my soul, and all a' my might\n\n[Hook]\nWhat's this feeling?\nMy love will rip a hole in the ceiling\nI give myself to you from the essence of my being and I\nSing to my god, songs of love and healing\nI want Moshiach now, time we start revealing\nWhat's this feeling?\nMy love will rip a hole in the ceiling\nI give myself to you from the essence of my being and I\nSing to my god, songs of love and healing\nI want Moshiach now\n\n[Hook]\nStrippin’ away the layers and reveal your soul\nGot to give yourself up and then you become whole\nYou're a slave to yourself and you don't even know\nYou want to live the fast life but your brain moves slow\nIf you're trying to stay high, bound to stay low\nYou want God but you can't deflate your ego\nIf you're already there then there's nowhere to go\nIf your cup's already full then its bound to overflow\nIf you're drowning in the waters and you can't stay afloat\nAsk Hashem for mercy, and he'll throw you a rope\nYou're looking for help from God you say he couldn't be found\nSearching up to the sky and looking beneath the ground\nLike a King without his Crown\nYou keep fallin' down\nYou really want to live but can't get rid of your frown\nTried to reach unto the heights and wound bound down on the ground\nGiven up your pride and then you heard a sound\nOut of night comes day and out of day comes light\nNullified to the One like sunlight in a ray\nMakin' room for his love and a fire gone blaze\nMakin' room for his love and a fire gone blaze\n\n[Hook]\n\n[Verse 3]\nSee I lift up my eyes where my help come from\nAnd I seen it circling around from the mountain\nThunder!\nYou feel it in your chest\nYou keep my mind at ease and my soul at rest\nYou're not vexed\nLook to the sky where my help come from\nSeen it circling around from the mountain\nThunder!\nYou feel it in your chest\nYou keep my mind at ease and my soul at rest\nYou're not vexed"}