{"song_name":"Conceited (There's Something About Remy)","artist_id":364848,"display_artist":"Remy Ma","spotify_id":"2R4KCSHfWuYiCMSu9f0nuc","lyrics":"See, this ain't nuttin that you use to\nOut of the ordinary, unusual\nYou gotta have the mind state like \"I'm so great\"\nCan't nobody do it like you do\nMiraculous, phenomenal\nAnd ain't nobody in here stoppin' you\nShow no love 'cause you wassup\nLook at yaself in the mirror like what the fuck\n\nDamn, I look good\nAnd can't nobody freak it like I could\nYeah, OK, I got a little fat, but\nMy shorty told me that he like it like that\nI'm happy\nAnother me there never can be\nSee, I'm so outstandin'\nDon't care if they can't stand me\nI'm sittin' on top of the world like Brandy\n\nSee, I look too good for this necklace\nAnd I look too good to be wearing this\nYou know I look way too good to be innocent\nI'm conceited. I got a reason\n\nSee, I look way too good to be driving that\nAnd I look too good to be buying that\nYou know I look way too good to be trying that\nI'm conceited. I got a reason\n\nNow who's that peaking in my window?\nNobody 'cause I live in a penthouse\nBaby, I'm sorry, but I'm sexy\nAnd all I want you to do is just bless me, let's see\nThis kid that I'm waitin' on\nHe said he love when my jeans look painted on\nWit a tight white tee, you ain't quite like me\nProbably why I'm always getting hated on\nNow shorty trynna push up on me like a Wonderbra\nListen, when I speak out I wouldn't want you take it wrong\nNow number one, I don't need you\nYa name's Q, I only see you when I see you\nListen two, you can never play me\n(Why is that? Why is that?)\n'Cause I'm such a fuckin' lady\nThree, it's all about me and I don't wanna talk about it\nIf you love to hear it, here it go\nI wrote a song about it\n\nSee, I look too good to be fucking you\nAnd I look too good to be loving you\nYou know I look way too good to stuck with you\nI'm conceited. I got a reason\n\nSee, I look too good to be gettin' with\nAnd I look too good to be havin' kids\nYou know I look way too good to be in the crib\nI'm conceited. I got a reason\n\nOh, oh, oh, oh\nI don't know what I'm doing\nI can't stop, my body gone moving\nI'm boppin' and poppin' to the music\nHe's watching me and he's about to lose it\nI'm droppin' that hotta den drop it like its hot\nFace down, ass up wit some new shit\nI'm outta control wit it\nDip it low, pick it up slow, poke it out, now roll wit it\nMy thong showin', but it's cool, my shoes go wit it\nNow all I need is a room wit a pole in it\nSee, I look good and I'm knowin it\nBut I was never to proud to be showin it\n\nSee, I look too good for this necklace\nAnd I look too good to be wearing this\nYou know I look way too good to be innocent\nI'm conceited. I got a reason\n\nSee, I look way too good to be driving that\nAnd I look too good to be buying that\nYou know I look way too good to be trying that\nI'm conceited. I got a reason"}