{"rank":"87","song_id":"22945","song_name":"Good Luck Charm","artist_id":"304031","display_artist":"Jagged Edge","spotify_id":"0rJBJ4K6uNeDg1rGVyi0Tp","lyrics":"\"Good Luck Charm\"\n\nShe's my light\nMy shining star\nShe's so dear to me yes she is yes she is\nMy guiding star my lucky charm\nYes she is yes she is\nWhoa whoa whoa oooh\n\n[1] - Everytime that something good happens in my life-\nYou're always there for me, looking good by my side-\nPicture you down, pullin up your panty hose\nAnd you always got that sexy underwear on\nSo much good has come my way\nSince she came in my life\nI'll never push you away or brush you off to the side\nSee girl I, I I....\nSee my luck has changed for the better.\n\n[Chorus:]\nSee I got so much love for you in these arms-\nDon't you know that you're my good luck charm.\nWhere you are forever girl ain't no harm\nAin't nobody else can borrow it, I won't allow it\n\nSee I got so much love for you in these arms\nDon't you know that you're my good luck charm.\nLovin you forever girl and never do I\nWanna go without, my good luck charm\n\n[2] - Like a rabbits foot on keys, or some lucky dice\nAll I want or need, I aint gotta ask twice\nWhere would I be? what would I do\nWithout you looking out for me?\nProbably be, probably be in these streets.\n\nWithout you in my life,\nMy future ain't the same, no.\nAnd I'm not wanting the blame\nBaby I, know I been around, I'm\nTired of messing around, I\nGot so much love.\n\n[Chorus]\n\n[Bridge:]\nAnd I'd throw away this ice, and\nGive up my J.E. pieces-\nJust to get a piece of (your love forever)\nAnd I knew you were a keeper\nSo babygirl I'm keepin you.\nCan't think about letting you go no no\nIt seems like every situation I been facing,\nYou know what to do to save me\nSo I know you bring me love.-\nSo I'm standing strong like a soldier-\nI know how to hold you-\nI'm saying this to let you know\nI got so. ooh.\n\n[Chorus]\n\nSee you're my yeah\nSee you're my\nSee you're my yeah\nSee you're my\n[fade]\n\n\nby Iris"}