{"rank":"55","song_id":"22957","song_name":"We Run This","artist_id":"311508","display_artist":"Missy Elliott","spotify_id":"4z5fkIflIBvSG9elVNmiOJ","lyrics":"(Missy Elliot):\nMy style can't be dupilcated or recycled.\nThis chick is a sick individual.\nSick tape, volume 2! Believe it! Oh! Oh! \nLet me switch up the game.\n\nVerse 1: \nI drink that cone yeah, step back cuz i might put it on ya. \nI go deep so deep, til you sleep, count sheep wake ya up \nfrom f****** all week. \nYou don't want me to show ya how freak b**** act when I ain't soba. \nOne of em, tore up, sho nuff. I ain't scared to take it off, \ntell em' free to take it off. Tipsy and it feel good, \nblack dudes got big woods. \nInto it, I do it, I did it. If you really,really want it then nigga stop frontin. \nHey, boy you know I'm your type, 5'2 and wear my jeans real tight, \nmy curves, they swerve, so superb, \nmy word is my word and I came to serve.\n\n(Chorus)\nWe run this, we run this, we run this, ugh! ugh! oh! \nIt don't matter where you from, it's where you at \nAnd if you came to freak-a-leak better bring your hat snicka! \nEast coast, west coast, down south, represent your coast. \nYeah we run it, yeah we run it, y'all don't want it cuz my coast run it. Oh! \nWe run this s***, we run this s***!\n\nVerse 2: \nWanna pull my hair, break my back? \nPut it right money might sit in your lap \nBack to back I can't even keep track. \nIt's a fact the freaks love to get slapped. \nSuck my toes and in the back rub. I don't come to do it, \nI just wanna be touched. \nLook at how y'all makin me blush, \nsome enough to go around so groupie don't push. \nWanna run that tusch in the bush. Don't my diamonds look real good? \nAnd they shine so hard that he glittas, \nso many karots they look like crittas. \nAnd we can do it all night, take a flashlight to see up in my windpipe. \nI like to keep a nigga hype. I wanna know can you handle my mic.\n\n(Chorus)\n\nHook: \nAny hustla's in the party y'all? Hell ya! \nIf you's a pimp let me see ya party on, Hell ya! \nOh, strippas take yo clothes off, Hell ya! \nY'all superstars y'all don't need no bodyguards, Hell ya! \n\nVerse 3: \nNigga I bow guard, allota rappers fake way to hard. \nPull up to the club in a rental car. \nWhere the freaks at, freaks at da bar where da hard drinks are. \nDon't start! If you don't want beef don't take it that far, wit a superstar. \nI got my foot on the clutch, see me bounce my butt, \nMisdeameanor too much and I don't give a f***!\n\nBridge: We run this, we run this, we run this. ugh! ugh! oh! \nIt don't matter where you from, it's where you at \nAnd if you came to freak-a-leak better bring your hat snicka! \nWe run this, we run this, we run this. ugh! ugh! oh! \nRepresent your coast and act like ya know, \nKnow how to act fore' you step your two feet in the door!"}