{"rank":"30","song_id":"22967","song_name":"Promiscuous","artist_id":"312112","display_artist":"Nelly Furtado Featuring Timbaland","spotify_id":"0bRh7pc1nfIv2edfcIUlKh","lyrics":"[Intro: Nelly Furtado & Timbaland]\nAm I throwing you off?\nNope\nDidn't think so\n\n[Verse 1: Nelly Furtado & Timbaland]\nHow you doing, young lady?\nThat feeling that you giving really drives me crazy\nYou don't have a player on the truck\nI was at a loss of words first time that we spoke\nYou looking for a girl that'll treat you right\nYou looking for her in the daytime, with the light\nYou might be the type if I play my cards right\nI'll find out by the end of the night\nYou expect me to just let you hit it\nBut will you still respect me if you get it\nAll I can do is try, gimme one chance\nWhat's the problem, I don't see no ring on your hand\nI'll be the first to admit it\nI'm curious about you, you seem so innocent\nYou wanna' get in my world, get lost in it\nBoy, I'm tired of running, let's walk for a minute\n\n[Hook: Timbaland and Nelly Furtado]\nPromiscuous girl, wherever you are\nI'm all alone, and it's you that I want\nPromiscuous boy, you already know\nThat I'm all yours, what you waiting for?\nPromiscuous girl, you're teasing me\nYou know what I want, and I got what you need\nPromiscuous boy, let's get to the point\nCause we're on a roll, you ready?\n\n[Verse 2: Nelly Furtado & Timbaland]\nRoses are red, some diamonds are blue\nChivalry is dead, but you're still kinda cute\nHey! I can't keep my mind off you\nWhere you at, do you mind if I come through?\nI'm out of this world come with me to my planet\nGet you on my level, do you think that you can handle it?\nThey call me Thomas, last name Crown\nRecognize game, Imma' lay mine's down\nI'm a big girl I can handle myself but if I get lonely I might need your help\nPay attention to me, I don't talk for my health\nI want you on my team\nSo does everybody else\nSHH! Baby we can keep it on the low\nLet your guard down ain't nobody gotta know\nIf you with it girl I know a place we can go\nWhat kind of girl do you take me for?\n\n[Hook: Timbaland and Nelly Furtado]\nPromiscuous girl, wherever you are\nI'm all alone, and it's you that I want\nPromiscuous boy, you already know\nThat I'm all yours, what you waiting for?\nPromiscuous girl, you're teasing me\nYou know what I want, and I got what you need\nPromiscuous boy, let's get to the point\nCause we're on a roll, you ready?\n\n[Bridge: Timbaland & Nelly Furtado]\nDon't be mad, don't get mean\nDon't get mad, don't be mean\nHey! Don't be mad, don't get mean\nDon't get mad, don't be mean\n\n[Verse 3: Nelly Furtado & Timbaland]\nWait...I don't mean no harm\nI can see you with my t-shirt on\nI can see you with nothing on\nFeeling on me before you bring that on\nBring that on?!\nYou know what I mean\nGirl, I'm a freak you shouldn't say those things!\nI'm only trying to get inside of your brain\nTo see if you can work me the way you say\nIt's okay, it's alright\nI got something that you gon' like\nHey, is that the truth or are you talking trash?\nIs your game M.V.P. like Steve Nash?\n\n[Hook: Timbaland and Nelly Furtado]\nPromiscuous girl, wherever you are\nI'm all alone, and it's you that I want\nPromiscuous boy, I'm callin ya' name\nBut you're driving me crazy, the way you're making me wait\nPromiscuous girl, you're teasing me\nYou know what I want, and I got what you need\nPromiscuous boy, we're one in the same\nSo we don't gotta play games no more"}