{"rank":"19","song_id":"23001","song_name":"Ain't No Other Man","artist_id":"299251","display_artist":"Christina Aguilera","spotify_id":"7huo2wvrCgRucUsjdSDLQV","lyrics":"Hey!!!!\r\nDo your thing honey!\r\n\r\nI could feel it from the start,\r\nCouldn't stand to be apart.\r\nSomething 'bout you caught my eye,\r\nSomething moved me deep inside\r\nDon't know what you did boy but you had it\r\nAnd I've been hooked ever since.\r\n\r\nI told my mother, my brother, my sister and my friends\r\nTold the others, my lovers, both past and present tense.\r\nThat everytime I see you everything starts making sense.\r\n\r\nDo your thing honey!\r\n\r\nAin't no other man can stand up next to you\r\nAin't no other man on the planet does what you do\r\n(what you do!)\r\nYou're the kinda guy, a girl finds in a blue moon. (hey)\r\nYou got soul (yeah), you got class (ohh). You got style, you bad ass (Oh Yeah!)\r\nAin't no other man it's true (all right)\r\nAin't no other man but you.\r\n\r\nNever thought I'd be alright. No, no, no!\r\n'Til you came and changed my life. Yeah, yeah, yeah!\r\nWhat was cloudy now is clear! Yeah, yeah!\r\nYou're the light that I needed.\r\n\r\nYou got what I want boy, and I want it!\r\nSo keep on givin' it up!\r\n\r\nSo tell your mother, your brother, your sister, and your friends.\r\nTell the others, your lovers, better not be present tense.\r\nCause I want everyone to know that you are mine and no one else's!\r\n\r\nOoooh,oh oh!\r\n\r\nAin't no other man can stand up next to you (to you yeah)\r\nAin't no other man (ain't no other man) on the planet does what you do\r\nYou're the kinda guy a girl finds(a girl finds) in a blue moon.\r\nYou got soul (soul), you got class (class).\r\nYou got style,you badass (yeah yeah yeah!)\r\nAin't no other man it's true\r\nAin't no other man but you.\r\n\r\nBreak it down now!\r\n\r\nAin't no other, ain't, ain't no other, (other)!!\r\nAin't no other, ain't, ain't no other (LOVER)!\r\nAin't no other, I, I, I need no other!\r\nAin't no other man but you!\r\nOhhhh!\r\nYou are there when I’m a mess\r\nTalked me down from every ledge\r\nGive me strength boy you’re the best\r\nYou’re the only one who’s ever passed every test\r\n\r\nAin't no other man (woo), can stand up next to you (next to you)\r\nAin't no other man on the planet does what you do. oh..\r\nYou're the kinda guy, a girl finds in a blue moon.\r\nYou got soul (yeah), you got class (yeah)\r\nYou got style, you badass (oh yeah!)\r\nAin't no other man it's true\r\nAin't no other man but you.\r\n\r\nAnd now I'm telling you so ain’t no other man but you\r\nHey!!!!!!!!\r\nAin't no other man, can stand up next to you,\r\nAin't no other man on the planet does what you do\r\n(what you do).\r\nYou're the kinda guy, a girl finds in a blue moon.\r\nBaby, baby, baby Oooh!!!!!\r\nYou got soul (yeah), you got class (ohh)\r\nYou got style, you badass\r\nDon't you know!\r\nAin't no other man it's true\r\nAin't no other man but you."}