{"rank":"83","song_id":"23075","song_name":"Show Me The Money","artist_id":"331209","display_artist":"Petey Pablo","spotify_id":"6lob8yGQuretKACtogsaQL","lyrics":"Show off that body you got \nYou got that dance floor so hot \nYou workin that, You twerkin that \nYou checkin that, like a clock \n\nCant nobody do it like I do it, \nwhen I do it, dog I do it \n(Break it down) Break it down putcho back into it \nMain Yall aint ready for the **** im doing \n(Get up) Get up Putcho drinks down \nDont want yall sausy your drinks out \nAll over that your cheap blouse aint nothin but a small any anyhow \n(Still me) Still me I just changed the sound to the other one I had and just swapped it out \n(Switch) Kept somethin in the backround, cuz you in love with the song but you in love with the backround \nCome on let a momma work for me \nMake a playa wanna spend some money \n(Come on) I dont really like to spend a money \nBut you can do what you do and do it well Imma \n\nShow off that body you got \nYou got that dance floor so hot \nYou workin that, You twerkin that \nYou checkin that, like a clock \n\n(Show up) Show up, empty \nNothin in um, Her..her \nNo Silicone, no lipo, no botox no dumpy dump (No) \nAll Natural, let the day spoil when another brother in this world \nGood lookin momma \nThat good and hot to death make an athelete lose his breath \nAnd had to move that *** when you bump south \nYou gonna need a couple skirts keep fallin out \n(For Real) a 10.5 on a rhictor scale a high number you can go to 12 \nshorty shaking like hell \nWe ought be shamed ourselves, creator couldnt rock the bed that well \n(Look Out) Breakin it down, ridin this beat like (WOW) \nPapa jail man I gun her down \n\nShow off that body you got \nYou got that dance floor so hot \nYou workin that, You twerkin that \nYou checkin that, like a clock \n\nThis is defiantly the wickedest thing I hear of my life! \nOK! I've been sippin on that patron \n(Get Up, Get up) \nI'm ready, Give you what you want \nOK! (Get Up, Get Up) \nMight not feel the same way tomorrow (Ok) \nBut I'll deal with that tomorrow \n(Get up, Get up) \nCuz tonight you got me feeling like I wanna take you home \n\nShow off that body you got \nYou got that dance floor so hot \nYou workin that, You twerkin that \nYou checkin that, like a clock"}