{"rank":"73","song_id":"23106","song_name":"Remember The Name","artist_id":"302304","display_artist":"Fort Minor Featuring Styles Of Beyond","spotify_id":"546QTayX6j4GcZsfTRrVnL","lyrics":"[Intro: Mike Shinoda]\nYou ready? Let's go!\nYeah!\nFor those of you that want to know what we're all about\nIt's like this, y'all, c'mon!\n\n[Chorus]\nThis is ten percent luck, twenty percent skill\nFifteen percent concentrated power of will\nFive percent pleasure, fifty percent pain\nAnd a hundred percent reason to remember the name\n\n[Verse 1: Mike Shinoda]\nMike, he doesn't need his name up in lights\nHe just wants to be heard, whether it's the beat or the mic\nHe feels so unlike everybody else, alone\nIn spite of the fact that some people still think that they know him\n\nBut fuck 'em, he knows the code, it's not about the salary\nIt's all about reality and making some noise\nMaking a story, making sure his clique stays up\nThat means when he puts it down, Tak's pickin' it up, let's go\n\n[Verse 2: Tak]\nWho the hell is he, anyway? He never really talks much\nNever concerned with status but still leaving 'em star-struck\nHumbled through opportunities given despite the fact\nThat many misjudge him 'cause he makes a living from writing raps\n\nPut it together himself, now the picture connects\nNever asking for someone's help, or to get some respect\nHe's only focused on what he wrote, his will is beyond reach\nAnd now it all unfolds, the skill of an artist\n\n[Verse 3: Ryu]\nThis is twenty percent skill, eighty percent beer\nBe a hundred percent clear, 'cause Ryu is ill\nWho would've thought he'd be the one to set the west in flames\nAnd I heard him wreck it with The Crystal Method\n\"Name of the Game\"\n\nCame back, dropped Megadef, took 'em to church\nI like \"Bleach\", man, why you have the stupidest verse?\nThis dude is the truth, now, everybody givin' him guest spots\nHis stock's through the roof, I heard he fuckin' with S. Dot\n\n[Chorus]\nThis is ten percent luck, twenty percent skill\nFifteen percent concentrated power of will\nFive percent pleasure, fifty percent pain\nAnd a hundred percent reason to remember the name\n\n[Verse 4: Ryu]\nThey call him Ryu the Sick, and he's spittin' fire with Mike\nGot him out the dryer, he's hot, found him in Fort Minor with Tak\nBeen a fucking nihilist porcupine, he's a prick, he's a cock\nThe type woman want to be with and rappers hope he get shot\n\nEight years in the making, patiently waiting to blow\nNow, the record with Shinoda's taking over the globe\nHe's got a partner in crime, his shit is equally dope\nYou won't believe the kind of shit that comes out of this kid's throat\n\n[Verse 5: Tak]\nTak, he's not your everyday on the block\nHe knows how to work with what he's got\nMaking his way to the top\nHe often gets a comment on his name, people keep asking him\n\"Was it given at birth or does it stand for an acronym?\"\n\nNo, he's living proof, got him rocking the booth\nHe'll get you buzzing quicker than a shot of vodka with juice\nHim and his crew are known around as one of the best\nDedicated to what they doing, give a hundred percent\n\n[Verse 6: Mike Shinoda]\nForget Mike, nobody really knows how or why he works so hard\nIt seems like he's never got time\nBecause he writes every note and he writes every line\nAnd I've seen him at work, when that light goes on in his mind\n\nIt's like a design is written in his head, every time\nBefore he even touches a key or speaks in a rhyme\nAnd those motherfuckers he runs with, those kids that he signed?\nRidiculous, without even trying, how do they do it?\n\n[Chorus]\nThis is ten percent luck, twenty percent skill\nFifteen percent concentrated power of will\nFive percent pleasure, fifty percent pain\nAnd a hundred percent reason to remember the name\n\nThis is ten percent luck, twenty percent skill\nFifteen percent concentrated power of will\nFive percent pleasure, fifty percent pain\nAnd a hundred percent reason to remember the name\n\n[Outro: Mike]\nYeah! Fort Minor, M. Shinoda, Styles of Beyond\nRyu, Takbir, Machine Shop!"}