{"rank":"28","song_id":"23121","song_name":"White & Nerdy","artist_id":"431263","display_artist":"\"Weird Al\" Yankovic","spotify_id":"60R2v9lheAu3lwZwAFxMZK","lyrics":"[Hook 1]\nThey see me mowin' my front lawn\nI know they're all thinking I'm so white and nerdy\nThink I'm just too white and nerdy\nThink I'm just too white and nerdy\nCan't you see I'm white and nerdy?\nLook at me, I'm white and nerdy\nI wanna roll with the gangstas\nBut so far they all think I'm too white and nerdy\nThink I'm just too white and nerdy\nThink I'm just too white and nerdy\nI'm just too white and nerdy\nReally really white and nerdy\n\n[Verse 1]\nFirst in my class here at MIT\nGot skills, I'm a champion at D&D\nM.C. Escher—that's my favorite \"M.C.\"\nKeep your 40, I'll just have an Earl Grey tea\nMy rims never spin, to the contrary\nYou'll find that they're quite stationary\nAll of my action figures are cherry\nStephen Hawking's in my library\nMy MySpace page is all totally pimped out\nGot people beggin for my Top 8 spaces\nYo, I know pi to a thousand places\nAin't got no grills, but I still wear braces\nI order all of my sandwiches with mayonnaise\nI'm a whiz at Minesweeper—I could play for days\nOnce you see my sweet moves, you're gonna stay amazed\nMy fingers movin' so fast I'll set the place ablaze\nThere's no killer app  I haven't run\nAt Pascal, well, I'm number one\nDo vector calculus just for fun\nI ain't got a gat but I got a soldering gun\n\"Happy Days\" is my favorite theme song\nI could sure kick your butt in a game of ping pong\nI'll ace any trivia quiz you bring on\nI'm fluent in JavaScript as well as Klingon\n(Here's the part I sing on)\n\n[Hook 2]\nThey see me roll on my Segway\nI know in my heart they think I'm white and nerdy\nThink I'm just too white and nerdy\nThink I'm just too white and nerdy\nCan't you see I'm white and nerdy?\nLook at me, I'm white and nerdy\nI'd like to roll with the gangstas\nAlthough it's apparent I'm too white and nerdy\nThink I'm just too white and nerdy\nThink I'm just too white and nerdy\nI'm just too white and nerdy\nHow'd I get so white and nerdy?\n\n[Verse 2]\nI've been browsin', inspectin'\nX-Men comics, you know I collect 'em\nThe pens in my pocket, I must protect 'em\nMy ergonomic keyboard never leaves me bored\nShopping online for deals on some writable media\nI edit Wikipedia\nI memorized Holy Grail really well\nI can recite it right now and have you \"ROTFLOL\"\nI got a business doing websites\nWhen my friends need some code, who do they call?\nI do HTML for 'em all, even made a homepage for my dog, yo\nI got myself a fanny pack\nThey were havin a sale down at The Gap\nSpend my nights with a roll of bubble wrap\nPop, pop, hope no one sees me, gettin freaky\nI'm nerdy in the extreme and whiter than sour cream\nI was in AV Club and Glee Club and even the Chess Team\nOnly question I, ever thought was hard\nWas do I like Kirk or do I like Picard?\nSpend every weekend at the Renaissance Fair\nGot my name on my underwear\n\n[Hook 3]\nThey see me strollin', they laughin'\nAnd rollin' their eyes cause I'm so white and nerdy\nJust because I'm white and nerdy\nJust because I'm white and nerdy\nAll because I'm white and nerdy\nHoly cow, I'm white and nerdy!\nI wanna bowl with, the gangstas\nBut, oh well, it's obvious I'm white and nerdy\nThink I'm just too white and nerdy\nThink I'm just too white and nerdy\nI'm just too white and nerdy\nLook at me, I'm white and nerdy!"}