{"rank":"88","song_id":"23201","song_name":"Top Back","artist_id":"277486","display_artist":"T.I.","spotify_id":"6t3W3QtsnGrK4BVFEGxr5r","lyrics":"[T.I.]\nHaaaa...Mannie Fresh I got you nigga\nI'm gonna show these niggaz what to do with one of your beats\nI'm shuttin the whole block down\nHere comes trouble homey\nI'ma tell you how the king like to ride homeboy\n\n[Chorus: repeat 2X]\nI like my beat down low and my top let back\nCan see me ridin 24's with a chopper in the back\nYa like ya Kenwood hot and ya top let back\nIf ya rims sit high and ya windows pitch black\n\n[Verse 1]\nI'm the man in my city ain't nobody fuckin wit me\nYou can ask the real niggaz and all the bad bitches\nI'm a known drug dealer I always have 50's\nAnd the thugs and the killers was all in class wit me\nSS'S on 26's watchin some television\nShorty I'm never slippin got the berretta in vision\nAnd ready to pop the clip in, ready to get to trippin\nReady to show these folks a celebrity pistol whippin\nPimp stolen' the automobile and the roof for the tag missin\nPolices' try to pursue me it's nothin but gas given\nAddicted to fast livin, yes I'm one of my dads children\nThink I'm bad now shoulda seen me before I had children\nGive dick to ya daddy's daughter and they oughta have children?\nHope he got some insurance cause I definitely have some endurance?\nKill her in Mississippi and drive her ass to Missouri\nStill my waint pet drippin' while I'm woodgrain grippin\n\n[Chorus]\n\n[Verse 2]\nI got this Pimp Squad Click I know you hearda bout us\nYoung niggaz filthy rich and we ain't worried bout much\nOn this glock I clutch In God I trust\nIf a fuck nigga start bet his heart I bust\nGot ya partners and the broad in ya car fucked up\nWhat, ya under estimation thought a star wouldn't bust\nI got the heart and the guts on this purp I blow\nMove ten bricks daily tryin' to twerk five mo\nYa see the Cadillac swervin down Hollywood Road\nOn the flyest ?? in Cali fuckin Hollywood Ho's\nOn a pill and half with my partner Young Dro\nBumpin Goodie Mob Soul Food number fo\nOther rappers' old dudes told dudes I'ma pro\nWith a loaded fo fo and a quarter brick of blow\n(Hey) nigga don't you hit me less you buyin 6 or mo\nMy 24 blades glistenin and my 808 kickin\n\n[Chorus]\n\n[Verse 3]\nI wear the crown down under man somebody better tell 'em\n'For I spit a hundred rounds and have everybody bailin\nI got some bitches in a Benz and my partners in the Chevy\nAnd now we ridin Giovanni's and Asani's on Pirellis\nIf ya ever think ya tryin to run up on me just forget it\nThe clip in the chopper long as ya leg and leave ya shredded\nPistol way in the truck got my knife on tuck\nYa think he ain't getn stuck you got life fucked up\nA couple stiches in ya hip will have ya night fucked up\nWill he live? Will he die? Guess he might luck up\nMeanwhile I'm racin my Ferarri like a light for a buck\nAgainst Lamborghini Gallardo everytime I get a car...\n\n[Chorus]"}