{"song_name":"Mr. Jones","artist_id":311188,"display_artist":"Mike Jones","spotify_id":"3LU66Soe9kT5saRxI4wTj6","lyrics":"Mr. Jones - Mike Jones \n\n[Hook] \nYou can ride all day long \nAnother mike diesel production(Mike Jones) \nBut you’ll ever catch Mr. Jones ha ha ha ha ha haaa(Mr. Jones) \nHe’s got a gangs that are far too strong (Ice Age Ice Age Ice Age) \nYour friends know it, that’s why you’re all alone ha ha ha ha ha (All alone) \nChasing the man you can’t see(Mike Jones) \nSo just walk away and let him be \nHe’s got a shot gun so go back home (Who? Who?) \nCuz you’ll never get Mr. Jones (Mike Jones) \n\n[Verse 1] \nI’m back on these tracks about to sell another mill \nMy pants stay saggin’ from them hundred dollor billz \nThese haters hate but they don’t really wanna see the steel \nThese haters hate but they don’t really wanna see the steel \nHad a million in my bank before i solomn bought the deal \nHad a million in my bank before I solomn bought the deal \nBefore I came out just say the streets wouldn’t feel \nThe game that I’m spittin the shit that’s real \nBut now I’m like Mello I’m the king of the hill \nAmerican dream playa tell me how you feel \nTook the diamonds out my teeth and put them on my phantom grill (Smile, ha ha) \n\n[Hook] \nYou can ride all day long (Mike Jones) \nBut you’ll never catch Mr. Jones ha ha ha ha ha haa (Mr. Jones) \nHe’s got a gang that’s far too strong (Ice Age Ice Age Ice Age) \nYour friends you know it, that’s why you’re all alone ha ha ha ha ha haa (All alone) \nChasing the man you can’t see (Mike Jones) \nSo just walk away and let him be \nHe’s got a shot gun so go back home (Who? Who?) \nCuz you’ll never catch Mr. Jones (Mike Jones) \n\n[Verse 2] \nI used to get dissed by the chicks in the club \nNow they want to rub my belly wanna show ya boy some love \nThey see me iced up they be like wassup? \nTry to jack me if u wanna I’ma leave u fucked up \nUsed to roll hatch back now I’m Cadillac and Benz \nUsed to roll hatch back now I’m Cadillac and Benz \nI used to have homies now I’m like i fuck friends \nCause even back then all they did was pretend \nNow I got my own lable Ice Age and I’m boss \nI’m the mayor of this town with the key to that Vault \nAll my cars black on black except the one with big gloss \nGot another white on white I call that hoe Rick Ross (Ross)(Hahaa) \n\n[Hook] \nYou can ride all day long (Mike Jones) \nBut you’ll never catch Mr. Jones ha ha ha ha ha haa (Mr. Jones) \nHe’s got a gang that’s far too strong (Ice Age Ice Age Ice Age) \nYour friends know it, that’s why you’re all alone (All alone) \nChasing the man you can’t see (You can’t see me baby) \nSo just walk away and let him be (Its the mayor) \nHe’s got a shotgun so go back home (Who? Who?) \nCuz you’ll never get Mr. Jones (Mike Jones) \n\n[Verse 3] \nHey hey hey hey \nNow make it rain \nHey \nNow make it rain \nHey \nNow make it rain \nAmerican dream – album and movie on the way baby (ha ha ha ha ha ha)"}