{"song_name":"Love Today","artist_id":311138,"display_artist":"MIKA","spotify_id":"6ZBJFWDYJSTQg54eDsqnkJ","lyrics":"Doom da da di da di doom da da di da di doom\n\nEverybody's gonna love today, gonna love today, gonna love today\nEverybody's gonna love today, gonna love today\nAnyway you want to, anyway you've got to\nLove love me, love love me, love love.\n\nI've been crying for so long,\nFighting tears just to carry on,\nBut now, but now, it's gone away.\n\nHey girl, why can't you carry on?\nIs it 'cause you're just like your mother,\nA little tight, like to tease for fun\nWell you ain't gonna tease no other\nGonna make you a lover!\n\nEverybody's gonna love today, love today, love today!\nEverybody's gonna love today,\nAnyway you want to, anyway you've got to love, love me,\nLove, love me, love, love\nGirl in the blue with the big bust on, big bust on, big bust on!\nWait 'till your mother and your papa's gone!\nOhh mama, mama, papa, shock, shock me, shock, shock me, shock, shock\n\nEverybody's gonna love today, gonna love today, gonna love today.\nEverybody's gonna love today, gonna love today.\nAnyway you want to, anyway you've got to, love, love me\nLove, love me, love, love\n\nCarolina sits on '95\nGive her a dollar and she'll make you smile\nHooker, book her, nook her, walk away!\n\nGirl dresses like a kid for fun,\nLicks her lips like they're something other,\nTries to tell you life has just begun,\nNow you know she's getting something other than the love from her mother.\n\nEverybody's gonna love today, love today, love today!\nEverybody's gonna love today,\nAnyway you want to, anyway you've got to love, love me, love, love me, love, love\nGirl in the blue with the big bust on, big bust on, big bust on.\nWait till your mother and your papa's gone!\nOhh mama, mama, papa, shock, shock me, shock, shock me, shock, shock\n\nI said everybody's gonna love today, gonna love today!\nI said everybody's gonna love today, gonna love today!\nAnyway you want to, anyway you've got to love, love me, love, love me, love, love\n\nDoom da da di da di doom da da di da di doom"}