{"rank":"14","song_id":"23482","song_name":"Good Life","artist_id":"276709","display_artist":"Kanye West Featuring T-Pain","spotify_id":"1fLdeDTrJWNkwOeFyAVLvF","lyrics":"[Produced by DJ Toomp, Kanye West, and Mike Dean]\n\n[Hook: Kanye West & T-Pain]\nLike we always do at this time\nI go for mine, I gots to shine\n(Now throw yo' hands up in the sky)\nI, go, go for mine, I gots to shine\n(Now throw yo' hands up in the sky)\nI'ma get on the TV momma, I'ma\nI'ma put shit down\n(Ayy) ayyy (ayy) ayyy\n(Ayy) ayyy (ayy) I'm good\n\n[Verse 1: Kanye West]\nWelcome to the good life, where niggas who sell D\nWon't even get pulled over in they new V\nThe good life, let's go on a living spree\nShit, they say the best things in life are free\nThe good life, it feel like Atlanta\nIt feel like L.A., it feel like Miami\nIt feel like N.Y., summertime Chi\nAh! (Now throw yo' hands up in the sky)\nSo I roll through good\nY'all pop the trunk, I pop the hood, Ferrari\nAnd she got the goods\nAnd she got that ass, I got to look, sorry!\n\n[Bridge]\nYo, it's got to be cause I'm seasoned\nHaters give me them salty looks, Lawry's\n50 told me, go 'head, switch the style up\nAnd if they hate then let 'em hate and watch the money pile up\nThe good life\n\n[Hook: Kanye West & T-Pain]\nNow I, I go for mine, I got to shine\n(Now throw yo' hands up in the sky)\nNow I, I go for mine, I got to shine\n(Now throw yo' hands up in the sky)\n(I'ma get on this TV momma, I'ma)\n(I'ma put shit down)\nAyy (ayyy) ayy (ayyy)\nAyy (ayyy) ayy (I'm good)\n\n[Verse 2: Kanye West]\nWelcome to the good life!\nWhere we like the girls who ain't on TV\nCause they got mo' (ass than the models)\nThe good life, so keep it comin' with the bottles\nCause she feel booze like she bombed at Apollo\nThe good life, it feel like Houston\nIt feel like Philly, it feel like D.C\nIt feel like V.A. or the Bay or Yay\nAy, this is the good life (Welcome to the good life)\nHomey tell me what's good\nWhy I only got a problem when you in the hood (Welcome to the good life)\nLike I'm new in the hood\nThe only thing I wish, I wish a nigga would (Welcome to the good life!)\nHe probably think he could\nBut, but, I don't think he should (Welcome to the good life)\n50 told me, go 'head, switch the style up\nAnd if they hate then let 'em hate and watch the money pile up\nThe good life\n\n[Hook: Kanye West & T-Pain]\nNow I, I go for mine, I gots to shine\n(Now throw yo' hands up in the sky)\nNow I, I go for mine, I gots to shine\n(Now throw yo' hands up in the sky)\nI'ma get on the TV momma, I'ma\nI'ma put shit down\n(Ayy) ayyy (ayy) ayyy\n(Ayy) ayyy (ayy) I'm good\n\n[Verse 3: Kanye West]\nHave you ever popped champagne on a plane, while gettin' some brain\nWhipped it out, she said \"I never seen Snakes on a Plane\"\nWhether you broke or rich you gotta get this\nHavin' money's not everything, not havin' it is\nI was splurgin' on Tryst, but when I get my card back\nActivated, I'm back to Vegas\n'Cause (the good life) I always had a passion for flashin'\nBefo' I had it, I closed my eyes and imagined the good life\n\n[Outro: T-Pain]\nBetter than the life I lived\nWhen I thought that I was gonna go crazy\nAnd now my grandmomma\nAin't the only girl callin me \"baby\"\nIf you feelin me now\nThen put yo' hands up in the sky, and let me hear you say\nHeyy, heyy, ooooh I'm GOOD!"}