{"rank":"72","song_id":"23539","song_name":"Suffocate","artist_id":"276550","display_artist":"J. Holiday","spotify_id":"3nJjIYchBNkYm7B8XfJf5N","lyrics":"Now Even Though I Try To Play It Off. \nI'm Thinking 'Bout You All Day Long And\nI Can't Wait For Shorty To Come Through\nFrom Your Lips And Neck\nTo Your Eyes, My Hands On Your Hips Homie Grind I'm Fantazing\n'Bout What I'm Gon' Do To You. \nYou Got Me Fiending For Her Love (Can't Lie)\nMan You Should See How She Got Me\nSpending All This Time With Her (With Her)\nI Couldn't Leave Her If I Wanted To Her Love Turns Me Into Fool \nTell Me What A Man Is To Do.\n\n[Chorus:]\nCause I Can't Breathe When You Talk To Me,\nI Can't Breathe When You're Touching Me\nI Suffocate When You're Away From Me \nSo Much Love You Take From Me\nI'm Going Out Of My Mind\n\nI Can't Breathe When You Talk To Me,\nI Cant Breathe When You're Touching Me\nI Suffocate When You're Away From Me \nSo Much Love You Take From Me\nI'm Going Out Of My Mind\n\nWhenever We Up In This Bed And My Finger Fall In Your Hair,\nI Wonder If You Feel Me Watching You\nCause I Can't Go A Night Without Your Lovin' \nGot Me Lookin At This Phone \nEverytime It Rings I Hope Its You (Girl)\nGot Me Bracin Through Ur Love (And I) I Ve Fallen For U \nI (Cant Lie) I Just Wanna Be With U\nAnd Yes She Got Me there I Said It\nSomebody Call The Paramedics \nTell Them To Hurry Up And Come Through. \n\n[Chorus: x2]\nCause I Can't Breathe (Cant Breathe) When you talk to Me \nAnd I Cant Breathe When you're Touching Me (When Your Touching Me)\nI Suffocate When You're Away From Me \nSo Much Love You Take From  Me \nI'm Going Out Of My Mind (I'm Going Out Of My Mind) \n\nI Can't Breathe When You Talk To Me \nI Can't Breathe When You're Touching Me\nI Suffocate When You're Away From Me \nSo Much Love You Take From Me \nI'm Going Out Of My Mind\ndon't Never Leave Me Girl I Need You \nInside My World I Can't Go A Day Without You \nAnd See Nobody Else Would Love But you \nI'll Never Feel Like I Feel With You Cause I\n\n[Chorus:]\nI Can't Breathe When You Talk To Me\nI Can't Breathe When You're Touching Me \n(cant breath when you're touching me )\nI Suffocate When You're Away From Me\nSo Much Love You Take From Me\nI'm Going Out Of My Mind ( I'm Going Out Of My Mind) \nI Cant Breathe When You're Touching Me (I Cant Breathe) \nSuffocate When You're Away From Me So Much Love You Take From Me.\nI'm Going Out Of My Mind (I'm Going Out Of My Mind).\nOuhh No No ... I Can't Breathe\nOuhh No No I Can't Breathe \nOuhh No No I Can't Breathe \nOuuhhhhhh Woo Ouhh \nOuhh No No I Cant Breathe \nOhh No No I Cant Breathe (I Cant Breathe)."}