{"rank":"51","song_id":"23554","song_name":"Sensual Seduction","artist_id":"279664","display_artist":"Snoop Dogg","spotify_id":"1wva1IlWLDNLgwipUWcmjy","lyrics":"I'm gonna take my time..\nShe gon' get hers before I...(before I)\nI'm gonna take it slow...\nI'm not gonna rush to stroll, so she can get a...\nSensual seduction, so I can get a...\nSensual seduction-duction\nSo we can get a sensual seduction-duction duction\nSensual seduction\n\nShe might be with him, but she's thinking 'bout me, me,meee,\nWe gon' go to the mall, we gon' go out to eat, eat, eeeeat,\nAnd all that we ever do is play in the sheets, sheets, sheets\nSmoke us a cigarette and go back to sleep, sleep,\nSleep, cause we den got a!\n\nSensual seduction-duction\nSensual seduction-duction ooh whoa!\nSensual seduction-duction duction\nSensual seduction-duction ooh whoa!\n\nI'm gonna take my time\nShe gon' get hers before I...\nI'm gonna take it slow... ow... oo... ow,\nI'm not gonna rush to stroll,\n\nIf ya don't know by know, doggy-dog is a freak, freak, freak!\nI keep a bad bitch with me seven days of the week,\nWeek, week!\nAnd all that we ever do is play in the sheets,sheets, sheets\nSmoke us a cigarette, and go back to sleep, sleep,\nSleep, cause we den got a\n\nSensual seduction-duction\nSensual seduction-duction ooh whoa!\nSensual seduction-duction duction\nSensual seduction-duction ooh whoa!\n\nI was all in da club sippin' some jin \nSmokin' on a benadrome\nWhen I peeped this little hoe out, \nI was all in a bum and drifter, \nShorty then came, then she hit da floor know, \nWith a see through dress, long hair\nLight brown eyes lookin like ms. bo peep \nAnd a nigga know if I take her home \nWith dem wide ass hips and you damn right I'm gon' be, so\nHot-uh!\nGoes da chick with da real pretty face, big ass booty and ity-bity\nWaist I whispered in her ear little mama what you\nDrink? I know you a freak,\nBut you know I ain't gon' say shit, see my game is\nOutrageous, I got it tippin crippin exchange some fuck faces, but it\nAin't no use to rush da bus\nCause I want her to have an eruption!\n\nSensual seduction-duction\nSensual seduction-duction ooh whoa!\nSensual seduction-duction duction\nSensual seduction-duction ooh whoa"}