{"rank":"79","song_id":"23753","song_name":"Game's Pain","artist_id":"1490221","display_artist":"The Game Featuring Keyshia Cole","spotify_id":"78IZoWbm5c2HUFM6eSYm7t","lyrics":"[Intro/Hook - Keyshia Cole]\nEyyy-yeaa\nYeeeaaaah\nHeeeey, yeah\nSee ever since the day I've got the chance to make a change\nI've been in this game, it's a new day\nAnd I'm makin it known cause, I just want the world to know\nI'm payin my dues, and I got the utmost, I just wanna let you know\nI'm payin homage cause, you've paved the way for meeee, ye-yeah\n\n[Verse 1: The Game]\nI swear to God, it feel like every day is my birthday\nLet the top down, California's my birthplace\nSo I'mma take you there like B.I.G took niggas to New York\n\"Juicy\" had us feelin like we was from New York\nAnd that's real shit, blazed the Philly\nIt's \"Summertime\", shout out to Will Smith\nCause who didn't wanna be the Fresh Prince?\nFlat top, gold chain and some fresh kicks\nMy nigga Nas told me \"Money Make the World go Round\"\nAnd Uncle Luke showed me how to make my girl go down\nI've been around Hip Hop since '85\nShe had her ups and downs but she stayed alive\nI used to think LL stood for \"Love LA\"\nHe from Queens, how the fuck he put that with Cool J?\nRed Kangol hat, red sweatsuit to match\nRed Adidas, nigga, Game is back\n\n[Hook: Keyshia Cole]\nAnd ever since the day I got the chance to make a change\nI've been in this game, it's a new day\nAnd I'm makin it known cause, I just want the world to know\nI'm payin my dues, and I got the utmost, I just wanna let you know\nI'm payin homage cause, you've paved the way for meeee, ye-yeah\n\n[Verse 2: The Game] (Keyshia Cole)\nPublic Enemy and N.W.A\nIs all my boombox had to say\n\"Today was a Good Day\" had the hood buzzin\nIce Cube my favorite rapper, y'all niggas can't tell me nothing\nEverybody first bootleg was \"Boyz N the Hood\"\nWhoever thought gangsta rap would make noise in the hood?\nWhen the cars ride by with the \"Boomin' System\"\nTwo door Mustang, and the roof was missin'\nEvery girl at your school had the new extensions\nEven gangstas was dancin' like New Edition\nCause the house parties stayed rockin all night\nNiggas came through and shot it up but it was alright (alright)\nCause after the cops left, it was a party then\nYou down with O.P.P.? Then bring Naughty in\nThey say \"It Never Rain in Southern California\", Tony! Toni! lied\nSit back, watch Game throw his money in the sky\n\n[Hook: Keyshia Cole]\nAnd ever since the day I got the chance to make a change\nI've been in this game, it's a new day\nAnd I'm makin it known cause, I just want the world to know\nI'm payin my dues, and I got the utmost, I just wanna let you know\nI'm payin homage cause, you've paved the way for meeee, ye-yeah\n\n[Verse 3: The Game]\nCash Rules Everything Around Me, C.R.E.A.M get the money\nIn the back, I relax with all the hunnies\nDJ bring it back, let it go\nMix it in with Black Rob, make 'em say \"WHOA!\"\nEverything full circle, Game livin' major\nGirls on my hip like a Skytel pager\nNow I'm on the top, let the champagne pop\nThrow ya hands in the sky cause The Game don't stop\nJust a little more change, gotta Benz and the Range\nEvery rap metaphor always ends in my name\nThe Kool Hercs, DJ Red Alerts\nBefore I was born they was talkin 'bout The Game\nAsk a Jay-Z fan 'bout Big Daddy Kane\nDon't know him, Game gonna show 'em\nJust like they showed me, my lyrics is O.G\nWhen it's all said and done, you niggas gon' quote me\n\n[Hook: Keyshia Cole]\nAnd ever since the day I got the chance to make a change\nI've been in this game, it's a new day\nAnd I'm makin it known cause, I just want the world to know\nI'm payin my dues, and I got the utmost, I just wanna let you know\nI'm payin homage cause, you've paved the way for meeee, ye-yeah\n\n[Outro: Keyshia Cole]\nSee, Mary J. I want you to understand\nYou paved the way (for me)\nI'm givin' homage (to you)"}