{"rank":"84","song_id":"23763","song_name":"Mr. Carter","artist_id":"307264","display_artist":"Lil Wayne Featuring Jay-Z","spotify_id":"2tQM1BUrXp2kqOM6mN11TC","lyrics":"[Produced by Infamous and Drew Correa]\n\n[Intro: Lil Wayne]\nYo, yo Drew and Inf\nThis-this, this right here is crazy\nYo I, I feel big, you know what I mean?\nLike, not, not big in the sense of, weight\nYou know what I mean? Like gainin' weight or nothin' like that\nLike colossal\nLike, know what I mean, like (sighs)\nI heard you were lookin' for me\n\n[Hook: Sha-Ron Prescott & Lil Wayne]\nHey, Mr. Carter (hello)\nTell me, where have you been? (Haha, you know, hehe)\nCause they've been asking, they've been searching\nThey've been wondering why (I know, haha)\nHey, Mr. Carter (hey, hello)\nTell me, where have you been? (Shit, you know)\nCause they've been asking, they've been searching\nThey've been wondering why (hahahah)\n\n[Verse 1: Lil Wayne]\nYeah, to you forever, from me to you\nI heard somebody say \"Church\", I'ma need a suit\nI'ma need a coupe, I won't need a roof\nFlyer than Beetlejuice, Beetlejuice, Beetlejuice\nI got the flow, I'm tryin' to see the roof\nDidn't wear a bulletproof so I got shot and you can see the proof\nBlind eyes could look at me and see the truth\nWonder if Stevie do?\nBut I'ma leave it to\nGod, not Beaver, neither you\nCause I'ma murder Y, kill O, and even U\nMan, I got Summer hatin' on me cause I'm hotter than the Sun\nGot Spring hatin' on me 'cause I ain't never sprung\nWinter hatin' on me 'cause I'm colder than y'all\nAnd I will never, I will never, I will never Fall\nI'm being hated by the seasons\nSo fuck y'all who hatin' for no reason\n\n[Hook: Sha-Ron Prescott & Lil Wayne]\nHey, Mr. Carter (I am him!)\nTell me, where have you been?\nAround the world and I'm back again!\nCause they've been asking, they've been searching\nWho's been askin' about me?\nThey've been wondering why (in case you wonderin', hah!)\nHey, Mr. Carter (I am him!)\nTell me, where have you been?\nAround the world now I'm back again!\nCause they've been asking, they've been searching\nWho's been askin' about me?\nThey've been wondering why (in case you wonderin', hah!)\n\n[Verse 2: Lil Wayne]\nYeah, I been in and out the bank, bitch\nWhile y'all asshole niggas been on the same shit\nI flush and watch 'em go down the drain quick\nTwo words you never hear: \"Wayne quit!\"\nCause Wayne win, and they lose\nI call them April babies, cause they fools\nAnd when they snooze, we up!\nFeet up, like a parapleguc\nOr paraplegic? I parallel park\nIn that red-and-yellow thing; old school Atlanta Hawk\nLike I'm from College Park, but I'm from Hollygrove\nNow all my Bloods scream \"Soo-woo and \"Da-da-do\"\nI know my role and I play it well\nAnd I weigh it well, on my Libra scale\nI suck a pussy, fuck a pussy, leave it there\nLong hair, don't even care\n\n[Hook: Sha-ron Prescott & Jay-Z]\nHey, Mr. Carter (Young! I am him)\nTell me, where have you been?\nAround the world now I'm back again\nCause they've been asking, they've been searching\nWho's been askin' about me?\nThey've been wondering why (in case you wonderin')\nHey, Mr. Carter (I am him)\nTell me, where have you been?\nAround the world now I'm back again\nCause they've been asking, they've been searching\nWho's been askin' about me?\nThey've been wondering why (in case you wonderin', chyeah)\n\n[Verse 3: Jay-Z]\nI'm right here in my chair with my crown and my dear\nQueen B, as I share, mic time with my heir\nYoung Carter, go farther, go further, go harder\nIs that not why we came? And if not, then why bother?\nShow no mercy in Murcielagos\nI'm far from bein' the bastard that Marcy had fathered\nNow my name's been mentioned with the martyrs\nThe Biggies and the Pacs and the Marleys and the Marcuses\nGarvey; got me a molotov-cocktail flow\nEven if you box well, can't stop the blows\nKaboom! The Roc Boy in the room\nThe dope boy I just came off the spoon\nAlso, I'm so fly I'm on auto-\nPilot, while guys just stare at my wardrobe\nI see Euros, that's right: plural\nI took so much change from this rap game, it's your go\n(Hey Mr. Carter) Young!\n\n[Verse 4: Lil Wayne]\nIt's my go, yeah…\nAnd I'ma go so opposite of soft\nOff the richter, Hector, Camacho Man, Randy Savage\nFar from average, above status–quo\nFlow so pro\nI know, I ride slow, and when I pass\nThey say, \"What up, killa?\" Man, stop bringin' up my past\nAnd next time you mention Pac, Biggie, or Jay-Z\nDon't forget Weezy, baby!\n\n[Hook: Sha-Ron Prescott, Lil Wayne & Choir]\nHey, Mr. Carter (amen)\nTell me, where have you been? (Yeah)\nCause they've been asking, they've been searching\nThey've been wondering why (haha)\nHey, Mr. Carter (amen)\nTell me, where have you been? (Hova!)\nCause they've been asking, they've been searching (Weezy)\nThey've been wondering why (baby!)\nHey, Mr. Carter (hahaha)\nTell me, where have you been? (I been hustlin')\nCause they've been asking, they've been searching (hustlin' hard)\nThey've been wondering why (chyeah!)\nHey, Mr. Carter\nTell me, where have you been?\nCause they've been asking, they've been searching\nThey've been wondering why\n\n[Outro: Lil Wayne]\nAnd I swear to everything, when I leave this Earth\nIt's gonna be on both feet, never knees in the dirt\nAnd you can try me, fucker, but when I squeeze, it hurt\nAhh, we'll lose two lives: yours and mine\nGive me any amount of time, don't let Ms. Carter grieve\nAt the funeral parlor, drippin' tears down my sleeve\nGive me any amount of time, don't let Ms. Carter grieve"}