{"rank":"100","song_id":"23771","song_name":"Never Would Have Made It","artist_id":"309820","display_artist":"Marvin Sapp","spotify_id":"3QdBvvYJ9k1CES1e9aYvaA","lyrics":"Never would have made it, never could have made it, without you\nI would have lost it all, but now I see how you were there for me\n\nAnd I can say\nNever would have made it,\nNever could have made it,\nWithout you\n\nI would have lost it all,\nBut I now how I see how you were there for me and I can say\nI'm stronger, I'm wiser, I'm better,\nmuch better,\n\nWhen I look back over all you brought me thru.\nI can see that you were the one that I held on to\nAnd I never\nChorus Never would have made it\n\nOh I never could have made it\nChorus Never could have made it without you\n\nOh I would have lost it all, oh but now I see how you were there for me\n\nI never\nChorus - Never would have made it\n\nNo, I never\nChorus - Never could have made it without you\n\nI would have lost my mind a long time ago, if it had not been for you.\nI am stronger\nChorus – I am stronger\n\nI am wiser\nChorus – I am wiser\n\nNow I am better\nChorus – I am better\n\nSo much better\nChorus – I am better\n\nI made it thru my storm and my test because you were there to carry me thru my mess\n\nI am stronger\nChorus – I am stronger\n\nI am wiser\nChorus – I am wiser\n\nI am better\nChorus – I am better\n\nAnybody better\nChorus – I am better\n\nI can stand here and tell you, I made it. Anybody out there that you made it\n\nI am stronger\nChorus – I am stronger\n\nI am wiser\nChorus – I am wiser\n\nI am better\nChorus – I am better\n\nMuch better\nChorus – I am better\n\nI made it, I made it, I made it, I made it, I made it, I made it, I made it, I made it\n\nAnd I never would have made it\nChorus Never would have made it\n\nNever could have made it\nChorus Never could have made it without you\n\nI would have lost my mind, I would have gave up, but you were right there, you were right there\n\nI never\nChorus Never would have made it\n\nOh I never\nChorus - I never could have made it without you.\n\nSomeone need to testify next to them and tell them I am stronger, I am wiser, I am better, much better. When I look back over what he brought me thru. I realize that I made it because I had you to hold on to, now I am stronger, now I am wiser, I am better, so much better. I made it. Is there anybody in this house other than me that can declare that you made it. Tell your neighbor, never would have made it. Never would have made it. Never could have made it. Never could have made it without you. Never would have made it. Never would have made it. Never could have made it. Never could have made it without you"}