{"rank":"58","song_id":"23856","song_name":"T-Shirt","artist_id":"279174","display_artist":"Shontelle","spotify_id":"0m0FYyIbSDiASOlQ64GDO5","lyrics":"hey, let me tell you know.\r\nohhhh baby.\r\ntrying to decide, trying to decide if i, really wanna go out tonight.\r\ni never used to go out without ya, not sure i remember how to.\r\ngonna be late gonna be late but, all my girls gon have to wait cause, i don't know if i like my outfit.\r\ni tried everything in my closet.\r\n\r\nnothing feels right when im not with you, sick of this dress and these Jimmy Choos.\r\ntaking them off cause i feel a fool, trying to dress up when im missing you.\r\nima step out of this lingerie, curl up in a ball with something Hanes.\r\nin bed i lay, with nothing but your T-shirt on.\r\noh, with nothing but your T-shirt on. \r\n\r\nhey, gotta be strong gotta be strong but i'm, really hurting now that you're gone.\r\ni thought maybe i'd do some shopping, but i couldn't get past the door and, now i don't know now i don't know if i'm, ever really gonna let you go and i, couldn't even leave my apartment.\r\nim stripped down torn up about it.\r\n\r\nnothing feels right when im not with you, sick of this dress and these Jimmy Choos.\r\ntaking them off cause i feel a fool, trying to dress up when im missing you.\r\nima step out of this lingerie, curl up in a ball with something Hanes.\r\nin bed i lay, with nothing but your T-shirt on.\r\n(i'm all by myself with)with nothing but your T-shirt on\r\nohhh, with nothing but your T-shirt on\r\n(cause i miss you, cause i miss you) with nothing but your T-shirt on.\r\n(said i miss you baby)\r\n\r\ntrying to decide, trying to decide if i, really wanna go out tonight.\r\ni couldn't even leave my apartment, i'm stripped down torn up about it.\r\n\r\nnothing feels right when im not with you, sick of this dress and these Jimmy Choos.\r\ntaking them off cause i feel a fool, trying to dress up when im missing you.\r\nima step out of this lingerie, curl up in a ball with something Hanes.\r\nin bed i lay.\r\nhey hey, nothing feels right when im not with you. \r\nsick of this dress and these Jimmy Choos.\r\ntaking them off cause i feel a fool, trying to dress up when im mising you.(cause i miss you)\r\nima step out of this lingerie, curl up in a ball with something Hanes.\r\nin bed i lay,(i would be in bed)with nothing but your T-shirt on.\r\nsaid i got nothing but your T-shirt on.\r\nhey,(cause i want to be close to you), with nothing but your T-shirt on.\r\ni remember when, you would like to see me, with nothing but your T-shirt on.\r\nhey,(nothing but your T-shirt on) \r\nlet me tell you know (nothing but your T-shirt on)\r\nwith nothing but your T-shirt on."}