{"rank":"5","song_id":"23861","song_name":"Swagga Like Us","artist_id":null,"display_artist":"Jay-Z & T.I. Featuring Kanye West & Lil Wayne","spotify_id":"1A35w9OSTTVXw3c6tj6AiV","lyrics":"[Chorus: M.I.A.]\nNo one on the corner has swagger like us\nSwagger like us, swagger-swagger like us\n\n[Verse 1: Kanye West]\nMr. West is in the buildin'\nSwagger on a hundred thousand trillion\nAyo, I know I got it first\nI'm Christopher Columbus, y'all just the Pilgrims\nThanksgiving, do we even got a question?\nHermes, Pastelle, I pass the dressin'\nMy attitude is tattooed, that mean it's permanent\nSo I guess we should address it, huh?\nMy swagger is Mick Jagger\nEvery time I breathe on a track, I asthma attack it\n\"Why you so mad for? Why you gotta have it?\"\n‘Cause I slaved my whole life, now I'm the master\nNaaaaa-na-naaaaa\nHow it feel to wake up and be the shit and the urine\nNaaaaa-na-naaaaa\nTryin' to get that Kobe number, one over Jordan\n\n[Chorus: M.I.A.]\nNo one on the corner has swagger like us\nSwagger like us, swagger-swagger like us\n\n[Verse 2: JAY Z]\n(No one on the corner…) Got a bop like this\nCan't wear skinny jeans, ‘cause my knots don't fit\nNo one on the corner got a pocket like this\nSo I rock Roc jeans, ‘cause my knots so thick\nYou can learn how to dress just by checkin' my fresh\nCheckin', checkin' my fresh; checkin', checkin' my fresh\nFollow my steps is the road to success\nWhere the niggas know you're thorough when the girls say yes\n(Yes) – but I can't teach you my swag\nYou can pay for school, but you can't buy class\nSchool of hard knocks, I'm a grad\nAnd that all-blue Yankee is my graduation cap\nIt's Hooooovaaaah\nDippin' different Rovers, whippin' with the soda\nHooooovaaaah\nDid you even have any doubt? After Doubt it was over\n\n[Chorus: M.I.A.]\nNo one on the corner has swagger like us\nSwagger like us, swagger-swagger like us\n\n[Verse 3: Lil Wayne]\nNo one on the corner has swagger like moi\nChurch, but I'm too clean for the choir\nI require what I desire, I got stripes: Adidas\nMamis scream, \"¡Papi, no más!\"\nRun up in your shit, just me, no más\nRunnin' this shit like I got four thighs\nNo one has swagger like these four guys\nNow when it comes to styles, I got several\nSharper than the swag or dagger all metal\nAnd my jewels blue and yellow\nThe type of shit that make 'em call you Carmelo\nRules as follows stay true to the ghetto\nWrite your name on the bullet, make you feel special\nHa! What the fuck you boys talkin' 'bout?\nI know it's us, ‘cause we the only thing to talk about\n\n[Chorus: M.I.A.]\nNo one on the corner has swagger like us\nSwagger like us, swagger-swagger like us\n\n[Verse 4: T.I.]\nYou can go see Weezy for the wordplay\nJeezy for the bird play\nKanyeezy for diversity, and me for controversy\nAll my verses picture perfect, only spit to serve a purpose\nYou ain't livin' what you kickin', then you worthless\nLookin' from the surface it may seem\nLike I got reason to be nervous\nThen observe my work to see that my adversity was worth it\nVerses autobiographical, absolutely classical\nLast thing I'm worried about is what another rapper do\nAin't nobody hot as me\nEven if they rap they ass off, blast off, and have outstandin' quality\nSell a lot of records, I'll respect it and salute that\nBut spittin' real life on hot beats I'm the truth at\nYou kick it like me, no exaggeration necessary\nLivin' revolutionary, nothin' less than legendary\nGangsta shit hereditary, got it from my dad\nFlow colder than February, with extraordinary swag\n\n[Chorus: M.I.A.]\nNo one on the corner has swagger like us\nSwagger like us, swagger-swagger like us"}