{"rank":"80","song_id":"23881","song_name":"Live Your Life","artist_id":"277486","display_artist":"T.I. Featuring Rihanna","spotify_id":"16GHcGtW9Io7AuVdNmTjv3","lyrics":"[Sample x4 (over intro)]\nMiya hee, miya ho, miya hu, miya ha-ha\n\n[Intro: T.I.]\nAy... this a special what's happenin to all my\nAll my soldiers over there in Iraq\nE'rybody right here\nWhat you need to do is be thankful for the life you got, y'knowmsayin?\nStop lookin at what you ain't got\nStart bein thankful for what you do got\nLet's give it to 'em baby girl, hey\n\n[Hook: Rihanna]\nYou're gonna be, a shinin star\nIn fancy clothes, and fancy car-ars\nAnd then you'll see, you're gonna go far\nCause everyone knows, just who ya are-are\nSo live your life (AYY! Ayyy ayyy ayyy)\nYou steady chasin that paper\nJust live your life (OHH! Ayyy ayyy ayyy)\nAin't got no time for no haters\nJust live your life (AYY! Ayyy ayyy ayyy)\nNo tellin where it'll take ya\nJust live your life (OHH! Ayyy ayyy ayyy)\nCause I'm a paper chaser\nJust livin my life (AYY) my life (OHH)\nMy life (AYY) my life (OHH)\nJust livin my life (AYY) my life (OHH)\nMy life (AYY) my life (OHH) just livin my life\n\n[Verse 1: T.I.]\nHey, never mind what haters say, ignore 'em 'til they fade away\nAmazing they ungrateful after all the game I gave away\nSafe to say I paved the way for you cats to get paid today\nYou'd still be wastin days away now had I never saved the day\nConsider them my protege, homage I think they should pay\nInstead of bein gracious they violate in a major way\nI never been a hater, still I love 'em in a crazy way\nSome say they sold the yay' you know they couldn't get work on Labor Day\nIt ain't that black and white, it has an area the shade of gray\nI'm Westside anyway, even if I left today and stayed away\nSome move away to make a way, not move away cause they afraid\nI brought back to the hood, and all you ever did was take away\nI pray for patience but they make me wanna melt they face away\nLike I once made 'em spray, now I could make 'em put the K's away\nBeen thuggin all my life, can't say I don't deserve to take a break\nYou'd rather see me catch a case and watch my future fade away\n\n[Hook: Rihanna]\nYou're gonna be, a shinin star\nIn fancy clothes, and fancy car-ars\nAnd then you'll see, you're gonna go far\nCause everyone knows, just who ya are-are\nSo live your life (AYY! Ayyy ayyy ayyy)\n[You steady chasin that paper]\nJust live your life (AYY! Ayyy ayyy ayyy)\nAin't got no time for no haters\nJust live your life (AYY! Ayyy ayyy ayyy)\nNo tellin where it'll take ya\nJust live your life (OHH! Ayyy ayyy ayyy)\nCause I'm a paper chaser\nJust livin my life (AYY) my life (OHH)\nMy life (AYY) my life (OHH)\nJust livin my life (AYY) my life (OHH)\nMy life (AYY) my life (OHH) just livin my life\n\n[Verse 2: T.I.]\nI'm the opposite of moderate, immaculately polished with\nThe spirit of a hustler and the swagger of a college kid\nAllergic to the counterfeit, impartial to the politics\nArticulate, but still'll grab a nigga by the collar quick\nWhoever havin problems with their record sales just holler Tip\nIf that don't work and all else fails then turn around and follow Tip\nI got love for the game, but ay I'm not in love with all of it\nCould do without the fame, and rappers nowadays are comedy\nThe hootin and the hollerin, back and forth with the arguin\nWhere you from, who you know, what you make and what kind of car you in\nSeems as though you lost sight of what's important when depositin\nThem checks into your bank account, and you up out of poverty\nYour values is a disarray, prioritizin horribly\nUnhappy with the riches cause you're piss poor morally\nIgnorin' all prior advice and forewarnin'\nAnd we mighty full of ourselves all of a sudden, aren't we?\n\n[Hook: Rihanna]\nYou're gonna be, a shinin star\nIn fancy clothes, and fancy car-ars\nAnd then you'll see, you're gonna go far\nCause everyone knows, just who ya are-are\nSo live your life (AYY! Ayyy ayyy ayyy)\nYou steady chasin that paper\nJust live your life (AYY! Ayyy ayyy ayyy)\nAin't got no time for no haters\nJust live your life (AYY! Ayyy ayyy ayyy)\nNo tellin where it'll take ya\nJust live your life (OHH! Ayyy ayyy ayyy)\nCause I'm a paper chaser\nJust livin my life (AYY) my life (OHH)\nMy life (AYY) my life (OHH)\nJust livin my life (AYY) my life (OHH)\nMy life (AYY) my life (OHH) just livin my life\n\n[Bridge: Rihanna]\nGot everybody watchin what I do, come walk in my shoes\nAnd see the way I'm livin if you really want to\nGot my mind on my money\nAnd I'm not goin awayyyyyyy\nSo keep on gettin your paper, and keep on climbin\nLook in the mirror, and keep on shinin (shinin)\nUntil the game ends, 'til the clock stop\nWe gon' post up on the top spot\nLivin the life, the life\nIn the Windmill City got my whole team with me\nThe life, my life\nI do it how I wanna do\nI'm livin my life, my life\nI will never lose\nI'm livin my life, my liiiife\nAnd I'll never stop it\n\n[Sample]\n{\"Miya hee, miya ho, miya hu, miya ha-ha\" - *repeat 4X*}\n\n[Outro: Just Blaze]\nSo live your life"}