{"rank":"58","song_id":"23900","song_name":"Bust Your Windows","artist_id":"304318","display_artist":"Jazmine Sullivan","spotify_id":"56z2qI0gKcPthQF6l8AW3E","lyrics":"I bust the windows out your car\nAnd no it didn't mend my broken heart\nI'll probably always had these ugly scars\nbut right now I don't care about that part.\n\nI bust the windows out your car\nAfter I saw you laying next to her\nI didn't wanna but I took my turn\nI'm glad I did it cause you had to learn\n\nI must admit it helped a little bit\nTo think of how you feel when you saw it\nI didn't know that I had that much strength\nBut I'm glad you see what happens when\nYou see you can't just play with peoples feelings\nTell them you love them and don't mean it\nyou'll probably say that it was juvenile\nBut I think that I deserve to smile\n\nI bust the windows out you car\nYou know I did it cause I left my mark\nCarved my initials with a crowbar\nAnd then I drove up into the door\n\nI bust the windows out Your car\nyou should feel lucky that was all I did\nAfter 5 whole years of this bullshit\nGave you all of me and you played with it\n\nI must admit it helped a little bit\nTo think of how you feel when you saw it\nI didn't know that I had that much strength\nBut I'm glad you see what happens when\nYou see you cant just play with peoples feelings\nTell them you love them and don't mean it\nYou probably say that it was juvenile\nBut I think that I deserve to smile\n\nBust Windows out Your car\nBut it don't come back to my broken heart\nYou could neva feel I how I felt that day\nUntil it happens baby you don't know pain\nOoh Yeah I did it (yeah I did it)\nYou should know it (you should kno it)\nI ain't sorry (I ain't sorry)\nYou deserved it (you deserved it)\nAfter what you did to me (after what you did)\nYou deserve it (you deserve it)\nI ain't sorry no no (I ain't sorry)\nYou broke my heart so\nI broke you car\nYou caused me pain (you caused me pain)\nSo I did the same\nEven though what you did to me was much worse\nI had to do something to make you hurt\nOh but why am I still crying?\nWhy am I the one who's still crying?\nOh oh you really hurt me baby\nYou really you really hurt me baby\n\nHey hey hey hey hey\nNow watch me, you\nNow watch me, you\nOooh I bust the windows out your car."}