{"rank":"94","song_id":"23924","song_name":"Did You Wrong","artist_id":null,"display_artist":"Pleasure P.","spotify_id":"5klW2KKu4GaHWfTR01ywrj","lyrics":"You know I want ya?ll to just sit back and think\nFor a second you know what I mean\nThere's a lot of haters out there hatin? on people relationships and stuff\nDon?t nobody wanna see you happy they always trynna take ya joy\nBring you down\n(No no no no noo)\n\nBut you gotta be the one to stick by yo mate\nAnd say I?ma be with you no matta what u know what I?m sayin?\nFuck it I did wrong you did wrong too, you know what I?m sayin? but\nWe gotta put up with each otha shit the easiest thing to do is leave\nYa dig? Anyway check dis out\n\nI don?t wanna lose this relationship, so we\nGotta stay strong don?t wanna move on\nI know you sick and tired of the fussin? and da fightin? and da cussin?\nBut I love you and you love me too\n\nI did you wrong you did me wrong\nI take you back you take me back\nI did you wrong girl you did me wrong girl\nI take you back I take you back, yea yea\n\nNo matta what you do, no matta what you say\nNo matta how far you go, don?t take your love away\nBecause I love you and girl I want you\nAnd girl I need you, so let's just work it out\n\nI ain?t trynna waste your time and I ain?t trynna waste my time\nAnd ain?t no need to waste no time, 'cause we done put in too much time\nI ain?t trynna waste your time and I ain?t trynna waste my time\nAnd ain?t no need to waste no time, 'cause we done put in too much time\n\nWhen you're in a relationship, the easiest thing for you to do is to leave\nYou gotta stick it out and work it out and stick it out and work it out\nAnd stick it out 'cause at the end of the day\n\nI did you wrong you did me wrong\nI take you back you take me back\nI did you wrong girl you did me wrong girl\nI take you back I take you back, yea yea\n\nNo matta what you do, no matta what you say\nNo matta how far you go, don?t take your love away\nBecause I love you and girl I want you\nAnd girl I need you, so let's just work it out\n\nI love you baby, I need you in my life you know what I?m sayin?\nI?m sick and tired of the arguing and all that good stuff\nI mean I?m pleading on this track because I really really love you\nAnd I really want us to work it out\n\nAnd um you know I wanna marry you baby\nYou know I want you to be in my life for the rest of my life\nYou know what I?m sayin', anyway\nI?m just talkin? a whole lot of gibber gabber\n\nBut um being without you is like the moon without the sun\nAnd the sun without the moon and Pleasure P without Pretty Ricky and\nYou know what I?m sayin?, a blunt with no no dro\nEcstacy with no body, know what I?m sayin\nYou get what I?m sayin baby, you dig, iight you dig\nHolla at ya boy, I love you\n\nI did you wrong you did me wrong\nI take you back you take me back\nI did you wrong girl you did me wrong girl\nI take you back I take you back, yea yea\n\nNo matta what you do, no matta what you say\nNo matta how far you go, don?t take your love away\nBecause I love you and girl I want you\nAnd girl I need you, so let's just work it out"}