{"rank":"54","song_id":"23929","song_name":"One More Drink","artist_id":null,"display_artist":"Ludacris Co-Starring T-Pain","spotify_id":"3XrYVxmqDEFU725or3B59w","lyrics":"[Ludacris]\nIt was Friday night and I was feelin aight (yup)\nDowntown Atlanta, big city, bright lights\nMixin Henny with the Sprite while I'm drinkin and drivin\nNo police lights (lights) no police sirens\nI'm headed to the club, lookin for a freak (freak)\nTo spread a little love and spread a couple cheeks (cheeks)\nPull up to the spot 26's like BAM!\nEyes on me like, \"Bitch do you SEE 'EM?\"\nStrolled through the front do' headed to the VIP (VIP)\nBought a couple bottles and I took a couple sips (sips)\nScopin out the room, and what do I SEE?\nA nice round butt, and a pair of double D's!\nSo I crept up like, \"Shorty what's happenin\nYou killin that dress and I love it with a passion\"\nThen she turned around and her face was aight\nShe had a gap tooth and a mean overbite, but I was like hmmmm\n\n[Hook: T-Pain]\nYeah yeah; if I take one more drink, I'm gon' end up fuckin you\nIs that what you wanna do, shorty?\nIf I take one more drink, I'm gon' end up fuckin you\nYou too, ooh ooh ooooh\n\n[Ludacris]\nWoke up the next mornin and all I can remember\nWas takin shots and tippin the bartender\nSurrendered to the woman end up bringin me home\nCause she started lookin better every shot of Patron, yup!\nI jumped up with a devilish grin\nCause tonight, damn right I might do it again\nSo I called up the homies (whattup) let's ride\nWe can hit the sports bar over on the Southside (aight)\nGet a couple of Coronas, couple of limes (yup)\nWent up to the bar and saw a couple of dimes\nSo I, slowly walked up and said hi\nMy name's Ludacris and I'm a hell of a guy\nOne said \"I know who you are, I'm your number one fan\nAnd right now it's too bad I got a man\"\nAnd I said I understand (I understand)\nBut where the hell is he at cause in a minute if he don't show up then mannnnn\n\n[Hook]\n\n[Ludacris] Uh-huh huh, ay Pain holla at 'em right quick man\n\n[T-Pain] + (Ludacris)\nYeah, you gon' get in trouble with yo' man girl\n(Don't get in trouble girl)\nTalkin 'bout how you're my biggest fan girl (I know it, I know it!)\nNow I don't wanna do (please) what you're gon' make me do\n(Don't make me do it, don't make me do it!)\nBut I, if I have more drink\n\n[Ludacris]\nOne mo' drink I'mma get ya home then I'll split ya\nGrab the camera phone and take a bunch of drunk pictures\nCause Hennessy mixed with a whole bunch of buddah\nEquals you mixed with a whole bunch of Luda\nAnd you know how far one drink could go\nStart slurrin my speech slowin up the flow\nHikin up ya skirt, climbin up ya shirt\nIt's Mr. Late Night Luda and I like to flirt\nSo guess what baby girl!\n\n[Hook]\n\n[Ludacris - over Hook]\nJust one mo', that's all it's gon' take\nWho else, T-Pain?\n\n[Outro: Ludacris]\nHa ha ha, you hear what I'm sayin?\nPeople too picky these days, damnit\nToo tall, too short, too fat, too skinny\nHave a couple of drinks and quit discriminatin\nThis has been a Luda Service Announcement\nDeuces, ha ha ha ha"}