{"rank":"85","song_id":"23957","song_name":"Playa Cardz Right","artist_id":"305806","display_artist":"Keyshia Cole Featuring 2Pac","spotify_id":"0nJZDtAaqO7o9mb6YoBfqO","lyrics":"[Intro: 2Pac]\nWassup, boo? Yeah\nHahahaha, yeah\n\n[Verse 1: 2Pac]\nAnother shady mission\nTricks, like watching pictures in hazy vision\nTonight is love making, take you any place you wish\nToday we're satisfied, yesterday we've stolen kisses\nBlind insanity, perfect pictures of me and my family\nNot understanding the destiny, had they planned for me?\nIf I have kids, will I live to see them grow?\nThough I don't know\nI live the life of a thug nigga until the day I go\nNo broken promises, a sacred bond broken\nI know I die alone, but yet and still I'm hopin'\nVisions of prisons, maybe I'll be forgiven\nI know it's better in Heaven, ‘cause being here ain't livin'\nClose my eyes and see nothing but pain, the world is crazy\nStill, looking for a queen to plant seeds and have babies\nMaybe I'll be the one or just maybe I'm lost\nYou'll never know being cautious, if you play your cards right\n\n[Hook: Keyshia Cole]\nI wanna be the one who\nWho you can depend on who\nWho be the one who be there\nThrough the thick and thin\nGo by the water we will\nBe there 'til the morning\nWe won't leave until the night\nAnd we will be forever more\n\n[Verse 2: Keyshia Cole]\nNo one else can do what you do for me\nTake me away from the pain I feel inside\nAnd it's gonna be alright and it'll be ok\nIf we try and take our time\nYes, baby, take our time\nAnd we'll grow, trust I know\nI wanna be the one whoooo…\n\n[Hook: Keyshia Cole]\nI wanna be the one who\nWho you can depend on who\nWho be the one who be there\nThrough the thick and thin\nGo by the water we will\nBe there 'til the morning\nWe won't leave until the night\nAnd we will be forever more\n\n[Interlude: 2Pac + (Keyshia Cole)]\nYou got to play your cards right on one (Ooooh, yeah)\nCan't be rushing like it's a race, nomsayin'? (No, no, no)\nIf you be patient, and you take your time (Be patient, baby)\nAnd you finesse it, 9 times out of 10 times (10)\nHomeboy, you gon' wake up with your breakfast in bed\nBut if you rush and you just be manhandlin'\nHaha (Heyy, it takes a real man)\nYour ass is going home tonight, haha (Heyy)\nPlay your cards right, nigga, take your time (Be the one)\nBe patient (Be the one, heeeyy)\nGo slow, it's better that way, you ain't heard? (Yeah)\nHaha, play your cards right (Be the one, I wanna be the one)\n\n[Hook: Keyshia Cole]\nI wanna be the one who\nWho you can depend on who\nWho be the one who be there\nThrough the thick and thin\nGo by the water we will\nBe there 'til the morning\nWe won't leave until the night\nAnd we will be forever more\n\n[Outro: 2Pac + (Keyshia Cole)]\nTake your time, man (Take your time)\nDon't be in such a rush (In a rush)\nHaha (Be forever more)\nYou got to be patient, man, be patient\nIt ain't going nowhere one, haha (Nowhere)\nGet some champagne (Haha, be forever more)\nBring some roses or somethin', you know\nPlay some soft shit, light a fire (Luther Vandross)\nYou got to be cool with it (Teddy, Teddy)\nYou got to be slow with it (Ooooh, be so)\nYou got to be patient, you got to play your cards right on one\nCan't be rushing like it's a race, nomsayin'?\nIf you be patient, and you take you time and you finesse it"}