{"rank":"65","song_id":"23969","song_name":"Last Of A Dying Breed","artist_id":null,"display_artist":"Ludacris Co-Starring Lil Wayne","spotify_id":"7bfeBFXgTwQ31hCkS2rcfB","lyrics":"[Ludacris]\n(Aowwww!) Luda!\nI done killed so many niggas in the booth I sell rappers on eBay (hey!)\nCause every one of my verses been instant like replays (hey!)\nSpeakers get blown like candles on yo' B-day (hey!)\nCause Luda's catalog got mo' records than the DJ (woo!)\nThe bank yells \"MAYDAY\" cause every day's a payday\nI put it on tape and then I'll sell it like Ray J\nBut not out the sto' (nope) straight to the buyer\nCause I slung 'em out my trunk like the D.C. sniper\nAnd six albums later you'll deposit every word\n'Til your memory bank gives me the credit I deserve\nTop 5, damn right! But really it just hit me\nThat three of yo' top 5's too scared to FUCK with me (woo!)\nSo how can I advance if you don't give me no opponents? (yeah)\nHow can you see the future if you livin for the moment? (yeah)\nHip-Hop couldn't die, I never offer my condolence\nBut I'll offer y'all a day of atonement - cause\n\n[Hook One: Ludacris] {w/ scratches by DJ Jaycee}\nI'm a lyricist to the death, so I got what you need\nLudacris, I'm the last of a dyin breed\nAnd we almost extinct, so I'm sayin it loud\nSay it with me: MC means move the crowd (3x)\n{scratches: \"M-MC means move, means move... m-move... move the crowd\"}\n\n[Lil Wayne]\nI got it baby!\nAnd I'm an MC, I move the crowd like Moses\nLike the Red Sea I wear red like roses\nGo against me and you'll be dead like roses\nSpittin at your head, full of bread like toasters\nNever had a holster, I keep it on my lap\nAnd hip-hop ain't dead, it just had a heart attack\nBut you see I keep it pumpin', yeah I got that heart back\nSo just call me Lil Carter, or Lil Cardiac\nPrecious like an artifact, valuable like a quarterback\nHannibal like they call me Jack, throwback like a Starter hat\nNow how did he thought of that? I mean how did he think of that?\nI mean how did I think of that? Now like a rental, bring it back\nI mean how did I think of that? I surprise myself sometimes\nSomeone should throw me a surprise party for every rhyme\nEvery time I do it, I do it dirty like swine\nFor the dirty and five, hip-hop, I'm alive!\n\n[Hook Two: Lil Wayne, Ludacris] {w/ scratches by DJ Jaycee}\nI'm a lyricist to the death and I got what you need\nWeezy F, the last of a dyin breed\nAnd we almost extinct, so I'm sayin it loud\nSay it with me MC means move the crowd (3x)\n{*scratches: \"M-MC means move, means move... m-move... move the crowd\"*}\n\n[Ludacris]\n(Aowwwww!) They say O'Reilly don't like him (nope), Oprah won't invite him (nope)\nThe president denounced him (yeah) no one will announce him (no!)\nControversial lyrics like I'm cryin for help\nI'm very talented, but I should be ashamed of myself (woo!)\nBut this is my art (art) this is my music (hey!)\nI'm speakin from the heart, hit record and I'll lose it!\nBite my tongue for no one, I'll put you on blast (blast)\nSo all the news channels, y'all could kiss my ass!\nAnd if I dish it I could take it, fix it if you break it\nCould hit rock bottom and I'm STILL gon' make it (why?)\nCause I'm a born hustler, natural survivor\nSeed of a gangsta, I put that on my father\nYouTube or Google me, turn it up and play it (hey!)\nCause many people think it, I just had the balls to say it (what?)\nAnd risk losin everything, I stand for the weak\nPlus I live for my freedom of speech - cause\n\n[Hook One]"}