{"song_name":"Move (If You 'W'anna)","artist_id":276877,"display_artist":"Mims","spotify_id":"null","lyrics":"[Intro]\nLet's get it! Ha Ha! I know you like\nwonderin right now like, what the hell is this right?\nHeh heh heh heh!!! I guess you 'bout to see right now\n\n{*bell rings*}\n\n[Chorus]\nMove if you wanna if you wanna if you wanna\nMove-Move if you wanna if you wanna if you wanna\nMove-Move if you wanna if you wanna if you wanna\nMove-Move if you wanna move-move if you wanna move\nMOVE IF YOU WANNA IF YOU WANNA IF YOU WANNA\nMOVE-MOVE IF YOU WANNA IF YOU WANNA IF YOU WANNA\nMOVE-MOVE IF YOU WANNA IF YOU WANNA IF YOU WANNA\nMOVE-MOVE IF YOU WANNA IF YOU WANNA IF YOU WANNA MOVE\n\nI don't undrestand how can I have so many haters\nKnowin I'm there father like my name is Darth Vader\nI can get you hemmed up while I'm bein taylored\nThen I slide off to the side like a fader\nHOMEY I'M THE PRESIDENT, GOVERNOR AND MAYOR\nI CONTROL EVERYTHING, LIKE A DICTATOR\nGET YOU BIZ MARKED UP, TURN YOU INTO VAPORS\nIF YOU GOT A PROBLEM GET YOU SWALLOWED LIKE A CHASER\nModel on my arm no homey I don't have to pay her\nAll I have to do is tell her where I wanna take her\nCatch us out in Italy, then we in Jamaica\nCaught up in the rapture, like Anita Baker\nWHEN I ROLL UP TO YOU NIGGAS LIKE A SKATER\nMOVE IF YOU WANNA WHEN YOU SEE THAT RED LASER\nNO MATTER HOW YOU MOVE AND THAT INFRARED WILL CHASE YA\nTHEN I KEEP IT MOVIN, HOMEY SEE YOU LATER! MIMS!\n\n[Chorus]:\nMove if you wanna if you wanna if you wanna\nMove-Move if you wanna if you wanna if you wanna\nMove-Move if you wanna if you wanna if you wanna\nMove-Move if you wanna move-move if you wanna move\nMOVE IF YOU WANNA IF YOU WANNA IF YOU WANNA\nMOVE-MOVE IF YOU WANNA IF YOU WANNA IF YOU WANNA\nMOVE-MOVE IF YOU WANNA IF YOU WANNA IF YOU WANNA\nMOVE-MOVE IF YOU WANNA IF YOU WANNA IF YOU WANNA MOVE\n\nI'm tryin to keep it cool, if you wanna, you can move, if you wanna\nTryin to have a little fun, maybe move a couple numbers but\nWhen you movin numbers, all the haters start to wonder\nThen they talk behind your back, in the breath they speakin under\nMAN I'M HOT, LIKE THE SUN, LIKE THE MIDDLE OF THE SUMMER\nSTRIKE DOWN IN A FLASH, NIGGA YOU CAN CALL ME THUNDER\nCHICKS CALL ME PHIL DRUMMOND 'CAUSE I GIVE 'EM DIFF'RENT STROKES\nBAHH, BAHH, BAHH, BAHH, BAHH, BEAT IT UP, LIKE A DRUMMER\nThey can call it one-hit wonder, but I guess that means I'm one-up\nLight a match, play with fire, that just means you gon' get burned up\nIn the river, where you turn up, 'cause thye see I'm on the come-up\nBut it's our, turn, now, if you want it, take it from us\nI DON'T NEED NO GOONS BY ME, IF YOU WANT IT COME AND TRY ME\nWE CAN DO THIS BROAD DAY, IN THE MIDDLE OF THE LOBBY\nNIGGAS SAY THAT THEY THE SHIT, WHEN THEY BARELY JUST A POTTY\nWHEN THEY PROBLEMS TURN TO PROL'LY AND THEY PROL'LY TURNS TO SORRY\nTELL 'EM!!!\n\n[Chorus]\nMove if you wanna if you wanna if you wanna\nMove-Move if you wanna if you wanna if you wanna\nMove-Move if you wanna if you wanna if you wanna\nMove-Move if you wanna move-move if you wanna move\nMOVE IF YOU WANNA IF YOU WANNA IF YOU WANNA\nMOVE-MOVE IF YOU WANNA IF YOU WANNA IF YOU WANNA\nMOVE-MOVE IF YOU WANNA IF YOU WANNA IF YOU WANNA\nMOVE-MOVE IF YOU WANNA IF YOU WANNA IF YOU WANNA MOVE"}