{"rank":"85","song_id":"24163","song_name":"Insane","artist_id":"301722","display_artist":"Eminem","spotify_id":"6x1stxDsnh4ZlEft29uhlR","lyrics":"[Produced by Dr. Dre]\n\n[Verse 1]\nI was born with a dick in my brain, yeah, fucked in the head\nMy stepfather said that I sucked in the bed\n'Til one night he snuck in and said\n\"We're going out back, I want my dick sucked in the shed\"\nCan't we just play with Teddy Ruxpin instead?\n\"After I fuck you in the butt, get some head\nBust a nut, get some rest,\" the next day my mother said\n\"I don't know what the fuck's up with this kid\nThe bastard won't even eat nothing, he's fed\nHe just hung himself in the bedroom, he's dead\"\n\"Debbie, don't let that fucker get you upset\nGo in there, stick a fuckin' cigarette to his neck\nI'll bet you he's fakin' it, I'll bet you, I bet\nHe probably just wants to see how upset you would get\nI'll go handle this, of course unless you object\"\n\"Aw, go fuck his brains out if any's left in his head\"\n\n[Chorus]\nIf you could count the skeletons in my closet\nUnder my bed and up under my faucet\nThen you would know I've completely lost it\nIs he nuts? No, he's insane\nIf you could count the skeletons in my closet\nUnder my bed and up under my faucet\nThen you would know I've completely lost it\nIs he nuts? No, he's insane\n\n[Verse 2]\n\"Did you get him?\" Naw, fucker tried to bite my face off\nI just got fuckin' chased off with a chainsaw\nThen he took the chainsaw, bit the fuckin' blades off\nAte the blades, stuck a baseball in a slingshot\nThen he aimed at his own face, let the thing pop\nTook his eye out, picked it up and played ping pong\nThen he played ping pong with his own ding-dong\nThat motherfucker's got nuts like King Kong\nThen he set the lawnmower out on the dang lawn\nAnd he laid all up underneath it with the thing on\nThen he took his pants, he took every fuckin' thing off\nEverything except his tank top and his training bra\nAin't he raw? Yeah, maniac, that's Shady, dawg\nMan that motherfucker's gangsta, ain't he dawg?\nShady, dawg, what be goin' through that fuckin' brain of yours?\nSay no more, what the fuck you waitin' for? Sing along\n\n[Chorus]\nIf you could count the skeletons in my closet\nUnder my bed and up under my faucet\nThen you would know I've completely lost it\nIs he nuts? No, he's insane\nIf you could count the skeletons in my closet\nUnder my bed and up under my faucet\nThen you would know I've completely lost it\nIs he nuts? No, he's insane\n\n[Verse 3]\nDon't you know what felch means? \"Yeah\" Well then, tell me\nWould you rather get felched or do the felching?\nFuck 'em in the ass, suck the cum out while you're belching\nBurp, belch, and go back for a second helping\nCan you dig what I'm saying, man? Can you smell me?\nI want you to feel me like my stepfather felt me (Oh...)\nFuck a little puppy, kick the puppy while he's yelping\n\"Shady, what the fuck you saying?\" I don't know, help me!\nWhat the fuck's happening? I think I'm fuckin' melting\n\"Marshall, I just love you, boy, I care about your well-being\"\nNo, Dad, I said no — I don't need no help peeing\nI'm a big boy, I can do it by myself, see?\nI only get naked when the babysitter tells me\nShe showed me a movie like Nightmare on Elm Street\nBut it was X and they called it \"Pubic Hair on Chelsea\"\n\"Well, this is called 'Ass Rape' and we're shooting the jail scene\"\n\n[Chorus]\nIf you could count the skeletons in my closet\nUnder my bed and up under my faucet\nThen you would know I've completely lost it\nIs he nuts? No, he's insane\nIf you could count the skeletons in my closet\nUnder my bed and up under my faucet\nThen you would know I've completely lost it\nIs he nuts? No, he's insane"}