{"rank":"94","song_id":"24177","song_name":"Ain't No Rest For The Wicked","artist_id":"275786","display_artist":"Cage The Elephant","spotify_id":"5c5a2Ptu8eyIpljhQHjIqk","lyrics":"I was walking down the street,\nWhen out the corner of my eye\nI saw a pretty little thing approaching me\nShe said \"I've never seen a man\nWho looks so all alone,\nCould you use a little company?\nIf you pay the right price\nYour evening will be nice,\nAnd you can go and send me on my way.\"\nI said \"You're such a sweet young thing\nWhy you do this to yourself?\"\nShe looked at me and this is what she said,\n\n\"Oh, there ain't no rest for the wicked,\nMoney don't grow on trees.\nI got bills to pay,\nI got mouths to feed,\nThere ain't nothing in this world for free.\nI know I can't slow down,\nI can't hold back,\nThough you know, I wish I could.\nOh no there ain't no rest for the wicked,\nUntil we close our eyes for good\".\n\nNot even fifteen minutes later\nI'm still walking down the street,\nWhen I saw the shadow of a man creep out of sight.\nAnd then he swept up from behind\nHe put a gun up to my head,\nHe made it clear he wasn't looking for a fight.\nHe said \"Give me all you've got\nI want your money not your life,\nBut if you try to make a move I won't think twice.\"\nI told him \"You can have my cash\nBut first you know I got to ask\nWhat made you want to live this kind of life?\"\n\nHe said \"There ain't no rest for the wicked,\nMoney don't grow on trees.\nI got bills to pay,\nI got mouths to feed,\nThere ain't nothing in this world for free.\nI know I can't slow down,\nI can't hold back,\nThough you know, I wish I could.\nOh no there ain't no rest for the wicked,\nUntil we close our eyes for good\".\n\nNow a couple hours passed\nAnd I was sitting at my house,\nThe day was winding down and coming to an end.\nSo I turned on the TV\nAnd flipped it over to the news,\nAnd what I saw I almost couldn't comprehend.\nI saw a preacher man in cuffs he'd taken money from the church,\nHe stuffed his bank account with righteous dollar bills.\nBut even still I can't say much\nBecause I know we're all the same,\nOh yes we all seek out to satisfy those thrills.\n\nYou know, there ain't no rest for the wicked,\nMoney don't grow on trees.\nWe got bills to pay,\nWe got mouths to feed,\nThere ain't nothing in this world for free.\nI know we can't slow down,\nWe can't hold back,\nThough you know, we wish we could.\nNo there ain't no rest for the wicked,\nUntil we close our eyes for good"}