{"rank":"99","song_id":"24178","song_name":"Throw It In The Bag","artist_id":"276136","display_artist":"Fabolous Featuring The-Dream","spotify_id":"6c0GmyBsE7mQtrVvxJaWc3","lyrics":"[Produced by Shatek]\n\n[Intro - Fabolous and The Dream]\nYou already know what it is (ah)\nWe got another one boy (A-T-L)\nYeah, (just throw it in the bag)\nWhat's up Brooklyn? What's up son?\n(What's up Fabo?)\nAye man, I got that black AmEx with me\nA.K.A. that \"Throw It In The Bag\" card\n(Radio Killa), yeah\n\n[Break - The-Dream]\nNow I know you ain't over there staring at my girl\nYeah, I know you ain't over there staring at my girl\nNigga, I know you don't call yourself hollering at my girl\nNow I know you don't call yourself hollering at my girl\nI keep her in Louboutin, Louis Vuitton\nGucci down to her feet, yup, just like me\nI'm the one, with them ones\nFuck the price on the tag, just throw it in the bag\n\n[Hook - The-Dream]\nUh huh, uh huh, uh huh\nJust throw it in the bag\n\n[Fabolous talking over the Hook]\nLadies, y'all ready to go shopping?\nNeiman Marcus on me and all that?\nYeah, come on then\n\n[Verse 1 - Fabolous]\nLook at price tags, where they do that at?\nHeard that in A-T-L, when I'm in A-T-L\nJust ask my baby gal, I treat that lady well\nAin't nothing so-so, and I know J.D. well\nA couple Benzes, black, white, gray C.L\nGot niggas looking like, \"Did we miss a Mercedes sale?\"\nDon't wonder what I do, just know they pay me well\nThey keep that Gucci and that Louis on my labi-el's\nThat's the way we feel -- must be nice, man\nYou with the right man, you ain't gotta price scan\nOr ask how much, now what I look like?\nSon I'm from Brooklyn -- what it look like?\nYou get it cause I got it, I got it so you get it\nIn Miami they say, \"Don't stop, get it, get it\"\nMami do the Speedy, daddy do the duffle\nBag full of chips, we ain't talking Ruffles\n\n[Hook]\n\n[Verse 2 - Fabolous]\nSee, I know what I'mma tell her\nThe same thing that the bank robber told the teller --\nJust throw it in the bag\nThat's the way it supposed to be\nA real nigga 'posed to help you out with the groceries\nJust throw it in the bag\nPaper or plastic, it's safer to ask it\nSo dead that nigga, I will pay for the casket\nThat Remy Mar' got him spitting plenty bars\nBroke ass nigga, couldn't buy the mini bar\nSo get with Loso, he ain't got to know so\nSuch a gentleman, dozen bottles of that Rose Mo'\nOh you got a man? Well, you need a richer one\nMeet me in the parking lot, the plates say \"GET U 1\"\nMeet me at the register, I'm there on the regular\nThem niggas price checking, you can help them in a second\nAs we proceed to give you what you need\nLike we breaking down the weed\nShorty, throw it in the bag\n\n[Hook]"}