{"rank":"32","song_id":"24188","song_name":"You're A Jerk","artist_id":"312160","display_artist":"New Boyz","spotify_id":"1YNC4CuWPLfmJ7V0xgSObY","lyrics":"[Verse: Legacy]\nJeeerkk\nI'm so cocky with it got my iced out clubs like rocky hit\nGot your girl on my swagg she lovin them jerkin songs\nLike the new ipod just touch it and turn her on\nAnd when the bass start beatin and the waist I'm beatin\nDone I got on my way I'm leavin she like where your goin I ain't got my shoes and purse\nI said it's none of your concern and she yelled (your a jerk!)\nSo I walked out the door, called Ben J. told him it's a function he said I'm on my way\nWe pulled up to the party ices on my shirt and got geeked up everybody jerkin\nWe was jerkin to the right jerkin to the left then she popped out of nowhere she was still half dressed\nShe like fareal jerk you love it but it's sumthin the whole party heard her but all I could hear was\n\n[Chorus:]\nWah wah wah wah (your a jerk)\nWhy you trippin I ain't even do nothin(your a jerk)\nI'm a jerk you ain't neva lie\nBut aye do me a favor call me jerk one more time(your a jerk!)\nI know\nYour a jerk! (I know) [x6]\n\nJerk jerk jerk (jerkin)\nJerk jerk jerk(jerkin) [x15]\n\n[Verse: Ben J.]\nEverything quiet and the bass real hard\nAnd I stay geeked up never been a retard got a new boy swagg\nAnd this here for ya'll so we gotta keep it separate like the jim crowe laws\nI'm a beast I'm a gang and I guess I'm a jerk and I go thru big rounds\nCause ya boy here a flirt man you call me a bottle with your lil jerk lines\nThen you say you brought it up but the jerk is mine\nYou squeezin I'm squeezin but yo shit is wack\nWhy you comin to the front you can push that back got ya girl on the side\nShe talkin sum lil stuff while she textin on the phone Ben J. hit it rough\nSo I did it was good and I quickly got dressed she was like where you goin\nThere's another girl naked she screamed out loud Ben J.(your jerk!)\nAnd I had nothing to say but sorry that it hurts\n\n[Chorus:]\nWah wah wah wah (your a jerk)\nWhy you trippin I ain't even do nothin(your a jerk)\nI'm a jerk you ain't neva lie\nBut aye do me a favor call me jerk one more time(your a jerk!)\nI know\nYour a jerk! (I know) [x6]\n\nYour a jerk jerk jerk (jerkin)\n\nJerk jerk jerk(jerkin) [x15]\n\nExcerpt geeked up\n\nI'm jerked up [x7]\n\nwww.Myspace.com/iMuzik"}