{"song_name":"D.O.A. (Death Of Auto-Tune)","artist_id":304305,"display_artist":"Jay-Z","spotify_id":"1rlsUf1hdCGf1ML0MJJczY","lyrics":"[Produced by No I.D.]\n\n[Hook]\n(Na na na na, hey hey hey, goodbye)\nOnly rapper to rewrite history without a pen\nNo I.D. on the track let the story begin, begin, begin\n\n[Verse 1]\nThis is anti-auto-tune, death of the ringtone\nThis ain’t for iTunes, this ain’t for sing-alongs\nThis is Sinatra at the opera, bring a blonde\nPreferably with a fat ass who can sing a song\nWrong, this ain't politically correct\nThis might offend my political connects\nMy raps don’t have melodies\nThis should make niggas wan' go and commit felonies\nGet your chain tooken\nI may do it myself, I’m so Brooklyn!\nI know we facing a recession\nBut the music y’all making gon' make it the Great Depression\nAll y’all lack aggression\nPut your skirt back down, grow a set men\nNigga this shit violent\nThis is death of auto-tune, moment of silence\n\n[Hook]\nLa da da da da da\nHey hey goodbye\nHold up\n\n[Verse 2]\nThis ain’t a number one record\nThis is practically assault with a deadly weapon\nI made this just for Flex and\nMister Cee I want niggas to feel threatened\nStop your bloodclot crying\nThe kid, the dog, everybody dying, no lying\nYou niggas' jeans too tight\nYou colors too bright, your voice too light (too far nigga)\nI might wear black for a year straight\nI might bring back Versace shades\nThis ain’t for Z100\nYe told me to kill y’all to keep it a hundred\nThis is for Hot 9-7\nThis shit for Clue, for Khaled we the best’n\nAww, nigga this shit violent\nThis is death of auto-tune, moment of silence\n\n[Hook]\nLa da da da da da\nHey hey hey goodbye\nHold up\nOnly rappers to re-write history without a pen\nNo I-D on the track let the story begin, begin, begin\n\n[Verse 3]\nHold up, this shit need a verse from Jeezy\nI might send this to the mixtape Weezy\nGet somebody from BMF to talk on this\nGet this to a Blood, let a Crip walk on it\n3 Thou' to style on this\nI just don’t need nobody to smile on this\nYou niggas singing too much\nGet back to rap, you T-Paining too much\nI’m a multi-millionaire\nSo how is it I’m still the hardest nigga here\nI don’t be in the project hallway\nTalking 'bout how I be in the project all day\nThat sound stupid to me\nIf you a gangsta this is how you prove it to me\nNigga just get violent\nThis is death of auto-tune, moment of silence\n\nLa da da da da da\nHey hey hey goodbye\nHold up"}