{"rank":"93","song_id":"24225","song_name":"Too Many Rappers","artist_id":"280828","display_artist":"Beastie Boys Featuring Nas","spotify_id":"4glAkXaI3bMjXppg8WYntJ","lyrics":"[Intro - Nas]\nMic check, mic check\n\n[Hook - Nas] (Beastie Boys)\nOne (one), two (two), three (three)\nToo many rappers, and there's still not enough MCs\nIt goes three (three), two (two), one (one)\nMCA, Adrock, Mike D, that's how we get it done\nLike ladies and gents, attention\nNas in the house with Beastie Boys\nWe can turn it out\nPerpetrators, we can point 'em out\nSo if you got somethin' on your mind, let it out\n\n[MCA]\nYo, I been in the game since before you was born\nI might still be MCing even after you're gone\nStrange thought, I know, but my skills still grow\nThe 80s, the 90s, 2000s, and so\nOn and on until the crack of dawn\nUntil the year 3000 and beyond\nStay up all night, and I MC and never die\nCause death is the cousin of sleep\n\n[Ad-Rock]\nBecause I'm back with a bang, boogie, oogie-oogie\nStrawberry Letter 23 like Shuggie\nOh my God, just look at me\nGrandpa been rappin' since '83\nI'm supersonic like J.J. Fad\nGot crazy-ass shit pullin' out the bag\nDon't forget the tartar sauce, yo, cause it's sad\nAll these crab rappers, they're rappin' like crabs\n\n[Nas]\nI have carte blanche, the vagabond\nNas is the narcissist, my pockets are rotund\nI'm no killa, but compared to you, I'm more real'a\nYou ain't a shot, a mobster, or a drug dealer\nA slug peeler, you're not\nMafioso, no\nYou ain't got the cut-throat in ya, beginner\nI ain't tryin' to hear your racket\nYou work with police, dog, you snitch, you rat\nYou wear that jacket\n\n[Mike D]\nHow many rappers must get dissed\nGimme eight bars, and watch me bless this\nI start to reminisce, ooh, when I miss\nThe real hip hop with which I persist\nLike rum in mojitos\nBullets and banditos\nMatzoh balls in soup\nJackets and troop\nYes, y'all, this is one for the history books\nNasty Nas, what's the word?\nCount it off on the hook\n\n[Hook]\n\n[MCA]\nCause this the type of lyric goes inside your brain\nTo blow you bullshit rappers straight out the frame\nMy lyrics spin 'round like a hurricane twister\nSo get your hologram on off-a Wolf Blitzer\nToo many rappers to shake a stick at\nI oughta charge a tax for every weak rap I had to listen to\nCause we be makin' stacks like Stax Records\nMy squad, we gotta pact -- we're never coming wack\n\n[Ad-Rock]\nTo all you crab rappers and hackers\nAnd circuit benders tweaked on Splenda\nI take the cake, I stole the mold\nThe golden microphone, well, that's mine to hold\nAnd why all these biters all up in my crotchspace?\nSniffin', buffin', huffin'\nAnd mean muggin' with a Blimpie Bluffin\nBack up off me, suckas, you ain't sayin' nothin'\n\n[Nas]\nI'm broader than Broadway, I was the project hallway\nDual tape recorder, lacin' oratorials all day\nI'm just getting started on this beat, this is foreplay\nAnd when this song's finished, y'all can sing along with this\nBy the way, I have a strong fetish for Christian Louboutin steppers\nI hear Russian blonde's the wettest\nBut anyway, I better pay homage to my fellas\nAnd that's what's on my mind and the rhyme, who's next up?\n\n[Mike D]\nMike D, the man of mystery\nHistory in the makin', and now we're takin'\nTitles, awards, and accolades\nScarin' the competition as I sharpen my blades\nWe come together like peanut butter and sandwiches\nLike pen and paper, like Picasso and canvases\nRockin' stadiums and shitty bars\nGo back in time, send a fax from my car\n\n[Hook]"}