{"song_name":"Imma Star (Everywhere We Are)","artist_id":304467,"display_artist":"Jeremih","spotify_id":"1QOxGqu6VTjx58nslWBFVW","lyrics":"I thought I told you I'm a star\nyou see the ice?\nyou see the cars\nflashy lights everywhere we are\nlivin like like there's no tomorrow\n\nI thought I told you I'm a star\nyou see the ice?\nyou see the cars\nflashy lights everywhere we are\nlivin like like there's no tomorrow\n\nI got money I don't need a range\nI'm a pimp I don't need a cane\nman it kills Charlie you can keep the change\nnow that I got the torch imma keep the flame\nimma keep my aim gotta make the big shots\nin my latest suit Louvie V flip flops\ngot a bad bitch her hand nails tip top\nJeremiah got the game on the slipknot\njust before the stacks I got rubberbands\nconsumers only want you to supply demand\nso here I am check my DNA\ngettin money is the only thing on my resume\n\nI thought I told you I'm a star\nyou see the ice?\nyou see the cars\nflashy lights everywhere we are\nlivin like like there's no tomorrow\n\nI thought I told you I'm a star\nyou see the ice?\nyou see the cars\nflashy lights everywhere we are\nlivin like like there's no tomorrow\n\nlike the dealership I got buku cars\npenitentiary I keep buku bars\nflow so hot ridin buku large\nHollywood ground I got buku stars\ndon't need Roger Ebert or the paparazzi\ntake on and already the county stop me\nI hit hella licks man hella stagin\nhit the weed man so you get in touch with mary jane\nyou a scorpio? girl get over here\nride me all night like you kid a paul revere\nkissin on my neck nibblin on my ear\nyou say you wanna chill? go ahead and have a beer\n\nI thought I told you I'm a star\nyou see the ice?\nyou see the cars\nflashy lights everywhere we are\nlivin like like there's no tomorrow\n\nI thought I told you I'm a star\nyou see the ice?\nyou see the cars\nflashy lights everywhere we are\nlivin like like there's no tomorrow\n\nOk now I be ballin I I be be ballin\nyou can catch me in the air I be ballin\nwhen I'm tryin to buy some gear I be ballin\nin the middle of the club or wherever you call it\neither the camera's fakin or the pole be clockin\nespecially at the end of the night when it's just\nnotan option\nnow they got the spotlight on me why they put that on me\nnow I'm never lonely cus everywhere I go there is...."}