{"rank":"97","song_id":"24281","song_name":"Young Forever","artist_id":null,"display_artist":"Jay-Z + Mr. Hudson","spotify_id":"7nmArpOotJ431XYlJXI1vy","lyrics":"[Intro: Mr. Hudson]\nLet's dance in style, let's dance for a while\nHeaven can wait, we're only watching the skies\nHoping for the best but expecting the worst\nAre you gonna drop the bomb or not?\nLet us die young or let us live forever\nWe don't have the power but we never say never\nSitting in a sandpit, life is a short trip\nThe music's for the sad man\n\n[Hook]\nForever young, I wanna be forever young\nDo you really want to live forever, forever, and ever?\nForever young (young)\nI wanna be (Aye, may the best of your todays)\nForever young (Be the worst of your tomorrows)\nDo you really want to live forever (But we ain't even thinkin' that far)\nForever (ya know what I mean?)\nForever young\n\n[Verse 1: Jay-Z]\nSo we livin' life like a video\nWhere the sun is always out and you never get old\nAnd the champagne's always cold and the music is always good\nAnd the pretty girls just happen to stop by in the hood\nAnd they hop they pretty ass up on the hood of that pretty ass car\nWithout a wrinkle in today, cuz there's no tomorrow\nJust a picture perfect day that last a whole lifetime\nAnd it never ends cause all we have to do is hit rewind\nSo let's just stay in the moment, smoke some weed, drink some wine\nReminisce, talk some shit, forever young is in your mind\nLeave a mark they can't erase, neither space nor time\nSo when the director yells cut, I'll be fine\nI'm forever young\n\n[Hook]\nForever young, I wanna be forever young\nDo you really want to live forever, forever, and ever?\nForever young, I wanna be forever young\nDo you really want to live forever, forever? Forever young\n\n[Verse 2: Jay-Z]\nFear not when, fear not why, fear not much while we're alive\nLife is for living, not living uptight, 'till you're somewhere up in the sky\nFear not die, I'll be alive for a million years, bye bye's\nAre not for legends, I'm forever young, my name shall survive\nThrough the darkest blocks, over kitchen stoves, over Pyrex pots\nMy name shall be passed down to generations\nWhile debatin' up in barbershops\nYoung slung, hung here, showed that a nigga from here\nWith a little ambition, just what we can become here\nAnd as the father pass the story down to his son's ears\nYoung'll get younger every year, yeah\nSo if you love me baby, this is how you let me know\nDon't ever let me go, that's how you let me know, baby\n\n[Hook]\nForever young, I wanna be forever young\nDo you really want to live forever, forever, and ever?\nForever young, I wanna be forever young\nDo you really want to live forever, forever? Forever young\n\n[Verse 3: Jay-Z]\nSlammin' Bentley doors, hoppin' outta Porsches\nPoppin' up on Forbes' list, gorgeous (hold up)\nNiggas thought I lost it, they be talking bullshit\nI be talking more shit, they nauseous (hold up)\nI'll be here forever, you know I'm on my fall shit\nAnd I ain't with foreclosure, I will never forfeit\nLess than four bars, Guru bring the chorus in\nDid you get the picture yet? I'm painting you a portrait\nOf young\n\n[Hook]\nForever young, I wanna be forever young\nDo you really want to live forever, forever, and ever?"}