{"rank":"60","song_id":"24313","song_name":"One Less Lonely Girl","artist_id":"305459","display_artist":"Justin Bieber","spotify_id":"69ghzc538EQSVon2Gm3wrr","lyrics":"[Intro]\nOne less lonely girl, one less lonely girl\nOne less lonely girl, one less lonely girl\n\n[Verse 1]\nHow many I told you's and start overs and shoulders have you cried on before?\nHow many promises? Be honest girl, how many tears you let hit the floor?\nHow many bags you packed just to take 'em back tell me that? How many either or's?\nBut no more, if you let me inside of your world there'll be the one less lonely girl\n\n[Pre-Chorus]\nOh no, saw so many pretty faces, now all I see is you\nOh no, don't need these other pretty faces\nCause when you're mine in the world\nThere's gonna be one less lonely girl\n\n[Chorus]\nOne less lonely girl, one less lonely girl\nOne less lonely girl, there's gonna be one less lonely girl\nI'm gonna put you first, I'll show you what you're worth\nIf you let me inside your world, there's gonna be one less lonely girl\n\n[Verse 2]\nChristmas wasn't merry, 14th of February, not one of 'em spent with you\nHow many dinner dates, set dinner plates and he didn't even touch his food?\nHow many torn photographs are you taping back? Tell me that, couldn't see an open door\nBut no more, if you let me inside of your world, there'll be one less lonely girl\n\n[Pre-Chorus]\nOh no, saw so many pretty faces, now all I see is you\nOh no, don't need these other pretty faces\nCause when you're mine in the world\nThere's gonna be one less lonely girl\n\n[Chorus]\nOne less lonely girl, one less lonely girl\nOne less lonely girl\nI'm gonna put you first, I'll show you what you're worth\nIf you let me inside your world, there's gonna be one less lonely girl\n\n[Bridge]\nI can fix up your broken heart, I can give you a brand new start\nI can make you believe, I just wanna set one girl free to fall\nShe's free to fall with me, her hearts locked and know what, I got the key\nI'll take her and leave the world with one less lonely girl, one less lonely girl\n\n[Chorus]\nOne less lonely girl, one less lonely girl\nOne less lonely girl, there's gonna be one less lonely girl\nI'm gonna put you first, I'll show you what you're worth\nIf you let me inside your world\nOne less lonely girl, one less lonely girl\nOne less lonely girl\nI'm gonna put you first, I'll show you what you're worth\nIf you let me inside your world, there's gonna be one less lonely girl"}