{"rank":"93","song_id":"24317","song_name":"Hell Of A Life","artist_id":"277486","display_artist":"T.I.","spotify_id":"61RKa8fRwmlyGgpEVoXsyT","lyrics":"[Intro: T.I.]\nAy, ay...\nIt's the King representin once more, ya understand?\nWhen people see me on Bankhead..\nMan the folks start pointin, screamin, and wavin, and yellin and...\nI'm talkin' bout man, ay look mayne y'know I'm sayin..\nI don't wanna roll over no toes in my Rolls, you dig what I'm sayin?\nY'all jump back up, let a pimp pass through, you dig?\nHahahahah!\n\n[Hook:]\nBeamers, Bentley’s, double R’s, Ferrari’s\nEvery time I see you, shawty where ya headin tonight?\n(Hey, where ya headin shawty?)\nSellin out arenas, chicks wit asses like Serena\nMan, shawty live a hell of a life (I'm tryna tell ya shawty)\nIt's a hell of a liiiiiiiife man, shawty live a hell of a liiiiiife...\n(That's how it is, real talk, true story)\nI ain't tellin no liiiiie man, shawty live a hell of a liiiiife...\n(That's how it is, real talk, true story)\n\n[Verse One]\nY'know, shawty goin extra hard when they release his passport\nWhy I need a credit card? What you thank this cash for? (What?!)\nHit the dealership and give 'em every dime he ask for\nJust so I can see two-hundred sixty on the dashboard\nIf shinin 'gainst the law, somebody better get the task force\nFor me, hoes love me, lemme fuck 'em 'til their ass hoarse\nPimpin' 101, just come and see me take a crash course\nYou wanna count my money, go to college, need a math course\nOn a mad dash for a hundred milli runnin\nBreakneck speed 'til I see a billi comin\nI'm filthy rich and hungry, feel the grumblin in my stomach\nI'm still stuntin off the chain, chasin nothin but some money\nPut a couple pair of queens like I'm playin gin rummy\nNo cards, just broads when a nigga dick hard\nFlooded offshore Audemars, lookin' like I caught a star\nPut it in her wristwatch, ballin like a big shot\n\n[Hook:]\n\n[Verse Two]\nSwag on fully, no semi, ho, hand me\nBankrolls, no pennies, drop Rolls (roles), no Emmy's\nStreet cred, no blemish, credit card, no limit\nYou went to Bankhead, spot a drop head, I'm in it!\nAnd bendin, a couple corners, hoppin on 20\nWit three or four women givin love like tennis\nMy boxers where her chin is, giving me the business\nWhile I'm ridin through the city, gag, swallow, no spittin\nLivin life, like I just got out of prison Wednesday night\nIf yo' chick is in my sight, then that chick is gettin right\nAy, I know niggas now with bitches think I'm hittin it and they right\nThey keep my name up out dey mouth and mind dey business, dey aight\nHey aight, if you hear me say aight, okay, aight?\nCause you know I got dem goons with me and I pay aight\nAnd they would like to see me broke or back to prison see me go\nBut instead they see me ballin, stuntin, everywhere we go - GO!\n\n[Hook:]\n\n[Interlude:]\nMoney won't fold, pockets all swoll\nRubberband keep poppin off my bankroll\n(I ain't tellin no liiiiie man, shawty live a hell of a liiiiife...)\n(That's how it is, real talk, true story)\nBrand new car fill my brand new chicks\nA hunred bands right quick let's see ya man do this\n(I ain't tellin no liiiiie man, shawty live a hell of a liiiiife...)\n(That's how it is, real talk, true story)\n\n[Hook:]"}