{"rank":"80","song_id":"24339","song_name":"Take Your Shirt Off","artist_id":"277474","display_artist":"T-Pain","spotify_id":"6BKtGdvO4IooVZdbF8bDyP","lyrics":"[Intro: T-Pain]\nT is the shit! (T is!) YEAH~!\nBrush 'em off, brush 'em off - HEY!\nBrush 'em off, brush 'em off - HEY!\nBrush 'em off, brush 'em off - HEY!\nTwist it in the air like a muh'fuckin helicopter - HEY!\nYeah, ladies and gentlemen (do the dance, do the dance) HEY!\nBoys and girls, children of all ages (do the dance, do the dance) HEY!\nThis is Nappy Boy man, this what we do - HEY! (in the air)\nINTRODUCIIIIING!\n\n[T-Pain]\nTeddy Pain, Teddy Penderazdoun\nLet it be known when I roll around town\nIf your girl lost then she 'bout to be found\nWhen I rock and roll, make that Boy Fall Out\nTeddy bears on my feet all round\nI'm back again, what you gon' do now?\nGet out of this party girl and come back to my house\nI'm about to show you how we do it down South\nTake your shirt off\n\n[Hook: T-Pain]\nAh ah-ah-ah ah ah, take your shirt off - HEY!\nAh ah-ah-ah ah ah, take your shirt off - HEY!\nAh ah-ah-ah ah ah, take your shirt off - HEY!\nTwist it in the air like a muh'fuckin helicopter - HEY!\nAh ah-ah-ah ah ah, take your shirt off - HEY!\nAh ah-ah-ah ah ah, take your shirt off - HEY!\nBrush 'em off, brush 'em off, do the dance man - HEY!\nTwist it in the air like a muh'fuckin helicopter - HEY!\nI know you don't care when yo' titties e'rywhere homegirl\nTake yo' motherfuckin shirt off - HEY!\nTake yo' motherfuckin shirt off - HEY!\nTake yo' motherfuckin shirt off - HEY!\nAnd if you don't care put your hands in the air homegirl\nTake yo' motherfuckin shirt off - HEY!\nTake yo' motherfuckin shirt off - HEY!\nHey, twist it in the air like a helicopter\n\n[T-Pain]\nWhat it is, what it's gon' be\nI see you in the crowd and you're looking at me\nBut you ain't doing nothing like you getting it for free\nI don't wanna see no KNOT in that pretty white tee\nTake it off for me, baby girl what you gon' do?\nYou looking like, \"Who this motherfucker talking to?\"\nI wanna see that Baby Phat wrap around yo' head\nNow answer this - is Auto-Tune really dead?\nTake your shirt off!\n\n[Hook]\n\n[T-Pain]\nHey girl, what it is?\nShould I take you back to my crib?\nAnd take yo' motherfuckin shirt off (heh) shirt off\nTake your motherfuckin shirt off, shirt off\nBaby girl, what's goin on?\nI know this is your favorite song\nSo take your motherfuckin shirt off (haha) shirt off\nTake your motherfuckin shirt shirt shirt shirt shirt shirt\nTAKE YOUR SHIRT OFF!\n\n[Hook]\n\n[Outro]\nTeddy Teddy, Pain Pain\nTeddy Teddy, Pain Pain\nTeddy Teddy, Pain\nTeddy Teddy, Pain Pain\nTeddy, Pain\nTeddy Pain, Pain Pain\nTeddy Teddy, Teddy Pain\nPain Teddy, Teddy Pain {*echoes*}"}