{"rank":"80","song_id":"24331","song_name":"Papers","artist_id":"430708","display_artist":"Usher","spotify_id":"77fP7UixHMYEIFT8NS92Ul","lyrics":"(usher usher usher)\nOoh! ooooooh! ooh! papers\nOoh! ooooooh! ooh! papers\n\nVrs 1:\nI can't, get to work on time, \nCan't believe the words to her I just said\nBut who the hell argue n fight like dogs at 6 in the morning? \n(in the mornin) \nI know its gonna' be some more sh** tonight  \nMm oooh\nOur pastor's callin, tellin me I done went too far in\nI'm seen around town and my friends can't recognize me, \n'cuz I took a chance on love (love), it's like (like),\nI'm dyin (ooh dyin)\n \nChorus:\nFor you I gave my heart \nAnd turned my back against the world \n'cause you were my girl, girl, girl\nI done damn near lost my mama, \nI done been through so much drama \nI done turned into the man that I never thought I'd be. \n\nI'm ready to sign them papers, papers, papers\nI done took all I can take \nBut u leave me no options girl \nI can't deny how much I love you, I done \nGave up everything I had to\nAs hard as it is I'm afraid I gotta say\nI'm ready to sign them papers, papers, papers\nI done took all I can take \nBut u leave me no options girl\n\nOoh! ooooooh! ooh! papers\nOoh! ooooooh! ooh! papers\n\nVrs 2: \nI'm losin my mind, cant figure out who's wrong or right\nI know it's you I love, \nBut then I also know it's you I don't like\nYou claim you hate who I was, \nBut that's the reason you here now\nYou think I don't know what's up, \nBut sweetheart that's what ruined us\nI ain't afraid to say I got needs \nBut the only time you here for me \nIs when the bottles poppin' and everything is sweet \nBut I i'm tired of sleeping in the other room \nSpending them long nights \nTrying to figure out what in the hell in my heart \nI ain't do right. \n(oooh for u) \n\nFor you I gave my heart \nAnd turned my back against the world \n(back against the world) \n'cause you were my girl, girl (girl), girl, \nI done damn near lost my mama (mama), \nI done  been through so much drama (drama) \nI done turned into the man that I never thought I'd be\n(never thought I would be) \n\nI'm ready to sign them papers (papers), \nPapers (paii), papers (paai ooh oh oh oh)\n(I done took) all I can take \nBut u leave me no options girl \nI can't deny how much I love you (know that I love u),\nI done gave up everything I had to \n(anything I had to) \nAs hard as it is I'm afraid I gotta say \n(I'm affraid I gotta say)\nI'm ready to sign them papers (papers), papers (paii), \nPapers (girl I took all I could take)\n(I done took) all I can take \nBut u leave me no options girl\n\nOhoh! ooooooh! oooooh yea! papers\nOoh! ooooooh! ooh! papers\n\nReady ready ready ready\nAll my fellas up in here, \nIf u had enough and u're ready to sign say\nReady ready ready ready (I'm ready, yes I am)\nAll my ladies if u sick and tired, \nAnd u're, ready to sign, say\nReady ready ready ready (ooh)\nI can't keep livin this life, \nI'm feena leave it for the last time I'm\nReady ready ready ready\n\nI done damn near lost my mama, \nI done  been through so much drama \nI done turned into the man I never thought I'd be. \n\nI'm ready to sign them papers, papers, papers\nI done, took all I can take \nBut u leave me no options girl \nI can't deny how much I love you, \nI done gave up everything I had to\nAs hard as it is I'm afraid I gotta say\nI'm ready to sign them papers, papers, papers\nI done took all I can take \nBut u leave me no options girl"}