{"rank":"11","song_id":"24378","song_name":"Hard","artist_id":"365068","display_artist":"Rihanna Featuring Jeezy","spotify_id":"3XcCfweqtfMbZNbM7Mq0gg","lyrics":"[Intro: Rihanna & (Rihanna + Jeezy)]\nYeah yeah yeah (yeah yeah yeah)\nYeah yeah yeah (oh yeah yeah yeah)\nOh yeah yeah yeah (yeah yeah yeah)\nOh yeah, oh yeah, oh yeah, yeah\nOh yeah, oh yeah, oh yeah, yeah\n\n[Verse 1: Rihanna]\nThey can say whatever, I'mma do whatever\nNo pain is forever, yup! You know this\nTougher than a lion, ain't gon' need to try it\nI live where the sky ends, yup! You know this\nNever lying, truth-teller\nThat Rihanna reign just won't let up\nAll-black on, blacked-out shades, blacked-out Maybach\nI'mma rock this shit like fashion, as in going til they say stop\nAnd my, runway never looked so clear, but the hottest bitch in heels right here\nNo fear, and while you're getting your cry on, I'm getting my fly on\nSincere, I see you aiming at my pedestal, I better let you know\n\n[Hook: Rihanna]\nThat I, I, I, I'm so hard, yea, yea, yea, I'm so hard\nThat I, I, I, I'm so hard, yea, yea, yea, I'm so hard\nThat I, I, I, I'm so hard, yea, yea, yea, I'm so hard\nSo hard, so hard, so hard, so hard\nYea, yea, yea, (that Rihanna reign just don't let up)\nYea, yea, yea, (that Rihanna reign just don't let up)\nYea, yea, yea, (that Rihanna reign just don't let up)\nSo hard, so hard, so hard, so hard\n\n[Verse 2: Rihanna]\nAll up on it, know you want to clone it\nAin't like me, that chick too phony\nRide this beat, beat, beat like a pony\nMeet me at the top, top, top, getting lonely\nWho think they test me now, run through your town\nI shut it down. Brilliant, resilient, fan mail from 27 million\nAnd I want it all, it's gonna take more than that\nHope that ain't all you got, I need it all\nThe money, the fame, the cars, the clothes\nI can't just let you run up on me like that, all on me like that\nYeah, I see you aiming at my pedestal, so I think I gotta let you know\n\n[Hook: Rihanna]\nThat I, I, I, I'm so hard, yea, yea, yea, I'm so hard\nThat I, I, I, I'm so hard, yea, yea, yea, I'm so hard\nThat I, I, I, I'm so hard, yea, yea, yea, I'm so hard\nSo hard, so hard, so hard, so hard\nYea, yea, yea, (that Rihanna reign just don't let up)\nYea, yea, yea, (that Rihanna reign just don't let up)\nYea, yea, yea, (that Rihanna reign just don't let up)\nSo hard, so hard, so hard, so hard\n\n\n[Verse 3: Jeezy]\nGo hard or go home, back to your residence\nSoon as the Red Dogs give the block back to the presidents\nI used to run my whole block like Obama and them\nYou ain't gotta believe me -- go ask my momma and them\nCouldn't even come in my room, smelled like a kilo\nLook like me and two of my boys playing casino\nCount the style I keep in my bag, they can't afford it\nTell 'em \"give me back my swag!\" -- they trying to clone it\nSee my Louis chucks, Louis flag, Louis frames, Louis belt\nWhat that make me, \"Louis Mane\"?\nI'm in the all-white party wearing all black\nWith my new black watch, call it the heart attack\nCardiac arrest, Carti'ac a wrist\nYeah, they say they hard, they ain't hard as this\nHard: the one word describes me\nIf I wasn't doing this, you know where I'd be\n\n[Outro: Rihanna]\nWhere them girls talking trash?\nWhere them girls talking trash?\nWhere they at? Where they at? Where they at?\nWhere them bloggers at?\nWhere them bloggers at?\nWhere they at? Where they at? Where they at?\nWhere your lighters at?\nWhere your lighters at?\nWhere they at? Where they at? Where they at?"}