{"rank":"65","song_id":"24431","song_name":"Hillbilly Bone","artist_id":"289793","display_artist":"Blake Shelton Featuring Trace Adkins","spotify_id":"7dL2kSVsBelmkQHbkNkx1l","lyrics":"Yea I got a friend from New York City, \nHe's never heard of Conway Twitty, \nDon't know nothing bout grits and greens, \nnever been south of Queens, \nbut he flew down here on a business trip, \nI took him honky-tonking and that was it, \nhe took to it like a pig to mud, cow to cud\n\nWe all got a hillbilly bone down deep inside \nno matter where you from you just can't hide it, \nwhen the band starts banging and the fiddle saws, \nyou can't help but hollerin' \nYEE-HAW! When you see them pretty \nlil' country queens man you gotta \nadmit that it's in them jeans, \nain't nothing wrong just gettin \non your hillbilly bone-ba-bone bone\n\nNaw you ain't got to be born out \nin the sticks with a f-150 and a 30-06. \nOr have a bubba in the family tree \nto get on down with me, yea bubba \nall you need is an open mind, \nif it fires you up you got a little shine, \nwhen it feels so right that it can't be wrong, \ncome on come on come on you ain't alone you ain't alone.\n\nWe all got a hillbilly bone down \ndeep inside no matter where you from \nyou just can't hide it, when the band starts banging \nand the fiddle saws, you can't help but hollerin' \nYEE-HAW! When you see them \npretty lil' country queens man you gotta admit \nthat it's in them jeans, ain't nothing wrong \njust getting on your Hillbilly bone-ba-bone-ba-bone bone\n\nWe all got a hillbilly bone down deep inside \nno matter where you from you just can't hide it, \nwhen the band starts banging and the fiddle saws, \nyou can't help but hollerin' YEE-HAW! \nWhen you see them pretty lil' country queens \nman you gotta admit that it's in them jeans, \nain't nothing wrong just getting on your \n\nHillbilly bone-ba-bone-ba-bone bone\nHillbilly bone-ba-bone-ba-bone bone\nHillbilly bone-ba-bone-ba-bone bone\nHillbilly bone-ba-bone-ba-bone bone"}