{"rank":"82","song_id":"24432","song_name":"Music Box","artist_id":"301722","display_artist":"Eminem","spotify_id":"1PokNDiTBQZgXci6rn2BVE","lyrics":"[Intro]\nYeah\nYeah, girl\nCan you hear that?\nIt's playing our song\nAre you sleepy? Take a nap\nYou're not afraid of the dark, are you?\n\n[Verse 1]\nYou hear the beat as it makes you not want to go to sleep\nI knock on Dakota's door, it's locked, so I go to creep\n'Round the back with binoculars, not 'cause I wanna peep\nBut because I'm hungry, she smells like tacos, I wanna eat\nVisions of hot chocolaty marshmallows, all so sweet\nWith sugar plums, oh look here comes Marshall, he's on your street\nHe's placing hot smoldering charcoals beneath your feet\nNow walk on 'em, he's dancing with carcasses cheek to cheek\nLike a Thanksgiving turkey, a holiday ham\nCinnamon sprinkled on toast, strawberry marmalade jam\nFlavor my favorite graham crackers with JonBenét Rams'\nI guess a modern-day Jack the Ripper is all that I am\n\n[Hook]\n(My music box)\n'Cause when the lights are off, I see the girl's asleep\n(My music box)\nBut I can hear you, my love, you keep calling me\n(My music box)\nAlthough we're worlds apart, you mean the world to me\n(My music box)\nSo once you call, I come, I will answer\n(My music box, my music box)\n'Cause when the lights are off, I see the girl’s asleep\n(My music box)\nI hear my music box playing a song for me\n(My music box)\nSo won’t you twirl around and do a whirl for me?\n(My music box, my music box)\nAnd would you be my private little dancer?\n\n[Verse 2]\nI almost look comatose, who wants to be sober? Gross\nI foam like a Doberman, mouth open, I overdose\nPut coke up my nostrils, in both my holes, then I plug my nose\nMy pupils quadruple in size, eyes are so bugged, I know\nI put on my mother's makeup, get naked, and run around\nWaving the gun around, I think I'm down to a hundred pounds\nThere's thunder, I wonder how come it rains, but the sun is out?\nThe devil's upset with his wife, they must be sluggin' it out\nI must be buggin' the fuck out, but what the fuck about?\nVoices are leading me up to the attic, I love my house\nThey pull and they tug my blouse, the sound of a music box\nComes from inside a toy chest, but what do I do? It's locked\nI pick it and open it, but it's stuffed full of human parts\nI dig 'til I find it, I wind it up, and the tune just starts\nIt's playing a song, so beautiful, and the room is dark\nThe moon is full, I smell a funeral, guess I'll loom in the park\n\n[Hook]\n(My music box)\n'Cause when the lights are off, I see the girl's asleep\n(My music box)\nBut I can hear you, my love, you keep calling me\n(My music box)\nAlthough we're worlds apart, you mean the world to me\n(My music box)\nSo once you call, I come, I will answer\n(My music box, my music box)\n'Cause when the lights are off, I see the girl’s asleep\n(My music box)\nI hear my music box playing a song for me\n(My music box)\nSo won’t you twirl around and do a whirl for me?\n(My music box, my music box)\nAnd would you be my private little dancer?\n\n[Verse 3]\nI'm fixated on asphyxiatin' and breakin' this little chick's neck\nLike a Pixy Stick\nThe sick, Satan-worshippin' bitches get horse whippings\nI'm in the back, through the back door slippin'\nThrough the crack, leavin' the corpse drippin'\nThe mortician of love, sent from above\nForced entry, the more wenchy the more stingy I become\nBeen doing this for more than a quarter-century, I'm just numb\nAm I dreaming, is it real? Someone pinch me on the buns\nThe time has come to tie her up, gotta roll me the ladder\nI've had enough of the chatter\nClimb up to the window, look at her\nThen climb in slow to shatter her brain matter and batter her\nWith a bat; a matter of fact, that will splatter her\nBut before I do that, I'll have a chat to flatter her\nGive her two compliments back to back, like \"Tabitha\nI'm your secret admirer, I'm back to ravish ya\nSo strong is your fight, but you're no match for Dracula\"\nProlonging her plight as I go back to stabbin' her\nDismember her limbs, simple as that: cadaver her\nZoom in with the lens, then pan back the camera\nStand back, 'cause here comes your man Jack, so Pamela\n\n[Hook]\n(My music box)\n'Cause when the lights are off, I see the girl's asleep\n(My music box)\nBut I can hear you, my love, you keep calling me\n(My music box)\nAlthough we're worlds apart, you mean the world to me\n(My music box)\nSo once you call, I come, I will answer\n(My music box, my music box)\n'Cause when the lights are off, I see the girl’s asleep\n(My music box)\nI hear my music box playing a song for me\n(My music box)\nSo won’t you twirl around and do a whirl for me?\n(My music box, my music box)\nAnd would you be my private little dancer?"}