{"rank":"95","song_id":"24477","song_name":"O Let's Do It","artist_id":"277783","display_artist":"Waka Flocka Flame","spotify_id":"0wCC06ziWEkYOif44iFggw","lyrics":"[Verse 1: Waka Flocka Flame]\nI fucked my money up, now I can't re-up\nRan up in his spot just to get my stacks up\nNow I'm back on deck, so shawty, what the fuck you want?\nHeard he's talking shit, but this ain't what the fuck you want\nLocked my CEO up, now it's back to coca\nNiggas talking shit, bro, hang him by a ropa\nHit em with the chopper, call that shit hot llama\nCall me Waka Flocka AKA Young Wild Nigga\nAKA Young Drug Dealer\nGot purp, got kush, got pills, got white\nIn the trap all night with the hard and the soft\nStacks on the floor, watch Kebo water whipping\nShoots it to the left, then he shoots it to the right\nSo Icey Brick Boys got it all night\nThese lame-ass niggas ain't got no fight\nKick in my door, we gonna shoot it out all night\nHome of the Braves, shawty, shoot 'em with AK\n\n[Hook: Waka Flocka Flame]\nYeah! Oh let's do it\nOh let's do it, oh let's do it\nYeah! Drug dealing music\nI influence, I influence\nYeah! Oh let's do it\nOh let's do it, oh let's do it\nYeah! Drug dealing music\nI influence, I influence\n\n[Verse 2: Waka Flocka Flame]\nOne shot, man down, his brains go \"ka-pow!\"\nOw, that shit hurt, so don't fuck around\nBut that happen often off in Riverdale, Georgia\nYou gonna pay the life you live off in Riverdale, Georgia\nThey gonna lay your ass out, rock you to sleep like a baby\nHit Squad, shawty, in the hood, we got them babies\nEver since they killed my nigga Travis\nStart popping pills and acting crazy\nEver since they killed my nigga Travis\nStart popping pills and acting crazy\n\n[Hook: Waka Flocka Flame]\nYeah! Oh let's do it\nOh let's do it, oh let's do it\nYeah! Drug dealing music\nI influence, I influence\nYeah! Oh let's do it\nOh let's do it, oh let's do it\nYeah! Drug dealing music\nI influence, I influence\n\n[Verse 3: Lil Capp]\nYeah, Flocka said let's do it\nAnd this Real Money, so we getting to it\nAnd your bitch, she choosing\nBut if you ain't talking dollars, keep it moving\nCatch me on the south with Flocka Flame\nAnd we got a problem if you saying Waka's name\n'Cause we off the chain, you see my green flag\nYou want beef? Oh let's do it 'cause you ain't bad\nAnd this music is for the drug dealers\nAnd this music influence thug niggas\nOkay, so if you get into it\nAy, oh let's do it\nAy, oh let's do it\n\n[Hook: Waka Flocka Flame]\nYeah! Oh let's do it\nOh let's do it, oh let's do it\nYeah! Drug dealing music\nI influence, I influence\nYeah! Oh let's do it\nOh let's do it, oh let's do it\nYeah! Drug dealing music\nI influence, I influence\n\n[Original Verse 3: Riverdale Shawty & Waka Flocka Flame]\nYou know me, nigga, I am the block\nIt's Riverdale and Waka Flock\nWe got the Glocks, whips and the knots\nEven got the spots (Scurt! Scurt!) off the block\nCatch me in different states, busting down bricks\nBusting down bricks with that chick you fell in love with\nWe on that thug shit, give a fuck about love, I'm cruel, bitch\nKeep my money on my mind, not you, bitch\nEvery day, shawty pull up in a new whip\nIn the trap, shawty said he need another one\nTold them call up Waka, he said \"What the fuck you want?\"\nPull up in the dunk followed by a yellow one\nSo Icey, Fetti Gang, pussy keep them Tommy guns"}