{"rank":"88","song_id":"24492","song_name":"Women Lie, Men Lie","artist_id":"431628","display_artist":"Yo Gotti Featuring Lil Wayne","spotify_id":"6jDMlQsmDnKtusidx4P4p8","lyrics":"[Hook]\nWomen lie, men lie\nWomen lie, men lie\nWomen lie, men lie\nNumbers don't lie\n[x6]\n\n[Verse 1: Yo Gotti]\nAy, step up in the party and them bad bitches be on me\nI be sipping on Patron when I'm jumping out Ferrari's\nI be rocking Gucci, sometimes Louis, I'm retarded\nAnd the rims by Asanti, but the shades by Bulgari\nHand on my scrap, I got my mind on my money\nPlus if my mind on dine, he ain't taking nothing from me\nHeaded on this choppa tool, headed on this choppa tool\nGot headed on a hundered round cause that's how much the choppa shoot\nBall-balling is my hobby, counting hundreds, going shopping\nAnd a 5 star wit me and I met her in the lobby\nTook her to the room, she hit me with that line\nSaid she ain't that type of girl, so I told her stop lyin'\n\n[Hook]\n[x4]\n\n[Verse 2: Lil Wayne]\nYoung Money, yeah!\nOkay, I ain't gotta lie, cross my heart, hope to die\nThem numbers don't lie, G5 over sky\nI fucked her pussy good, make her cry if I tried\nBut I'm tired of being sick, and I'm sick of being tired\nTired of these niggas, and tired of these bitches\nAnd shit, let them lie, long as they ain't snitching\nAnd men lie about women\nAnd shit; women lie about plenty\nAnd they ain't lying on me\nI'm in the bed with two fine bitches lying on me\nSo that would make three, and numbers don't lie\nAnd money don't lie, and neither do I, bitch!\n[Hook overlaps] Cause I'm the truth\nYeah Now what are you? Haha!\n\n[Hook]\n[x4]\n\n[Verse 3: Yo Gotti]\nI'm tryna count to a billion\nMy bitch, Brazilian\nHop in that Lamb', push the button, lose the ceiling\nSun out, no rain drops, posting the same spot\nRight here in North, North Memphis where I came from\nHundred on the neck, I ain't never had shit\nThat the streets gave me family, Barry White cut the check\nAin't no secret in the streets, niggas know I got neck\nGot the swagger through the roof, I was born just to flex\nZip code on my wrist, phone number in the bank\nIn my ten 'til six with my 305 paint\nI got my 3-5-7 and my 501's\nIn a Lear 55 wit my Air Force Ones\nNo lie!\n\n[Hook]\n\n[Outro]\nWomen lie, men lie\nWomen lie, men lie\nSay what you want but the fucka' don't lie"}