{"rank":"35","song_id":"24507","song_name":"Over","artist_id":"301284","display_artist":"Drake","spotify_id":"749SJvmRHD43wFUnBtUJ36","lyrics":"[Produced by Boi-1da and Al-Khaaliq]\n\n[Intro]\nYoung Money\n\n[Chorus]\nI know way too many people here right now\nThat I didn't know last year—who the fuck are y'all?\nI swear it feels like the last few nights\nWe've been everywhere and back\nBut I just can't remember it all\nWhat am I doing? What am I doing?\nOh yeah, that's right—I'm doing me, I'm doing me\nI'm living life right now, man\nAnd this what I'ma do 'til it's over, 'til it's over\nBut it's far from over\n\n[Verse 1]\nAlright, bottles on me, long as someone drink it\nNever drop the ball, fuck are y'all thinking?\nMaking sure the Young Money ship is never sinking\nAbout to set it off in this bitch: Jada Pinkett\nI shouldn't have drove, tell me how I'm getting home\nYou too fine to be laying down in bed alone\nI could teach you how to speak my language, Rosetta Stone\nI swear this life is like the sweetest thing I've ever known\nAbout to go thriller, Mike Jackson on these niggas\nAll I need's a fucking red jacket with some zippers\nSuper good smidoke, a package of the Swisher's\nI did it overnight, it couldn't happen any quicker\n\"Y'all know them? Well, fuck it, me neither\"\nBut point the biggest skeptic out, I'll make him a believer\nIt wouldn't be the first time I done it, throwing hundreds\nWhen I should be throwing ones, bitch, I run it\n\n[Chorus]\nI know way too many people here right now\nThat I didn't know last year—who the fuck are y'all?\nI swear it feels like the last few nights\nWe've been everywhere and back\nBut I just can't remember it all\nWhat am I doing? What am I doing?\nOh yeah, that's right—I'm doing me, I'm doing me\nI'm living life right now, man\nAnd this what I'ma do 'til it's over, 'til it's over\nBut it's far from over\n\n[Verse 2]\nOne thing 'bout music: when it hits, you feel no pain\nAnd I swear I got this shit that make these bitches go insane\nSo they tell me that they love me\nI know better than that, it's just game\nIt's just what comes with the fame\nAnd I'm ready for that, I'm just saying\nBut I really can't complain, everything is kosher\nTwo thumbs up, Ebert and Roeper\nI really can't see the end getting any closer\nBut I'll probably still be the man when everything is over\nSo I'm riding through the city with my high beams on\nCan you see me? Can you see me? Get your Visine on\nY'all just do not fit the picture: turn your widescreen on\nIf you thinking I'ma quit before I die, dream on\nMan they treat me like a legend, am I really this cold?\nI'm really too young to be feeling this old\nIt's about time you admit it, who you kidding?\nMan nobody's ever done it like I did it, uh\n\n[Chorus]\nI know way too many people here right now\nThat I didn't know last year—who the fuck are y'all?\nI swear it feels like the last few nights\nWe've been everywhere and back\nBut I just can't remember it all\nWhat am I doing? What am I doing?\nOh yeah, that's right—I'm doing me, I'm doing me\nI'm living life right now, man\nAnd this what I'ma do 'til it's over, 'til it's over\nBut it's far from over\nYeah, that's right—I'm doing me, I'm doing me\nI'm living life right now, man\nAnd this what I'ma do 'til it's over, 'til it's over\nBut it's far from over"}