{"rank":"49","song_id":"24511","song_name":"I'm Back","artist_id":"277486","display_artist":"T.I.","spotify_id":"00YAhmYqomnoWd7ogDUtXU","lyrics":"[Hook]\nI never let you down, I’ma shine on sight\nKeep your mind on your grind and off of mines, alright?\nHard I'm gonna ball, on them squares I float\nQuarter-million dollar cars everywhere I go\nI know in the lead it may seem he might be\nBut no matter what they doing, they don’t do it like me\nLike a G I hold it down for the town I’m at\nIn a flash like that\nRecognize I'm back!\nStrike a match, catch a fire\n\n[Verse 1]\nAny moment I decide that's enough of all your lies\nBoy, your buzz just died\nStep inside, super-fly, to the shoes in their coupe\nThen exit out with all the bitches like we always do\nMy desire to retire grow with every new crew\nCause these guys, they don't ride like my nigga, you too\nTight jeans, funny haircuts dancing on the screen\nThere's a drought of real niggas in the game, so it seems\nJust pretend to holla, pimping, give the shit a black eye eye\nNext he say he trapping in my head I’m like: \"why?\"\nBe yourself; you ain't got a pimp bone in your body\nI can tell you ain't never bought a key or caught a body\nNigga probably just seen Wayne, Gucci Mane\nMe and Boosie all go to prison\nNow he flipping hoes, every nigga tripping\nListen dude, for you that ain't in the cards\nThank the power's in the guns\nBut overall it's in your heart\nNowadays I don’t know what's up with niggas in the A\nGuess he think he in the game but he really in the way:\nViolating. I was having conversations in the joint\nBut guess who done it? And I promised I would put you on point\nI’m disappointed in you, dogg, you ain't hold it down at all\nBut I ain't going at your jaw, just going to show you how to ball\nStanding tall through the storm, on the yard or in the dorms\nCats in prison who expecting me to represent for them\n\n[Hook]\n\n[Verse 2]\nStrike a match, catch a fire, see T.I. add gas\nWhat's a Molotov cocktail that never break a glass\nStill I am, partnas want to come for me you better bring it\nI ain’t mad I forgive them, God I know they ain't mean it\nYeah I seen it all before, hate I'm popping and they ain't\nWrack they brain try to think how to stop it and they can’t\nAin't that lame, but then that hatred manifest to pure malice\nI’m no longer being callous, I’m gonna let you niggas have it\nWon’t be satisfied until somebody dies and I'm patiently waiting on\nMe and the reaper on a first name basis now\nI’m a let you make it now, stay totally out the way for you\nBut know that we could take it any place you wanna take it too\nHating in your blood, Cuz. Yes, it’s just too late for you\nAll I could do is pray for you or organize a wake for you\nYour choice, clearly I ain't hearing your voice\nKeep it up an Imma send you ass to chill wit Aunt Joyce\nHey, you can have the bottom, partner I'm up in the sky box\nI got shit locked down nigga why stop now\nI'm so above you, hover over suckers why drop down\nI’m so profound, it goes down, and I never let you down"}