{"rank":"93","song_id":"24612","song_name":"Who Dat","artist_id":"276541","display_artist":"J. Cole","spotify_id":"0NkhsTIoveKdBQAfGDCNBw","lyrics":"[Intro]\nWho dat, who dat?\nWho dat, who dat?\nWho dat, who dat?\n\n[Verse 1]\nHey, who dat, who dat? That nigga you been waiting for\nI mean the shit was all bad just a week ago\nRappers was bullshitting, fuck it I ain't hating though\nBecause now a nigga hot enough to fuck with one of Satan' hoes\nAnd she can't tell the difference, I been through hell conditions\nWishing for air conditioning, feeling God was never listening\nNow I'm on television, and did I fail to mention?\nYour bitch is tired of missionary, boy you failed the mission\nSpeaking of positions just witness how I elevate it\nReal niggas celebrate it, finger fuck whoever hate it\nMy life accelerated, but had to wait my turn\nThen I redecorated, that mean my tables turned\nLive life, might as well, only way to learn\nIs try and fail, clientele the only way to earn\nSo if you're selling crack, or if you're selling rap\nMake sure it's mean so them fiends keep on coming back\n\n[Hook]\nWho dat, who dat? Bitch I got that flame\nWho dat, who dat? Bitch I got that flame\nWho dat, who dat? Bitch I got that flame\nSo don't worry about my motherfucking name\nI got them saying who dat, who dat? Cole World\nWho dat, who dat? I got them saying\nWho dat, who dat? Cole World\nWho dat, who dat?\n\n[Verse 2]\nHey, the mind state of a winner\nWhen you thinking about summertime I'm thinking about the winter\nWhen you thinking about breakfast I'm heating up my dinner\nI was plotting this moment back when y'all was riding spinners\nYeah I'm a menace, God as my witness, with this pen I'm insane, yup\nHungry like the nigga who ain't got the taste of fame yet\nClown told me, “Ain't you Roc? But where the fuck your chain at?”\nGuess it's something like your girl, nigga it ain't came yet\nThe man make the chain, chain don't make the man\nHow many niggas do we know with hella ice but yet they lame?\nThe cloth from which we came me and them is not the same\nIt's like we all headed to Spain they took the boat I took the plane, damn\nThat boy's sick now hoes on his joystick\nHeating up like May weather, dog I'm on that Floyd shit\nBoy stick to your day job, said you was hot? Well, they lied\nIs that your girl? Well, I just G'd her, no A-Rod\n\n[Hook]\nWho dat, who dat? Bitch I got that flame\nWho dat, who dat? Bitch I got that flame\nWho dat, who dat? Bitch I got that flame\nSo don't worry about my motherfucking name\nI got them saying who dat, who dat? Cole World\nWho dat, who dat? I got them saying\nWho dat, who dat? Cole World\nWho dat, who dat?\n\n[Interlude: Andre 3000]\nNow who else want to fuck with Hollywood Cole?\n\n[Verse 3]\nThe little engine that could, this little nigga is good\nRappers claiming they sick, I heal niggas for good\nA couple of y'all ain't took a field trip to the hood\nAnd me? I'm fresh prince, I'm Will Smith to the hood\nBaby, ain't saying names but we not the same\nAll the money and the fame don't change the fact that you lame\nMight want to grab you a chain, want to tip up your hat\nMight want to purchase some game, homey your shit is so wack\nI got my finger on the trigger, tell that nigga, “hold that”\nWant picture perfect baby you can check the Kodak\nHey, so anything you can do I can do better\nAnd any chick you can screw I can get wetter\nI'm young, black, gifted, live my life on the run\nBet your bottom dollar before I'm done\nThey say that I'm the one, ya nigga I'm the one\nI got them saying\n\n[Hook]\nWho dat, who dat? Bitch I got that flame\nWho dat, who dat? Bitch I got that flame\nWho dat, who dat? Bitch I got that flame\nSo don't worry about my motherfucking name\nI got them saying who dat, who dat? Cole World\nWho dat, who dat? I got them saying\nWho dat, who dat? Cole World\nWho dat, who dat?"}