{"rank":"93","song_id":"24624","song_name":"Loser","artist_id":null,"display_artist":"Glee Cast","spotify_id":"3iAvTn62s7rvE6hm6fFodt","lyrics":"Puck:\nIn the time of chimpanzees I was a monkey\nButane in my veins, so I'm out to get the junkie\nWith the plastic eyeballs, spraypaint the vegetables\nDog food stalls with the beefcake pantyhose\n\nFinn:\nKill the headlights and put it in neutral\nStockcar flaming with a loser in the cruise control\nBaby's in Reno with the vitamin D\nGot a couple of couches, sleep on the love seat\n\nPuck:\nSomeone came sayin' I'm insane\nTo complain about\nA shotgun wedding and a stain on my shirt\n\nFinn:\nDon't believe everything that you breathe\nYou got a parking violation and a maggot on your sleeve\nSo shave your face with some mace in the dark\n\nFinn and Puck:\nSaving all your food stamps for burning down the trailer park\n\nHoward:\nYo\n\nFinn:\nCut it!\n\nThe Group:\nSoy un perdedor, I'm a loser baby so why don't you kill me (Finn: Double barrel buckshot)\nSoy un perdedor, I'm a loser baby so why don't you kill me\n\nPuck:\nForces of evil on a bozo nightmare\nBan all the music with a phony gas chamber\nCause one's got a weasel and others got a flag\nOne's on the pole, shove the other in a bag\nWith the rerun shows and cocaine nose job\nThe daytime crap of the folk singers slop\nHe hung himself with a guitar string\nA slab of turkey neck and it's hangin' from a pigeon wing\n\nFinn:\nYa' can't write if ya' can't relate\nTrade the cash for the beef for the body for the hate\nAnd my time is a piece of wax, fallen on a termite\nWho's chokin' on the splinters?\n\nThe Group:\nSoy un perdedor, I'm a loser baby (Terri: I'm a loser baby) so why don't you kill me\n(Finn: Get crazy with the cheezwhiz)\nSoy un perdedor, I'm a loser baby so why don't you kill me (Finn: Drive, by, body pierce)\n\nHoward:\nYo bring it on down\n\nThe Group:\nSoy un perdedor, I'm a loser baby, so why don't you kill me\n\nFinn:\nI'm a driver, I'm a winner things are gonna' change I can feel it\n\nThe Group:\nSoy un perdedor, I'm a loser baby (Terri: I'm a loser baby) so why don't you kill me\n(Why don't you kill me) (Puck: I can't believe you!)\nSoy un perdedor, I'm a loser baby so why don't you kill me\n\nSo why don't you kill me?\nSoy un perdedor, I'm a loser baby (Terri: I'm a loser baby) so why don't you kill me\nSo why don't you kill me (Sandy: Sprechen Sie Deutsch, baby?)\nSoy un perdedor, I'm a loser baby so why don't you kill me\nSo why don't you kill me?"}