{"rank":"71","song_id":"24661","song_name":"Cold Wind Blows","artist_id":"301722","display_artist":"Eminem","spotify_id":"3Tj1luJyKPQt7WbrqpJ2Az","lyrics":"[Produced by Just Blaze]\n\n[Intro]\n‘Cause some things just don't change\nIt's better when they stay the same\nAlthough the whole world knows your name\nSome want a bigger stage\nThey came to see you spit your game\nBut it shouldn't be difficult to explain\nJust why you came back again\nYou hate the fame, love the game\nCold as ice you remain, fuck them all\nTell them all eat shit, here we go again\n\nGod damn! Is it that time again already?\nY'all don’t look too happy to see me\nFuck man, don’t everybody welcome me back at once\nAll right, fuck y’all then!\n\n[Verse 1]\nYou can get the dick, just call me the ball sack, I'm nuts\nMichael Vick in this bitch, dog—fall back, you mutts!\nFuck your worms, you've never seen such a sick puppy\nFuck it, a sick duck,  I want my duck sicked, mommy\nAnd my nuts licked, gobble them up trick, yummy\nBitch, you don't fuckin' think I know\nThat you suck dick, dummy?\nYou'll get your butt kicked, fuck all that love shit, honey\nYeah, I laugh when I call you a slut, it's funny\nShorty, dance, while I diss you to the beat, fuck the words\nYou don't listen to 'em anyway, yeah, struck a nerve\nSucker, motherfucker, might as well let my lips pucker\nLike Elton John, ‘cause I'm just a mean cocksucker\nThe shit is on ‘cause you went and pissed me off\nNow I'm shittin' and pissin' on everybody\nGive a fuck if it's right or wrong\nSo puff the Buddha, light a bong, but take a look at Mariah\nNext time I inspire you to write a song—come on!\n\n[Chorus]\nOh, oh-oh, oh-oh, oh\nI'm as cold as the cold wind blows\nWhen it snows and it's 20 below\nAsk me why, man, I just don't know\nNo-no-no, no-no, no\nI'm as cold as the cold wind blows\nBlow-blow-blows\nBlow-blow, blows, oh, oh-oh\n\n[Verse 2]\nFuck it, I'm a loose cannon\nBruce Banner's back in the booth\nY'all are sittin' ducks, I'm the only goose standin'\nI'll set the world on fire, piss on it, put it out\nStick my dick in a circle, but I'm not fuckin' around\nMothafucka, I'll show you pussy-footin'\nI'll kick a bitch in the cunt 'til it makes a queef\nAnd sounds like a fuckin' whoopee cushion\nWho the fuck is you pushin'?\nYou must've mistook me for some sissy soft punk\nLookin' for some nookie or bosom\nGo ahead, fuckin' hater, push me!\nI told you ain't no fuckin' way to shush me\nCall me a faggot ‘cause I hate a pussy\nMan the fuck up, sissy, G's up\nAll you gardeners freeze up\nPut your hoes down, “Shady ease up!\nMan, chill!”, naw I can't, goddamn it, rap is a landfill\nDrop the anvil, these are shoes that you can't fill\nShit the day that happens the world will stop spinnin'\nAnd Michael J. Fox'll come to a standstill\nDuring a earthquake urine in your face\n‘Cause you're fake, ah! What the fuck? That hurt, wait!\nAh what the fuck! I just got struck by lightnin'\nAll right then, I quit, God, I give up\nCall it evil that men do\nLord, forgive me for what my pen do\n“This is for your sins, I cleanse you\nAnd you can repent, but I warn you\nIf you continue, to Hell I'll send you”\nAnd just then the wind blew, and I said...\n\n[Chorus]\nOh, oh-oh, oh-oh, oh\nI'm as cold as the cold wind blows\nWhen it snows and it's 20 below\nAsk me why, man, I just don't know\nNo-no-no, no-no, no\nI'm as cold as the cold wind blows\nBlow-blow-blows\nBlow-blow, blows, oh, oh-oh-oh\n\n[Verse 3]\nHow long will I be this way? Shady until my dyin' day\n'Til I hang up the mic and it's time for me to say\n\"So long,\" 'til then I'll drop the fuckin' bombs\nLike I missed the pass when I went long\nIf you don't like it you can kiss my ass in a lint thong\nNow sing along, slut this, slut that\nLearn the words to the song\n\"Oh, bitches don't like that,\" homie, I'll be nicer to women\nWhen Aquaman drowns\nAnd the Human Torch starts swimmin'\nMan, I'm a cold soul, I roll solo\nSo, don't compare me to them other bums over there\nIt's like apples to oranges, peaches to plums, yeah\nI'm bananas, pussy, cut off the grapes and grow a pair\nBut I swear, you try to diss me, I'll slaughter you\nI put that on everything, like everyone does with Auto-tune\nThe last thing you want to do\nIs have me spit out a rhyme\nAnd say, \"I was writing this, and I thought of you,\" so\n\n[Chorus]\nOh, oh-oh, oh-oh, oh\nI'm as cold as the cold wind blows\nWhen it snows and it's 20 below\nAsk me why, man, I just don't know\nNo-no-no, no-no, no\nI'm as cold as the cold wind blows\nBlow-blow-blows\nBlow-blow, blows, oh, oh-oh-oh\n\n[Outro]\nI don't know, I don't know what caused\nI don't know what caused me to be this way\nI don't know, I don't know\nBut I'll probably be this way 'til my dyin' day\nI don't know why I'm so, I'm so cold\nMean things I don't mean to say\nI guess this is how you made me"}