{"rank":"92","song_id":"24664","song_name":"25 To Life","artist_id":"301722","display_artist":"Eminem","spotify_id":"0dyWQoMOU9oERL6c9vxtRp","lyrics":"[Produced by DJ Khalil & Danny Keyz]\n\n[Hook]\nToo late for the other side\nCaught in a chase, 25 to life\nToo late for the other side\nCaught in a chase, 25 to life\nToo late\n(I can't keep chasing 'em\nI'm taking my life back)\nCaught in a chase, 25 to life\n\n[Verse 1]\nI don't think she understands the sacrifices that I've made\nMaybe if this bitch had acted right I woulda stayed\nBut I've already wasted over half my life, I woulda laid\nDown and died for you, I no longer cry for you, no more pain\nBitch, you took me for granted\nTook my heart and ran it straight into the planet\nInto the dirt, I can no longer stand it\nNow my respect, I demand it\nI'ma take control of this relationship, command it\nAnd I'ma be the boss of you now, goddamn it\nAnd what I mean is that I will no longer let you control me\nSo you better hear me out, this much you owe me\nI gave up my life for you, totally devoted to you I have stayed\nFaithful all the way, this is how I fuckin' get repaid?\nLook at how I dress, fuckin' baggy sweats, go to work a mess\nAlways in a rush to get back to you, I ain't heard you yet\nNot even once say you appreciate me, I deserve respect\nI've done my best to give you nothin' less than perfectness\nAnd I know that if I end this I'll no longer have nothin' left\nBut you keep treatin' me like a staircase: it's time to fuckin' step\nAnd I won't be comin' back, so don't hold your fuckin' breath\nYou know what you've done, no need to go in depth\nI told you you'd be sorry if I fuckin' left\nI laughed while you wept, how's it feel now?\nYeah, funny, ain't it? You neglected me\nDid me a favor, though, my spirit free you've set\nBut a special place for you in my heart I have kept\nIt's unfortunate, but it's…\n\n[Hook]\nToo late for the other side\nCaught in a chase, 25 to life\n(Can't take no more)\nToo late for the other side\nCaught in a chase, 25 to life\n\n[Verse 2]\nI feel like when I bend over backwards for you, all you do is laugh\n‘Cause that ain't good enough\nYou expect me to fold myself in half 'til I snap\nDon't think I'm loyal, all I do is rap\nHow can I moonlight on the side? I have no life outside of that\nDon't I give you enough of my time?\nYou don't think so, do you?\nJealous when I spend time with the girls\nWhy I'm married to you still? Man, I don't know\nBut tonight I'm serving you with papers\nI'm divorcing you – go marry someone else and make 'em famous!\nAnd take away their freedom like you did to me\nTreat 'em like you don't need 'em and they ain't worthy of you\nFeed 'em the same shit that you made me eat\nI'm moving on, forget you\nOh, now I'm special? I ain't feel special when I was with you\nAll I ever felt was this helplessness\nImprisoned by a selfish bitch\nChew me up and spit me out, I fell for this\nSo many times it's ridiculous\nAnd still I stick with this, I'm sick of this\nBut in my sickness and addiction you're addictive as they get\nEvil as they come, vindictive as they make 'em\nMy friends keep askin' me why I can't just walk away from\nI'm addicted to the pain, the stress, the drama\nI'm drawn to shit, I guess I'm a\nMess, cursed and blessed, but this time I\nAin't changin' my mind, I'm climbin' out this abyss\nYou're screamin' as I walk out that I'll be missed\nBut when you spoke of people\nWho meant the most to you, you left me off your list\nFuck you, Hip-Hop! I'm leavin' you\nMy life sentence is served, bitch, and it's just…\n\n[Hook]\nToo late for the other side\nCaught in a chase 25 to life\n(I'm gone, man)\nToo late for the other side\nCaught in a chase 25 to life\nToo late\nCaught in a chase 25 to life"}