{"rank":"30","song_id":"24692","song_name":"Aston Martin Music","artist_id":"365033","display_artist":"Rick Ross Featuring Drake & Chrisette Michele","spotify_id":"5W7xC99N2Zzfh69r7I7zWK","lyrics":"[Intro: Rick Ross]\nOh\nLet's pull the 2-seater out baby\nIt's where ever you wanna go!\n\n[Hook: Chrisette Michele]\nRiding to the music, this is how we do it (all night), all night\nBreezing down the freeway just me and my baby, in our ride\nJust me and my boss, no worries at all\nListening to the Aston Martin Music, Music\n\n[Post-Hook: Drake]\nWould've came back for you\nI just needed time to do what I had to do\nCaught in the life I can't it let it go\nWhether that's right I will never know\nBut here goes nothing\n\n[Verse 1: Rick Ross]\nWhen I'm alone in my room sometime I stare at the wall\nAutomatic weapons on the floor, but who can you call?\nMy down, bitch, one who live by the code\nPut this music shit aside get it in on the road\nA lot of quiet time pink bottles of rose\nExotic red bottoms whole body glittered in gold\nFollowing fundamentals and following in the rental\nI love a nasty girl whose swallow is on the menu\nThat money triple up when ya get it out of state\nI need a new safe cause I'm running out of space\nElroy Jetson: I'm somewhere out in space\nIn my 2-seater she's the one that I would take\n\n[Hook: Chrisette Michele]\nRiding to the music, this is how we do it (all night), all night\nBreezing down the freeway just me and my baby, in our ride\nJust me and my boss, no worries at all\nListening to the, Aston Martin Music, Music\n\n[Post-Hook: Drake]\nWould've came back for you\nI just needed time to do what I had to do\nCaught in the life I can't it let it go\nWhether that's right I will never know\nBut here goes nothing\n\n[Verse 2: Rick Ross]\nPull up on the block in a drop-top chicken box\nMr. KFC, VVS's in the watch\nLiving fast where it's all about that money bag\nNever front, you take it there, it ain't no coming back\nTop down right here is where she wanna be\nAs my goals unfold right in front of me\nEvery time we fuck her soul take a hold of me\nAddicted like Pookie that pussy be controlling me\nThat thing keep calling\nFuck maintain boy: I gotta keep ballin!\nPink bottles keep coming\nJames Bond coupe pop clutch 100\n\n[Hook: Chrisette Michele]\nRiding to the music, this is how we do it (all night), all night\nBreezing down the freeway just me and my baby, in our ride\nJust me and my boss, no worries at all\nListening to the Aston Martin Music, Music\n\n[Interlude: Drake]\nWould've came back for you\nI just needed time, to do what I had to do\nCaught in the life, I can't let it go, whether that's right, I will never know\nHoping you will forgive me, never meant wrong\nTried to be patient, waited too long\nBut I would've came back, but I would've came back\nWould've came back, would've came back\nWould've came -\n\n[Verse 3: Drake]\nI talk slicker than a pimp from Augusta\nWho just had his linen suit dry-cleaned, bitches, what’s up witcha?\nI hate callin’ the women bitches, but the bitches love it\nI took some sense and made a nickel of it\nI’m urgin’ all daughters to kiss they mothers\nWith those lips that all that lipstick covers\nYou’re never too grown up to miss and hug her\nAnd girls countin’ on me to be there like missin’ rubbers\nI’m on some Marvin Gaye shit, a bunch of distant lovers\nThis ain’t the life that I’m used to\nReintroduced to people I’ve been introduced to\nDid you forget me?\nOr are you too scared to tell me that you met me\nAnd fear that I won’t remember\nI wish you could still accept me for me\nI miss Memphis, Tennessee, my cousins, my dad\nThe simplistic beauty that all of them Southerners have\nI’m halfway across the world with dozens of bags\nFeelin’ like all four members of Color Me Badd\nIn one nigga, amazing shit\nI got that Courtney Love for you, that crazy shit\nI don’t drink every bottle I own, I be agin’ shit\nAnd I got them wedding ring flows, that engagin’ shit\nWhich one of y’all got fleets on your keychains?\nThe seats for these Heat games?\nI really think you stare at yourself and you see things\nLa Familia, I’ve been inducted and instructed\nTo stunt on these niggas we don’t really fuck wit\nFuck is up?\nHavin’ lunch and debatin’ Ferrari prices\n23 and goin’ through a midlife crisis\nBut trust me, I still deliver like a midwife\nAnd no, I’m not sayin’ I’m the nicest, I just live life like it\nUh, it take a certain type of man to teach\nTo be far from hood, but to understand the streets\nI never threw away that paper with my Grammy speech\nBecause I haven’t hit the pinnacles I plan to reach\nYeah, you gotta own it if you want it\nKisses all on her body, she tells me live in the moment\nAnd, baby, I’ll never forget none of that\nGirl, I told you I was coming back\n\n[Outro: Chrisette Michele]\nAston Martin Music, Music\nAston Martin Music, Music"}