{"rank":"18","song_id":"24734","song_name":"No Hands","artist_id":"277783","display_artist":"Waka Flocka Flame Featuring Roscoe Dash & Wale","spotify_id":"6GgPsuz0HEO0nrO2T0QhDv","lyrics":"[Chorus: Roscoe Dash]\nGirl, the way you're moving got me in a trance\nDJ, turn me up\nLadies, this your jam\nI'ma sip Moscato and you gon' lose them pants\nThen I'ma throw this money while you do it with no hands\nGirl, drop it to the floor, I love the way your booty go\nAll I wanna do is sit back and watch you move and I'll proceed to throw this cash\n\n[Verse 1: Waka Flocka Flame]\nAll that ass in your jeans\nCan Wale beat? Can Roscoe skeet?\nLong hair, she don't care\nWhen she walk, she gets stares\nBrown-skin or a yellow bone\nDJ, this my favorite song\nSo I'ma make it thunderstorm, flood warning, Flocka, yeah\nBlow it, fuck it, I don't care\nJacksons flying everywhere\nTap my partner Roscoe like, \"Bruh, I'm drunk as hell, can't you tell?\nThrew 70 bands, bet 50 stacks, oh fucking well\nI'm trying hit the hotel with two girls that'll swallow me\nTake this dick while I swallow Pink Moscato, got her freaky\nHey, you got me in a trance, please take off your pants\nPussy pop on a handstand, you got me sweating\nPlease pass me a fan, damn\n\n[Chorus: Roscoe Dash]\nGirl, the way you're moving got me in a trance\nDJ, turn me up\nLadies, this your jam\nI'ma sip Moscato and you gon' lose them pants\nThen I'ma throw this money while you do it with no hands\nGirl, drop it to the floor, I love the way your booty go\nAll I wanna do is sit back and watch you move and I'll proceed to throw this cash\n\n[Verse 2: Wale]\nShe said, \"Look, ma, no hands\"\nShe said, \"Look, ma, no hands and no, darling, I don't dance\"\nAnd I'm with Roscoe, I'm with Waka, I think I deserve a chance\nI'm a bad motherfucker, go and ask some motherfuckers\nA young handsome motherfucker, I sling that wood, I just Nunchuck them\nWho you with, and what's your name?\nAnd you not hip, boo, I'm Wale\nAnd that D.C. shit, I rep all day\nAnd my eyes red 'cause of all that haze\nDon't blow my high, let me shine\nDrumma on the beat, let me take my time\nNiggas want beef, we can take it outside\nFight for what broad? These hoes ain't mine\nIs you out your mind? You out your league\nI sweat no bitches, just sweat out weaves\nWear out tracks, let me do my thing\nI got 16 for this Roscoe thing\nBut I'm almost done, let me get back to it\nWhole lot of loud and a little Backwood\nWhole lot of money, big tip, I would\nI put her on the train, little engine could, bitch\n\n[Chorus: Roscoe Dash]\nGirl, the way you're moving got me in a trance\nDJ, turn me up\nLadies, this your jam\nI'ma sip Moscato and you gon' lose them pants\nThen I'ma throw this money while you do it with no hands\nGirl, drop it to the floor, I love the way your booty go\nAll I wanna do is sit back and watch you move and I'll proceed to throw this cash\n\n[Verse 3: Roscoe Dash]\nR-O-S-C-O-E, Mr. Shawty-Put-It-On-Me\nI be going ham, shawty upgrade from bologna\nThem niggas tipping good, girl, but I can make it flood\n'Cause I walk around with pockets that are bigger than my bus\nRain, rain, go away, that's what all my haters say\nMy pockets stuck on overload, my rain never evaporates\nNo need to elaborate, most of these ducks exaggerate\nBut I'ma get money, nigga, everyday stunting, nigga\nDucks might get a chance after me\nBitch, I'm balling like I'm coming off of free throws\nJust ahead of the game, no cheat codes\nLambo, Roscoe, no street code\nAnd your booty got me lost like Nemo\nGo, go, go, go, go on and do your dance\nAnd I'ma throw this money while you do it with no hands\n\n[Chorus: Roscoe Dash]\nGirl, the way you're moving got me in a trance\nDJ, turn me up\nLadies, this your jam\nI'ma sip Moscato and you gon' lose them pants\nThen I'ma throw this money while you do it with no hands\nGirl, drop it to the floor, I love the way your booty go\nAll I wanna do is sit back and watch you move and I'll proceed to throw this cash"}