{"rank":"17","song_id":"24760","song_name":"Gonorrhea","artist_id":"307264","display_artist":"Lil Wayne Featuring Drake","spotify_id":"2k79z9A1dbdQ8gQG8M1Zz5","lyrics":"[Verse 1: Lil Wayne]\nI am not a human\nShout to all my moon men\nYeah they call me Tune, got them bitches tuned in\nIt's a crazy world, so I stay in mine\nAnd niggas don’t cross the line\nNiggas stay in line\nLike welfare\nI'm Saint Elsewhere\nHotter than a Devil? Nigga, hell yeah\nRock-a-bye baby\nHomicide baby\nThat's more tear drops, call me cry baby\nWhat you talking 'bout? Tell it to my 9\nCut your tongue out, mail it to your moms\nI’m a young God\nSwagger unflawed\nBitch, I'm in the building, you in the front yard\nLife's a bitch, naw, better yet a dumb broad\nAnd I bet I can fuck the world and make it cum hard\nYeah, you boys is washed up\nAnd I’m shitting on 'em like two girls and one cup, yuck\nWeezy Baby AKA Bring The Money Home\nPull out a AK and pop you in your funny bone\nLaugh now, die later motherfucker\nYou's a bitch like Zeta Phi Beta motherfucker\n\n[Hook: Lil Wayne]\nYeah, I call it how I see ya\nI wish I never met ya, I wouldn’t wanna be ya\nPussy ass nigga, I don’t want your gonorrhea\nPussy ass nigga, I don’t want your gonorrhea\nYeah, I call it how I see ya\nI wish I never met ya, I wouldn’t wanna be ya\nPussy ass nigga, I don’t want your gonorrhea\nPussy ass nigga, I don’t want your gonorrhea\n\n[Verse 2: Lil Wayne]\nMan I’m so tired of balling, I sleep a lot now\nI’ll let my goons rush ya, like Moscow\nGun at your eyebrow: Pow-Pow\nMan I ball hard, even with five fouls\nYeah, we in this bitch like tampons\nDump you in the woods, now get your camp on\nChoke-hold around this shit 'cause I’m so hands-on\nI get high as fuck and Polo sheets is what I lands on\nBack against the wall, and my two feet is what I stand on\nDiva in the room, she blowing me just like a band horn\nGot her on her knees, the same knees that she be praying on\nNow she just text her girlfriend with a capital \"You can join\"\nYeah, what y’all wanna do? I’m all ears\nSmoking on that headband, call that shit that Paul Pierce\nI’m just so ahead of my time like dog years\nBal' like Solange, India Arie, Britney Spears\n\n[Hook: Lil Wayne]\nYeah, I call it how I see ya\nI wish I never met ya, I wouldn’t wanna be ya\nPussy ass nigga, I don’t want your gonorrhea\nPussy ass nigga, I don’t want your gonorrhea\nYeah, I call it how I see ya\nI wish I never met ya, I wouldn’t wanna be ya\nPussy ass nigga, I don’t want your gonorrhea\nPussy ass nigga, I don’t want your gonorrhea\n\n[Verse 3: Drake]\nI am spending much more than I’m making\nOn these cars and these vacations, is that too much information?\nI just bought a Lamborghini, I'm not even into racing\nWith a windshield full of tickets cause I live right by the station\nI am tryna figure out why you so mad at me\nYes, I’m with Young Money, tell the magazine stop asking me\nI be with the dread with the tattoos on his head\nAnd a flag the color red like a fucking low battery\n(Okay) Nigga peep the shit I’m wyling on\nI be with your baby mama, you be with your child at home\nBig Mo, Big Red, two cups made of styrofoam\nBig cheese big bread call that shit a calzone\n(Okay) I will break your fucking collar bone\nUs against the world, better pick which fucking side you on\nWayne got a Bugatti that he steady putting mileage on\nAnd we about to kill 'em, C4, Mr. Carter's home\n\n[Outro: Lil Wayne]\nYeah, I call it how I see ya\nI wish I never met ya, I wouldn’t wanna be ya\nWe some asshole niggas, call us diarrhea\nThe money keep growing, yep, it's growing like a Chia\nYeah, I call it how I see it\nY’all some pussy ass niggas: we should call ya gonorrhea\nYou keep talking that shit, I’ma see ya\nKill your senorita and and your fucking Mama Mia"}