{"rank":"52","song_id":"24764","song_name":"I'm A Slave 4 U","artist_id":null,"display_artist":"Glee Cast","spotify_id":"03K011CpEjqCtcSAYCBqow","lyrics":"Brittany:\nI know I may be young\nBut I've got feelings, too\nAnd I need to do what I feel like doing\nSo let me go and just listen\n\nAll you people look at me like I'm a little girl\nWell, did you ever think it'd be okay for me to step into this world?\nAlways saying \"Little girl don't step into the club\"\nWell, I'm just trying to find out why 'cause dancin's what I love, yeah (Now watch me)\n\nGet it, get it, uh\nGet it, get it, woah (Do you like it?)\nGet it, get it, oh (It just feels good)\n\nHuh, huh, huh, huh\n\nI know I may come off quiet, may come off shy\nBut I feel like talking, feel like dancing when I see this guy\nWhat's practical is logical, what the hell who cares?\nAll I know is I'm so happy when you dancing there, yeah\n\nI'm a slave for you\nI cannot hold it\nI cannot control it\n\nI'm a slave for you\nI won't deny hide it\nI'm not trying to hide it\n\nBaby, don't you wanna dance upon me (I just wanna dance next to you)\nTo another time and place?\nOh, baby, don't you wanna dance upon me? (Are you ready?)\nLeaving behind my name and age (Uh, uh, let's go)\n\nLike that\nYou like it, yeah\nNow watch me\n\nGet it, get it, uh\nGet it, get it, woah (Do you like it?)\nGet it, get it, oh (It just feels good)\n\nHuh, huh, huh, huh\n\nI really wanna dance tonight with you (I just can't help myself)\nI really wanna do what you want me to (I just feel I let myself go)\nI really wanna dance tonight with you (I wanna see you move)\nI really wanna do what you want me to (Uh, uh, uh)\n\nBaby, don't you wanna dance upon me (I just wanna dance next to you)\nTo another time and place?\nOh, baby, don't you wanna dance upon me? (Are you ready?)\nLeaving behind my name and age\n\nI'm a slave for you (Take that now)\nI cannot hold it\nI cannot control it\n\nI'm a slave for you (It just feels right, It just feels good)\nI won't deny it\nI'm not trying to hide it\n\nGet it, get it, uh\nGet it, get it, whoa\nGet it, get it, oh\n\nHuh, huh, huh, huh (Just dance with me)\n\nGet it, get it, uh\nGet it, get it, whoa\nGet it, get it, oh\n\nHuh, huh, huh, huh\n\nI'm a slave for you (Here we go now, here we go now)\nI cannot hold it\nI cannot control it (Do you like it when I move?)\n\nI'm a slave for you (Uhu, uhu, here we go)\nI won't deny it (Yeah, yeah)\nI'm not trying to hide it\n\nYeah, like that?"}