{"rank":"89","song_id":"24803","song_name":"Rap Song","artist_id":"277474","display_artist":"T-Pain Featuring Rick Ross","spotify_id":"28gIO6msEpMiz8D8uk4zvr","lyrics":"[Intro: T-Pain]\nNappy Boy ooh-wee, ooh-wee\nEverybody say yeah, oh oh oh\nHey, ay-ay-ay-ay\n\n[Verse 1: T-Pain]\nWe've been messin 'round for a long time, a while now\nAnd you already know what's on my mind, it's goin down now\nAnd I don't need no background music girl, I'll turn it up loud now\nI got the gangsta feelin'\nAnd I'mma do somethin' to you, to you, to you\nWe can take it over to The Bay, where my Mistah FAB at?\nOr just put on that N.W.A, comin' *Straight Outta Compton* on that pussy, baby\nOr we can do it all night long, I'm 'bout to have yo' head gone\nAnd I ain't doin nothin' wrong, but we can make love to a rap song\n\n[Hook: T-Pain]\nMe and you, yo' momma and yo' cousin\nBaby we can make love to a rap song\nA milli, a milli, a milli, a motherfucker I'm ill\nBaby we can make love to a rap song\nGo shawty, it's your birthday\nWe gon' party like it's your birthday\nWhere that new Jeezy CD? Put on that Yo Gotti\nI'm diggin in your coochie while we're listenin to Gucci on a rap song\n\n[Verse 2: T-Pain]\nAnd you been on my mind all day, I know you're with it\nAnd I'mma do you like Kanye, cause \"I'ma let you finish\" (I'ma let you finish)\nYou can get it or we can do it East Coast style, and I'll keep on my fitted\nI said I got the gangsta feelin\nI feel like breakin you off, you off, you off\nOr we can take it way down South, Rick Ross on the iPad (cause you the Boss's girl)\nSuper thick thighs\nAnd your booty like Bombs Over Baghdad\nWait, hold up, she got a donk, she got a donk\nShe got a donk, I'm 'bout to have yo' head gone\nAnd I ain't doin nothin wrong, but we can make love to a rap song\n\n[Hook: T-Pain]\nMe and you, yo' momma and yo' cousin\nBaby we can make love to a rap song\nA milli, a milli, a milli, a motherfucker I'm ill\nBaby we can make love to a rap song\nGo shawty, it's your birthday\nWe gon' party like it's your birthday\nWhere that new Jeezy CD? Put on that Yo Gotti\nI'm diggin in your coochie while we're listenin to Gucci on a rap song\n\n[Verse 3: Rick Ross]\nMy jeans sag, boy got a mean swag\nRight now you're rockin' with the finest, and I mean that\nReally, you the finest, and I mean that\nPants fitted, damnit, where your jeans at?\nMakin love to a rap song\n\"Port of Miami,\" \"Trilla,\" \"Deeper Than Rap,\"\nLike Akon, we can stack it all up\nOr do you like I'm Juvi', make you back it all up\nThat's all shorty ever was, Balenciaga bags cost a couple bucks\nHot Is all shorty ever been\nBlow a couple racks in Barney's on that Phillip Lim\nBallin, it's ya birthday\nYou know that champagne'll get your boy to first base\nHaters do they thing, but we do it bigger\nNumber one niggas, Rozay and that boy Teddy Pender\n\n[Hook x2: T-Pain]\nMe and you, yo' momma and yo' cousin\nBaby we can make love to a rap song\nA milli, a milli, a milli, a motherfucker I'm ill\nBaby we can make love to a rap song\nGo shawty, it's your birthday\nWe gon' party like it's your birthday\nWhere that new Jeezy CD? Put on that Yo Gotti\nI'm diggin in your coochie while we're listenin to Gucci on a rap song"}