{"rank":"56","song_id":"24827","song_name":"Roman's Revenge","artist_id":"312259","display_artist":"Nicki Minaj Featuring Eminem","spotify_id":"7eK3fdGXCmhGfE8dKtETQU","lyrics":"[Verse 1: Nicki Minaj as Roman Zolanski]\nI am not Jasmine, I am Aladdin\nSo far ahead, these bums is laggin'\nSee me in that new thing, bums is gaggin'\nI'm startin' to feel like a dungeon dragon\nRaah, raah, like a dungeon dragon\nI'm startin' to feel like a dungeon dragon\nLook at my show footage, how these girls be spazzin'\nSo fuck I look like gettin' back to a has-been?\nYeah, I said it, has-been\nHang it up; flatscreen\nPlasma\n\"Hey Nicki, hey Nicki,\" asthma\nI got the pumps, it ain't got medicine\nI got bars; sentencin'\nI'm a bad bitch, I'm a cunt\nAnd I'll kick that ho; punt\nForced trauma; blunt\nYou play the back, bitch, I'm in the front\nYou need a job, this ain't cuttin' it\nNicki Minaj is who you ain't fuckin' with\nYou lil' brag-a-lot, I beat you with a pad-a-lock\nI am a movie; camera block\nYou outta work, I know it's tough\nBut enough is enough\n\n[Hook: Nicki Minaj as Roman Zolanski]\nRaah, raah, like a dungeon dragon\nRaah, raah, raah, like a dungeon dragon\nRaah, raah, raah, like a dungeon dragon\nLike a dungeon dragon, like a dungeon dragon\n\n[Verse 2: Eminem as Slim Shady]\nI ain't into S&M, but my whip's off the chain\nA little drop of candy paint drips off the frame\nTwisted-ass mind, got a pretzel for a brain\nAn eraser for a head, fuckin' pencil for a frame\nYou don't like it, then peel off, bitch!\nEvery last woman on Earth I'll kill off\nAnd I still wouldn't fuck you, slut!\nSo wipe the smile on your grill off\nI swear to God I'll piss a Happy Meal off\nGet the wheels turning, spin, and wheel off\nSnap the axle in half, bust the tie-rod\nQuit hollering \"Why, God?\"\nHe ain't got shit to do with it\nBygones'll never be bygones\nThe world ain’t finished swallowing my wad\nI ain't finished blowing it, nice bra\nHope it'll fit a tough titty, bitch, life's hard\nI swear to God, life is a dumb blonde white broad\nWith fake tits and a bad dye job\nWho just spit in my fuckin' face and called me a fuckin' tightwad\nSo finally I broke down and bought her an iPod\nAnd caught her stealing my music\nSo I tied her arms and legs to the bed\nSet up the camera and pissed twice on her\nLook, two pees and a tripod!\nThe moral to the story is, life's treating you like dry sod?\nKick it back in its face, my God\nIt's Shady and Nicki Minaj, you might find the sight quite odd\nBut don't ask why, bitch (Ask \"Why not?\")\n\n[Hook: Eminem as Slim Shady]\nThe world-world is my punching bag and\nIf I'm garbage, you're a bunch of maggots\nMake that face, go on, scrunch it up at me\nShow me the target so I can lunge and attack it\nLike a raah, raah, like a dungeon dragon\nYou fell off, off, they musta bumped your wagon\nYou musta went off the back, I'm 'bout to go off the deep end\nI told you to stay in your lane, you just jumped in traffic\n\n[Verse 3: Nicki Minaj as Roman Zolanski]\nIs this the thanks that I get for puttin' you bitches on?\nIs it my fault that all of you bitches gone?\nShoulda sent a thank-you note, you little ho\nNow I'ma wrap your coffin with a bow\n\"Nicki, she's just mad 'cause you took the spot\"\nWord, that bitch mad 'cause I took the spot?\nWell, bitch, if you ain't shittin', then get off the pot\nGot some niggas out in Brooklyn that'll off your top\nI hear them mumblin', I hear the cacklin'\nI got 'em scared, shook, panickin'\nOverseas, church, Vatican\nYou at a standstill; mannequin\nYou wanna sleep on me? Overnight?\nI'm the motherfuckin' boss, overwrite\nAnd when I pull up, vroom, motorbike\nNow all my niggas gettin' buck; overbite\nI see them dusty-ass Filas, Levi's\nRaggedy Ann, holes in your knee-highs\nI call the play, now do you see why?\nThese bitches callin' me Manning Eli\nManning Eli, these bitches callin' me Manning Eli!!\n\n[Verse 4: Eminem as Slim Shady]\nAll you lil' faggots can suck it\nNo homo, but I'ma stick it to 'em like refrigerator magnets\nAnd I'm crooked enough to make straitjackets bend\nYeah, look who's back again, bitch, keep acting as if\nYou had the same passion that I have, yeah, right\nStill hungry, my ass, you ass-dicks had gastric bypass\nAin't hot enough to set fire to dry grass\nAnd 'bout as violent as hair on eyelids but eyelash\nGo take a flying leap of faith off a fuckin' balcony\n'Fore I shove a falcon wing up your fly ass\nYou know what time it is, so why ask?\nWhen Shady and Nicki's worlds clash\nIt's (high class) meets (white trash)\n\n[Hook: Nicki Minaj as Roman Zolanski]\nRaah, raah, like a dungeon dragon\nRaah, raah, raah, like a dungeon dragon\nRaah, raah, raah, like a dungeon dragon\nLike a dungeon dragon, like a dungeon dragon\n\n[Outro: Nicki Minaj as Martha Zolanski]\nRoman, Roman! Stop it, stop it!\nYou've gone mad, mad, I tell you, mad!\nYou and this boy Slim Shady!\nWhat's going on? They'll lock you away!\nThey'll put you in a jail cell! I promise!\nTake your mother's warning, Roman, please\nBack to bed! Run along! Let's go! Come on!\nWash your mouth out with soap, boys"}