{"rank":"38","song_id":"24841","song_name":"Stop! In The Name Of Love / Free Your Mind","artist_id":null,"display_artist":"Glee Cast","spotify_id":"51jSfEPZeqH70uDXyq0nYL","lyrics":"Finn and Puck with New Directions Boys:\nHere we go!\n\nFinn with New Directions Boys:\nStop! In the name of love, before you break my heart (New Directions Boys: Free your mind)\nStop! In the name of love, before you break my heart\nThink it over\n\nArtie (with New Directions Boys):\nI wear tight clothing, high heeled shoes\nIt doesn't mean that I'm a prostitute (no, no)\n\nPuck (with New Directions Boys):\nI like rap music, wear hip hop clothes\nThat doesn't mean that I'm out sellin' dope (no no, no)\n\nFinn with New Directions Boys:\nBefore you can read me you gotta\nLearn how to see me, I said\nStop! In the name of love, before you break my heart (New Directions Boys: Free your mind)\nStop! In the name of love, before you break my heart\nThink it over\n\nPuck with Finn and New Direction Boys:\nFree your mind and the rest will follow (Finn: think it over)\nBe color blind, don't be so shallow\n\nSam:\nI've known of your, your secluded nights\nI've even seen her maybe once or twice\nBut is her sweet expression\nWorth more than my love and affection?\n\nFinn with New Directions Boys:\nBefore you can read me you gotta\nLearn how to see me, I said\nStop! In the name of love, before you break my heart (Artie: Can't stop! Can't stop!)\nStop! In the name of love, before you break my heart (Artie: Before you break my heart and stop!)\nThink it over\n\nPuck with Finn and New Directions Boys:\nFree your mind and the rest will follow\nBe color blind, don't be so shallow\n(Finn: Think it over) Free your mind and the rest will follow (Artie: Oohh, oh-oh-oh)\nBe color blind, don't be so shallow (Artie: Don't break my, don't break my heart)\n\nNew Directions Boys:\nStop!\nStop! (Artie: In the name of love)\nFree your mind\nStop!\nFree your mind\nStop! (Artie: Oh free your mind)\n\nFinn with New Directions Boys:\nBefore you can read me you gotta\nLearn how to see me, I said\n\nFinn with New Directions Boys:\nStop! (Artie: Stop!) In the name of love, before you break my heart (Artie: Before you break my heart) (Free your mind)\nStop! In the name of love (Artie: In the name)\nBefore you break my heart (Artie: Of love)\n\nPuck with New Directions Boys:\nFree your mind and the rest will follow (Finn: Stop! In the name of love) (Artie: Oh free your mind)\nBe color blind, don't be so shallow (Finn: Before you break my heart) (Artie: You got to be!)\nFree your mind and the rest will follow (Finn: Stop! In the name of love) (Artie: Wo, oh oh!)\nBe color blind, don't be so shallow (Finn: Before you break my heart) (Artie: Don't break my, don't break my heart)\n\nFinn with New Directions Boys:\nStop! In the name of love, (Artie: You got to stop it, you got to stop)\nBefore you break my heart (Artie: Don't break my heart) (Puck: Free your mind)\nStop! In the name of love, (Artie: Stop! Stop!) before you break my heart\n\nOh think it over\n\nPuck and New Directions Boys:\nFree your mind\n\nArtie and Finn with New Directions Boys:\nAnd the rest will stop!"}