{"rank":"92","song_id":"24849","song_name":"Scott Mescudi Vs. The World","artist_id":null,"display_artist":"Kid Cudi Featuring Cee-Lo","spotify_id":"5QemHQxj7PRkrw8lJl2W7C","lyrics":"[Intro]\n(Guitar Notes)\n\n[Verse 1: Kid Cudi]\nWhat up, how is everyone doing?\nYou are now in the world I am ruling\nTake a minute to adjust for the wonderous\nClusterfuck of fun and enchantment\nI promise you some Generation-Next shit\nSpeak for the seller who I left with\nParallel levels in the dark, dark place\nTricked all you niggas to a dark, dark fate\nAnd guided you all with a smile upon my face\nAs the sun kisses us on the foreheads gently\nGentle with the drugs, heavy with the love\nAnd my speeches on stage rock mountains from a club\nMoney doesn't move me except on the literal\nG4 flights, now we're off to Australia\nI wanna see more of the world\nThese are more than just words\nThese are facts from a winner\n\n[Chorus: Cee-Lo]\nThis is a journey into the horizon\nYou can see past if it's real to you\nWe can meet on the other side\nOn the other side\nThis is a journey into the horizon\nYou can see past if it's real to you\nThen we can meet on the other side\nOn the other side\n\n[Verse 2: Kid Cudi]\nWhat up, how is everyone feeling?\nI hope you understand what you're hearing\nTake a minute to roll up for the wonderous\nClusterfuck of darkness and evil\nI will paint the Yin and the Yang for you\nAnd my jeans are Dior for the love of skinnies\nUpgraded, fitted it into the T\nWork hard, makin' sure I don't become a memory\nHard to press on when the memories remember me\nAnd they always find the perfect moment\nHigh speed, my momentum won't slow up none\nLost in the wind, I've lost all my friends\nMaybe they were never meant to be acquainted\nMoney seems to make everything tainted\nEverybody mad 'cause they stuck where I knew 'em last\nTook what I wanted and I did it all blunted\nOh, oh\n\n[Chorus: Cee-Lo]\nThis is a journey into the horizon\nYou can see past if it's real to you\nWe can meet on the other side\nOn the other side, ay\nThis is a journey into the horizon\nYou can see past if it's real to you\nWe can meet on the other side\nOn the other side"}