{"rank":"54","song_id":"24877","song_name":"Valerie","artist_id":null,"display_artist":"Glee Cast","spotify_id":"4hBW3h6FnQNh7NRmyxLLG7","lyrics":"Santana (New Directions Girls):\nWell, sometimes I go out by myself\nAnd I look across the water (Uh, uh, uh, uh-uh, uh, uh, uh, uh-uh)\nAnd I think of all the things, what you're doin'\nAnd in my head I paint a picture (Uh, uh, uh, uh-uh, uh, uh, uh, uh-uh)\n\n'Cause since I've come on home (Aaahh, aahh)\nWell, my body's been a mess (Aaahh, aahh)\nAnd I've missed your ginger hair (Aaahh, aahh)\nAnd the way you like to dress\n\nSantana with New Directions:\nWon't you come on over?\nStop making a fool out of me\nWhy don't you come on over Valerie?\n\nSantana (New Directions):\n(Pa, pa, pa, pa, pa, pa, pa, pa) Valerie-e-e (Why don't you come on over?)\n(Pa, pa, pa, pa, pa, pa, pa, pa) Va-a-lerie yeah (Valerie, Valerie)\n(Pa, pa, pa, pa, pa, pa, pa, pa) Valerie-e-e (Why don't you come on over?)\n\nSantana (New Directions Girls):\nDid you have to go to jail\nPut your house on up for sale\nDid you get a good lawyer-e-er? (Uh, uh, uh, uh-uh, uh, uh, uh, uh-uh) (New Directions: Lawyer-e-er)\n\nI hope you didn't catch a tan (Uh, uh, uh, uh-uh, uh, uh, uh, uh-uh)\nI hope you find the right man who'll fix it for you (New Directions: Who'll fix it for you)\nNow are you shopping anywhere (Uh, uh, uh, uh-uh, uh, uh, uh, uh-uh)\nChanged the color of your hair (Uh, uh, uh, uh-uh, uh, uh, uh, uh-uh)\nAnd are you busy? (Uh, uh, uh, uh-uh, uh, uh, uh, uh-uh) (New Directions: Are you busy?)\nAnd did you have to pay that fine (Uh, uh, uh, uh-uh, uh, uh, uh, uh-uh)\nThat you were dodging all the time (Uh, uh, uh, uh-uh, uh, uh, uh, uh-uh)\nAre you still dizzy-y-y? (New Directions: Are you still dizzy, dizzy, dizzy?)\n\nSantana:\nSince I've come on home (Aaahh, aahh)\nWell my body's been a mess (Aaahh, aahh)\nAnd I've missed your ginger hair (Aaahh, aahh)\nAnd the way you like to dress\n\nSantana with New Directions:\nWon't you come on over\nStop making a fool out of me\nWhy don't you come on over Valerie?\n\nSantana (New Directions):\n(Pa, pa, pa, pa, pa, pa, pa, pa) Valerie-e-e (Why don't you come on over?)\n(Pa, pa, pa, pa, pa, pa, pa, pa) Va-a-lerie yeah (Valerie Valerie)\n(Pa, pa, pa, pa, pa, pa, pa, pa) Valerie-e-e (Why don't you come on over?)\n\nSantana (New Directions Girls):\nWell, sometimes I go out by myself (Uh, uh, uh, uh-uh, uh, uh, uh, uh-uh)\nAnd I look across the water (Uh-uh)\nAnd I think of all the things, what you're doing (Uh, uh, uh, uh-uh, uh, uh, uh, uh-uh)\nAnd in my head I paint a picture...... (Uh-uh)\n\n'Cause since I've come on home (Aaahh, aahh)\nWell, my body's been a mess (Aaahh, aahh)\nAnd I've missed your ginger hair (Aaahh, aahh)\nAnd the way you like to dress\n\nSantana with New Directions:\nWon't you come on over\nStop makin' a fool out of me\nWhy don't you come on over Valerie?\n\nSantana (New Directions):\n(Pa, pa, pa, pa, pa, pa, pa, pa) Valerie-e-e (Why don't you come on over?)\n(Pa, pa, pa, pa, pa, pa, pa, pa) Va-a-lerie yeah\n(Pa, pa, pa, pa, pa, pa, pa, pa) Valerie-e-e (Why don't you come on over?) Valerie (Valerie Valerie)\n(Pa, pa, pa, pa, pa, pa, pa, pa) Valerie (Why don't you come on over Valerie?)\n(Pa, pa, pa, pa, pa, pa, pa, pa) Valerie Valerie (Why don't you come on over?)\n(Pa, pa, pa, pa, pa, pa, pa, pa)\n\nSantana with New Directions:\nWhy don't you come on over Valerie?"}