{"rank":"30","song_id":"24901","song_name":"I Just Had Sex","artist_id":"418536","display_artist":"The Lonely Island Featuring Akon","spotify_id":"6eG57n71RMwtmtmeJxinSQ","lyrics":"[Intro: Andy & Akon]\nSometimes\nOh, oh, oh\nSomething beautiful happens in this world\nAkon\nYou don't know how to express yourself, so\nAnd Lonely Island, yeah\nYou just gotta sing\n\n[Hook: Akon]\nI just had sex, and it felt so good (felt so good)\nA woman let me put my penis inside her\nI just had sex, and I'll never go back (never go back)\nTo the not-having-sex ways of the past\n\n[Verse 1: Andy & Jorma]\nHave you ever had sex? I have, it felt great\nIt felt so good when I did it with my penis\nA girl let me do it, it literally just happened\nHaving sex can make a nice man out the meanest\nNever guess where I just came from, I had sex\nIf I had to describe the feeling, it was the best\nWhen I had the sex, man, my penis felt great\nAnd I called my parents right after I was done\nOh, hey, didn't see you there, guess what I just did?\nHad sex, undressed, saw her boobies and the rest\nBut sure nice of her to let you do that thing\nNice of any girl ever! Now, sing\n\n[Hook: Akon]\nI just had sex, and it felt so good (felt so good)\nA woman let me put my penis inside her\nWanna tell the world\n\n[Verse 2: Andy & Jorma]\nTo be honest, I'm surprised she even wanted me to do it\nDoesn't really make sense! But, man, screw it\nI ain't one to argue with a good thing! She could be my wife\nThat good? The best thirty seconds of my life\nI'm so humbled by a girl's ability to let me do her\n'Cause honestly, I'd have sex with a pile of manure\nWith that in mind, the soft nice smell of girls' better\nPlus, she let me wear my chain and my turtleneck sweater\n\n[Bridge: Akon]\nSo this one's dedicated to them girls\nThat let us flop around on top of them, yeah\nWhether you're near or far, whether short or tall\nWe wanna thank you all for letting us fuck you\n\n[Interlude: Andy, Jorma, & Akon]\nShe kept looking at her watch\nDoesn't matter, had sex\nBut I cried the whole time\nDoesn't matter, had sex\nI think she might've been a racist\nDoesn't matter, had sex\nShe put a bag on my head\nStill counts!\n\n[Bridge: Akon]\nI just had sex, and my dreams came true (dreams came true)\nSo if you've had sex in the last thirty minutes, then you qualified to sing with me\n\n[Hook: Akon]\nI just had sex, and it felt so good (felt so good)\nA woman let me put my penis inside her\nI just had sex, and I'll never go back (never go back)\nTo the not-having-sex ways of the past"}