{"rank":"78","song_id":"24922","song_name":"Party Rock Anthem","artist_id":"276754","display_artist":"LMFAO Featuring Lauren Bennett & GoonRock","spotify_id":"70dWrqAp30TmWeibQkn0i7","lyrics":"Party rock! Yeah! Whoo! Let's go!\n\nParty rock is in the house tonight\nEverybody just have a good time (yeah)\nAnd we gon' make you lose your mind (whoo!)\nEverybody just have a good time (clap)\n\nParty rock is in the house tonight (oh)\nEverybody just have a good time (and the feeling's alright)\nAnd we gon' make you lose your mind (yeah)\nWe just wanna see ya shake dat!\n\nIn the club, party rock\nLookin' for ya girl, she on my jock, huh\nNon-stop when we in the spot\nBooty movin' way like she own the block, whoo\n\nWhere the drink? I gots to know\nTight jeans, tattoo, 'cause I'm rock 'n' roll\nHalf-black half-white domino\nGain the money - Op-e-doe\n\nYo, I'm runnin' through these hoes like Drano\nI got that devilish flow, rock 'n' roll, no halo\nWe party rock! Yeah, that's the crew that I'm reppin'\nOn the rise to the top, no \"Led\" in our \"Zeppelin\", hey\n\nParty rock is in the house tonight (whoo)\nEverybody just have a good time (yeah)\nAnd we gon' make you lose your mind\nEverybody just have a good time (let's go)\n\nParty rock is in the house tonight\nEverybody just have a good time (and we feelin' right)\nAnd we gon' make you lose your mind\nWe just wanna see ya shake dat!\n\nEveryday I'm shufflin'\nShufflin', shufflin'\n\nStep up fast\nAnd be the first girl to make me throw this cash\nWe gettin' money, don't be mad\nAnd now stop - ...hatin' is bad\n\nOne more shot for us, another round\nPlease fill up my cup, don't mess around\nWe just wanna see you shake it now\nNow you're home with me, you're naked now\n\nGet up, get down, put your hands up to the sound\nGet up, get down, put your hands up to the sound\nGet up, get down, put your hands up to the sound (whoo)\nPut your hands up to the sound\nPut your hands up to the sound (let's go)\n\nGet up, get up, get up, get up\nGet up, get up, get up, get up (yeah)\n\nGet up, put your hands up to the sound\nTo the sound (whoo!)\nPut your hands up, put your hands up\nPut your hands up, put your hands up\n\nParty rock is in the house tonight (put your hands up) (whoo)\nEverybody just have a good time (put your hands up)\nAnd we gon' make you lose your mind\nEverybody just have a good-good-good time\n\nOh (put your hands up)\nOh (I can feel it man)\nOh (put your hands up)\nOh (put your hands up)\n\nShake dat!\nEveryday I'm shuff-fuf-fullin'\nPut your, put your\nPut your, put your (yeah!)\nPut your, put your (whoo)\n\nPut your, put your\n..your hands up\n..your hands up\nPut your hands up\nEvery day I'm shufflin'"}