{"rank":"80","song_id":"24925","song_name":"Love Faces","artist_id":"430421","display_artist":"Trey Songz","spotify_id":"5rX60GiR64Epgri9Ubjzg9","lyrics":"[Intro]\nWhen I met you woman\nI couldn't help but notice a face so beautiful\nNow imagine, the faces you would make if we ever made love\nOh, oh, oh, oh\n\n[Verse 1]\nPulled up in the drop top Benz\nHit the horn two times and you walked outside\nDress keep hugging them thighs and the only thing inside my mind is\nI want you, yes I do, and if there's anything you suggest I do, then tell me\nNow we all in the crib on my sofa\nGirl, I'm so glad you came over\nI wanna tell you, \"Come closer\"\nBut I don't know if you feel, like I feel, tell me, girl\n\n[Pre-Chorus]\nDon't it feel good when I touch on it?\nWouldn't it be nice if all night I was in you?\nCome kiss me, come with me, down the hall to my bedroom\nTonight we'll be\n\n[Chorus]\nMaking love faces\nMaking love faces\nShadows on the wall while the candles burning\nMessing up the bed while you sweating out your perm and\nMaking love faces\nMaking love faces\nMy hands rubbing on your skin\nLet's go hard, don't hold it in\n\n[Verse 2]\nGirl, let me wrap my hands around you\nSo happy ever since I found you\nJust like a kid who found some candy, let me feel and find your panties\nTake 'em off, take em off, take 'em off take 'em off please\nOh down on my knees\nOh, you're right in front of me\nDon't have to pay for my attention, can you hear me? Is you listening?\nBaby, be real with me, I wanna know\n\n[Pre-Chorus]\nDon't it feel good when I touch on it?\nWouldn't it be nice if all night I was in you?\nCome kiss me, come with me, down the hall to my bedroom\nTonight we'll be\n\n[Chorus]\nMaking love faces\nMaking love faces\nShadows on the wall while the candles burning\nMessing up the bed while you sweating out your perm and\nMaking love faces\nMaking love faces\nMy hands rubbing on your skin\nLet's go hard, don't hold it in\n\n[Bridge]\nThe way you bite your lip is that your way of telling me you like it? Mmhmm\nIf I'm the best you ever had girl, in your life, say mmhmm\nAnd when your eyes roll back in your head, the shaking in your legs\nMmhmm, mmhmm, that's what she said\n\n[Chorus]\nMaking love faces\nMaking love faces\nShadows on the wall while the candles burning\nMessing up the bed while you sweating out your perm and\nMaking love faces, let the people sing\nMaking love faces\nMy hands rubbing on your skin\nLet's go hard, don't hold it in, love faces"}