{"rank":"5","song_id":"24926","song_name":"I Need A Doctor","artist_id":"301270","display_artist":"Dr. Dre Featuring Eminem & Skylar Grey","spotify_id":"70ATm56tH7OrQ1zurYssz0","lyrics":"[Hook: Skylar Grey]\nI'm about to lose my mind\nYou’ve been gone for so long\nI’m runnin' outta time\nI need a doctor, call me a doctor\nI need a doctor, doctor\nTo bring me back to life\n\n[Verse 1: Eminem]\nI told the world, one day I would pay it back\nSay it on tape, and lay it, record it\nSo that one day I could play it back\nBut I don’t even know if I believe it when I’m sayin' that\nDoubts startin' to creep in, every day it's just so gray and black\nHope, I just need a ray of that\n‘Cause no one sees my vision when I play it for ‘em\nThey just say it's wack — but they don’t know what dope is\nAnd I don’t know if I was awake or asleep when I wrote this\nAll I know is, you came to me when I was at my lowest\nYou picked me up, breathed new life in me, I owe my life to you\nBut for the life of me, I don't see why you don't see like I do\nBut it just dawned on me you lost a son, demons fightin' you\nIt’s dark, let me turn on the lights\nAnd brighten me and enlighten you\nI don't think you realize what you mean to me\nNot the slightest clue, ‘cause me and you were like a crew\nI was like your sidekick; you gon' either wanna fight me\nWhen I get off this fuckin' mic, or you\nGon' hug me, but I'm outta options, there's nothin' else I can do\n‘Cause—\n\n[Hook: Skylar Grey]\nI'm about to lose my mind\nYou’ve been gone for so long\nI’m runnin' outta time\nI need a doctor, call me a doctor\nI need a doctor, doctor\nTo bring me back to life\n\n[Verse 2: Eminem]\nIt hurts when I see you struggle; you come to me with ideas\nYou say they're just pieces, so I’m puzzled\n‘Cause the shit I hear is crazy\nBut you're either gettin' lazy\nOr you don’t believe in you no more\nSeems like your own opinions, not one you can form\nCan't make a decision, you keep questionin' yourself\nSecond guessin' and it's almost like you're beggin' for my help\nLike I’m your leader, you're supposed to fuckin' be my mentor\nI can endure no more, I demand you remember who you are\nIt was you who believed in me when everyone was tellin' you\nDon't sign me, everyone at the fuckin' label, let's tell the truth!\nYou risked your career for me, I know it as well as you\nNobody wanted to fuck with the white boy\nDre, I’m cryin' in this booth\nYou saved my life, now maybe it's my turn to save yours\nBut I can never repay you, what you did for me is way more\nBut I ain't givin' up faith\nAnd you ain't givin' up on me — get up, Dre!\nI'm dyin', I need you, come back for fuck’s sake!\n\n[Hook: Skylar Grey]\nI'm about to lose my mind\nYou’ve been gone for so long\nI’m runnin' outta time\nI need a doctor, call me a doctor\nI need a doctor, doctor\nTo bring me back to life\n\n[Verse 3: Dr. Dre]\nIt literally feels like a lifetime ago\nBut I still remember the shit like it was just yesterday though\nYou walked in, yellow jump suit, whole room, cracked jokes\nOnce you got inside the booth, told you, mic smoke\nWent through friends, some of them I put on, but they just left\nThey said they was ridin' to the death\nBut where the fuck are they now, now that I need them?\nI don't see none of them, all I see is Slim\nFuck all you fair-weather friends! All I need is him\nFuckin' backstabbers!\nWhen the chips were down you just laughed at us\nNow you 'bout to feel the fuckin' wrath of Aftermath, faggots!\nYou gon' see us in our lab jackets\nAnd ask us where the fuck we been?\nYou can kiss my indecisive ass crack, maggots!\nAnd the cracker's ass, little cracker jack beat\nMakin' wack math, backwards producers; I'm back, bastards!\nOne more CD and then I’m packin' up my bags, and as\nI’m leavin', I’ll guarantee they'll scream:\n\"Dre, don’t leave us like that, man!\" ‘cause—\n\n[Hook: Skylar Grey]\nI'm about to lose my mind\nYou’ve been gone for so long\nI’m runnin' outta time\nI need a doctor, call me a doctor\nI need a doctor, doctor\nTo bring me back to life"}