{"rank":"89","song_id":"24948","song_name":"Words I Never Said","artist_id":"308591","display_artist":"Lupe Fiasco Featuring Skylar Grey","spotify_id":"5AcOdoDOQOKtPlAM1FqBO8","lyrics":"[Hook: Skylar Grey]\nIt's so loud inside my head\nWith words that I should have said\nAs I drown in my regrets\nI can't take back the words I never said\n\n[Verse 1: Lupe Fiasco]\nI really think the War on Terror is a bunch of bullshit\nJust a poor excuse for you to use up all your bullets\nHow much money does it take to really make a full clip?\n9/11, building 7, did they really pull it?\nUh, And a bunch of other coverups\nYour child's future was the first to go with budget cuts\nIf you think that hurts, then wait, here comes the uppercut\nThe school was garbage in the first place, that's on the up and up\nKeep you at the bottom but tease you with the upper crust\nYou get it, then they move it, so you never keeping up enough\nIf you turn on TV, all you see's a bunch of \"what the fucks\"\nDude is dating so and so, blabbering 'bout such and such\nAnd that ain't Jersey Shore, homey, that's the news\nAnd these the same people supposedly telling us the truth\nLimbaugh is a racist, Glenn Beck is a racist\nGaza Strip was getting bombed, Obama didn’t say shit\nThat's why I ain't vote for him, next one either\nI’m a part of the problem, my problem is I’m peaceful\nAnd I believe in the people, yeah\n\n[Hook: Skylar Grey]\nIt's so loud inside my head\nWith words that I should have said\nAs I drown in my regrets\nI can't take back the words I never said\n\n[Verse 2: Lupe Fiasco]\nNow we can say it ain't our fault if we never heard it\nBut if we know better, then we probably deserve it\nJihad is not holy war, where's that in the worship?\nMurdering is not Islam, and you are not observant\nAnd you are not a Muslim\nIsrael don't take my side cause look how far you've pushed them\nWalk with me into the ghetto, this where all the kush went\nComplain about the liquor store, but what you drinking liquor for?\nComplain about the gloom, but when'd you pick a broom up?\nJust listening to Pac ain't gon' make it stop\nA rebel in your thoughts ain't gon' make it halt\nIf you don't become an actor, you'll never be a factor\nPills with million side effects, take 'em when the pain's felt\nWash them down with diet soda, killing off your brain cells\nCrooked banks around the world would gladly give a loan today\nSo if you ever miss a payment, they can take your home away\n\n[Hook: Skylar Grey]\nIt's so loud inside my head\nWith words that I should have said\nAs I drown in my regrets\nI can't take back the words I never said\n\n[Verse 3: Lupe Fiasco]\nI think that all the silence is worse than all the violence\nFear is such a weak emotion, that's why I despise it\nWe scared of almost everything, afraid to even tell the truth\nSo scared of what you think of me, I'm scared of even telling you\nSometimes I'm like the only person I feel safe to tell it to\nI'm locked inside a cell in me, I know that there's a jail in you\nConsider this your bailing out, so take a breath, inhale a few\nMy screams is finally getting free, my thoughts is finally yelling through\n\n[Hook: Skylar Grey]\nIt's so loud inside my head\nWith words that I should have said\nAs I drown in my regrets\nI can't take back the words I never said"}