{"rank":"14","song_id":"25059","song_name":"Where Them Girls At","artist_id":"300445","display_artist":"David Guetta Featuring Flo Rida & Nicki Minaj","spotify_id":"3djPwpsQAnp8B8gC81e7fk","lyrics":"[Hook: Flo Rida]\nSo many girls in here, where do I begin?\nI seen this one, I’m bout to go in\nThen she said, \"I’m here with my friends\"\nShe got me thinking, and that's when I said\n\"Where dem girls at, girls at?\"\n\"Where dem girls at, girls at?\"\n\"Where dem girls at, girls at?\"\nSo go get them, we can all be friends\n\n[Verse 1 Flo Rida]\nHey, bring it on baby, all your friends\nYou’re the shit and I love that body\nYou wanna ball, lets mix it, I swear you’re good, I won't tell nobody\nYou got a BFF, I wanna see that girl, it’s all women invited\nHair do’s and nails, that Louie, Chanel all up in the body\nPresidents in my wallet, no rules I’m bout it\nBlow the whistle for the hotties\nI got it, shawty, it’s never too much, can’t be doing too much\n10 to one of me, I can handle that love\nOutta of my reach, we can all get buzz\nHolla cause I’m free, no matter it’s no rush\n\n[Hook: Nicki Minaj & Flo Rida]\nSo many boys in here, where do I begin?\nI see this one, I’m bout to go in\nThen he said \"I’m here with my friends\"\nHe got to thinkin', and that's when he said\n\"Where dem girls at, girls at?\"\n\"Where dem girls at, girls at?\"\n\"Where dem girls at, girls at?\"\nSo go get them, we can all be friends\n\n[Verse 2: Nicki Minaj]\nPB! PB! Who's Peabo Bryson?\nTwo years ago I renewed my license\nAnyway why’d I start my verse like that?!\nYou can suck a dick or you can suck on a ballsack\nNo no I don’t endorse that, pause that, abort that\nJust the other day mi go a-London, saw dat, kids down hyde street\nPaparazzi, all dat\nHey hey what can I say?\nDay day day da-day day\nComing through the club all the girls in the back of me\nThis ain't football why the fuck they tryna tackle me?\nReally, I peeped dude at the bar like really, looking like he wanna good time like really\nSaid he had got a friend for my home girl Lily, Lily, Lily, Lily\n\n[Hook]\nSo many girls in here, where do I begin?\nI see this one, I’m bout to go in\nThen she said \"I’m here with my friends\"\nHe got to thinkin', and that's when I said\n\nWhere dem girls at, girls at?\nWhere dem girls at, girls at?\nWhere dem girls at, girls at?\nSo go get them, we can all be friends\n\n[Nicki Minaj]\nWhere my girls at uhh, hmm, uhh\nWhere my girls at uhh, hmm, uhh\nYo, where my girls at uhh, hmm, uhh\nYo, where my girls tryna get to jumpin’\n\n[Hook]\nSo many girls in here, where do I begin?\nI seen this one, I’m bout to go in\nThen she said, \"I’m here with my friends\"\nShe got me thinking, and that's when I said\n\nWhere dem girls at, girls at?\nWhere dem girls at, girls at?\nWhere dem girls at, girls at?\nSo go get them, we can all be friends"}