{"rank":"97","song_id":"25119","song_name":"Cat Daddy","artist_id":"364837","display_artist":"Rej3ctz","spotify_id":"1N4jhCFeE0hrZGYfpJsSAF","lyrics":"Check this out baby girl, I want you to check out a nigga\nCattttt Dadddyyyyy!\n\n[Verse 1: Bounc3]\nMan I go to work, true winner\nJeans skinny, like Squidward\nLookin for your girl, just missed her\nDid my cat daddy and I took her down, timber\nWrist cold, mamma call it winter\nSwisher full of nuggets, daddy calls it Denver\nBaby got ass chelsea calls its thinnest, UPS checks get it we deliver\nCat daddy when I dougie, cat daddy when I member\n(when I member) Rockin' skinnies, they for Rej3ctz, I remember\nCompetition see the Creez, they surrender\nSmokin' Wyclef kush, Now I'm gone till November\nMove your arms like your wheel chair stunt'n\nDrop low grab your shoulder like yo fuckin\nTell Power 106 to bang this shit\nBig up to my bro Sam, he the king of this shit\n\n[Hook]\nCall me SpongeBob\nStackin Krabby Patties\nBitch I go to work\nDo my Cat Daddy\n\nCall me SpongeBob\nStackin Krabby Patties\nBitch I go to work\nDo my Cat Daddy\n\nCat Daddy, Cat Daddy, Cat Daddy, Cat Daddy (bitch I go to work)\nCat Daddy, Cat Daddy, Cat Daddy, Cat Daddy (bitch I go to work)\n\n[Verse 2: MoWii]\nYou heard of Too Short?\nI'm too long\nI'm in the club all black goin' Akon\nLike headlights\nI'm too on\nDo my cat daddy and I'm going nuts, acorn\nI'mma muthafuckin fool for this\nWhen it come to the yard, I'm the coolest kid\nI'm in my prime barbecue rib\nAnd these milfs like pubes all around my dick\nI block a hater like a goalie\nPockets guacamole\nChecks in effect ashy neck like a rollie\nDid it with your chick she hate the Cat Daddy lonely\nGive her jungle fever I'm Lamar and she's Khloe\nYea I'm crackin' like a newborn rooster\nTake your chick in the mall, yea we call that booster\nDont get mad, it's your chick, she's choosing\nCat Daddy haters screamin \"What the fuck you doin'?\"\n\n[Hook]\n\n[Verse 3]\nTell them all Cat Daddy ‘fore I (Smash That)\nBig Chain, costs a couple stacks, man\nThick chain cost a couple grand\nJhawk slap them in the track, Do the dance\nYou gon' wanna learn it for yourself\nYea I'm up in the range rover, Parked like Yosemite\nBlow like a champ, dog. Smokin' like a chimney\nStudy of matter, The energy is chemistry\nHaters don't matter, Bitches drink my energy\nI'm fitted in the front, I Cat Daddy\nThen come up swing my arms, Cat Daddy\nBaby I'm thuggin\nEvery weekend I'm clubin\nNiggas show me love-in, the fade it's nothin\nGreen on me, every day St. Patricks\nEver since the day I was born I been a star, Patrick\nCat Daddy, Cat, Cat Daddy, [Cat Daddy, Cat, Cat Daddy]\n\n[Hook]"}