{"song_name":"Booty Wurk (One Cheek At A Time)","artist_id":"null","display_artist":"T-Pain Featuring Joey Galaxy","spotify_id":"null","lyrics":"Jump out your car in the middle of the street\nOpen up the truck let the base beat\nGo ahead, go ahead,\nYou gotta walk up in the club bear-footed\nI like that booty you know where to put it\nGo ahead, go ahead.\n\nNow mamma you look so professional I'm followin' you sweatin' you\nI can't believe I'm doing what I'm doing\nWhat is wrong with my head go ahead\n'Cause baby I like how you're working it\nAnd watching you, you twarkin' it\nI'm trying get you out of this club and get you off in my bed\nOhh, go ahead, yeah.\n\nNow let me see the booty work, booty work,\nBooty work, boo booty work,\nBooty work, booty work, boo boo boo booty work,\nGo ahead, go ahead,\nNow let me see the booty work, booty work,\nBooty work, boo booty work.\nLeft cheek, right cheek, left cheek, right cheek.\n\nBlack car, black rims, black shirt, black timbs\nLeh go, leh go, come on baby keep on doin what you doin\nLeh go, leh go, come on baby keep on doin what you doin\n\nHoly moly, look at her, she got the boots with the fur\nLet go, let go, come on baby keep on doin what you doin\nLet go, let go, come on baby keep on doin what you doin\nAnd mama I can see that thong on you the Dj play this song for you\nI'm tryin to drive my stick shift all over ya curves\nSay word, if you keep playin with my fitted we're gonna get it, get it, get it\nGirl I represent the nappy boy clique so I know that you heard\nSay word...\n\nNow let me see the booty work, booty work,\nBooty work, boo booty work,\nBooty work, booty work, boo boo boo booty work,\nGo ahead, go ahead,\nNow let me see the booty work, booty work,\nBooty work, boo booty work.\nLeft cheek, right cheek, left cheek, right cheek.\n...\n\nGirl it must be a crime to be as fine as you aha\nYou know exactly what I'm tryin to do\nYou see me, I'm tryin to keep it jumpin'\nGirl I got a chevy with hydraulics and you remindin' me of it\nUp and down, up and down, girl you know what's happenin'\nRound of applause, keep that booty clappin'\nThem other girls lackin' what you packin'\nAnd you got them embarrassed by what you got from your parents\nI'm tryin to see them shorts, see them shorts spread apart\nI aint coming up short, up short Kevin Hart, Kevin Hart\n\nCome on baby keep on doing what you're doing,\nCome on baby keep on doing what you're doing,\nMove your feet, cut a rug, put your hands up\nIf you're the baddest in the club.\n\nTake off, come on baby keep on doing what you're doing,\nGirl I'm tryin get you next to me\nBut first you gotta let me see that booty work\nBooty work, boo booty work,\nBooty work, booty work, boo boo boo booty work,\nGo ahead, go ahead,\nNow let me see the booty work, booty work,\nBoo, Boo Boo boo booty work.\nLeft cheek, right cheek, left cheek, right cheek.\n... boom, boom, boom.\n\nNow let me see the booty work, booty work,\nBooty work, boo booty work,\nBooty work, booty work, boo boo boo booty work,\nGo ahead, go ahead,\nNow let me see the booty work, booty work,\nBooty work, boo booty work.\nLeft cheek, right cheek, left cheek, right cheek."}