{"rank":"68","song_id":"25179","song_name":"Marvin's Room","artist_id":"301284","display_artist":"Drake","spotify_id":"2z3htsNRuhDN923ITatc56","lyrics":"[Woman on phone]\n\"Hello\nYeah I just walked in\nYeah I'm good you still working?\ntonight, right now?\n'Did I go out' yeah I went out\nI went, I went to a couple of clubs\nI never went to bed\nshit... wine or water\nyou should see someone about a cold drink\nIdk I'm delirious... night\"\n\n[Verse 1]\nCups of the rose, bitches in my old phone\nI should call one and go home\nI been in this club too long\nThe woman that I would try,\nis happy with a good guy,\nBut I've been drinking so much\nThat I'ma call her anyway and say\n\n[Hook]\nFuck that nigga that you love so bad\nI know that you still think about the times that we had\nI say\nFuck that nigga that you think you found\nAnd since you picked up, I know he's not around\n\n[Woman on phone]\n\"Are you drunk right now?\"\n\n[Drake]\nI'm just saying, you can do better\nTell me have you heard that lately?\nI'm just saying, you could do better\nAnd I'll start hating? only if you make me\n\nuh\n\n[Verse 2]\nCups of that Xo\nAll my people been here\nI see all of her friends here\nGuess she don't have the time to kick it no more\nFlights in the morning,\nWhat you doing that's so important\nI've been drinking so much that I'ma call you anyway and say\n\n[Hook]\nFuck that nigga that you love so bad\nI know that you still think about the times we had\nI say\nFuck that nigga that you think you found\nAnd since you picked up, I know he's not around\n\n[Woman on Phone]\nAre you drunk right now?\n\n[Drake]\nI'm just saying, you can do better\nTell me have you heard that lately\nI'm just saying, you could do better\nAnd I'll start hating only if you make me \n\n[Verse 3]\nI think I'm addicted to naked pictures\nAnd sitting talking 'bout bitches that we almost had\nI don't think I'm conscious of making\nMonsters outta the women I sponsor 'til it all goes bad\nBut shit, it's all good\nWe threw a party, yeah, we threw a party\nBitches came over, yeah, we threw a party\nI was just calling cause they were just leaving\nTalk to me please don't have much to believe in\nI need you right now, are you down to listen to me?\nToo many drinks have been given to me\nI got some women that's living off me\nPaid for their flights and hotels, I'm ashamed\nBet that you know them, I won't say no names\nAfter a while, girl, they all seem the same\nI've had sex four times this week: I'll explain\nHaving a hard time adjusting to fame\nSprite in that mixture, I've been talking crazy, girl\nI'm lucky that you picked up, lucky that you stayed on\nI need someone to put this weight on\n\n[Drake and Woman on phone]\n\"Well I'm sorry\"\n\"Are you drunk right now?\" - Woman\n\n[Drake]\nI'm just saying, you can do better\nTell me have you heard that lately\nI'm just saying, you could do better\nAnd I'll start hating only if you make me\n\n[Drake on phone]\n\"You're not going to come?\"\n\"Guess I'm bout to just kick it here then...\"\n\n[Bridge]\nJust throw up while I hold your hurt back\nHer white friends said you niggas crazy\nI hope no one heard that\nI hope no one heard that.\nCause if they did we gon be in some trouble."}