{"rank":"66","song_id":"25185","song_name":"Gucci Gucci","artist_id":"306077","display_artist":"Kreayshawn","spotify_id":"5jOZ3W3HwXjUhfaeoOo4Gp","lyrics":"[Sample]\nOne big room full of bad bitches\n\n[Hook]\nAnd we stunting like\nGucci Gucci, Louis Louis, Fendi Fendi, Prada\nBasic bitches wear that shit so I don't even bother\n\n[Verse 1]\nGucci Gucci, Louis Louis, Fendi Fendi, Prada\nThe basic bitches wear that shit, so I don't even bother\nI put that on my partner, I put that on my family\nOakland city represent, address me as your majesty\n\nYeah you can kiss the ring, but you can never touch the crown\nI smoke a million Swisher blunts and I ain't never coming down\nBitch you ain't no Barbie I see you work at Arby's\nNumber 2, super-sized Hurry up I'm starving\n\nGnarly, radical, on the block I'm magical\nSee me at your college campus baggie full of Adderalls\nCall me if you need a fix, call me if you need a boost\nSee them other chicken heads? They don't never leave the coop\n\nI'm in the Coupe cruising, I got the stolen plates\nServing all the fiends over there by the Golden Gate\nBridge, I'm colder than the fridge and the freezer\nI'm snatching all your bitches at my leisure\n\n[Hook]\n\n[Verse 2]\nGucci Gucci, Louis Louis, Fendi Fendi, Prada\nI'm lookin like Madonna but I'm flossing like Ivana\nTrump, you know I keep that work in my trunk\nGot my hand on the pump if you wanna press your luck\n\nI'm yelling \"Free V-Nasty\" 'til my throat is raspy\nYoung, rich and flashy I be where the cash be\nYou can't find that? I think you need a Google Map\nMy pearl-handled kitty-cat will leave and press your noodle back\n\nNow Google that groupies follow me like Twitter\nI'm rolling up my catnip and shitting in your litter\nWhy you looking bitter? I be looking better\nThe type of bitch that make you wish that you ain't never met her\n\nThe editor, director plus I'm my own boss\nSo posh, nails fierce with the gold gloss\nWhich means nobody getting over me\nI got the swag and it's pumping out my ovaries\n\n[Hook]\n\n[Outro]\nOh, all you basic ass hoes out there\nMan I got rooms full of bad bitches\nThey don't need Gucci, they don't need Louis\nWe swagging, ehh, meow"}