{"rank":"13","song_id":"25199","song_name":"Headlines","artist_id":"301284","display_artist":"Drake","spotify_id":"6RGvWCHTS6BC46TsMyN0WM","lyrics":"I might be too strung out on compliments\nOverdosed on confidence\nStarted not to give a fuck and stop fearing the consequence\nDrinking every night because we\nDrink to my accomplishments\nFaded way too long, I'm floatin in and out of consciousness\nAnd they sayin I'm bad, I agree with that\nI just take my time with all this shit\nI still believe in that\nI had someone tell me I fell off, ooh I needed that\nAnd that they want to see me pick it back up\nWell, where'd I leave it at?\nI know I exaggerated things, now I got it like that\nStuff my napkin in my shirt cause I'm just mobbin like that\nYou know good and well that you don't want a problem like that\nYou gonna make someone around me catch a body like that\nNo, don't do it, please don't do it\nCause one of us goes in, and we all go through it\nAnd Drizzy got the money, so Drizzy gonna pay it\nThose my brothers, I ain't even gotta say it\nThat's just something they know\nThey know, they know, they know\nThey know, they know, they know\n\nThat the real is on the rise\nFuck them other guys\nI even gave em a chance to decide\nNow, that's something they know\nThey know, they know, they know\n\nI be yelling out money over everything\nMoney on my mind. Then she wanna ask\nWhen it got so empty. Tell her I apologize\nHappened over time. She said she miss the old Drake\nGirl, don't tempt me..\nIf they don't get it, they'll be over you\nThat new shit that you got is overdue\nYou better do what you supposed to do\n\nI'm like \"why I gotta be all that?\"\nBut still, I can't deny the fact\nThat it's true, listening to you expressing all them feelings\nSoap opera rappers, all these niggas sound like All My Children\nAnd that's who you thinkin is about to come and make a killing\nI guess it really is just me, myself and all my millions\nYou know that they ain't even got it like that\nYou gonna hype me up and make me catch your body like that\nCause I live for this, this isn't just a hobby like that\nWhen they get my shit and play it, I ain't even gotta say it\nThey know. They know, they know, they know\nThey know, they know, they know\n\nThat the real is on the rise\nFuck them other guys, and I even gave em\nA chance to decide, now that's something they know\nThey know, they know, they know\n\nI be yelling out: money over everything, money on my mind\nTell them I apologize, happened over time\nThey know"}