{"rank":"100","song_id":"25224","song_name":"Martians Vs Goblins","artist_id":"1490221","display_artist":"Game","spotify_id":null,"lyrics":"(Game)\nBlood gang kill 'em all, Odd Future Wolf Gang\nKidnap a vampire, drain all his fuckin veins\nWolf Grey Jordans, use his intestines for the strings\nSnatch up Rihanna and throw her in front of a fuckin train\nSniff a fucking unemployment line of cocaine\nTie Lil B up to a full tank of propane\nSwag, now watch him cook.. and just stand there and look\nHave a bonfire with old Harry Potter books\nMartians vs. Goblins, goons vs. the crooks\nAnd since me and Tune had Viacom shook\nI shoulda got a real-ass pirate to do the hook\nMaybe Jack Sparrow maybe Peter Pan's nemesis\nMy power's limitless like Blanka on Sega Genesis\nSuperhero, mad that Marvel overlooked me\nCause Spiderman and Hulk straight pussy\n\nBitch I'm a muthafuckin Martian (I'm a goddamn Goblin)\nBitch I'm a muthafuckin Martian (I'm a goddamn Goblin)\nBitch I'm a muthafuckin Martian (I'm a goddamn Goblin)\nMuthafuckin Martian (goddamn Goblin)\nWe are not the same, I am a Martian\n\n(Tyler)\nA year ago, I was poor, somewhat\nNow my future's brighter than Christopher's new haircut\nBruno Mars is still sucking dick and fucking male butts\nIn the same closet that Tyler Perry gets clothes from\nI suck? Where the fuckin Ring Pops?\nYou got a better chance of getting a copy of Detox\nWolf Gang, we rock, crack rock and that shit was expected\nLike Jayceon whenever he name-drop (Fuck you, Tyler)\nJesus, motherfucking Theresa\nThis nigga Game got Wolf Haley for this feature\nMy team is running shit like we have full-cleat Adidas\nGetting chased by the police on a full bred Cheetah\nBishop Eddie caught me tryna escape\nBag full of drag and a Nicki Minaj mixtape\nDragging all you fags to the back of the log cabin\nFall back like Lebron's hairline\nAgainst the Mavericks, he lost\n\nBitch I'm a muthafuckin Martian (I'm a goddamn Goblin)\nBitch I'm a muthafuckin Martian (I'm a goddamn Goblin)\nBitch I'm a muthafuckin Martian (I'm a goddamn Goblin)\nMuthafuckin Martian (goddamn Goblin)\nWe are not the same, I am a Martian\n\n(Game)\n(Chuck, fuck what) I do\nCause Lil Tunechi always bless me (Not you)\nHe killed me on my own track, so what? Not you\nFuck you, I spit like I had kids with Erykah Badu\nI fucked her on the day of that naked video shoot\nI was sucking that pussy like it was wonton soup\nThen I hit Lebron's mom in bron-bron's coupe\nWith Delonte West taping, we had bon-bons too\nWith Cleveland cheerleaders, they had pom-poms too\nSo I smacked them bitches wearing Bishop Don Juan's suit\n(Where was Snoop?) I don't know,\nProbably doing what the Crips do\nBut when I'm with my uncle, fuck it! Then I'm a Crip too\nAnd I will Crip Weezy, Crip Jones, and Crip you\nNow I'm the Doggfather, walking with a Shih Tzu\nMad that DC comics overlooked me\nCause Captain America's straight pussy\n\nBitch I'm a muthafuckin Martian (I'm a goddamn Goblin)\nBitch I'm a muthafuckin Martian (I'm a goddamn Goblin)\nBitch I'm a muthafuckin Martian (I'm a goddamn Goblin)\nMuthafuckin Martian (goddamn Goblin)"}