{"rank":"84","song_id":"25253","song_name":"Got 2 Luv U","artist_id":"1490159","display_artist":"Sean Paul Featuring Alexis Jordan","spotify_id":"7ha7zYOryB0rpnMTa4S75U","lyrics":"[Timbaland]\nDance with me... whaaat?\nDance with me... say what, say what?\nTango with me... say what, say what? (repeat 2X)\nDance with me... say what, say what? (repeat 2X)\nTango with me... say what, say what?\nHaha, bring it in\n\nOoooh, I love what you got on\nA tight see-through dress with some green and pink thongs\nWord is bond, can I pick you up in my eight-five-oh\nOr do you want to pick me up, in your black limo\nHere goes, an even-ing that's memorable\nA year ago you didn't like me cause I had no dough\nWhoa, a black man on a mission, wishin\nthat your crazy ass would listen, hear bout what you beenmissin\nI know you wanna do it, I know you wanna ride it, my pony\nGet on me, bone me, act like you own me\nThen I gotta feel your crazy ass out homie, what?\n\nChorus: Playa\n\nOooohhh, luv 2 luv ya, baby (repeat 4X)\n\n[Timbaland (talking over chorus)]\nI love you baby, I love you baby what?\nI still love you, say what say what?\nUhh, I love you baby, uh uh uh uh I love you baby\nWhat?  I love you baby\nTell me how much you love me\n\n[Shaunte]\nTim, come over here and take my address\nI undress in a black neglige like Faye Dunaway\nRun your fingers through my hair and squeeze my nipples\nLove the way you're talkin in my ear like that baby tickles\nLater for uptown, no time to go downtown\nI'm wild, since you see Club Clit, now take a look around\nDive in, my Billy Ocean, crazy drunk now\nQuick to respond, when I cum just keep it there now\nmove over please, cause you're drivin me nuts\nYou went past my sugar-wall straight to my guts\nI came you cum, you still do amaze me\nOne of the reasons why, I luv 2 luv ya baby\n\nChorus\n\n[Timbaland (talking over chorus)]\nAhh, I love you baby love you baby\nAhh, uhh, I love you baby love you baby\nSay what say what?  I love you baby love you baby\nHa ha, Playa, sing\n\n[Playa]\nI love how you express yourself\nSho' nuff you can work that body\nI know you can work that body\nYou go about it oh so well\nSho' nuff you can work that body\nI know you can work that body (JD, JD, what?)\nGirl I love it when you're next to me, come down\nWanna make sure that you know that (ha ha, ha ha ha!)\nYou're the best thing that I've received\nAnd I wanna make sure that you know that (love you baby, love youbaby)\n\nChorus 2X\n\n[Timbaland (talking over chorus)]\nAhh, I love you, we all love you, ha ha\nWhoo, aah, say what, say what say what, say what?\nSay what?  Say what say what?\nHa ha, ha ha, ha ha, ha ha, that's how we do it\nRight now, me and you in your nightgown\nWe doin this one time\nFor your sexy mind, all the ladies\nAll the ladies, all the ladies, I love you ladies\n\nHa, sing it to me\nAhhh, say what, say what say what, say what?\nOne time, one time, I'm out"}