{"song_name":"Dedication To My Ex (Miss That)","artist_id":1496550,"display_artist":"Lloyd Featuring Andre 3000 & Lil Wayne","spotify_id":"0jmdMkRc7bmnmF9TNRfxF5","lyrics":"[Lil Wayne]\nHey ya\nI came to talk about this girl that had my love it seems\nI went away for a while\nShe gave my love away\nI really shouldn't blame her\nBut now that pussy is a stranger\n\n[Lloyd]\nBaby, somethings on my mind I gotta say it\nYeah, Your pussy done changed\nIt's the same girl and that's a shame\n(A crying shame baby)\nOooh, ain't being funny\nI know another bee's been in that honey\nOoh, baby, her pussy done changed\nIt's such a shame girl and that's a shame\n(who the hell you giving my loving to girl?)\n\n[REFRÃO]\nOooh Nooo\nTell me where that pussy gone\nCause it don't feel the same\n(I miss that pussy, that pussy, that pussy)\nOooh Nooo\n(why you do me like that baby)\nWhy is that happening to me\nOooh Nooo\nShe told me that it was not missin'\n(I miss that pussy, that pussy, that pussy)\nOooh Nooo\nYeah yeah yeah yeh\n\n\nShe, she used to be a really special lady\nI guess she's feeling kinda freaky lately\nIt's such a shame cause now the pussy's changed\n(Pussy changed)\nShe used to squeeze me\nGrip me tight so she can please me\nBut now now, that pussy changed\nIt's such a shame, that pussy changed\n\n[REFRÃO]\nOooh Nooo\nWhere did ya p-ssy go?\nCause girl, I need to know\n(I miss that pussy, that pussy, that pussy)\nOooh Nooo\nI'ma about to kill it bitch\nOooh Nooo\nShe gave away all my money\n(I miss that pussy, that pussy, that pussy, that pussy)\nOooh Nooo\nYeah, yeah, yeh\n\n\n[Andre 3000]\nDamn, doll, do change ya all?\nI'm your number fan belt they are not important\nI don't use a cordless, microphone\nThey don't feel real to me\nMeaning real woman\nOthers ?\nYou my ? green box When I couldn't afford a Ford\nClean socks scootin' across the floor in your grandmama house\nHand on your mouth\nYou yap too much about the penny, mechanic so uncanny\nX-men, x-men, your ex boyfirend should thank me that I took you off his hands\nNo I can't bring another beach to the sand\nAnd know I am well aware that you can bring a man to his knees\nand get what you need without saying please\nBut can you bring a man to his feet when defeat is on repeat\nAnd they put this man's Grammy's on the street?\nWhat? Why so quiet?\nHate that all of our memories happened in a Hyatt\nYou were perfect before you went on a diet\nYou was way different, you think I don't remember\nShit, the magazine got to your head\nNow somebody you don't even know got you in bed\nBet Your Buddy Dont Even Know You Don't Like Red\nOr Was It Fuchsia, Fuck It, Our Future Is Dead.\n\n[REFRÃO]\nOooh Noop\n[Lil Wayne]\nI thought a p-ssy cat had 9 lives man\n\nOooh Nooo\n(I miss that pussy, that pussy, that pussy, that pussy)\nOooh Nooo\nShe gave away all my shit\n(I miss that pussy, that pussy, that pussy, that pussy)\nYeah, yeah, yeh\nI miss ya girl\n\n(Fuck dat bitch!)"}