{"song_name":"We'll Be Fine","artist_id":301284,"display_artist":"Drake Featuring Birdman","spotify_id":"4WmcBHCMydSBMNr34yRI6W","lyrics":"[Drake]\nYeah, never thoughts of suicide I'm too alive\nBut I still treat it likes it's do or die\nEven though dying isn't in the plans, but neither was making it and here I am\nIn the presidential do you like your new room?\nAlways presidential and tonight's no blue moon\nSince I saw Aaliyah's precious life go too soon, she deserve the credit for how I'm about to get it\nThat's why I got a new dumb thing moving through the street\nGot a new condo, move it to the beach\nHeard Nicki just bought a brand new crib\nGoddamn man she's beauty and the beast (Lord)\nSeems like yesterday that I was up and coming\nStill so young that I ain't had enough of nothing\n\nThe fam here, the drink here, the girls here?\nWell f*ck let's get it then\n\n[Hook]\nI'm trying to let go of the past\nShould we make this one a double?\nYe ain't even gotta ask, Ahh\nBecause it's hard to say no (say no)\nYeah it's hard to say no\n\nAre you down? Are you down? Yeah you all the way down, everytime\nAm I down? Am I down? Yea I'm all the way down. We'll be fine\nAre you down Are you down yeah you all the way down, everytime\nAm I down Am I down? Yea I'm all the way down we'll be fine\n\n[Drake]\nUsed to make us proud we had dreams of getting bigger man\nLoved you until now, but now I'm the ni**a man\nYou keep talking that \"You was this and you had this and you deserve some f*cking credit how did anyone forget it.\"\n\nGot a show up in your city, yo girl is in the line and the line around the corner it's my motherf*cking time\nYou should take it as a sign, man I got it right now. I wouldn't doubt it because these bitches all about it right now\nLet's be real about this sh*t, can I take you home? Or come to where you stay?\nDo you live on your own? I heard you got your ways, I never would have known. She said \"your such a dog\" I said \"your such a bone.\"\nI've been everywhere, where you know me from?\nThese days women give it to me like they owe me one\nBut they crave attention though they always saying \"Show me something.\"\nBut girl you ain't the only one that's trying to be the only one\nAt least I admit that, if you get that, and you with that\nThen fuck let's get it then\n\n[Hook]\nI'm trying to let go of the past\nShould we make this one a double?\nYe ain't even gotta ask, Ahh\nBecause it's hard to say no (say no)\nYeah it's hard to say no\n\nAre you down? Are you down? Yeah you all the way down, everytime\nAm I down? Am I down? Yea I'm all the way down. We'll be fine\nAre you down Are you down yeah you all the way down, everytime\nAm I down Am I down? Yea I'm all the way down we'll be fine\n\n[Birdman]\nYeah, Drizzy. Yo turn nigga!\nTake Care of the business nigga (shine on these niggas)\nGive these niggas the business nigga!\nKill spray anything in the way. nigga fuck em! We don't love em!\nYeah, it's just that Uptown gangsta shit\nToronto, stand up for one of the realest niggas, Drizzy, with the realest flow\nToast to this gangsta shit. OVO-YMCMB\nYou understand me? Playing with these motherf*cking millions like they ain't nothing\nRubber band stacks. That YMCMB sh*t nigga. Flashy lifestyle\nOne Hundred"}