{"song_name":"Stereo Hearts","artist_id":"null","display_artist":"Glee Cast","spotify_id":"4y3HmDkg2Hpuu4E48nlU3w","lyrics":"My heart's a stereo\nIt beats for you, so listen close\nHear my thoughts in every note oh oh\nMake me your radio\nTurn me up when you feel low\nThis melody was meant for you\nTo sing along to my stereo\n\nIf I was just another dusty record on the shelf\nWould you blow me off and play me like everybody else?\nAnd if I asked you to scratch my back, \nCould you manage that?\nLike with your hands \"look Travie, I can handle that\"\nFurthermore I apologize for any skipping tracks\nIt's just this last girl that played me \nleft a couple of cracks\nI used to, used to, used to now I'm over that\nCos holding grudges over love is ancient artifacts\nIf I could only find a note to make you understand\nI'd sing it softly in your ears and grab you by the hand\nKeep me stuck inside your head like your favorite tune\nAnd know my heart's a stereo that only plays for you\n\nMy heart's a stereo\nIt beats for you, so listen close\nHear my thoughts in every note oh oh\nMake me your radio\nTurn me up when you feel low\nThis melody was meant for you\nTo sing along to my stereo\n\nTo my stereo\nSo sing along to my stereo\n\nIf I was an old school 50 pound boombox\nWould you hold me on your shoulder \nWherever you walked?\nWould you turn my volume up in front of the cops\nAnd crank it higher everytime they told you to stop?\nAnd all I ask is that you don't get mad at me\nWhen you have to purchase mad D batteries\nI appreciate every mixtape your friends make\nYou never know, we come and go like on the interstate\n\nI think I finally found a note to make you understand\nIf you can hit it, sing along and take me by the hand\nKeep me stuck inside your head like your favorite tune\nYou know my heart's a stereo that only plays for you\n\nMy heart's a stereo\nIt beats for you, so listen close\nHear my thoughts in every note oh oh\nMake me your radio\nTurn me up when you feel low\nThis melody was meant for you\nTo sing along to my stereo\n\nSing to my stereo\nSo sing along to my stereo\n\nI only pray you never leave me behind \n(never leave me)\nBecause good music can be so hard to find (so hard)\nI'd take your hand and hold it closer to mine\nThought love was dead\nBut now you're changing my mind (come on)\n\nMy heart's a stereo\nIt beats for you, so listen close\nHear my thoughts in every note oh oh\nMake me your radio\nTurn me up when you feel low\nThis melody was meant for you\nTo sing along to my stereo\n\nTo my stereo\nSo sing along to my stereo"}