{"rank":"86","song_id":"25509","song_name":"Way Too Cold","artist_id":"276709","display_artist":"Kanye West Featuring DJ Khaled","spotify_id":null,"lyrics":"Kanye West! (Swag King Cole) DJ Khaled!\nCan't a young nigga get money any more? (ah)\nTell PETA my mink is dragging on the floor (ah)\nCan I have a bad bitch without no flaws\nCome to meet me without no drawers?\nDinner with Anna Wintour, racing with Anja Rubik\nI told you mahfuckas it was more than the music\nIn the projects one day, to Project Runway\nWe done heard all that loud-ass talking, we're used to it\nI'm from where shorties fucked up, double-cupped up\nMight even kill somebody and YouTube it\nTo whoever think their words affect me is too stupid\nAnd if you can do it better than me, then you do it!\nWe flyer than a parakeet, floatin' with no parachute\nSix thousand dollar pair of shoes, we made it to the Paris news!\nDon't talk about style cause I embarrass you\nShut the fuck up when you talk to me 'fore I embarrass you\nCan't a young nigga get money any more? (ah)\nTell PETA my mink is dragging on the floor (ah)\nCan I have a bad bitch without no flaws\nCome to meet me without no drawers?\nAnd the whole industry want to fuck your old chick\nOnly nigga I got respect for is Wiz\nAnd I'll admit, I had fell in love with Kim\nAround the same time she had fell in love with him\nWell that's cool, baby girl, do ya thang\nLucky I ain't had Jay drop him from the team\nLa Familia, Roc Nation\nWe in the building, we still keep it basement\nWe flyer than a parakeet, floatin' with no parachute\nSix thousand dollar pair of shoes, I made it to the Paris news\nDon't talk about style cause I'll embarrass you\nShut the fuck up when you talk to me 'fore I embarrass you\nGOOD Music, we fresh, we fresh\nAnything else, we detest, detest\nBitch-ass niggas got ass and breasts\nAll that said, let me ask this quest'\nCan't a young nigga get money any more?\nTell PETA my mink is dragging on the floor\nCan I have a bad bitch without no flaws\nCome to meet me without, don't talk to me 'bout style, nigga\nI'll mothafuckin' embarrass you\nTalking 'bout clothes, I'll mothafuckin' embarrass you\nHollering 'bout some hoes, I'll mothafuckin' embarrass you\nWay too cold, I promise you'll need some theraflu\n(Uh, uh, uh, uh, uh) Get the theraflu\n(Uh, uh-uh, uh-uh, uh) Get the theraflu\n(Uh, uh-uh, uh-uh, uh, uh-uh, uh-uh)\n(Uh, uh-uh, uh-uh uh) Get the theraflu"}