{"rank":"65","song_id":"25517","song_name":"How Will I Know","artist_id":null,"display_artist":"Glee Cast","spotify_id":"1BeT9WValmzm2po1xKmHug","lyrics":"Mercedes:\nThere's a boy I know\nHe's the one I dream of, ooh-ooh\nLooks into my eyes\nTakes me to the clouds above, mmm\n\nOh, I lose control (Santana: Ooh-ooh)\nCan't seem to (with Santana: get enough, uh huh)\nWhen I wake from dreaming (Kurt and Santana: Ooh-ooh)\nTell me is it (with Kurt and Santana: really love, aha)\n\nRachel (Kurt, Mercedes, and Santana):\n(Ooh) How will I know (Don't trust your feelings)\nHow will I (with Kurt, Mercedes, and Santana: know)\n(Ooh) How will I know (Love can be deceiving)\nHow will I (with Kurt, Mercedes, and Santana: know)\n\nKurt, Mercedes, Rachel, and Santana (Mercedes and Santana):\nHow will I know (if he really loves me?)\nI say a prayer (with every) heart beat\nI fall in love (whenever we meet)\nI'm asking you ('cause you know about these things)\nHow will I know (if he's thinking of me?)\nI try to phone (but I'm too shy) (Kurt and Rachel: Can't speak)\nFalling in love (is all bitter sweet)\nThis love is strong (why do I feel weak, oh, wake me)\n\nMercedes (with Kurt, Rachel, and Santana):\nI'm shaking (Santana: Ooh-ooh)\nI wish I had you (with Santana: near me now, uh huh)\n(Said there's no) mistaking (Kurt, Rachel, and Santana: Ooh-ooh)\nWhat I feel is (really love) (Kurt, Rachel, and Santana: Aha)\nOh, tell me\n\nKurt and Rachel:\nIf he loves me (Mercedes and Santana: If he loves me)\nIf he loves me\n\nKurt, Mercedes, Rachel, and Santana:\nIf he loves me not (Mercedes: Oh-oh, yeah)\n\nKurt and Rachel:\nIf he loves me (Mercedes and Santana: If he loves me)\nIf he loves me\n\nKurt, Mercedes, Rachel, and Santana:\nIf he loves me not\n\nRachel:\nOh! How will I know!\n\nKurt, Mercedes, and Santana:\nHow will I know\n\nMercedes and Santana:\nIf he's thinking of me\n\nKurt, Mercedes, Rachel, and Santana (Mercedes and Santana):\nI try to phone (but I'm too shy) (Kurt and Rachel: Can't speak)\nFalling in love (is all bitter sweet)\nThis love is strong (why do I feel weak?)\n\nMercedes:\nHow will I know\n\nKurt, Rachel, and Santana (Mercedes):\nHow will I know if he really loves me? (How will I know, hey, how will I know)\nI say a prayer with every heart beat (How will I know, ooh, how will I know)\nI fall in love whenever we meet (How will I know, yeah, how will I know)\nI'm asking you cause you know about these things (How will I know, yeah)\n\nKurt, Mercedes, Rachel, and Santana:\nHow will I know"}