{"rank":"92","song_id":"25690","song_name":"Poetic Justice","artist_id":"305702","display_artist":"Kendrick Lamar Featuring Drake","spotify_id":"0qv4GLagrXhM0bAzCpuezH","lyrics":"[Intro]\nEvery second, every minute, \nman I swear that she can get it\nSay if you a bad bitch put your hands up high, \nhands up high, hands up high\nTell 'em dim the lights down right now, put me in the mood\nI'm talking 'bout dark room, perfume\nGo, go!\n\n[Verse 1: Kendrick Lamar]\nI recognize your fragrance (hol' up!)\nYou ain't never gotta say shit (woo!)\nAnd I know your taste is\nA little bit (mmm) high maintenance (ooh)\nEverybody else basic\nYou live life on an everyday basis\nWith poetic justice, poetic justice\nIf I told you that a flower bloomed in a dark room, \nwould you trust it?\nI mean I write poems in these songs dedicated to you when\nYou're in the mood for empathy, there's blood in my pen\nBetter yet, where your friends and them?\nI really wanna know you all\nI really wanna show you off\nFuck that, pour up plenty of champagne\nCold nights when you curse this name\nYou called up your girlfriends and\nY'all curled in that little bitty Range I heard that\nShe wanna go and party, she wanna go and party\nNigga, don't approach her with that Atari\nNigga, that ain't good game, homie, sorry\nThey say conversation rule a nation, I can tell\nBut I could never right my wrongs\n'less I write it down for real, P.S\n\n[Hook x2: Kendrick Lamar]\nYou can get it, you can get it\nYou can get it, you can get it\nAnd I know just, know just, know just, \nknow just, know just what you want\nPoetic justice, put it in a song\n\n[Verse 2: Drake]\nI really hope you play this\nCause ol' girl you test my patience\nWith all these seductive photographs \nand all these one off vacations\nYou've been taking\nClearly a lot for me to take in\nIt don't make sense\nYoung East African Girl, \nyou too busy fucking with your other man\nI was trying to put you on game, put you on a plane\nTake you and your mama to the motherland\nI could do it, maybe one day\nWhen you figure out you're gonna need someone\nWhen you figure out it's all right here in the city\nAnd you don't run from where we come from\nThat sound like poetic justice, poetic justice\nYou were so new to this life but God damn you got adjusted\nI mean I write poems in these songs, \ndedicated to the fun sex\nYour natural hair and your soft skin, \nand your big ass in that sundress (ooh!)\nGood God, what you doing that walk for?\nWhen I see that thing move, \nI just wish we would fight less and we would talk more\nAnd they say communication save relations, I can tell\nBut I can never right my wrongs unless \nI write them down for real\nP.S\n\n[Hook x2]\nYou can get it, you can get it\nYou can get it, you can get it\nAnd I know just, know just, know just, \nknow just, know just what you want\nPoetic justice, put it in a song\n\n[Verse 3: Kendrick Lamar]\nEvery time I write these words they become a taboo\nMaking sure my punctuation curve, every letter is true\nLiving my life in the margin and that metaphor was proof\nI'm talking poetic justice, poetic justice\nIf I told you that a flower bloomed in a dark room, \nwould you trust it?\nI mean you need to hear this\nLove is not just a verb, it's you looking in the mirror\nLove is not just a verb, it's you looking for it, maybe\nCall me crazy, We can both be insane\nA fatal attraction is common\nAnd what we have common is pain\nI mean you need to hear this\nLove is not just a verb and I can see power steering\nSex drive when you swerve, I want that interference\nIt's coherent, I can hear it, mmhmm\nThat's your heartbeat\nIt either caught me or it called me, mmhmm\nBreathe slow and you'll find gold mines in these lines\nSincerely, yours truly\nAnd right before you go blind\nP.S\n\n[Hook]\nYou can get it, you can get it\nYou can get it, you can get it\nAnd I know just, know just, know just, \nknow just, know just what you want\nPoetic justice, put it in a song\n\n[Skit]\n\"I'm gon' ask you one more time homie, \nwhere is you from? Or it is a problem\"\n\"Ay you over here for Sherane homie?\"\n\"Yo I don't care who this nigga over here for, \nif he don't tell where he come, it's a wrap! I'm sorry\"\n\"Hol' up hol' up hol' up, we gon' do it like this, OK? \nI'mma tell you where I'm from, OK? \nYou gon' tell me where you from, OK? \nOr where your Grandma stay, \nwhere your mama stay, or where your daddy stay, OK?\"\n\"Enough with all this talkin\"\n\"Matter of fact, get out the van homie. \nGet out the car before \nI snatch you out that mother fucker homie\""}