{"rank":"96","song_id":"25825","song_name":"Wop","artist_id":"276543","display_artist":"J. Dash","spotify_id":"3zbnvxvqV5lL4Vq0FznWsX","lyrics":"Uh-oh [X2]\n\nJ.Dash...\n\nUh-oh [X2]\n\n[Chorus]\n\nI made a little bit of money (I made a little bit of money)\nI paid my bills (I paid my bills)\nI paid this cover (I paid this cover)\nI wont stand still (I wont stand still)\n\nLet me see you\nWop [X7]\n\nNow let me see you\nWop [X18]\n\n\n[Verse 1]\n\nWop If you let me get lost, if you don't\nLook at the reaction when I hit em in the front\nGot fleezy in the back and chello in the front\nListen to the record boy I got what you wont\nBeatz so fly cuz the club on chomp\nGot hizz like woofs beatin in the back of the door\nLadies take it back throw back the joint\nBend at the waist, lean to the front\nNow Bounce yo body to the, just a little bit harder\nShawty move yo feet just a little\n\nAint nobody here wop better than me\nPurple flag to the left Who better than me.\nI got an all star squad who better than me.\nMan listening to the beat who better the me.\nI payed to get in so I ain't goin to jail \nAnd then be weepin' way to long...\n\n[Chorus]\n\n[Verse 2]\n\nJ.dash why you had to do it like that\nGot the ladies checkin' they bags\nWopping like they breakin' they backs (breakin they backs)\nTakin' it: back, back, back... wait!\nNow I'm checkin shawty with a micro craves (craves)\nHotta' than a baby in a microwave\nLook at how she woppin' man she might get paid\n\nWop Wop Wop a little harder\nLook at how she wop she a party starter\nI hope that security remembered to card her\nCuz I never done the wop where you ain't hotter\nI never drop dime but I drop u a dollar\nTell her if you give me your number then maybe I call her\nShe said that she knew me and know I'm a baller\nMan I better wop outa here I'll see yall tomorrow.\n\n[Chorus]\n\n[Outro]\n\nNow drop it to the floor, drop drop it to the floor then\nWop [X4]\n\nNow leeean then\nWop [X4]\n\nTurn around and Wop, wop, wop\nTurn around and wop, wop, wop, wop\n\nNow wiggle wiggle wiggle wiggle, wiggle wiggle wiggle\nWop [X4]\n\nPlay dead like... Then\nWop [X4]\nStrike a pose like... Then\nWop [X4]\nCheck that lady like Dang she Fine... then\nWop[X4]\nBeat it up like (beat beat beat beat beat beat beat) then\nWop [X4]\nSpeed it up like... then\nWop [X4]\nMake it rain like\nWop [X4]\nDo yo thang like\nWop [X4]\nMake money like\nWop [X4]\nHit your body like\nWop [X4]\nDo yo thang like\nWop [X4]\nMake it rain like\nWop [X4]\nMake money like\nWop [X4]\n\nSlap dash...\n\nPut some more\nWop [X4]\nPurple flag\nWop [X4]\nDrink a stand\nWop [X4]\nHit you're body like\nWop [X4]\nAnd we do it like\nWop [X4]\nSlow down like\n\nAy\n\nThis is another j.dash production\n\nKeep woppin' [X18]"}