{"rank":"84","song_id":"26030","song_name":"Furthest Thing","artist_id":"301284","display_artist":"Drake","spotify_id":"6cT5orvyKqwghJp6KB9vG0","lyrics":"[Verse 1]\nSomewhere between psychotic and iconic\nSomewhere between I want it and I got it\nSomewhere between I'm sober and I'm lifted\nSomewhere between a mistress and commitment\nBut I stay down, girl I always stay down\nGet down, have her lay down\nPromise to break everybody off before I break down\nEveryone just wait now\nSo much on my plate now\nPeople I believed in they don't even show they face now\nWhat they got to say now?\nNothin' they can say now\nNothin' really changed but still they look at me a way now\nWhat more can I say now?\nWhat more can I say now?\nYou might feel like nothin' was the same\n\n[Hook] x2\nI still been drinkin' on the low\nMobbin' on the low\nFuckin' on the low\nSmokin' on the low\nI still been plottin' on the low\nSchemin' on the low\nThe furthest thing from perfect\nLike everyone I know\n\n[Verse 2]\nAnd I hate that you don't think I belong to ya\nJust too busy runnin' shit to run home to ya\nYou know that paper my passion\nBittersweet celebrations\nI know I can't change what happened\nI can't help it\nI can't help it\nI was young and I was selfish\nI made every woman feel like she was mine\nand no one else's\nAnd now you hate me\nStop pretendin', stop that frontin'\nI can't take it\nGirl don't treat me like a stranger\nGirl you know I seen ya naked\nGirl you know that I remember, don't be a pretender\nGettin' high at the condo, that's when it all comes together\nYou know I stay remniscin'\nAnd makeup sex is tradition\nBut you been missin' girl\nAnd you might feel like nothin' was the same\n\n[Hook]\n\n[Bridge]\nDrinkin', smokin', fuckin', plottin'\nSchemin', plottin', schemin', gettin' money\nDrinkin', fuckin', smokin', plottin', schemin'\nPlottin', schemin', gettin' money\n\n[Verse 3]\nThis the life for me\nMy momma told me this was right for me\nI got 'em worried, like make sure you save a slice for me\nI should have Spoons, serve you up\nwith a fork and knife for me\nYour actions make us doubt you\nYour lack of effort got me rappin' different\nThis the shit I wanna go out to\nPlay this shit at my funeral if they catch me slippin'\nNaked women swimmin' that's just how I'm livin'\nDonate a million to some children, that's just how I'm feelin'\nA nigga fillin' up arenas, who the fuck could see us?\nI had to Derrick Rose the knee up before I got the re-up\nYours truly the boy\nI just build and build more\nY'all niggas build to destroy\nY'all niggas party too much, man I just chill and record\nNo filler, you feel it now if you ain't feel it before\nYes Lord, this the shit I wanna go out to\nThis the shit I wanna go out to"}