{"song_name":"Come Thru","artist_id":301284,"display_artist":"Drake","spotify_id":"5CDy1I6rSt6vXdqIb87A6f","lyrics":"[Intro]\nWe had the type of nights where morning comes too soon\nAnd nothing was the same\n\n[Verse 1]\nWatch me, going out of the way\nWhen I should've went home\nOnly time of the day I get to spend on my own\nI was trippin' off how I used to sleep at ya crib\nShould drive by right where you live, and pick you up on the way\nWe ain't spoke in so long, probably put me in the past\nI can still get you wet and I can still make you laugh\nYou should call into work if that ain't too much to ask\nI could pour you up a drink and we can burn something\n\n[Hook x2]\nCome thru, come thru, come thru, come thru\nGirl you know we got thangs to do\nGirl you know we got thangs to do\nSo get your ass in that car and come thru\n\n[Verse 2]\nLast night I brought DOA to the studio\nThey already had a stage and a booty pole\nIts supposed to be a lot of hard working going on\nBut who the fuck can focus with this twerkin' going on\nSomeone put a order in for a chicken\nTold my girl to order in, I need the kitchen\nYeah they know I got the hook-up, \n\nthey just wait on me to cook up\nBaby I heat up the stove, you do the dishes ya know?\nRap game, Crack game, ain't that different ya know?\nLast album had it booming something vicious ya know?\nAnd ya know I need ya back in my life\nGirl ya know ya got that, know ya got that thing that I like\nGirl you got that thing forreal\nWhen I was on a mission to make it\nWho used to sleep on the floor with you \nwhen you lived in the basement?\nWho else got all the things you need at 4am when it's late?\nI always pour you up a drink and let you burn something\n\n[Hook]\nCome thru, come thru, come thru, come thru\nGirl you know we got thangs to do\nGirl you know we got thangs to do\nSo get your ass in that car and come thru\n\n[Outro]\nWhy has it been so long? Why has it been so long?\nWhy has it been? Why has it been?\nWho you been crying to? Who you been flying to?\nWho's bed are you sleeping in? Someone's been hiding you\nWhere have you been?\nYou deserve rounds tonight, \ncome thru girl you deserve rounds tonight\nCome thru girl you deserve rounds tonight\nCome thru girl you deserve rounds tonight\nRounds tonight oh, \ncome thru girl you deserve rounds tonight\nCome thru girl you deserve rounds tonight"}