{"song_name":"Tuscan Leather","artist_id":301284,"display_artist":"Drake","spotify_id":"69gz9onZQNVw55cMQsaYii","lyrics":"(Verso 1)\nComin' off the last record, I'm gettin' 20 million off the record\nJust to off these records, nigga that's a record\nI'm livin' like I'm out here on my last adventure\nPast the present when you have to mention\nThis is nothin' for the radio, but they'll still play it though\nCause it's that new Drizzy Drake, that's just the way it go\nHeavy airplay all day with no chorus\nWe keep it thorough, nigga, rap like this\nfor all of my borough niggas\nI reached the point where don't shit matter to me, nigga\nI reached heights that Dwight Howard couldn't reach, nigga\nPrince Akeem, they throw flowers at my feet, nigga\nI could go a hour on this beat, nigga\nI'm just as famous as my mentor\nBut that's still the boss, don't get sent for\nGet hype on tracks and jump in front of a bullet\nyou wasn't meant for\nCause you don't really wanna hear me vent more\nHot temper, scary outcome\nHere's a reason for niggas that's hatin' without one\nThat always let they mouth run\nBench players talkin' like starters, I hate it\nStarted from the bottom, now we here, nigga, we made it\nYeah, Tom Ford Tuscan Leather smelling like a brick\nDegenerates, but even Ellen love our shit\nRich enough that I don't have to tell 'em that I'm rich\nSelf explanatory, you just here to spread the story, wassup\n\n(Verso 2)\nSittin' Gucci Row like they say up at UNLV\nYoung rebel, Young Money nothin' you could tell me\nPaperwork takin' too long, maybe they don't understand me\nI'll compromise if I have to, I gotta stay with the family\nNot even talkin' to Nicki, communication is breakin'\nI dropped the ball on some personal shit, I need to embrace it\nI'm honest, I make mistakes, I'd be the second to admit it\nThink that's why I need her in my life, to check me\nwhen I'm trippin'\nOn a mission tryna shift the culture\nTell me who dissin', I got some things that'll hit the culprit\nThem strep throat flows, them shits to stop all of the talkin'\nAll of the talkin', got one reply for all of your comments\nFuck what you think, I'm too busy\nthat's why you leave a message\nBorn a perfectionist, guess that makes me a bit obsessive\nThat shit I heard from you lately\nreally relieved some pressure\nLike aye, B I got your CD, you get an E for effort\nI piece letters together and get to talkin' reckless\nI don't change like credentials\nyou know you see the necklace\nMy life's a completed checklist\nI'm tired of hearin' 'bout who you checkin' for now\nJust give it time\nwe'll see who's still around a decade from now\nThat's real\n\n[Verse 3]\nHow much time is this nigga spendin' on the intro?\nLately I've been feelin' like Guy Pearce in Memento\nI just set the bar, niggas fall under it like a limbo\nThe family all that matters, I'm just out here with my kinfolk\nOff everything my pen wrote we went from Bundy to Winslow\nThis for shorty up on Glen Grove\nwho love when I catch my tempo\nI sip the [?] and listen to Cappadonna\nThe Fresh Prince just had dinner with Tatiana, no lie\nAll these 90's fantasies on my mind\nThe difference is that with mine\nthey all come true in due time\nI might come through without security to check if you're fine\nThat's just me on my solo like fuck it, like YOLO\nWanted to tell you, \"Accept yourself\"\nYou don't have to prove shit to no one except yourself\nAnd if you end up needin' some extra help, then I could help\nYou know, back on your feet and shit\nTryna get my karma up, fuck the guilty and greedy shit\nHow much time is this nigga spendin' on the intro?\nHow this nigga workin' like he got a fuckin' twin though?\nLife is soundin' crazy, 40 on Martin Scorcese\nAnd I wouldn't change a thing if you paid me\nnow real nigga wassup\nHow much time is this nigga spendin' on the intro?\n\n[Outro]\nAs hell below. I'll see you when you get there\nAre you enjoying yourself?\nIf we may we'd just like to close off\nwith something a bit inspirational\nHopefully something a bit relevant as to us all\nAre having the same fears\nshedding similar tears\nand of course dying in so many years\nIt don't mean that we can't have a good life\nSo we'd like to just maybe close out with something\nsome food for thought"}