{"rank":"7","song_id":"26059","song_name":"Rap God","artist_id":"301722","display_artist":"Eminem","spotify_id":"6r027Faonff84hxFMjMbIH","lyrics":"Look, I was gonna go easy on you\nAnd not to hurt your feelings\nBut I'm only going to get this one chance\nSomething's wrong, I can feel it\nJust a feeling I've got\nLike something's about to happen\nBut I don't know what\nIf that means, what I think it means\nWe're in trouble, big trouble\nAnd if he is as bananas as you say\nI'm not taking any chances\nYou were just what the doctor ordered\n\nI'm beginning to feel like a Rap God, Rap God\nAll my people from the front to the back nod, back nod\nNow who thinks their arms\nAre long enough to slapbox, slapbox?\nThey said I rap like a robot\nSo call me Rapbot\n\nBut for me to rap like a computer\nMust be in my genes\nI got a laptop in my back pocket\nMy pen'll go off when I half-cock it\nGot a fat knot from that rap profit\nMade a living and a killing off it\nEver since Bill Clinton was still in office\nWith Monica Lewinsky feeling on his nut-sack\nI'm an Mc still as honest\nBut as rude and as indecent as all hell\nSyllables, killaholic (Kill 'em all with)\nThis slickety, gibbedy, hibbedy hip hop\nYou don't really wanna get into a pissing match\nWith this rappidy rap\nPacking a Mac in the back of the Ac\nPack backpack rap, yep, yackidy-yac\nAnd at the exact same time\nI attempt these lyrical acrobat stunts\nWhile I'm practicing that\nI'll still be able to break a motherfuckin' table\nOver the back of a couple of faggots and crack it in half\nOnly realized it was ironic\nI was under Aftermath after the fact\nHow could I not blow?\nAll I do is drop F-bombs\nFeel my wrath of attack\nRappers are having a rough time period\nHere's a maxipad\nIt's actually disastrously bad for the wack\nWhile I'm masterfully constructing this masterpiece as\n\nI'm beginning to feel like a Rap God, Rap God\nAll my people from the front to the back nod, back nod\nNow who thinks their arms\nAre long enough to slapbox, slapbox?\nLet me show you maintaining\nThis shit ain't that hard, that hard\n\nEverybody want the key\nAnd the secret to rap immortality like I have got\nWell, to be truthful the blueprint's simply rage\nAnd youthful exuberance\nEverybody loves to root for a nuisance\nHit the earth like an asteroid\nDid nothing but shoot for the moon since\nMc's get taken to school with this music\nCause I use it as a vehicle to bust a rhyme\nNow I lead a new school full of students\nMe? I'm a product of Rakim, Lakim Shabazz, 2pac N\nW. A, Cube, hey, Doc, Ren, Yella, Eazy\nThank you, they got Slim\nInspired enough to one day grow up\nBlow up and be in a position\nTo meet Run Dmc and induct them\nInto the motherfuckin' Rock n' Roll Hall of Fame\nEven though I walk in the church\nAnd burst in a ball of flames\nOnly Hall of Fame I be inducted in is the alcohol of fame\nOn the wall of shame\nYou fags think it's all a game\n'Til I walk a flock of flames\nOff of planking, tell me what in the fuck are you thinking?\nLittle gay looking boy\nSo gay I can barely say it\nWith a straight face looking boy\nYou witnessing a massacre\nLike you watching a church gathering\nTake place looking boy\nOy vey, that boy's gay\nThat's all they say looking boy\nYou get a thumbs up, pat on the back\nAnd a way to go from your label everyday\nLooking boy\nHey, looking boy, what you say looking boy?\nI got a \"hell yeah\" from Dre looking boy\nI'mma work for everything I have\nNever ask nobody for shit\nGet outta my face looking boy\nBasically boy you're never gonna be capable\nTo keep up with the same pace looking boy\n\nI'm beginning to feel like a Rap God, Rap God\nAll my people from the front to the back nod, back nod\nThe way I'm racing around the track\nCall me Nascar, Nascar\nDale Earnhardt of the trailer park\nThe White Trash God\nKneel before General Zod this planet's Krypton\nNo Asgard, Asgard\n\nSo you be Thor and I'll be Odin\nYou rodent, I'm omnipotent\nLet off then I'm reloading immediately\nWith these bombs I'm totin'\nAnd I should not be woken\nI'm the walking dead, but I'm just a talking head\nA zombie floating\nBut I got your mom deep throating\nI'm out my ramen noodle\nWe have nothing in common, poodle\nI'm a doberman, pinch yourself in the arm\nAnd pay homage, pupil\nIt's me, my honesty's brutal\nBut it's honestly futile if I don't utilize what I do though\nFor good at least once in a while\nSo I wanna make sure somewhere\nIn this chicken scratch I scribble and doodle\nEnough rhymes to maybe to try\nAnd help get some people through tough times\nBut I gotta keep a few punchlines just in case\n'Cause even you unsigned\nRappers are hungry looking at me\nLike it's lunchtime\nI know there was a time where once I\nWas king of the underground\nBut I still rap like I'm on my Pharoahe Monch grind\nSo I crunch rhymes, but sometimes when you combine\nAppeal with the skin color of mine\nYou get too big\nAnd here they come trying to censor you\nLike that one line I said on \"I'm Back\"\nFrom the Marshall Mathers Lp\nOne where I tried to say I take seven kids from Columbine\nPut 'em all in a line, add an Ak-47, a revolver and a nine\nSee if I get away with it now\nThat I ain't as big as I was\nBut I've Morphed into an immortal coming through the portal\nYou're stuck in a timewarp from 2004 though\nAnd I don't know what the fuck that you rhyme for\nYou're pointless as Rapunzel with fucking cornrows\nYou're like normal, fuck being normal\nAnd I just bought a new Raygun from the future\nTo just come and shoot ya like\nWhen Fabolous made Ray J mad\nCause Fab said he looked like a fag\nAt Maywhether's pad\nSingin' to a man while they played piano\nMan, oh man, that was a 24 7 special\nOn the cable channel\nSo Ray J went straight to the radio station the very next day\n''Hey, Fab, I'mma kill you''\nLyrics coming at you at supersonic speed\n(Jj Fad)\nUh, sama lamaa duma lamaa\nYou assuming I'm a human\nWhat I gotta do to get it through to you\nI'm superhuman\nInnovative and I'm made of rubber\nSo that anything you saying\nRicocheting off of me\nAnd it'll glue to you\nI'm never stating\nMore than never demonstrating\nHow to give a motherfuckin' audience\nA feeling like it's levitating\nNever fading\nAnd I know that the haters are forever waiting\nFor the day that they can say I fell off\nThey'd be celebrating\n'Cause I know the way to get 'em motivated\nI make elevating music, you make elevator music\nOh, he's too mainstream\nWell, that's what they do\nWhen they get jealous, they confuse it\nIt's not hip hop, it's pop, cause I found a hella way to fuse it\nWith rock, shock rap with Doc\nThrow on Lose Yourself and make 'em lose it\nI don't know how to make songs like that\nI don't know what words to use\nLet me know when it occurs to you\nWhile I'm ripping any one of these verses\nDiverse as you\nIt's curtains, I'm inadvertently hurtin' you\nHow many verses I gotta murder to prove\nThat if you're half as nice at songs\nYou can sacrifice virgins too\nSchool flunkie, pill junky\nBut look at the accolades the skills brung me\nFull of myself, but still hungry\nI bully myself cause I make me do\nWhat I put my mind to\nAnd I'm a million leagues above you\nIll when I speak in tongues\nBut it's still tongue in cheek, fuck you\nI'm drunk so Satan take the fucking wheel\nI'm asleep in the front seat\nBumping Heavy D and the Boys, still \"Chunky, But Funky\"\nBut in my head there's something\nI can feel tugging and struggling\nAngels fight with devils\nHere's what they want from me\nThey asking me to eliminate\nSome of the women hate\nBut if you take into consideration\nThe bitter hatred that I had\nThen you may be a little patient\nAnd more symphatetic to the situation\nAnd understand the discrimation\nBut fuck it, life's handing you lemons, make lemonade then\nBut if I can't batter the women how the fuck\nAm I supposed to bake them a cake then?\nDon't mistake it for Satan\nIt's a fatal mistake if you think I need to be overseas\nAnd take a vacation to trip a broad\nAnd make her fall on her face and don't be a retard\nBe a king? Think not\nWhy be a king when you can be a God?"}