{"rank":"62","song_id":"26063","song_name":"Stay","artist_id":"302251","display_artist":"Florida Georgia Line","spotify_id":"3grPZ1iQg2tEdh0ZCh3HTt","lyrics":"I'd sell my soul just to see your face.\nAnd I'd break my bones just to heal your pain.\nIn these times I need a saving grace, but time is running out and I'm starting to lose my faith.\n\nBut if I told you I loved you, would it make you want to stay?\nI'm sorry for the way I hurt you and making you walk away.\n(I should have took the time to tell you)\nAnd if I wrote you a love song and sang it to you every day, would it ever be enough to make you wanna come back home and stay?\n(I can't go another day without you)\nWould it make you, make you, wanna stay?\n(Girl you gotta know I love you)\n\nMy heart's on my sleeve, but it's turning black.\n(I guess I know what it feels like it to be alone)\nWithout your touch I'm not gonna last.\n(I know you know that I need ya just to carry on)\nIt feels like my walls are caving in.\n(You'd always hold me before I left you hanging on)\nAnd I'll do anything to have you here again.\n\nBut if I told you I loved you, would it make you want to stay?\nI'm sorry for the way I hurt you and making you walk away.\n(I should have took the time to tell you)\nAnd if I wrote you a love song and sang it to you every day, would it ever be enough to make you wanna come back home and stay?\n(I can't go another day without you)\n\nYeah, the days are cold, the nights are long.\nAnd I can't stand to be alone.\nPlease know this is not your fault.\n\nAnd all I want...\n\nIs to tell you I love you and make you wanna stay.\nThere's gotta be a way, 'cause going on without you is killing me everyday.\n\nAnd if I wrote you a love song and sang it to you every day, would it ever be enough to make you wanna come back home and stay?\n(I can't go another day without you)\nWould it make you, make you, wanna stay?\n(Girl you gotta know I love you)\nWould it make you, make you, wanna stay?\n(I can't go another day without you)\n\nWould it make you, make you, wanna stay?"}