{"rank":"93","song_id":"26341","song_name":"Fight Night","artist_id":"5650707","display_artist":"Migos","spotify_id":"2n5gVJ9fzeX2SSWlLQuyS9","lyrics":"Public Service Announcement\nWhere all my rich niggas at man?\nMigo!\n\nBroke niggas stand to the left\nMy rich niggas stand to the right\nLil' mamma, she keep looking at me (lil' mama!)\nIm'a knock the pussy out like fight night\n\nHit it with the left\nHit with the right\nIm'a knock the pussy out like fight night\n\nBeat it with the left\nBeat it with the right\nIm'a knock the pussy out like fight night\n\nIf you know me notice that my feng shui\nCertified everywhere, ain't gotta print my resume\nTalking crazy, I pull up andele\nR. I. P to Nate Dogg, I had to regulate\n\nPocket rocket fire, watch him disintegrate\nIt's a truckload coming on the interstate\nSirloin steak all on my dinner plate\nYour main bitch say she wanna make a sex tape\n\nRich nigga, I could never be a broke nigga (rich nigga)\nBroke niggas I can never get along with them!\nAlways been hated since a little nigga (always)\nIt's forever pussy nigga gotta deal with it (rich nigga!)\n\nFloat like a butterly, sting like a bee\nRumble young nigga rumble!\nLil' mamma want a nigga like me in the sheets\nIce cube knock it out like Deebo\n\nNow who's that talking that gangsta shit\nSomebody gonna kick your ass\nWhen I walk up in the club I better make a thunderstorm\nLet them know that this a whole lot of cash\n\nRich niggas on the right all night (rich nigga)\nBroke niggas to the left by yourself (brokanese)\nNow who the hell just said that the roof on fire?\nCall 911 like Wyclef\n\nI'm a rich nigga, I don't like a bitch nigga\nNigga broke nigga, I don't deal with you\nAll of my niggas, official, My bitches they strippers\nMy niggas they criminals trying to get to the M&Ms\n\nIf your bitch is so innocent, why she sucking my children\nLast time I asked I dine and dashed and bitch I go in the building\nBad bitch make it clap let me know ya\nYoung rich nigga on the couch talking to Oprah\n\nBottles in the Vip while I stand on the sofa\nI don't speak your language Brokanese, I thought I told ya\nThese bitches they be smokin' on hookah\nMy nigga ballin' like [?]\nGeeked up in the [?] I scare ya bitch Freddy Krueger. Freddy?"}