{"rank":"87","song_id":"26362","song_name":"Wild Life","artist_id":"6229494","display_artist":"Jack & Jack","spotify_id":"5Nh8XViPuGZpPfAdcmcr5t","lyrics":"Wild life wild life\n\nYeah, no telling what I might do\nWhen I'm in the right mood\nYou know me, I'm all up in the party like a V. I. P\nAnd everything is looking better from my P. O. V\nNocturnal animals, we don't sleep\nAnd I'll probably forget you, Cee Lo Green\nI'm sweating like the Amazon, a hundred degrees\nAnd that back shot's bigger than a family tree\nSo drop that thing like a fumble\nLike you talking to the king of the jungle\nWe got lions, tigers, bears, oh my\nAnd every single one's turnt up, yo\nI don't want anybody bringing the vibes down\nSo if you want to wind down, oh look what I found\nA little something that will keep you awake\nUntil the break of dawn\nDon't be afraid to get rowdy\n\nI'm not done yet, pass me the bottle\nIt's two Am, let's hit the throttle\nDrink in my cup, hands going up\nLet's hit the dance floor and get\nWild like wild life (x3)\n\nYeah, everybody going crazy on the dance floor, jam packed\nGot a couple bands back from the bank\nOn my last trip like I ransacked\nEverybody hanging like a string from a Tampax\nYes, my bitches back from the Amtrak\nYou ain't ever heard a flow quite like this\nEverywhere I turn seeing iced out wrists\nShe might be German, she might be Swiss, damn\nAnd I'm feeling pretty hectic\nLights all around, good thing I'm not epileptic\nI'm kinda confused like I'm measuring in metric\nTalking shit, you better take it back, interception\nNow set the forests a blazing\nGet the wild life jumping like an animal rave\nI know your parents say they miss the good old days\nBut things change\n\nI'm not done yet, pass me the bottle\nIt's two Am, let's hit the throttle\nDrink in my cup, hands going up\nLet's hit the dance floor and get\nWild like wild life (x3)\n\nHey you, come here girl, party with me (party with me)\nYou know it's gonna be a wild night (so wild)\nMove that body to the melody (melody)\nI could show you how to live the wild life (wild life)\nYou ain't gotta spend a dime, it's free (it's free)\nYou know it's gonna be a wild night (let's go)\nDoor's open, you don't need a key (no key)\nI could show you how to live the wild life (wild life)\n\nI'm not done yet, pass me the bottle\nIt's two Am, let's hit the throttle\nDrink in my cup, hands going up\nLet's hit the dance floor and get\nWild like wild life (x3)"}