{"rank":"66","song_id":"26622","song_name":"The Blacker The Berry","artist_id":"305702","display_artist":"Kendrick Lamar","spotify_id":"0mRxPVluGvxD6TitLPcbYt","lyrics":"Everything black, I don't want black\nI want everything black, I ain't need black\nSome white, some black, I ain't mean black\nI want everything black\n\nSix in the mornin', fire in the street\nBurn, baby, burn, that's all I wanna see\nAnd sometimes I get off watchin' you die in vain\nIt's such a shame they may call me crazy\nThey may say I suffer from schizophrenia or somethin'\nBut homie, you made me\nBlack don't crack, my nigga\n\nI'm the biggest hypocrite of 2015\nOnce I finish this, witnesses \nwill convey just what I mean\nBeen feeling this way since I was 16, came to my senses\nYou never liked us anyway, fuck your friendship, I meant it\nI'm African-American, I'm African\nI'm black as the moon, heritage of a small village\nPardon my residence\nCame from the bottom of mankind\nMy hair is nappy, my dick is big, my nose is round and wide\nYou hate me don't you?\nYou hate my people, your plan is to terminate my culture\nYou're fuckin' evil \nI want you to recognize that I'm a proud monkey\nYou vandalize my perception but can't take style from me\nAnd this is more than confession\nI mean I might press the button \njust so you know my discretion\nI'm guardin' my feelins, \nI know that you feel it\nYou sabotage my community, makin' a killin'\nYou made me a killer, emancipation of a real nigga\n\nThe blacker the berry, the sweeter the juice\nThe blacker the berry, the sweeter the juice\nThe blacker the berry, the sweeter the juice\nThe blacker the berry, the bigger I shoot\n\nI said they treat me like a slave, cah' me black\nWoi, we feel a whole heap of pain, cah' we black\nAnd man a say they put me in a chain, cah' we black\nImagine now, big gold chain full of rocks\nHow you no see the whip, left scars pon' me back\nBut now we have a big whip, parked pon' the block\nAll them say we doomed from the start, \ncah' we black\nRemember this, every race start from the block, \njust remember that\n\nI'm the biggest hypocrite of 2015\nOnce I finish this, witnesses \nwill convey just what I mean\nI mean, it's evident that I'm irrelevant to society\nThat's what you're telling me, \npenitentiary would only hire me\nCurse me till I'm dead\nChurch me with your fake prophesizing that \nI'mma be just another slave in my head\nInstitutionalize manipulation and lies\nReciprocation of freedom only live in your eyes\nYou hate me don't you?\nI know you hate me just as much as you hate yourself\nJealous of my wisdom and cards I dealt\nWatchin' me as I pull up, \nfill up my tank, then peel out\nMuscle cars like pull ups, \nshow you what these big wheels 'bout, ah\nBlack and successful, this black man meant to be special\nKatzkins on my radar bitch, how can I help you?\nHow can I tell you I'm making a killin'?\nYou made me a killer, emancipation of a real nigga\n\nI'm the biggest hypocrite of 2015\nWhen I finish this if you listenin' \nthen sure you will agree\nThis plot is bigger than me, it's generational hatred\nIt's genocism, it's grimy, little justification\nI'm African-American, I'm African\nI'm black as the heart of a fuckin' Aryan\nI'm black as the name of Tyrone and Darius\nExcuse my French but fuck you - no, fuck y'all\nThat's as blunt as it gets, I know you hate me, don't you?\nYou hate my people, I can tell cause it's threats when I see you\nI can tell cause your ways deceitful\nKnow I can tell because you're in love with that Desert Eagle\nThinkin' maliciously, he get a chain \nthen you gone bleed him\nIt's funny how Zulu and Xhosa might go to war\nTwo tribal armies that want to build and destroy\nRemind me of these Compton Crip gangs that live next door\nBeefin' with Pirus, only death settle the score\nSo don't matter how much I say \nI like to preach with the Panthers\nOr tell Georgia State \"Marcus Garvey got all the answers\"\nOr try to celebrate February like it's my B-Day\nOr eat watermelon, chicken, and Kool-Aid on weekdays\nOr jump high enough to get Michael Jordan endorsements\nOr watch Bet cause urban support is important\nSo why did I weep when Trayvon Martin was in the street?\nWhen gang banging make me kill a nigga blacker than me?\nHypocrite!"}