{"rank":"74","song_id":"26679","song_name":"How Many Times","artist_id":null,"display_artist":"DJ Khaled Featuring Chris Brown, Lil Wayne & Big Sean","spotify_id":"3uqez7AQId9NZ15UF9QW9M","lyrics":"[Intro: Chris Brown & (DJ Khaled)]\nPour a cup for the bitches that ain't scared to get down\nGet down, get down (We The Best Music)\nHow many times I gotta?\nLight another for the bitches who's just only in town\n(Another one) For the weekend, oh\n(DJ Khaled!)\n\n[Hook: Chris Brown]\nHow many times I gotta tell that ass to come over?\nI'll fuck you right, have you walkin' from side to side\nYou know how a nigga feel 'bout wastin' time\nYou know how I feel about waitin' in line\nYou know he ain't it, girl, you're wastin' your time\nYou're only this young for a moment in time, take it in stride\nHow many times I gotta tell that ass to come over?\nHow many times I gotta tell that ass to come over?\nHow many times I gotta tell that ass to come over?\nI'll fuck you right, have you walkin' from side to side\nHow many times?\n\n[Verse 1: Lil Wayne]\nHow many times I gotta tell your ass to come over?\nHow many times I gotta tell you I got a chauffeur?\nThink about it, think it over\nEverything is gon' be kosher\nCall me when you gettin' closer\nIf you take a taxi, how much I owe ya?\nDon't send me no naked pictures\nIf I can't get naked with ya\nThis dick deserve recognition\nI don't mind payin' that commission\nIs you with the shit or nah?\nIf we ain't fuckin' then, bitch, bon voyage\nHow many times? I said how many times?\nToo many times and bitch, I ain't got time\n\n[Hook: Chris Brown]\nHow many times I gotta tell that ass to come over?\nI'll fuck you right, have you walkin' from side to side\nYou know how a nigga feel 'bout wastin' time\nYou know how I feel about waitin' in line\nYou know he ain't it, girl, you're wastin' your time\nYou're only this young for a moment in time, take it in stride\nHow many times I gotta tell that ass to come over?\nHow many times I gotta tell that ass to come over?\nHow many times I gotta tell that ass to come over?\nI'll fuck you right, have you walkin' from side to side\nHow many times?\n\n[Verse 2: Big Sean]\nOkay, phone off the hook, yeah, that bitch won't stop blinkin'\nI'll pick up for you though on the second ring\nYou've been drinkin' and drinkin', you're drinkin' for fun\nAnd you drink for a reason\nYeah, leave your boyfriend and call me when you're leavin'\nCallin' shots, refereein', no drama\nPussy so wet, I'ma need Dramamine and mattress Aquafining\nBoy, I light the block up, young Billie Jeaning\nI'm dodgin' the leeches, I'm signin' agreements\nI'm signin' new artists, I sell out arenas\nSwimmin' with the dolphins on the Dan Marino\nWine mixin', this shit like the Catalina\nB-I-G, minus Puff and Lil Cease\nI'm on my grind, 3 AM text like I need ya\nDream about the pussy, fuck it, I'm a dreamer\nHold me down but don't hold me back like I need you to, damn\nI wrote myself a million dollar check in fifth grade\nI put it on the wall and promised it'd be this way\nShe fuck me like she want the rent paid\nLike she want that Oscar De La Renta\nI slow it down like it's her favorite ballad\nThen go back up at it like I hadn't had it\nStraight up\n\n[Hook: Chris Brown]\nHow many times I gotta tell that ass to come over?\nI'll fuck you right, have you walking from side to side\nHow many times?\n\n[Post-Hook: Chris Brown]\nPour a cup for the bitches that ain't scared to get down\nGet down, get down, how many times I gotta?\nLight another for the bitches who's just only in town\nIn town, in town, for the weekend, oh\n\n[Verse 3: Chris Brown]\nI see these bitches in Supperclub\nNiggas got me throwin' bottles up\nBottles with all of my homies\nI'm feelin' generous, throwin' my money\nShe said she wanted the molly love\nI gave her the dick but I'm not in love\nI call out, \"Bingo!\" the minute I'm bonin'\nSoon as I'm done, kick her out in the mornin'\nGot Xans when I turn up, it's a party, bust it open\nPop that pussy in a circle, go retarded, pop it for me\nShe got that booty galore, grippin' it, backin' me up\nYou wanna fuck with a thug\nNow I see all these bitches got ass and they throwin'\nDamn, it's just a matter of time 'fore I'm gone\nDrinkin' Ciroc and I know that she got it for free\nI hit up Diddy, he told me he did it\nHe said that the liquor just bring out the freaks\nThem bitches lit, droppin' that ass to a split\nTalkin' 'bout me, I'm the shit\nI just get down for the money, the bitches, and cars\nAnd my niggas, they whippin' the bricks, huh\n\n[Hook: Chris Brown]\nHow many times I gotta tell that ass to come over?\nHow many times I gotta tell that ass to come over?\nHow many times I gotta tell that ass to come over?\nI'll fuck you right, have you walkin' from side to side\nHow many times?"}