{"rank":"84","song_id":"26693","song_name":"L$D","artist_id":"275210","display_artist":"A$AP Rocky","spotify_id":"4S7YHmlWwfwArgd8LfSPud","lyrics":"I know I dream about her all day\nI think about her with her clothes off\nI'm ridin' 'round with my system pumpin' Lsd\nI look for ways to say, \"I love you\"\nBut I ain't into makin' love songs\nBaby, I'm just rappin' to this Lsd\n\nShe ain't a stranger to the city life\nI introduce her to this hippy life\nWe make love under pretty lights, Lsd (Acid)\nI get a feelin' it's a trippy night\nThem other drugs just don't fit me right\nGirl, I really fuckin' want love, sex, dream\nAnother quarter to the face system\nMake no mistakes, it's all a leap of faith for love\nIt takes a place in feelin' that you crave doin'\nLove, Sex, Dreams\n\nIt started in Hollywood\nDreamin' of sharin' love\nMy tongue had a loss for words\nCause my feelings just said it all\nParty just started up\nDreamin' of sharin' worlds\nHeld this feeling for way too long\nSaid I really wanna let it go\n\nI've been gettin' fly because the gimmick's so dope\nI've been getting high cause I figured Lord told me\nI've been drinking, driving, I will never go home\nI'm gon' stay drivin' cause the weather so cold\nFeeling low some times when the light shines down\nTakes me high\nCan you feel it?\nCan you feel it?\n\nFeeling low sometimes when the light shines down\nTakes me high\nCan you feel it?\nCan you feel it?\nFor all them hoes that was frontin' on\nniggas back in the day (this for my broke jiggy niggas)\nexcuse me, fuck out my face\nThey say wealth is in the mind, not the pocket\nI learned that from a very wise man\n\nOkay excuse me, Mr. Bill Collector, I got problems\nMy check arrive mañana, I'ma pay my debt, I promise\nI spent 20 thousand dollars with my partners in Bahamas\nAnother 20 thousand dollars on Rick Owens out in Barneys\nI said excuse me, why the fuck you lookin'?\nWhat's your problem?\nI swear we gon' have drama\nif you touch my tailored garments\nAll you see is niggas here, so that means it's triggers there\nWhat you mean?\nWe got weed, and codeine and bricks for sale\n\nI bet a lot of niggas plottin' so you know\nI got that heater, bruh\nDrive my side of Harlem, catch me ridin' with my nina, bruh\nShe got an apple bottom that remind you of Bonita, bruh\nOh you mean like Q-Tip? Now that girl my new bitch\nExcuse me, no, I believe the proper term's excuse you\nI could switch up on you niggas and start shittin'\nif I choose to\nThat's when the new you becomin' different\nsince they knew you\nI guess the new me is just gon' take some gettin' used to\n\nIt started in Hollywood\nDreamin' of sharin' love\nMy tongue had a loss for words\nCause my feelings just said it all\nI look for ways to say, \"I love you\"\nBut I ain't into makin' love songs\nBaby I'm just rappin' to this Lsd"}