{"rank":"79","song_id":"26765","song_name":"Here","artist_id":"6592648","display_artist":"Alessia Cara","spotify_id":"0yKXxMgfRpYzVeIbPZss5B","lyrics":"[Written by Alessia Cara & Sebastian Kole]\n[Produced by Pop & Oak and Sebastian Kole]\n\n[Intro]\nI guess right now you've got the last laugh\n\n[Verse 1]\nI'm sorry if I seem uninterested\nOr I'm not listenin', or, I'm indifferent\nTruly I ain't got no business here\nBut since my friends are here, I just came to kick it\nBut really I would rather be at home all by myself\nNot in this room\nWith people who don't even care about my well-being\nI don't dance, don't ask, I don't need a boyfriend\nSo you can, go back, please enjoy your party\nI'll be here\nSomewhere in the corner\nUnder clouds of marijuana\nWith this boy who's hollering\nI can hardly hear\nOver this music I don't listen to\nAnd I don't wanna get with you\nSo tell my friends that I'll be over here\n\n[Chorus]\nOh-oh-oh here, oh-oh-oh here\nOh I ask myself, what am I doin' here?\nOh-oh-oh here, oh-oh-oh here\nAnd I can't wait 'til we can break up out of here\n\n[Verse 2]\nExcuse me if I seem a little unimpressed with this\nAn anti-social pessimist, but usually I don't mess with this\nAnd I know you mean only the best\nAnd your intentions aren't to bother me\nBut honestly I'd rather be\nSomewhere with my people\nWe can kick it and just listen to\nSome music with a message, like we usually do\nAnd we'll discuss our big dreams\nHow we plan to take over the planet\nSo pardon my manners\nI hope you'll understand that I'll be here\nNot there in the kitchen\nWith the girl who's always gossiping about her friends\nSo tell them I'll be here\nRight next to the boy who's throwin' up\nCause he can't take what's in his cup no more\nOh God why am I here?\n\n[Chorus]\nOh-oh-oh here, oh-oh-oh here\nOh I ask myself, what am I doin' here?\nOh-oh-oh here, oh-oh-oh here\nAnd I can't wait 'til we can break up out of here\n\n[Bridge]\nHours later congregatin' next to the refrigerator\nSome girl talkin' 'bout her haters, she ain't got none\nHow did it ever come to this? I shoulda never come to this\nSo holla at me, I'll be in the car when you're done\nI'm stand-offish, don't want what you're offerin'\nAnd I'm done talkin', awfully sad it had to be that way\nSo tell my people when they're ready that I'm ready\nAnd I'm standin' by the TV with my beanie low\nYo I'll be over here\n\n[Chorus]\nOh-oh-oh here, oh-oh-oh here\nOh I ask myself, what am I doin' here?\nOh-oh-oh here, oh-oh-oh here\nAnd I can't wait 'til we can break up out of here"}