{"rank":"78","song_id":"26761","song_name":"Charged Up","artist_id":"301284","display_artist":"Drake","spotify_id":"3bOoByGO6dgf3EYY8pSDaV","lyrics":"[Intro]\n(Stop, stop, stop\nFuck niggas gon' be fuck niggas\nthat's why we never give a fuck\nwhen a fuck nigga switched up)\nI'm so sorry\nDid you hope I was crying?\nIt was rough without you\nIt was rough without you\n\n[Hook]\nI did some charity today for the kids\nBut I'm used to it cause all y'all charity cases\nAll y'all stare in my face in hopes\nyou could be the replacement\nNiggas is snitching on us without no interrogation\nI stay silent 'cause we at war and I'm very patient\nSix God is watching\nI just hope you're prepared to face him\nI'm charged up, I'm charged up\n\n[Verse 1]\nWow, I'm honored that you think this is staged\nI'm flattered man, in fact, I'm amazed\nThe perfect start to the summer, man this shit is a doozy\nThis shit a twist in the movie\nbut don't jump to conclusions\nYou boys are getting into your feelings on me\nYou should embrace it\nthis could be one of our realest moments\nOkay the flow start to feel familiar, don't it?\nMust I remind you that Jimmy got 20 million on it\nNeed Dj Clue to drop a bomb on it\nNone of them want this shit more than I want it\nI seen it all coming, knew they would push a button\nEaster egg hunting, they gotta look for something\nDone doing favors for people\nCause it ain't like I need the money I make off a feature\nI see you niggas having trouble going gold\nTurning into some so and so's that no one knows\nBut so it go\nCome live all your dreams out at Ovo\nWe gon' make sure\nyou get your bread and you know the ropes\nI get a ring and I bring it home like I'm Corey Joe\nNo woman ever had me star struck\nOr was able to tell me to get my bars up\nI'm charged up\nOh no we eating, niggas ain't about to starve us\nNah, niggas ain't about to starve us\nI'm charged up\n\n[Verse 2]\nI bought my niggas rollies off of Thank Me Later\nWhile these boys was stanky legging\nTrust me this information is vital\nI'm trying to take the high road\nI still got love for my idols\nI got me a deal with Apple and I still feel entitled\nRumor has it, there's something that only I know\nRumor has it, I steer the ship with my eyes closed\nRumor has it, I either fucked her or never could\nBut rumor has it, hasn't done you niggas any good\nit's sound, sound, sound 'til the day I die\nWe going live to keep this shit alive\nCops are killing people with they arms up\nAnd your main focus is tryna harm us?\nAnd you think you 'bout to starve us?\nNiggas ain't about to starve us\nNah, I'm charged up\n\n[Outro]\n(Stop, stop, stop, stop...)\nHave you seen me?\nI'm doing so good\nEverytime I leave\nOh, I'm so sorry\n(Fuck niggas gon' be fuck niggas\nthat's why we never give a fuck\nwhen a fuck nigga switched up)\n\n[Sample]\nYou know, I kept it real\nIt ain't too many real people out here\nAnd people be on some weak bitch ass shit all day long\nIndustry people... regular people\nAnd then when you keep it real with people\nthey cross the line, take yo"}