{"rank":"65","song_id":"26776","song_name":"Boyz-N-The Hood","artist_id":"276068","display_artist":"Eazy-E","spotify_id":"1tjrLW8Szp1P4QvmbA7CkA","lyrics":"[Intro: Dresta]\n\"Yeah, Gangsta Dresta done stepped in this, motherfucker. And this one goes out to all the O.G.'s out there. And I can't forget the baby gangstas, what's up, niggas? My nigga they came back with some of that old school original west coast shit, nigga. That got all of y'all on his dick in the first place, yeah. So run that shit, E, yeah.\"\n\n[Verse 1: Eazy-E]\nCruisin' down the street in my '64\nJockin the freaks, clockin' the dough\nWent to the park to get the scoop\nKnuckleheads out there cold shooting some hoops\nA car pulls up, who can it be?\nA fresh El Camino rolling Kilo G\nHe rolls down his window and he started to say\nIt's all about making that GTA\n\n[Hook: Eazy-E]\nCause the boys in the hood are always hard\nYou come talking that trash, we'll pull your card\nKnowing nothing in life, but to be legit\nDon't quote me, boy, cause I ain't said shit\n\n[Verse 2: Eazy-E]\nDonald B's in the place to give me the pace\nHe said, \"My man JD is on freebase\"\nThe boy JD was a friend of mine\n'Til I caught him in my car trying to steal a Alpine\nChased him up the street to call a truce\nThe silly cluck-head pulls out a deuce-deuce\nLittle did he know, I had a loaded 12 gauge\nOne sucker dead, LA Times front page\n\n[Hook: Eazy-E]\nCause the boys in the hood are always hard\nYou come talking that trash we'll pull your card\nKnowing nothing in life, but to be legit\nDon't quote me, boy, cause I ain't said shit\n\n[Verse 3: Eazy-E]\nBored as fuck and I wanna get ill\nSo I went to a place where my homeboys chill\nNiggas out there making that dollar\nI pulled up in my '64 Impala\nThey greet me with a 40 and I start drinking\nAnd from the 8-ball my breath start stinking\nLeft to get my girl to rock that body\nBefore I left I hit the Bacardi\nWent to her house to get her out of the pad\nDumb ho said something that made me mad\nShe said something that I couldn't believe\nSo I grabbed the stupid bitch by her nappy ass weave\nShe started talking shit, wouldn't you know?\nReached back like a pimp, slapped the ho\nHer father jumped up and he started to shout\nSo I bombed on pops, knocked his ol' ass out\n\n[Hook: Eazy-E]\nCause the boys in the hood are always hard\nYou come talking that trash we'll pull your card\nKnowing nothing in life, but to be legit\nDon't quote me, boy, cause I ain't said shit\n\n[Verse 4: Eazy-E]\nNow I'm rolling hard, now under control\nThen wrapped the '64 'round a telephone pole\nI looked at my car and I said, \"Oh, brother\nThrow it in the gutter and go buy another\"\nWalking home and I see the G ride\nNow Kat is drivin Kilo on the side\nAs they busted a U, they got pulled over\nA undercover cop in a dark green Nova\nNow Kat got beat for resisting arrest\nHe socked the pig in the head for rippin' his Guess\nNow G is caught for doing the crime\nFourth offense on the boy, he'll do some time\n\n[Hook: Eazy-E]\nCause the boys in the hood are always hard\nYou come talking that trash we'll pull your card\nKnowing nothing in life, but to be legit\nDon't quote me, boy, cause I ain't said shit\n\n[Verse 5: Eazy-E]\nI went to get them out, but there was no bail\nMy niggas caused a riot in the county jail\nTwo days later in municipal court\nKilo G on trial straight cut a fart\nDisruption of a court, said the judge\nOn a six-year sentence, my man didn't budge\nBailiff came over to turn him in\nKilo G looked up and gave a grin\nHe yelled out, \"Fire,\" then came Suzy\nThe bitch came in with a sub-machine Uzi\nPolice shot the girl, but didn't hurt her\nBoth upstate for attempted murder\n\n[Hook: Eazy-E]\nCause the boys in the hood are always hard\nYou come talking that trash we'll pull your card\nKnowing nothing in life, but to be legit\nDon't quote me, boy, cause I ain't said shit"}