{"rank":"100","song_id":"26773","song_name":"100 Grandkids","artist_id":"276901","display_artist":"Mac Miller","spotify_id":"4rra3z09djKcOviLkHWN6l","lyrics":"[Intro]\nWoah-oh\n(Hey!)\nWow-wow-wow-wow\n(Hello)\nWow-wow-wow\n(This is a revolution)\nWow-wow\nWoah-oh\nWow-wow-wow-wow\n(As we proceed)\nWow-wow-wow\nWow-wow\n\n[Hook 1]\nI made a promise to my momma\nThat I'll bless her with some grandkids, she can spoil them\nUntil then, I'm getting dollars, I'm just doing what I gotta\nCan a man live? And it's all day (homie)\nI'm a God, give the whole squad a job, get them all paid\nCame a long way from all-state, yeah\nNow we All-American, we All-American\n\n[Verse 1]\nI swear to God I put the hero in heroin\nThese flows, kilos\nI could sell snow to a ski slope\nI could sell evil to the devil\nNonbelievers to a temple\nShit, I could sell water to a speedboat\nAnd these eyes is iconic\nI went pro, made profit\nNow I keep some dead face in my pocket\nGettin' faded, I been stoned all week\nBut what's a God without a little OD? Just a G\nBreezing my weed, easing my mind\nWhy you worry about me?\nStop tripping, I'm fine\nSwear these bitches done lost it lately\nYou put the ho in honest baby, so complicated\nAnd I may be a little arrogant, I'm aware of it\nI know (I know)\nI got a problem, I'mma take care of it\nWeight I'm carrying, gotta let it go\n(It won't hold me down no more)\n\n[Hook 1]\nI made a promise to my momma\nThat I'll bless her with some grandkids, she can spoil them\nUntil then, I'm getting dollars, I'm just doing what I gotta\nCan a man live? And it's all day (homie)\nI'm a God, give the whole squad a job, get them all paid\nCame a long way from all-state, yeah\nNow we All-American, we All-American\n\n[Post-Chorus]\nWe ain't goin' nowhere\nWe ain't goin' nowhere\nWe can't be stopped now\nCause this rap shit's for life\nWe ain't goin' nowhere\nWe ain't goin' nowhere\nWe can't be stopped now\nCause this rap shit's for life\n\n[Bridge]\nBack then I had a dream\nOf gettin' this money, man\nI know, my life would change\nJust need a hundred grand\nBack then I had a dream\nOf gettin' this money, man\nI know, my life would change\nJust need a hundred grand\n(When I first made a hundred grand...)\n\n[Transition]\n(Back when I first made a hundred grand...)\n(Yeah, back when I first made a...)\n(Back when I first made a hundred grand...)\n\nPart 2: 100 Grand\n\n[Hook 2]\nYeah, back when I first made a hundred grand, thought I was the shit\nWhen I first made a hundred grand, thought I was a king\nWhen I first made a hundred grand, couldn't tell me nuttin\nWhen I first made a hundred grand, made a hundred grand\n(Let me get some money)\n\n[Verse 2]\nYeah, okay, back then they used to call me little\nBut now I'm ridin' something clean in a coat made of armadillo\nThey haven't got the memo, they sayin' I'm the shit though\nTryna make it complicated when this shit is simple\nTell me what you wanna be, what your dreams is\nA hundred G's in my jeans, I'm a genius\nEach and every day some save me please\nAnd get schooled, homie, change degrees\nI'm the plug, what you need though?\nI'm goin' beast mode\nI keep a freak, even when she underwater she can deep throat\n(Wait what?)\nI made a mil' before I pay the bill\nCause fools worried about a wave, I'm a NAVY seal\nCome with me, I can make your life change for real\nAlways had a dream of stuntin'\nIt ain't nothing unless we runnin' shit\nJust a young motherfucker with a plan\nThought I was the man\n\n[Hook 2]\nBack when I first made a hundred grand, thought I was the shit\nWhen I first made a hundred grand, thought I was a king\nWhen I first made a hundred grand, couldn't tell me nuttin\nWhen I first made a hundred grand, made a hundred grand\n(Let me get some money)\n\n[Outro: Female Voice]\nLet me get some money (Time flies)\nLet me, let me get some money (Yeah, you know time flies)\nI just need some shoes my niece (Try to catch it)\nCan we stop at Chipotle?\nLet me get some money (Time flies)\nLet me, let me get some money (yeah, you know time flies)\nLet me get some money (Try to catch it)\nLet me, let me get some money"}