{"rank":"92","song_id":"26836","song_name":"30 For 30 Freestyle","artist_id":"301284","display_artist":"Drake","spotify_id":"5pJnRLlzUcRxrtYgfdUwvg","lyrics":"[verse: drake]\nNever thought I'd be talking from this perspective\nBut I'm not really sure what else you expected\nWhen the higher-ups\nHave all come together as a collective\nWith conspiracies to end my run\nAnd send me a message\n40, Did you get the message?\nCause I just checked my phone and I didn't get it\nI mean, I say hats off for a solid effort\nBut we didn't flinch for a second, we got our shit together\nYeah, not here to fight wars\nBut niggas wanna talk high scores\nParty just dipped off in a white porsche\nAnd I just came from dinner\nWhere I ate some well done seared scallops\nThat were to die for\nBut I got bigger fish to fry\nI'm talking bigger shit than you and I\nKids are losin' lives, got me scared of losing mine\nAnd if I hold my tongue about it, I get crucified\nWrote this shit on a bumpy flight on a summer night\nFlying over chattanooga\nOut here trying to spread the movement\n\nI just got me the mercedes pullman\nYou niggas never heard of it, you gotta hit up google\nBack in the city, shit is getting brutal\nThese kids'll hit your noodle\nThen take a girl to the movies\nThey've been dropping out on both sides\nWe ain't in it, we just ghost ride\nThe pen is working if you niggas need some ghost lines\nI thought you wanted yours like I want mine\nI guess you just making moves on your own time\nBut just know it'll be january in no time\nAnd your absence is very concerning\nIt's like you went on vacation with no plan of returning\nShit is purely for sport, I need a 30 for 30\nBanners are ready in case we need to retire your jersey\nI got a club in the raptors arena\nChampionships, celebrations during regular seasons\nPaternity testing for women that I never slept with\nI'm legally obligated if they request it\nSo much legal action like I'm michael jackson\nLuckily, I'm great at avoiding distraction\nUsed to give no reaction, now I'm overreacting\nAh nigga, that shit gotta go platinum\nI just listened to closer to my dreams\nWide eyed and uneducated at 19\nI can't rap like that, all young and naive\nNot after all of the shit I've seen and the things I believe\nDrastically changing, thank you for all your patience\nI'm just in a different space and I choose to embrace it\n4, 000 Square feet just isn't as spacious\nYou loved me back in the basement\nGuess it is what we make it\nI'm tired of awkward exchanges\nAnd nigga's crooked ways\nTired of champagne toasts with people that look away\nPeyton and eli when niggas\nCalled me they brother the season start\nAnd I don't wanna see you end up with nothing\nY'all throw the word \"family\"\nAround too much in discussion\nRookie season, I would've never thought this was coming\nThey knees give out\nAnd they passing to you all of a sudden\nNow you the one getting buckets\nThey put their arm around you\nNow you becoming the crutches\nKids got on your number\nCause you the one they look up to\nAnd women that you seen on tv look better in person\nAnd either they wanna fuck you or convince you\nThat they can to see where it goes from there\nBut these ain't the girls from brampton\nThis ain't that local action\nThe haters just bringing me\nAnd my people closer, actually\nWhat happened to the things you niggas said\nWas supposed to happen?\nAre we just supposed to ignore the fact\nThat it never happened?\nWe just supposed to get the pie and then split it in two?\nSupposed to forget your mistakes\nBut not forget about you?\nMy plan was always to make\nThe product jump off the shelf\nAnd treat the money like secrets\nKeep that shit to ourselves\nPapi champú, young pablito de seis dios\n6 G-o-d, I think I\nWas destined for this shit\nWhen I was 'round keyshia cole and t. I\nAnd young dro was popping off with ain't I\nWay before niggas had they hands out\nLike they doing macarena\nBut who am I to complain now\nI'm still around, they know"}