{"rank":"72","song_id":"26898","song_name":"Best Friend","artist_id":"5883339","display_artist":"Young Thug","spotify_id":"6kdJfvcllBFlaj7tHIkGuL","lyrics":"[Intro]\nThugger!\nYsl for life, bitch\nYeah fuck you, your momma and everything else\nFree the goat!\n\n[Hook]\nThat's my best friend, that's my best friend, flexin'\nBig ol' booty bitch missus from Texas, what's next is\nI'm gon' skeet off, lil nigga come catch me, catch me\nAnd that's my bestie, my bestie, my best friend, go best friend\nNigga livin' Ttg and everything is still on fleek\nBad bitch rollin' wit' me, she gon' smile cause she on fleek\nHundred thousand dollars inside my pants, my shit on fleek\nHey-yeah!\n\n[Verse 1]\nTake them boys to school, swagonometry\nBitch I'm bleeding bad, like a bumble bee\nHold up! Hold it, hold it, nigga proceed\nI'ma eat that booty just like groceries\nEat on that coochie, lay that bitch down like \"let's do it\"\nNo Tiger bitch, eat that wood, eat that wood\nSupplier, bitch, I got pistols, no wood\nI want them tacos that are Meagan Good\nHelicopter choppin' with the buzz\nStuff them racks inside them if they nudge\nBang that other side, nigga curb\nAnd my reefer louder than a speaker\nYeah my niece is hanging with The Beatles\nIf you ever find her, better keep her\nThirty seven cameras for the sneakers\nGoin' out like awesome Beanie Sigel\nSend a cup, I can't wait to mistreat 'em\nForcin' your ho, I can't wait to mislead 'em\nAnd beat 'em, they ain't my people\n\n[Hook]\nThat's my best friend, that's my best friend, flexin'\nBig ol' booty bitch missus from Texas, what's next is\nI'm gon' skeet off, lil nigga come catch me, catch me\nAnd that's my bestie, my bestie, my best friend, go best friend\nNigga livin' Ttg and everything is still on fleek\nBad bitch rollin' wit' me, she gon' smile cause she on fleek\nHundred thousand dollars inside my pants, my shit on fleek\nHey-yeah!\n\n[Verse 2]\nLet me tell you how I spent a couple hundreds today\nI done cut back on that lean, I'm on that Hen' and D'ussé\nDon't do no talkin' when you see him, you better shoot in his face\nI got a hundred bitches that can't wait to replace\nMichael Jackson nigga, Thugger Jackson moon walkin'\nThe S. L. I. M. E. army tool shopping\nMe a horny goat, I'm boolin' at the bull stop\nNo I can't get arrested cause I'm talkin' bout my necklace\nI'mma put that bitch in the buck, I'm a dog, let? s get stuck\nMy lil' sister Dora eat them Lucky Charms and give me luck\nWaddup cus? Here yo' cup, call my Bloods, bring my bup\nYour crew suck, don't got bucks, these ain't drugs nigga\n\n[Hook]\nThat's my best friend, that's my best friend, flexin'\nBig ol' booty bitch missus from Texas, what's next is\nI'm gon' skeet off, lil nigga come catch me, catch me\nAnd that's my bestie, my bestie, my best friend, go best friend\nNigga livin' Ttg and everything is still on fleek\nBad bitch rollin' wit' me, she gon' smile cause she on fleek\nHundred thousand dollars inside my pants, my shit on fleek\nHey-yeah!"}